["The timestamp is here if you're wondering 17:54", "You are a legend bro", "hahah", "I'm chocking", "Truly a dedective of culture", "What did she say?", "@confused af boku no...", "@Aebel oh alright LMAO", "how the fuck\n\ndid you know that i came here for that", "She bamboozled 3-4K people into thinking the stream ended with that rage quit. Well played my dear detective well played. 1:21:22", "https://youtu.be/qFnn4AQvbHg Haachama is back", "@Bread Cheeks no need to spam.", "@Bread CheeksRest in peace that ASMR live stream she did shall not be archived.", "toxic amelia = best", "https://youtu.be/qFnn4AQvbHg Haachama is back", "@Bread Cheeks dude stop", "@TRAWESS this guy got almost 50k sub and only have 90k total views. I wonder y", "Nah fam. \nSweet Amelia = Best Amelia.", "14:11 ok who was the hero that asked?", "King", "She was just using that as an example.", "Herself, actually", "@Keep on living She's the hero then... Insert always has been quote here", "Huh, wasn't expecting Amelia to be a Heroes of the Storm fan. Guess she really is best girl, I should never have doubted her.", "When did she say this? Pretty good", "@Jinpachiro 13:15", "@Jinpachiro She mentions it at about 13:10", "always has been", "After a week full of minecraft, this stream felt so relaxing and refreshing, even Ame looked more happy than usual, well, except for the later matches when toxic Ame awakened .", "https://youtu.be/qFnn4AQvbHg Haachama is back", "1:30:12 the return of Nyamelia", "I’m sure my paintball buddies have been putting glue on my weapons. They deny it, but I’m sticking to my guns", "https://youtu.be/qFnn4AQvbHg Haachama is back", "Bu dum, pshh", "1:10:24 Amelia's Hulk Hogan Impression\n1:20:39 He's ZOOMIN", "https://youtu.be/fn4PlKBnxms Amelia say Meow", "Luv her", "44:29 definitely not addicted to Minecraft", "https://youtu.be/qFnn4AQvbHg Haachama is back", "Well the stream was relaxing. It's nice.\nSo yeah, Ame addicted so bad on Minecraft, it's affecting her game. Lol so many idol meetings. I did not realize she made a Watame face. So many moments in this one. Thanks for the stream.", "Nooo I want more apex streams", "02:20  start!/Yawn\n03:20  Bubba\n03:34  \n      |      schedule", "33:10 take phonecall\n33:50 oh no\n34:25 how does baited?\n34:57 brrrrring(LOL", "1:08:49 Gura:HAHA\n1:09:04 HIC \n1:09:08こんにちは/Gura in apex\n1:10:29 Sit on my face/fifth Game", "1:21:22 thx for watching?\n1:22:32 LOL(I know is JK\n1:23:50 anything?\n1:24:16 HIC", "@かみ箱 You're faster than lightning!", "@かみ箱 Y\nI look up to you kind sir/madam. Keep up the good work (salute)", "@かみ箱 Thank you so much!", "Wow, time stamp for every minute. This here is real dedication", "This needs to be up top", "2:20 \n\nDon’t come in here telling me that’s a yawn my brother.", "Watson Concoction is just ToxiciTea", "damn", "How are you so wise in the ways of science", "@ShankzKyu- It is but elementary fellow investigator", "Welcome archive warriors", "Our time has come", "the most clean stuff hits\n19:40 obs machine broke\n21:15 obs fixed\n32:31 death sound", "Nice timestamps, thx", "thanks for the timestamps, really needed for the late comers", "@Mad Tech your welcome man glad i can be of some help", "Amelia: \"I am looting\"\nWhat chats just heard: \"LEWDING???\"\n1:21:22/1:22:35 Amelia bamboozled their viewers", "https://youtu.be/fn4PlKBnxms Amelia say Meow", "@Bread Cheeks Thank you very much for this.", "Witcher 3 on my birthday\nSweetness", "Well then happy early birthday", "I hope so. She might be too tired then play Minecraft. >_>", "@sojiro856 HUHHHH DONT SAY THAT, it huuuurts xD", "I love the fact that she legit commentates over the gameplay like a tournament announcer lol", "\"I keep right clicking on doors like its minecraft~\" - Watson Amelia", "pov: you watch watson go hulk mode", "Normally I don’t watch vtubers but when best girl emelia Watson plays apex", "12:43 livin’ on a prayer", "pew pew", "https://youtu.be/fn4PlKBnxms Amelia say Meow", "I’m Japanese. I want to enter membership but i don’t know how to do it.   Please tell me how to enter membership!!  Sorry for my poor English.", "You click the \"join\" letters beside the subscribe button", "@kiell borja I can’t found “ join”  maybe foreigners can’t join the membership.", "Try doing it on a Pc JOIN option ain’t available to me on tablets or phone.", "@Alejandro Camacho Join option is available on my phone, you probably need to update your app?", "動画の下に「メンバーになる」という青いボタンのある所を押して、メンバーになれます。：）スマホでも、PCでも出来るはずです。もしかして探せなかったら、 「Watson Amelia Ch. hololive-EN」のチャンネルペエジに行けば、すぐ見つけるかもしれません。", "Bruh", "@Alejandro Camacho  For the time being, I tried on my PC and entered the membership.  Thank you!!", "@Rofl Waffles Thank you for taking time to translate it into Japanese! I started watching Watson Amelia and started studying English in earnest. So I can hardly understand what she is saying now. I am looking forward to talking with various people in English in the comments section. I want to be able to speak like a native!", "@Rising Atlas We are bro!!!!!!!", "@リセッシュ茶 wat", "@Rising Atlas sorry", "@リセッシュ茶 don't be", "@Rising Atlas What dose 「don’t be」 mean. please tell me", "@リセッシュ茶 don't be sorry okay", "@Rising Atlas I can understand  thank you!!", "@リセッシュ茶 yay friends", "@Rising Atlas yay!!", "@リセッシュ茶 不和はありますか？私は日本語を勉強していて、言葉を交換できると思います。私は英語がかなり上手です", "@リセッシュ茶 do you have discord? I’m learning japanese and maybe we could exchange stuff. I’m pretty decent at english (i also typed this in english just in case you couldn’t understand what i said in japanese)", "@Zerayan   I have discord account.  It may be good because I heated that speaking is important for learning a language. Please do your best to study japanese.", "\"The John Wick one should be released after this stream is over\"\n\n....", "You are the second person to pronounce my name as Talkae. I love it.\n\nAlso, 1:39:05 Dani is crying in his sleep right now.", "that ragequit lmao!", "Stream starts......me: another one into amelia noise compilation", "29:27 PRRRRRRRRR ITS EVERYWHERE", "When Ame pulled up the map blocker I actually pogged lol", "Another member of the 4 fork gang. Bless you, detective.", "ya gotta love ame trying new things and having new personalities.Also nice stream today", "She plays hots!???\nI’m so happy to have found this detective!", "This here, is a REAL gamer girl. With toxicity and all that comes with package. Plus hiccups.", "its been a while since the last apex. I had fun as always", "2:49 this is actually a sonouraus war cry of a very angry animal. FEROCIOS", "Thank you Amelia for your videos. Hope your doing well and glad for the time you spend with us.\n\nI've been having alot of things going on, so it difficult to join every stream and I'm super thankful for the archives. However I just want to say your always amazing. Thank you so much❤️.", "かーわーいーいーーー\n日本語聞くのしんどい", "24:47 if you look closely to that box, it is most likely gura's death box.", "Gururura", "We need to call Ame the Amegator, Investigator, Gatorgirl, or \"Interior Crocodile, Alligator! I drive a Chevrolet movie theater\".", "57:38.   Thank you renzo in the chat for saying exactly what I was thinking", "I love the little bois she puts in the titles", "Shall we call Ame, Rasta Watsa due to her Jamaican accent?", "YESSS I’M SO EXCITED FOR THE GIRL’S LAST TOUR BUILDING", "WHEN DOES SHE SAY CYKA BLYAT SOMEBODY PLEASE", "1:05:03", "HEROES UNITE! Let me know if u need a HotS player to party up with! :P", "︻テ＝➖", "Witcher 3? Ahhh my fingers aren’t ready!", "I can imagine Ame playing Minecraft PE every time she go under her desk.", "1:07:45 Damn that rage XD hahaha", "I missed you chief Watson, today was extremely awesome and full of surprises in no small part thanks to you. ", "WAIT! Amelia plays Heroes of the Storm? 13:15", "What song in the background I really like it", "Watson=Gawr u need floets to go to the pool\nGawr=that romer is true :(\nMe=Say what know??!", "Walking L Jkjk my queen", "47:56 more of amelia noises", "Thumbnail is so cuute🤭", "2:03:20\nMah heart, mah soul.", "Girl is nearing 500k subs. Awesome.", "01:05:03 Suka Blyat\nApparently Amelia should be a Counter-Strike veteran. As Russian I can confirm, her accent is excellent...\nПохоже, Аме-чан - ветеран КС. Как русский, могу подтвердить, что ее акцент идеален.", "Wall-E is a great choice for a film :)", "I experience that rage quit live and saw 2K people said byeee", "Is she playing with default FOV?", "Yup i just became a simp damnit", "1:05:05 Russian Accent...", "I just found this channel so hi", "Ame needs to take a trip to IKEA and get herself some kitchen stuff.", "SHOOTBOYS", "are you going to try r6 ?", "amelia tries to play the new game Genshim impact\nPleeeaaseee", "Ame playing Minecraft even when playing another game. A dub is a dub though gz", "55:23 Ame you have refined taste in music and don't let anyone tell you otherwise", "How do you stretch your armpits ??", "dem just shown up in mine", "Heroes of the storm in 2020 OMEGALUL", "14:12 HMMM\nThis stream TLDR: 24:55\nCeramic = Glass 27:50 and Ame only needs 4 forks 26:55\n>No Bee Movie watchalong", "1:39:05 Dani : ugh Disgusting", "Hello fellow boner", "What a good teammate she actually goes revive and doesn't loot immediately", "Struggles of a minecraft addict changing games.", "I’m just looking at the mini map. Just the mini map. There’s nothing lewd.", "Toxic is her middle name 😂", "AmeRushi minecraft collab? On Friday?", "Can’t believe she actually saw the video", "28:47", "I love you Ame!", "I'm actually going to do something, AMELIA WATSON, I'm giving you a sidekick because well yagoo hasn't thought out about a Hololive game, so I'll do that, probably gonna be a Metroidvania rpg that is stage based like order of ecclesia, but cooler. Also the protagonist is called Celia Homes.", "I missed toxic Amelia ", "I hope/think it will be a collab with chairman coco. Since only people Watson can collab with are English speakers... kinda narrows it.", "ARMPIT STRETCHING", "Nice play as always", "Thats happen when you are addicted to Minecraft.", "https://youtu.be/qFnn4AQvbHg Haachama is back", "@Bread Cheeks stop spamming", "Bruh i want to play apex with herrr", "Lol dat swimsuit Amelia........damn", "1:07:48 ahahahah", "demn she loves bangalore, then must be SHiv Fans", "I like how she’s the only one who puts BST it’s so helpful being a Brit", "I believe they all do. I find Kiara is the only one who streams at times more manageable for us brits as she lives in a  German speaking country I believe", "@Mynanship Actually Kiara is in Japan, and so is Calli. I believe Ina is in Canada, while Gura and Amelia are both in North America.", "@Merc With A Mouth really i find that kiaras schedule is extremely suited towards people living in Europe as here her streams alternative from around 12 pm to 5 pm whereas the others stream at like 3 am and 2 am", "Too much minecraft will forget other game ", "Epico", "im going to be like you maybe", "how", "nice", "I hope the secret collab is with one of the JP or ID holos.", "Its probably Rushia or a 5th/4th gen member", "https://youtu.be/fn4PlKBnxms Amelia say Meow", "@AMELIA VIRUS well there is an English speaking 1st gen JP Minecrafter :)", "Among Us with EN, JP, ID will be GOAT", "???? was also in Botan's schedule at the same date and time 🙃", "@What a Simp KFP Navy Admiral hmmmmmmmm🔍🔍", "@What a Simp KFP Navy Admiral can they communicate though? Watson knows Japanese the least out of EN and Botan I’ve never heard saying anything in English other then guns or FPS titles lol.  Botan collab would be cool I like botan and Watson being carried in a FPS would be funny. Personally think if it is none EN it’ll be Coco or the Australian cook. Possibly moona as well.", "ASU", "Ye", "Odd that the chat isn’t being shown.", "I guess that is because so one said something bad in it :(", "@? the Platypus no it just takes a minute to show up after the stream.", "@One Punch Fish I was this years old when I learned that. That is super cool to know.", "Amelia should watch \"Hereditary\" for the Halloween movie stream.\nIts not a Halloween movie but its dang scary.", "a", "O", "24:15 Amelia Watson: \"ina\" cent\nIna: Proud tako noise", "Toxic Amelia is just so cute", "Nyam nyam nyam nyam", ""]