["I like how if Ame needs help, She just calls chat, She's training us to become professional backseaters where we write Understandable helpful Explanations instead of just 'eat'", "We ain't called the Backseat boys for no reason! But yeah honestly ame's chat has gotten much better", "@Cye_Rye If she could tame bubba, she could tame us, after all she's a S", "@Ivan R.A. We Bullly her She Bullies us it's a win win \nWell not for our moms", "but the chat backseats even when she's not asking for", "@Julius Zeppeli where on the way to becoming professional, were getting there... hopefully", "Lmao, truth", "It certainly gives your fingers a workout when you have to type out a detailed explanation as fast as possible before she moves on", "Lol, it might be a bit random for others, but I feel like if she could master chat she could be powerful like Aris in her own way. Kinda hoping tbh", "She isnt \"training\" the chat, rather she has the social skill to interact with it while playing. The other one who does this is Pekora (yes, even if it is a social skill Pekora can do the same because she changes while streaming), tho Pekora isnt as chill as Ame so chaos ensues.", "The two founding fathers of the HoloEN server, so much productivity happens with both of them", "Technically gura made the first minecraft settlement in the server but let’s forget about that we making railways here", "Also that Kiara truly founded it. Gura just logged in first", "Kiara discovered the lands, Gura colonized it and Ame/Ina built a nation out of it", "@Ken Nguyen lol what about Calli", "Ehughesj bingo", "@Moose The natives \n\nStill in their humble abodes", "@Moose Call is that one investor who visits from time to time.", "@Moose she lives in their society", "@Moose Calli is the (boomer)citizen", "@Ken Nguyen Calli reaps the sinner mobs that threaten the server", "@Moose Calli's here too.", "No one has done a hiccup timestamp yet?! Fine... I'll do it myself!!!\nStream Start!: 02:50\nHiccup count:\n1. 10:38", "1:14:23 at this very moment, you can hear the thousands of sigh of relief of teamates when Amelia finally turned off auto-jump", "tears were shed", "Watson is real British - Bild railway and  colonies new-ish land.", "and kills dozens of natives", "Fingers crossed she doesn't start a revolution", "@Pxltr2033 this is call - bringing enlightenment, you know...", "@Kohl R. she’s no French to do something like this.", "Huh.  Yeah, go figure she's the one that colonizes the Nether.", "Ina-wan Takobi: Amekin has turned to the toxic side!\n\nPigYounglings: Master Skywatson there are too many of us, what are we going to do?", "Gawrda: \"Hmmm, \"a\" I will.", "That whole part was hilarious. I love this community lol", "Good soldiers follow orders.", "Kiara: Unlimited chickens!", "General takobi**", "42:08 \"They are not cowards, they are pigwards\" 😂", "Ever Hear the Tragedy of Darth Watson the Scottish? I thought not. It's not a story Yagoo would tell you... It's a Zoomer Legend.", "Epic soundtrack plays in the background", "can someone give me the timestamp of that moment? I saw it live and laughed my ass off", "Is it possible to learn this power?", "I hope this copypasta never dies", "2:29:25 Exe\"cute\" Order 66", "Yes my lord.", "2:32:50 she stepped on us\n2:35:00 asmr\nfor my viewing pleasure", "2:16:53 Scottish Amelia", "That last battle again the piglin was kinda sick tho 2:29:00, today we are blessed with an asmr at 2:35:00", "Ok so we have the third minecraft company from Hololive? Damn now It's getting harder to choose which one to invest. Pekora construction, Akukin, or Watson Railways. Any finance guy wants to help?", "Diversity your portfolio", "Well, you see, Pekora Construction is the most advanced, with revolutionary techniques, a great ammount of Experience, and has more than enough manpower for most projects, however, on the other hand we have Watson Railways, which are just starting out, meaning that there is a lot of room for asset acquisition, and a great potential for investment but higher risks.", "Also Moonarchitect is a subsidiarie of Usada construction", "I feel like with the efficiency of Watson Railways they have potential to be something more!", "The railways sound more lucrative. Movement and control of resources always makes bank", "@Fiusha Ironfoot Usada Construction's kinda shady though, there's been leaked footage of their CEO committing war crimes against villagers", "Time in the market beats timing the market.", "2:29:00 \"Battle of Rourke's Drift 1880 (colorized)\"", "Clippers, it syncs up with this nicely: https://www.youtube.com/watch?v=DSjPoUtlkyk", "PIGLINS ATTACK\nFIGHT BACK TO BACK\nSHOW THEM NO MERCY AND FIRE AT WILL \nKILL OR BE KILLED", "@FranclyInsane \nFACING AWAITING\nA HOSTILE SPEAR\nA NEW FRONTEIR", "I'm gonna be controversial here and say that the nether needs to be properly colonized. These piglins have made it a custom to rob and kill humans on a regular basis.\n\nNot only do they steal luxury from our generous nobles. But they attack common humans at sight. That's racially motivated violence against the humans! This happens at alarming rates, yet they just go back to their villages without any justice delivered? This is not peace, this is negligence!", "if i hadn't known who they were, i would've thought they've been friends for years. it's really nice seeing them being so comfortable together, it's very sweet", "100% agreed", "Do we know that Ina and Ame are strangers?\n\nI know, for instance, Korone and Okayu are long time friends.", "Whenever I hear Ame speak in a scottish accent, I swear I hear All Star by Smash Mouth playing in the background.\n\nAlso, o7 Tea Mates, where the discord link at? XD", "ah,you never got informed? we already reached 150 members in our Discord,therefore we are not inviting anymore", "@- Kyrel - Unfortunate but it's all good~", "are you talking about some other discord server than main ame's one?", "@dawcakrwi Or you could redirect me to the main ame discord server, my good man.", "@Ace Ellasos https://discord.gg/WPGhczB", "@dawcakrwi Thanks m8", "When girls play minecraft: \n*get hit by smth. Are you ok ?\n\nWhen i play with my guy friends: ", "2:13:15  IS THAT PHIL?!? The legend starts", "the full suit gold armour and the golden sword\nyep its him\nhe was destined to meet cali and gura to be their slave\nthere is more to him than meets the eye", "No PHIL got golden helmet", "Comfy Ame and Ina stream, chill(sometimes chaotic) chat, PERFECT! The moment when the Piglins coming at you and Ghast shot you was really scary but also fun! (We are the one who should really thanking you for everything!)\n\nP.S= Secret Ending Unlocked: Sleepy Ame", "2:35:00\n\nNo, we should be the one thanking you for this wonderful treat ", "Blessed stream! Ame and Ina collabs are the most relaxing experiences of HoloEn.\nThe ASMR at the end is a bonus ", "53:47 do not rob Ame house", "1:49:26 Yeah... the massive hole that now has claimed two victims... it seems that Kiara proof doesn't mean Calli proof. I hope the hole doesn't claim anymore innocent souls...", "I was too tired to continue watching but I managed to watch the rest of the VOD. My favourite part was the ending with the fight against the zombie pigs. Really fun stream!", "My tiny brain can't comprehend why she is putting the rail path to the right of the bridge instead of directly on the bridge. \n\nWatson is too smart for me.", "Nope never she mined directly down into lava. \n\nWatson is just okay average smart.", "I do that too\nProbably because we drive on the Right side of the Road here in Malaysia, same for the UK\nIts sorta a force of habit, but for Ame I wouldnt know the real reason", "@Aston Martin bro we drive on the left side of the road", "maybe so they can still use the bridge as a walkway if they need?", "@MixNMatchName it's exactly Because of that. Ame has repeatedly remarks that she don't want the rail to interrupt the walkway", "54:57 ;) ok I leave now", "1:27:25 B)", "Today will mark the day Watson finally turned off Auto Jump.\n\nIt will be a day to remember for all time.", "Aw. Had to miss this. I was suddenly busy. Oh well off to the archive after work then.", "It's kinda weird I had already thought \"Nah they will be fine in the end\" even before the stream started, these two are just too OP in Minecraft. ", "The bodies of Ina and Watson that were buried that day laid the foundation of Watson Industries Nether branch..", " for all the Hiccups I missed, and thank you for the wonderful stream", "god tier stream as per usual, watson. the random 360 suicide jump that you survived somehow will stay with me for the rest of the week", "Thank us?\nNo, thank you for keeping me entertained during this grind of a job!", "Another successful Zombie Pig grind for XP.\n\nAt a nice juicy level of 0.", "54:00 The little pig dude running and opening the door ha!!!!", "This was a great stream, as always.", "I'VE JUST TELEPORTED FROM INA", "Lovely fun stream, you never disappoint Ames, that’s why we stay.", "Chat: Do a flip!!!\nAme: 1:46:06", "720 trickshot", "Ina's thumbnails are always so great", "I love how it appears the Enderman is waiting for the right moment. It just spawns right in front of them. It is letting them know that it is watching at all times.", "10:22 The Creeper, creeping around.", "The “hmu’s” and “hic’s” are awesome!", "It's not the curves themselves that slow the cart down, but a wall next to the curve, as the minecart's corners scrape the near walls and that's why they slow down. \n\nBut I'm fine with them solving it with sheer power. All that powerful wiggling and shaking will clean Gura's gills nicely.", "Ah yes.\nHolomyth's two brain cells.", "Which are oddly 80% of HoloEN's brain power.\n\nthe other 20% is Calli.", "8:12 \"You have an arrow through your chest\"\n\nEnderman: Hey what's up. I hear that there is an arrow stuck in someone chest. Uncloth yourself to let me check", "Cant wait for them to learn to build god tools and then give copies to gura and co and see there reactions. Actually, cant wait til they kill the ender dragon.", "1:09:27 is the perfect laugh, that's also followed by long silence", "I watch Ame's streams for her cute hiccups", "May things always turn out the way you expect, same for peace, love joy and happiness.", "53:47 watson and the 🐷", "her making gold armour is bugging me, but i 100% realise thats what shes doing for and i hate that its still bugging me >.<", "attempting to make an xp farm... what she gets is an XP loss!", "Minecraft streams are always a delight for your eyes and ears, pure relaxation.", "does anyone know what resource pack Ame uses? its so prettyyy", "The interdimensional Rail Baron!", "1:58:48 my favorite part", "1:08:54 When spaghetti falls out of your pockets.", "Ah yes milk gets rid of curses, just like real life.", "Can't get cursed if your bones are strong enough", "HE NEED SOME MILK", "Between the colonization of the Nether by these two and the enslavement of Phil by Gura and Calli the EN server is becoming quite the empire.", "10:40 HICCCCC", "with ame too addicted to survivals and build stuff, do you think she would like Factorio?", "Im still sad that ame is using shaders. They mess with my perception and make it harder for me to recognize items and locations.", "Also this lag is crazy. Maybe it has to do with the shaders???", "Do Some Minecraft Traps!!! Follow The Footsteps of Pekoramon!!!!", "usada construction need to watch out", "Watson have a insane approve at combat. Very impressive", "Rumor has it HololiveEN is banned from the JP server because Usada Construction paid the government a bribe to maintain their monopoly", "Anyone got the timestamp for the scottish accent", "Man their nether looks cool", "waston may i ask your minecraft version is Java Or Win10edition?@@", "2:50", "These 2 are probably the best at Minecraft in the group.", "Someone tell Ame to use a blast furnace its a furnace but faster!", "I'm not an expert on Minecraft but I think the pigs hate blue stuff. Maybe a blue door will keep them out of your house.", "Ground Pounder", "HoloEn Minecraft w/o Ame is still in Stone Age.", "Alpacas are just Walmart brand Llamas.", "At the time of posting. 469k......Nice", "okay but what texture pack is this", "4 horas da manhã é pra machucar o neném, f", "Does anyone have the seed of this world?", "1:46:06 ame 360", "All hics:\n0:10:40\n0:24:29\n0:48:45", "Railing Ina in the Nether", "Good stream", "1:00:42", "Another pigman genocide railway nether colonize comfy tea stream with Ame & Ina.", "2:35:00\n\nasmr", "What’s her shader", "What shader is this?", "Hololive en Make me buy Minecraft 🤣😀", "Watson kensetsu is looking nicer", "EL COMENTARIO EN ESPAÑOL", "Guys.....WHOS JOE?????????", "Nice", "Ooo", "Have you heard about the three holes in the ground? Well well well", "I don't know if you'll see this but for the rail I'd suggest rerouting the top section at the start where the first downward slope is. Instead of curving to the left dig a tunnel through the netherack straight down to the flat area further down. It will use less rails and also if there are zombie pigmen walking on the track they can block you when going up or down the rail.", "Black and yellow black n yellow", "I think someone should tell her and other members that there's a specific playlist of music for the nether that they can easily find just to set up the mood a bit ^^.\n\nI also noticed that the girls that use the minecraft music playlist uses only a small portion of the survival music, I think they should give the other survival music a try just so it's less repetitive!", "Ponarelfo", "", "the graphics difference lul been to long since i played minecraft clearly", "", "Perfect avatar for the end of the stream.", "Good video buddy. I liked that. And did you see my Minecraft Animations by the way?", "you didn't even see the video. At least try to make you plug somewhat tolerable", "I think i cracked the case!!\n\nSOME OF WHAT IS BELOW MAY TRIGGER SOME PEOPLE, AND IT IS NOT A CERTAIN THING BUT A PERSONAL THEORY. You’ve been warned"]