["3:38:37\n\"Also, Ame keeps me calm\" \n* proceeds to lean against Amelia * \nMY HEART", "51:39\n\nAme: Ughh my gold sword is gone.\nGura: Im sorry (Checks her chest and notices she has gold then winks)", "i just notice that da sword in gura's pocket when she picking ame's things XD", "It was so wholesome", "And Amelia just winked after that, she was definitely knowing what's happening.", "It's hilarious how Ina is the only one that has had a nicer time on Minecraft\n\nEveryone else is just PAIN incarnate", "Ina really does take it safe, and honestly with how many ridiculous things happen on this server, it ain't even a bad approach. I was happy to see Ina at the end of the stream, made me glad that she was ok after she said she wasn't feeling well earlier.", "@Blooper {Reloaded} I had no idea she was feeling sick today since I don't have twitter anymore. Glad it wasn't too serious as well.", "@Keeys She was probably just fatigued, it has been one eventful month already, and I don't blame her for taking a day off to relax and get better.", "These girls collabing so much their cycles are syncing up. First Kiara,Calli then Ina. My bet is on Gura next.", "@Ben Cooming you know thats not a real thing right? Please tell me you know that.", "@TheVelourFog It is a real thing among close friends and roommates. There's a lot of case studies. I think he was joking though because it obviously can't happen in a not-in-person context.", "No, Amelia was having a smooth time working on her tunnel until a certain jinxing Gura came along. Being Gura is being pain.", "@Blooper {Reloaded} same, if i worked this often i would need a day to recharge", "@Ian Weber Can you elaborate what ya'll are talking about? My slow ass dont get it", "they’re talking about menstrual cycles, or periods, for some reason", "@2 cheetahs eating a pumpkin oooohhhhhhhhhhh. Aight thanks g", "Um guys, I don't think it was her period, she said her stomach wasn't feeling well yesterday during the Japanese study stream earlier today.", "Guys and their speculations... Stress is also a factor. The stress bought upon their debut and first month would be my bet. Their lives before (even with training and preparation) can't be compared to now.", "guess I was wrong and its Amelia next.", "2:28:03 ICONIC MOMENT", "bruh ", "Creeper? AWW MAN!", "i feel gura is suppressing somethin but i dont know what...", "Stream Start!: 2:27\n\nHiccup count:\n1. 33:02", "C U L T U R E", "that death was sasuga minecraft", "Yoooooooo! The Magnifying glass above Ame's house is hella cool!", "Kamen Rider! Progrise! Rising Hopper!", "Gives me a Saturday morning cartoon hero headquarters vibe.", "Duuuude~~ tubular!", "Big facts", "When did she add it? Did she made it off stream? I've been scouring the previous vids.", "You mean the tennis racket?", "@Lishtenbird yes", "This stream was lowkey super wholesome, Even when they where getting lost at sea, they had a good time and Amelia was open to help Gura for as long as she wanted to continue  playing, (probably cause she addicted to Minecraft lol) but the part that I really felt the wholesomeness at was when Gura said Amelia keeps her calm, gave me big sister looking out for little sister vibes. Hopefully they do more of this collabs cause even with set backs of die a lot they didn't lose anything that was important and had a successful adventure and made some progress for building Atlantis. (and also giving Gura that motivation back from her last Minecraft stream that she may lost)", "Could not agree more! <3", "Their relationship is so wholesome- I’m really getting the close-best-friend vibe from them! From making jokes, messing around, having each other’s backs- it really made my heart so happy for them and brought back a lot of good memories for me", "What happened to Gura's motivation last stream? Sorry it's hard for me to keep track of hololive", "@hanif rafli During her last solo minecraft stream she die a whole bunch, losing a lot of items and not made any progress on making a enchantment table(the main goal of the stream). Long story short she drop the f bomb just from seeing Pillagers outside the tunnel and being frustrated, also her biggest achievement of the stream was making a door for her house. (I said it affected her motivation cause it's similar to the Maneater stream where she was having a hard time progressing the whole stream and as of now she hasn't schedule another Maneater stream)", "When did she say that?", "@Daniyal Khuhro If your talking about the f bomb it was 2:52:00 on her previous Minecraft solo stream.\n\nBut if your talking about the motivation part then she never brought that up, it was my own comparison on why she stop playing Maneater, because she was having a hard time progressing for mostly the whole stream and in this stream showing she was progressing a lot with minor setbacks.", "Amelia is so calm when she collabs. You wouldn't believe she is a toxic gamer.", "You need to watch her clubhouse game collab with Kiara, her toxic was barely showing lol", "I guess being around other people decreases her rage or something.", "“I don’t want to yell, but it seems you guys like it *hic*”", "The whole toxic joke is so overused now", "@Jaws1391 the iconic ones are always overused, and it's why they're iconic.", "@Atis Yosprakob Honestly tho xD", "Perhaps the real treasure is the journey we made along the way", "Is this flirting?", "Does this still apply when you both die multiple times along the way?", "2:02:38 ames laugh just puts biggest smile on my face BLESS THIS STREAM GOOD WORK YOU TWO !", "u can hear the real ame voice. must protecc at all costs.", "Ikr her bf is so lucky", "@Akemisan - bro....", "i mean you shouldnt even be expecting to marry any of these girls in the first place e.e", "@Kaaro exactly", "On today's episode of the Same and Ame show: Same-chan has mental boom... several times...", "Gura: praises all the works Ame has done. 26:37\nAmelia: ", "Ame starts eating her cold burrito at 3:38:48", "Thankyou for this gem", "Her mouth picks Ame eating it... My heart", "Who else thinks Ame started playing with Ina after the stream ended?", "agree with you hahaha", "Agree with you who knows", "She's probably still going as we speak. Or she actually stopped playing, which I doubt.", "She has to return the Iron you know", "@Blooper {Reloaded} even gura still wanna play", "Update: if you see her twitter you’ll see that i was sort of right", "Before Amelia and Gura go on any big journeys, They always put some salt and pepper on their head. Because they are well-seasoned adventurers", "I hate myself for actually liking this joke", "The stream was quite eventful. RIP Gura on her many deaths. They made a lot of progress. Minimal backseating, well at least it was bearable. Ina was there sort of. Gura's choice of words were something. Picked a lot of good screenshots. Thanks for the stream.", "Watching this stream was like watching a full arc of One Piece", "1:00:42\nThis is such an adorable moment.  Gura winks into the camera because she'd secretly thrown Watson a newly crafted Golden Sword. ❤️", "This stream was so intense. The whole thing is structured like a movie and kept me engaged all the way to the end!! Any Ideas for a movie title?", "Ame and Gura’s Bizarre Adventure", "A Series of Unfortunate Events", "What not to do when adventuring", "1000 ways to die.", "The Last Hic", "Everyday we move closer to having every HoloEN member in the bottom left", "can sbdy explain to me this bottom left business? i think i missed the stream it was on", "Prob wrong but i think it was the 2nd all together collab", "@Jack Valior there was a Collab stream in which lewd rating and mind rating  chart take place for every member \nIn which Kiara in bottom left\nWatson in botton right\nGura in middle left", "@Jack Valior Watch the HoloEN 2nd collab in Kiara's channel. All the bottom left thing starts at 55:24, you can find the timestamps in the comments", "@Jack Valior yeah in the second full collab there was a chart with up being purity and right being intelligence. People start saying “bottom left” when they collectively lose all their brain cells lmao", "@Jack Valior they made an alignment chart in their 2nd/3rd collab where either you're pure (top) or lewd (bottom), smart (right) or dumb (left).\n\nAmelia is bottom right, while Kiara is bottom left. I can't remember where the rest are aligned to though.", "@Jack Valior Link to the chart: https://twitter.com/takanashikiara/status/1307505846922870785", "@Knicklichtjedi Gaming thank you =)", "@Jack Valior np! ♥", "Considering Ame is probably the least experienced in Minecraft (only rivaled by Calli?), she managed to be the most productive among the group. Now that's gamer mentality right there!", "Similar to Moona", "gamer girl ame", "@MoeSanation Moona is a freaking monster. All of that in spawn of a month is just so crazy.\n\nBut yea, Ame start enjoying the game and we love to watch it.", "I love how you can tell by the movements of her mouth that Ame is eating something. Is so cute~", "In the JP streams we say もぐもぐ助かる", "Like a cute fish \nIts so cute \nYou probably know what i mean if you had a pet fish", "3:47:34 Creeper : Why am i here ?  Just to suffer.. \n3:50:20 turtle nooo\n\nShe kill it with no hesitation ", "Every session of Minecraft is an adventure of pain, with highs and lows. Can’t wait to see the senpais make it all the more chaotic in the EN server!", "I'm a South Korean who don't know Japanese.\nSince subscribed here, I can finally understand what Vtuber says.\n빨랑 니뽄고를 배우든지 해야지..", "You must like Ina'nis then, since she said she speaks Korean", "Nijisanji has korean vtubers", "It’s really nice to understand the Vtuber’s right? They’re so cute and funny. It’s like a dream true", "I think staying this channel is also good for me. Because I should improve my TOEFL listening skill more ,which is for study abroad to the states.", "@SaltyBrim and also nice to be able to communicate with Vtuber", "I pressed on a random part of the VOD becajse I forgot where I was and managed to land exactly on the \"Do you want my seed\" part lmfao", "\"A Compass points to your spawn point.\" And with that, HoloEN has done more research into this game in one week than Achievement Hunter did in years", "3:39:15 \"I like cold food\"\n\nThat's it, she's the one.", "That was the most confusing yet equally entertaining installment of Uncharted I have ever seen.\n\nUncharted: Watson's Fortune", "Oh hey, Calli did another Doom Eternal video.  Guess I'll watch that in the morning.\n\nwake up eight hours later\nOh look there's another twelve hours of Minecraft to get through oh god how do they make so much content", "As a hololive fan since the beginning of the year, you'll get used to it :3", "\"How far can we go?\"", "EXACTLY 4 HOURS (≧▽≦)", "An endurance stream! Very fun and entertaining to watch. Hope to see more! \n\nAnd of course, waiting for Detective Diaries and Witcher 3 soon! ( though I wouldn't mind if you replace them with Minecraft again LMAO )", "Who else was there from beginning to end?", "I", "I think I kind of fell asleep (4am stream ;_;) in the beginning, but as soon as they started hunting treassure with maps the adrenaline woke me up.", "Y’all have no life lmao", "@ Marckus Andrei Narvasa why’s that?", "@Marckus Andrei Narvasa I just finished a long ass workday and I just watch their streams and leave it on in the background so think again. They're just entertaining to watch. I'm from Hawaii so it literally starts at 4pm and ends at whatever time. So I'm not up all night like some people would be during the streams late at night in their own time zones.", "@ミク初音 no point answering haters and salty people. They're just envious they aren't having as much fun as we are and wanna bring people down. Best to just apply rule 3, ignore em. The stream was greaf", "@Canaryright!", "me and i use two mobile phones at the same time to watch it together", "\"Ame has a budder sword\"\nNice reference random chat guy", "2:34:53 they found the treasure\n2:41:29 trident drowned kills Gura; they lose the treasure\n2:44:33 they find the treasure again", "Modern detective helped a baby shark to find her atlantis", "I left before the stream end cause of irl stuff,  now come back here to watch the archive. I mean,  this stream is honestly very entertaining so i feel like i must watch it all the way lol. Thanks Ame and Gura for this amazing ride! I hope you girls are having fun too!", "I swear, everyone in HoloEN takes turns being the \"Mom Friend\" and it's just the most heartwarming thing.", "Thank you Ame for taking care our little silly shark. She really needs a big sister to watch her back in minecraft. Thank you so much.", "woah Amelia master builder, she even provided an overhang to place torches on the 2nd treasure chest there\nvery thoughtful and resourceful amazing", "Missed the stream, but its great that you and gura could have a proper minecraft collab.\nKeep up the progress guys, WE'RE  ROOTING  FOR U ", "Ame being an absolute madlass MPV, even tanking the creeper's explosion. That's our detective!", "1:15:40 was that a ship bottom left", "So many emotions on this roller coaster. Also Gura really needs to get armor! XD", "These Minecraft streams are sooo fun to watch.", "i keep following the Minecraft stream since the beginning of Holo EN server, \nit's like watching a cinematic universe.. each channel connected to each other and sometimes Ame will cameo in another stream", "Ame is the best waifu, always get your back.\nEspecially gura's back, you two made a perfect team! \nIt's also fun to watch both stream to see the WHOLE picture of your story...alright, tee tee time!", "\"It's dark I can't see.\" Has been uttered a few times this stream... Perhaps it is time for Ms. Watson to check her video options and light levels.", "52:30 omg gura felt bad about losing Ame's stuff it was so cute but I felt so bad loool 😭 they really do make the best duo imo, Ame helping gura since she was having a hard time was really nice and time just flies by since they mesh really well with each other.", "I was there my internet just say no 😢 i can't watch", "3:37:43 Another GurAme or SameAme moment\n2:41:28 yab\n\nAme onee chan saving her imouto again and again", "You should watch Mio Mama or Lamy Mama 😂", "Her scream is so CUTE", "2:02:12 zooming Creeper", "When heard ame screaming butter when she got the gold me:\n skydoesminecraft still lives!", "Where would you guys rank the \n“Treasure Hunters” arc in the Hololive anime?", "Not be the hater but bottom low tier. Neighbour War and Usada Construction got a new season which is pretty strong. This one... Might be below Hololive Resistance.", "16:30\nAme: No, we’re not stealing, we’re borrowing. I’ll give it back!\n\nGura: We are merely “borrowing”.", "2:02:38 Aw man", "By any means I don't wanna backseat, this is just for them to enjoy the game better: \nI hope they learn all the super useful shortcuts for inventory/crafting stuff (like shift clicks and auto stack) and that they can use keyboard numbers to access items much faster without having to scroll (I think most Hololive doesn't do this). \nOh and that they learn the magic of pressure plates on doors.", "Maybe the real mining trip was the treasure hunt we made along the way", "I enjoyed watching this. They make for a good team.\nI finally tried out the demo to make sure the game can run on my laptop; had to make a few concessions (opaque tree branches, shorter distance) but it's fine to play, so I want to buy it soon.", "Archives be blessed; I had to quit after midnight. And that compass bit got so annoying; I just wanted to help, but I had no idea anymore who was actually right about where it points to, so, I'm just glad they eventually get places XD\n\nLike some of us were saying, the real treasure was the journey and the talks along the way XD", "Thank you for helping little shark to make atlantis come true while also working on your own projects.", "Does anyone know the time difference, so I can move between the streams?", "56 seconds?\n55 seconds?\n1 minute 5?", "Chat's pretty bad during these, but the stream itself was great. Haven't really given Minecraft any interest in the last few years but I really like seeing how a fresh server is progressing", "An exciting adventure of a stream. I don't think I've cheared out loud to a Minecraft stream in yeas. When they got back home after almost losing their hard earned loot, oh what a finish! And then it just kept going! Proud to be an investigator working for such a brilliant detective!", "1:10:11 Ame's face just smiling the whole time while taking a call XD", "Oh I didn't know it was a simultaneously stream. I got in late ha.", "It felt like ame still wanted to play more at the end there", "\"whaut do i do? i got bone, strings, and pumpkin\" what you trying to make gura? lol", "I popped in to look at the stream and came in at the perfect time to hear a hic!", "Watson Amelia is so pretty cute and I like how she speaks 😍😍💕, and Gawr Gura is also cute too 🤗", "3:19:19\nAh Ame, a Detective of Culture, I see!", "The Fort Amelia builds around 2:20:00 makes me think she's less Sherlock and more Robinson Crusoe", "Another beefy VOD, Ame & Gura really blessing us rn", "The railway is amazing! Sasuga Watson Construction", "this stream was very entertaining\n\n\nit was also a disaster.", "Finding the stuff is only the first test - now it must be carried home.", "2:02:14 - The creeper moment", "When it's nighttime the avatar are way to bright for my eyes", "Detective by day, plumber by night.", "When Ame called gold butter, i brought me back to skydoesminecraft days, nostalgia", "Tbh this is painful to watch, but they learn a lot. Especially with the hunger bar lol. Hope this duo did it again next time.", "1:02:34\nRule34: so you have chosen death", "Wonderful!", "2:09:37 - 2:09:58 is making me wheeze", "RIP Boat Creeper. Woulda been funny just to leave him there as a landmark.", "I like watching this as I play minecraft so I dont feel so alone when I play cause I have no friends and no wifi for my ps4", "Lol I said Carmen Sandiego at the same time Watson said it, well actually I said it slightly before she said it.\n\nGreat minds think alike I guess. Lol", "That was a great expedition", "3:47:20 creeper's birdwatching", "My only hope is that they someday learn to use their shields, forky Boys are scary but 2 shielded players can make short work of them", "loved everything", "I MISSEDDDD", "Timestamp for when she time-traveled?", "Gura and Watson channel their inner Senchou, and go on looking for pirate treasure.", "~Frère Jacques~Frère Jacques~......DEJA VU! Iv just been in this space before", "Thanks for the stream", "Is no one gonna talk about Carl...", "great stream gals! it was really fun", "Dude i just hummed Minecraft theme at the same time as amelia \nMy heart is completely complete", "lol fun stream but what is with that superchat drama, someone give me a rundown on the story xD", "Ikr", "LMAOOOO I'm makin donuts", "Theres loads to do in Sea of Thieves!!!!!!!!!!!!", "well that was great", "Hmmm...yep, definitely a comfy stream, thanks Ame, thanks Gura~ you both get a good rest, alright?", "See this before going to bed today", "1:15:50  where I left off in stream", "Oh okay", "Anyone know the outro title?", "Yo who else remembers Carl", "Creeper aww man is inevitable next karaoke", "I need to see gura using the trident in water", "Miss Watson, a small critic: the screen wasn't covering the whole game window and avatars on your stream were too big.", "We have the Same last name. Just wanted to point that out", "Hiccup at 33:04", "15:15 TAKO BELL + SUBWAY", "Ame built a better house than me in 30 seconds", "Nice teamwork guys can't wait for more adventures", "Fun stream", "Jesus loves you and I hope you have an amazing rest of your fall this year!!~~", "Oh no not the salt mine.\nIf you complain about gold ammo again you're going in the lava, okay chat?", "1:02:32", "Is it just me or do they have thin necks", "33.04 wt is that cute noise", "Amelia hiccuped.", "Is this their own server or they joined Holo Servers?", "Own server with all the EN members", "They are ruining the ecosystem of that lake by killing all those fish", "You know if you think about it really fits that gura is mainly a rhythm gamer like how do you expect a shark to operate a controller or keyboard with more than a couple buttons with fins. That said I’d love to fan art of shark gura playing muse dash", "Great stream Boss o7 it was super fun, also I think chat was way more chill today somehow, really enjoyed chatting whit the boys", "Who else switches POV during the stream? Only me? Yeah.", "I had both on, just one of them were muted.", "Just Amelia, just Amelia, just Amelia...", "gura should make armor already", "I'm pretty sure dolphins are faster than boats", "I just realized something. You know? W and M is only like upside down. And Watson got like the same smile just like Matsuri got. Anybody feel the same thing?", "DO A FLIP", "Seed got leaked", "Gura was the one with the most progression before right? I guess the tides have changed", "If Ina didn't join the stream woulda went for another 6 hours lmao", "Lol", "I love same x ame collabs", "Maybe I'm just being bitter but the whole Carl thing was kinda annoying and it was getting into rule #3 territory", "It was very annoying especially since Gura explicitly talked about respecting the chat guidelines recently", "Hm, yes this channel is made out of Minecraft", "Why does Ame teeth look like lips?", "bruh", "🥳", "Minecraft is a horror game", "the only thing i dont like about the sea is those random things suddenly touching your legs (grass and stuff) it really freaks me out", "AME MVP, thanks for helping Gura, thanks to you Gura accelerated his progress.", "His?", "What is vtubers who is Amelia Watson and why does she keep getting recommended to me", "just sit back and watch", "You’re on the verge of hell good luck mate.", "Says the guy who is subscribed to Ironmouse and a translator channel", "now go watch “Im. Scatman.”", "What? You're subscribed to several vtuber-related channels, so why are you asking what they are?", "Sloppy Phart yeah but this is corporate and it's like their celebrities living in a hype house. Like what is Holo? I'm very new to the scene", "Sloppy Phart it's just such a rabbit hole that never stops expanding", "@Ecclectic Sayonce Hololive is just a group of Vtubers. This specific branch is called Hololive English and there are 5 so far. They sometimes collab, but normally just play games solo in their own streams. Some do art and another does music. It's not really corporate, just organised.", "Next minecraft stream should be named we're crafting", "does anyone know who’s the oldest? or is their age unknown", "As a character, Gura is 3000y.o something", "in hololive everyone is about the same age, they are over 20, but under 30. The youngest is Fubuki, she is 19 years old, the oldest is probably our boomer pirate Marinе", "If you mean lore-wise, then Calli would be the oldest since death would’ve existed before the others, if you mean irl, then nobody knows, just that the requirement to join Hololive means you have to be 18+", "Feels like there always seeking death Lmao", "Minecraft", "I understand why you're skeptical about whatever the chat says but you gotta give us the benefit of the doubt Amelia! :D we see you rage quite often anyway even without us lying to you so we don't need to :P\n\nit's kinda cringy to say but it's more satisfying seeing you accomplish what you want to do so we're more inclined to help you most of the time ^__^", "\"Most of the time\"", "To be honest, the chat is annoying, it's like having someone touching your shoulder and tolding what do you have to do, i hope they let her enjoy the game and discover things for herself", "", "", "Shout-outs to Carl\nIts a shame mary left him for ame", "Dude was side tracking chat, dont give him attention", "Jesus, they dont know how to prepare for an adventure, welp its content  for us to enjoy", "You know, watching you play minecraft really makes me think.", "Carl struggling to save his marriage in here", "I was laughing to the point of crying whenever I saw him popup", "tbh it was only funny the first few donations, but it became cringe", "Carl Season 1 Fin~ \nTO BE CONTINUED-", "Ooh F Carl, haha JK", "Never forget Carl\n2:18:33 i think this is the first superchat?", "i loled at the Carl Brutananadilewski supachats. its from aqua teen hunger force. its not real its a meme ", "Josh is the true villain", "@Chimpking Lich  justice for carl!!!", "If you're reading this,", "I don't understand why they are trekking across the water dying and getting lost just to find chests with iron and gold in them.  You can just mine that stuff up.  I think I missed whatever part where they said what this trip is supposed to be accomplishing.", "vanilla minecraft is just frustrating.  The smallest of modpacks adds so much improved experience, just having a mini and world map and waypoints and dropping a grave with your stuff on death would make this so much less painful.", "@GretchenDawntreader well mc became a lot harder for no reason, they are very new to a mc suited to people who know more about the game. There is so much to learn and they aren't aware of the ways to mine and profit before you can build and explore without such a hard time.", "The heart of the sea was the real booty here. Diamonds and metals were just gravy"]