["Since TTT is already taken, how about WWW - Watson's Wonderful Waterhole?", "I hate the fact that I like this", "That's a perfect name!", "Big agree. Petition to name it WWW (Lol)", "I see they can reach out for you for more puns in the movie", "hole uhhhhh. I...... Its not i hate it ( ͡° ͜ʖ ͡°)", "LEWD", "I was still pure a few minute ago until i saw WWW. MY BRAIN", "Hmmmmmmmmm", "I read this from live chat but someone suggested TTT = Tenchou (Store owner) Tantei (Detective) Tower.", "It’s not lewd if you don’t think it’s lewd. I need to cleanse my brain", "If its gonna be WWW why not just call it 草 lol", "I love that, it's very on brand and wwwww being JP for laughing fits perfectly", "(☞ ͡° ͜ʖ ͡°)☞", "this sounds so wrong but again she have Watson shaft...so....", "Also known as kusa", "lewd....\n..\n..\n..", "Thats sounds a little bit yabai", "This is golden", "a lewd name. but perfect for watson", "LEWD", "What’s TTT?", "wwwww", "@Mr Chips PH Grass?", "@Dakota Jones yup, so \"wwwww\"(unspecific amount of \"w\"s) is Japanese way of typing \"lol\", short for warau (笑う), or to laugh. And since they also look like grass if you have rows of them, so they also say 草 (kusa).", "@Leon Wow, thanks! I learned a thing!", "Chat got really cozy once the moderator wound up deleting backseat gamers.  Hate that they migrated to Kiara's chat to try to spam their unwanted opinions.  But oh well, it's a good start.  Still, it was a great stream and Amelia is doing a great job of keeping us entertained.  So happy that she's about to hit 500k.  She really deserves it.  She's a sweet, sweet girl who, like Gura, seems to have her finger on the pulse of modern trends and knows her audience.  She's a gifted entertainer and a natural comedian.  I hate that we get on her nerves so much, but hopefully we'll do better for her.  Can't wait to see what else she has in store for us!  We love you, Ame!  You deserve it!", "Agreed.", "Well said investigator", "Uh huh, so different from before when there is no moderator, and she hits 500K yeah! Congrats Ame!", "I'm pretty sure she's got raided \nby trolls", "@Advanced Weeb I worry about that.  The Minecraft content is great, but it sadly draws in a very immature crowd.  Although, I did see a few  Investigators in there trolling and backseating as well.", "Nice, we finally got mods for chat.\n\n\nWas getting super irritating during her Witcher 3 streams of morons going \"Gwent this, Gwent that\"", "I agree as well, even though you want to see her succeed and not waste her time building something that doesnt work, I think she should be able to learn on her own that it doesnt work. (Im also guilty of this; when they were doing the hoppers I told them that you can put the chest next to the hopper rather than under it) But upon reflection its mostly because people feel like theyre playing through their perspective so when theyre doing something thats not so correct then chat gets a bit impatient because they know what will happen. It personally stresses me out so I just have to leave the stream cause of ocd or something. But I guess other people deal with it by spreading their suggestion so that maybe they could fix it, however its probably super overwhelming and stressful for the streamer. I personally dont think that people are backseating with the intent of being toxic, it just happens to turn out to be toxic.", "Yessir!", "@help me The first thing to remember is that these are not just random girls they picked up off the street .  These are grown women, these are people with experience in entertainment, in the games industry, and most of all - THEY ARE GAMERS.  And I'm a gamer and I sure as hell would hate to have 20,000 people trying to tell me what to do in the game I'm playing.", "They started muting people who weren’t even back seat gaming at one point which is kinda nuts. What’s irritating is when something doesn’t work and Ame blames chat. I think she really instigates the back seat gamers herself.", "@Julian Benali They were trying to get a handle on the situation to make it easier and better for everyone.  Most of the fans are sick of the backseat spamming too.  And she doesn't have a PROBLEM with chat answering a question - that's FINE.  But she does get mad when the chat gives the wrong answer, as she should be.  She actually says \"Okay, fine guys, what should I do?\" and they give her incorrect information.", "Uncle Biff That’s to be expected when you  have a large enough fan base, that’s why you don’t just go with whatever answer you happen see first. I do think she just has issues taking advice, like she gets kinda rebellious over it.", "@Julian Benali No, chat flat out lies to her for laughs and spams the wrong answer.  And even then, she doesn't get that mad about it.  She just jokes like \"You guys lied to me!\"  Because she just accepts that.  What she can't accept is a bunch of OCD crybabies who want the game played their way and who forget that they're watching another person's gaming experience and not their own.  It's not a difficult concept for anyone who has been taught to respect the wishes of others.", "Uncle Biff No, she’s obviously joking around when she goes “you guys lied to me!” but it’s easy to see when she genuinely blames chat because she doesn’t wanna take responsibility for her own mistakes, which just further provokes chat into backseat gaming.", "Julian Benali just go see her twitter and also reddit.", "Razorwind I have, what are you expecting me to see exactly?", "@Julian Benali \"she doesn't wanna take responsibility for her own mistakes\", \"she has issues with taking advice\" kinda sus wording bro.  she's learning a game, she's never gonna play perfectly or min/max all the time, and we're along for the ride, and she occasionally asks for advice. It's not that serious, at the end of the day both her and the chat just wanna have fun and she's figuring out how to nudge it that way, this time with moderation.", "@Julian Benali the new revised rules from Ame community tab, she just posted 35 mins ago.", "Yoyo Jones Of course, it wouldn’t be interesting if she played perfectly. She just needs to stop blaming others when fails to play perfectly", "Razorwind Oh yea I saw that. Glad she added it.", "Just curious. Is the moderator a bot? I was trying very hard to report any spam and would notice some would become redacted or deleted before I finished reporting. That was probably the moderator at work right? What’s crazy is that even members were outright nuking chat with spam so members only would not solve the issue.", "I know some channels that will ban people for backseating, even if they are a member. I don't think it's a bad idea. Someone who is backseating doesn't really have anyone's best interest at heart, so it's better if they just go away. They annoy the person playing the game, and they annoy all the viewers. They can yell into the void to their heart's content, not even knowing that they were banned, but will still think they are \"contributing\". Everyone wins.", "XnRz_ Yea, that’s the mods at work.", "@Robert Kristian Zambrano Sadly everybody wants to be a comedian/entertainer, and try to interject themselves into the show...instead of sitting back in being in the audience. If they think they can do better, they should create their own show.", "@Uncle Biff Exactly it.", "Differences in cultural norms get be hard to navigate sometimes. Ame-chan also seems to be learning about them. She reminds me of Hermione from Harry Potter played by Emma Watson. A relative maybe? Maybe Ame-chan is also good at magic in minecraft?", "Amelia can manage on her own, but when Kiara plays Minecraft it's mostly chat plays Minecraft as she doesn't really know how to do it herself and she keeps asking chat for help.", "@Uncle Biff Idk, Amelia seems to be the only one in Hololive EN who was actually a gamer prior to starting streaming, though it seems she only played fps. Pretty obvious if you watch their streams when they start playing games.", "Ohh so THATS why there was a weird influx of spammers in Kiara's chat all of a sudden telling her to read the SC. What a pain in the ass group of people, so dedicated to backseating they'll raid another stream just to do it.", "@Julian Benali You're part of the problem... the way you think sucks so much...", "I feel real bad for the EN group cus you can tell they all enjoy minecraft but the english speaking MC community is FILLED with backseat gamers.  They're very 'this is the efficient/right way' type of backseaters which are the worse!    Worse because people forget people play games how they as an individual want to play.  I'm glad they're starting to moderate and ban/mute the backseaters, it's gonna improve chat a lot and make streams more fun :3", "@Julian Benali If people are fucking up she's going to blame others you can't fault her for that. Regardless she shouldn't have to put up with the bullshit anyway whether or not it was generated by her 2nd handed or not.", "@Julian Benali you dum", "Progress.", "@Robert Kristian Zambrano IMO Gwent is a great game but I hate watching it. I don't think I'll ever be able to relate to people who want a streamer to play Gwent for hours.", "@Julian Benali I think the point is that she blames others because she feels so much pressure to do things correctly. Because when she doesn't, chat mercilessly mocks her. Some are lighthearted, but she knows that a lot of them are the same backseaters just waiting for her to mess up, and sometimes trolling her just so that they can spam their directions and feel justified about it. At the end of the day, this is her stream, not theirs. How would you feel if you were in your own home and your friends and family kept criticising you for your sense of fashion, your furniture, the kind of food you eat - all the time, relentlessly telling you that ", "@Yoyo Jones I agree. It's not like they're revising a draft of the Geneva Convention - it's just a video game - it literally has no real world implications to anything. If them wasting time or making mistakes isn't enjoyable for you then don't watch them.\n\nThat's, ultimately, how this is supposed to work. If the streamer isn't delivering a stream you want to watch then don't watch it. It is their job to deliver entertainment and if they aren't doing that for you then that doesn't mean you're supposed to nag them until you're satisfied - it means just close the window and go do something else.", "@johkkers \"How would you feel if you were in your own home and your friends and family kept criticising you for your sense of fashion, your furniture, the kind of food you eat - all the time, relentlessly telling you that they know what's best for you?\" Do you want to tell me your life isn't like that? Do you not have people that care for you? Who spend their time thinking for your sake? That love you so much they don't want you to run into a knife? Poor sod.", "@Die Finsternis there's a big difference between caring enough to warn someone, and constantly denying and undermining their personal agency. One is being concerned, the other is being controlling.", "they should add another rule No Backseat gaming its really annoying rn", "@HeatWave it's already up. Thank goodness that it's being enforced.\n\nIf it's in her rules then people can't complain if they're muted or booted. Hopefully other members do the same so a situation like Kiara getting raided just so that they could backseat could be curbed.", "I like how you are fawning over someone who doesn't even really like her fans. Pretty awesome to make over $1000 every stream though.", "@LaFonteCheVi And you're an asshole no one here likes.", "Honestly the comments complaining about back seat gaming give me more of a headache then the people doing it.", "@Alex M Both are kinda annoying if I have to be quite honest, even if I joined in the complaining against backseating.", "i noticed that", "@Magitrix Alyxra You're basing that on what you think a \"gamer\" is supposed to perform like.  It's that kind of elitism that's stifling the industry.  Maybe don't judge a person's status as a \"gamer\" based on your own personal evaluation of their skill.", "@johkkers  Nah, the issue is that you are mixing things that should not be mixed. Its is COMPLETLY alright if family and friends do that. Point is: Chat isn't family and friends. Your argument implied it anyways by using those as example. If you consider chat family and friends, I'd need to call you all pricks for trying to make her sway away from the people she considers dear.", "@help me I feel ya.  Nice, balanced comment, too.  Shame that some of the antis have descended to name-calling or general condescension.  It's not good for the vibe either.  In any case, it'll be interesting to see how Ame deals with the coming failure.  Hoping that she has the fortitude to re-do and triumph in the end.  In the meantime, we'll just have to accept that Ame don't listen. And reserve the right to say \"Told ya so!\" :D", "So cozy, kicking people out on a whim for harmless chat and then arguing about it on the comments...", "@LaFonteCheVi get out of here. If you don't like the content nobody will miss you", "@Die Finsternis it's not completely alright if you paid attention to my qualifiers of 'all the time', and 'undermining personal agency'. That's not alright for anyone to do, unless the person in question is unable to care for themselves - which is hardly the case with a grown woman playing a computer game. ", "I don't understand Amelia talking about but I like her Minecraft streams\n500k sub congratulations\nThank you for the stream\n(I can't speak english sorry )", "welcome !", "The table has been turned, also Welcome", "英語の話さないのがよく書けますよ", "Welcome to the investigators and Tea mates!!!!! We don’t bite!!!!", "@Arc lieutenant Jesse we’re not supposed to bite people? o_o", "@DisAppointment4 If they want to be bitten, its some people's kink (not mine though)", "Welcome to our world of English Hololive Nihon-niki", "Lol when ame said she wouldn’t play among us with the chat, can’t blame her for that one 😂", "Everyone toxic so.... ", "I'm pretty sure she still wouldn't have played with chat even if all this shite hadn't happened. On her FPS streams, she was stream sniped so often so that's probably her biggest worry.", "@Emma Nonn what if its member only...among us (nah...its wont work i guess)", "@Ara Ara it might work. a much smaller chat will be way easier to handle. it'll be slow and chill unlike the shitfest we usually get", "@Ara Ara hmm that actually could work, and it is probably the best way to do an among us stream with viewers. But that's only if she wants to do it at all, and we shouldn't try to get her to do one if she doesn't want to.", "cant blame her after what happened in the witcher stream", "@Caio Was a massive shitshow of morons tbh.\n\nShe even read the Witcher books beforehand and I'm sure most of chat during those didn't read the books lmao.", "@Ara Ara members were spamming during Witcher 3 stream yesterday too, so sadly don’t think it would help much. We just need to report any spam more often, and hopefully they can get a dedicated moderator for her chat.", "Im sorry im new here, but I LOVE AMEE SO MUCH!!! So what happened in the witcher stream guys? I missed it", "@Yuuki Kurounga spamming and backseating during all the time", "@Emma Nonn Even then there will probably (guaranteed) be so much simping that she won't have fun. She's the competitive type after all.", "you have the time stamp on that?", "@Croco Dylan's just jump randomly, pretty sure you'll find it as it happened almost the whole stream", "She should just add a rule #7 that says \"no backseating\" and get a mod to block people who do. A number of vtubers have that rule, might not stop the chat but at least she would make it clear upfront.", "@Robert Kristian Zambrano she didn't read them all she is still reading the first book", "How can they not be self aware of what they act like in chat smh", "@divineiniquity she added that rule after the streams and apparently mods took care of backseating this time", "45:30 A kilogram of feathers is heavier than a kilogram of steel since you have to deal with the weight of what you did to those poor birds", "But Steel is heawier than fheathers?", "Watching Ame's POV was hilarious, you don't see Kiara doing the deed, you only hear Kiara's crying, the sounds of hitting, the screams of the dying chickens.", "Ina would be proud of that one.", "@Hydrengea is Not Normally Deep Red if you have a kilogram of something and you balance it on a scale with a kilogram of something else, both sides still weigh a kilogram lol", "@Trajen Woosh", "It won't weigh on me if I took those feathers from Kiara", "@Trajen Joseph quiet we don’t want to hear it", "Umm.. If your logic is like that, then it is actually steel.\n\nYou need to destroy some animal's habitat to get the steel. And also that mine will pollute the surrounding. From mine to the smelter it is all pollution. Air pollution, sound pollution, and etc.", "@juni meme I also want to be like this, whooshing some dumb ppl, but I remember that.. THIS IS NOT REDDIT.", "@DBT woosh", "@juni meme he’s not the one you should be wooshing, he’s explaining to the other guy who said a kilogram of steel would be heavier than a kilogram of feathers that they would weigh the same. I’m sure Trajen understands the joke.", "@Trajen not if you add the emotional weight", "\"KFP Employee training with kiara\"\n\nIn reality: Watson industries building training with Amelia Watson", "Hello ! I am in hospital so hard to servive in hospital so pls subscribe to my channel it will be fell good😇", "@Tenzin c mamó xd", "expectation: KFP employee training\nreality: More rails", "I posted this as a reply to someone who justified backseating but they deleted their comment. No, unless she specifically asks for help stfu, let them experience the game and fail/succeed on their own terms. She doesn’t even read chat or SC because too many people tell her what to do. She (Ame) seems to like to do her own research and play on her terms. She is a gamer. If she was being handheld you would all be complaining as well so just stfu!", "Nanodesu Vaccine lol I was typing a reply to that comment too then it disappeared.\n\nAnyway, I'll share my reply here if that's alright. Of course this is not directed at you, Vaccine, but at the guy who deleted comment:", "@massmanton Yes it’s alright.", "Dude did the same to me, seems like he just can't take opinions about his statements that well.", "@The Grand Alliance Bruh, that's not what it means.\n\n\nAre you being a moron right now? Backseating came from \"Backseat driving\" AKA being a giant fucking asshole who keep taking the steering wheel despite the driver saying no.", "@The Grand Alliance lmao how many minutes you got timed out for you to get this angry?.😂", "@The Grand Alliance The biggest clown in the comments section ladies and gentlemen!", "Yes, chat needs to let her experience the game in her own way, so that she could have fun and explore how she feels like she wants to.", "@The Grand Alliance you keep deleting your comments lol you're a troll", "@The Grand Alliance You are not a clown, but you are the entire circus", "@The Grand Alliance Think about what you are doing, Ame didn’t listen to you, mods times you out and what you did was go on to Kiara’s stream to post the same thing... what kind of validation are you seeking?", "@The Grand Alliance Apparently you're blind and keep thinking that's what backseating means.\n\n\nSomething really tells me you're a kid.", "@The Grand Alliance see? You got timed out not once or twice but 5 times. Lmao that's already telling something.\nSome people got timed out and they even have membership. But they took it out very well. \nSo hold that 5 timed out L like a man. 😂😂", "Chat is for beta males bruh", "@The Grand Alliance That's literally backseating still, the fucking streamer will ask if they need help or advice.\n\n\nPlus what you're also doing is technically spam. You're among a sea of 20k viewers, you seriously think your long ass explanation will be read?", "@The Grand Alliance this guy.. It doesn't matter.. You see other got timed out and not even angry this much. Some of them even have membership.", "I find it much more entertaining to see what different people do when they are learning a game I personally already know. I don't really get the backseat gamers, go play yourself if you get frustrated at someone else's playing.", "Where is the fun in just searching on YouTube and then do a copy paste about it? If you are new to a game just like minecraft or any other \"open World\" game then is just more fun to go and explore yourself. If you wanna help the streamer do it for things that are a MUST or that are of really big help ( for example a crafting a compass in minecraft) , but if youre going to tell them every single second about what to do even for small details then becomes annoying.", "@The Grand Alliance no one wants your advice", "Reign it back a little folks. Every one here seems to mean well but I'm sure as heck it doesn't benefit the community as a whole if you continue down this path.\n\nAgree to disagree. Ame can choose not to listen to backseat gamers anyway.", "@The Grand Alliance We don't care what you think backseating means. Don't tell her how to play the game. Just sit back and watch her play, only giving advice when she asks for.", "@The Grand Alliance You do know that doesn’t work on YouTube anymore so you’re lying I also saw a comment of yours get deleted immediately after as well which too quick too get downvoted then deleted.", "@The Grand Alliance Shut the hell up dude, no one here likes your opinions, if you are so mad about us trying to make chat better, you can just unsubscribe and watch someone else, we will not miss you at all.", "@The Grand Alliance I literally search up and downvoting does absolutely nothing so you are lying about downvoting leading to your comments getting deleted also you seem to choose whether your comments are getting deleted because of downvoting or shadowbanning.", "@The Grand Alliance I literally search up and team YouTube did say they hide dislikes and remove any functionality of them doing anything sorry Redditor YouTube isn’t reddit your comments can’t get downvoted then deleted if you want to know why I think you are “if you think I’m insane I have a bridge to sell you” is such a reddit thing to say it makes me cringe.", "@The Grand Alliance If you could, please post a source that shows that comments can be deleted based on dislikes. Additionally, having your own definition of a word or using an old one does not change the defenition to what you want it to mean", "THIS", "Did someone actually downvoted grand alliance's comments?", "@The Grand Alliance Reading your reposted original post along with the OP's and the member's response,  you are definitely the one in the wrong here.\n\nCivil discourse is impossible not because you are being cancelled, but because you can't own up to the fact that you are wrong.", "@Robert Kristian Zambrano Heck, backseat gaming is as old as couch gaming.", "@The Grand Alliance Dude just screw off.  Nobody will listen to your bad takes anyways.", "@The Grand Alliance I think the point here is that Ame just doesn’t want chat to tell her what to do unless asked for since... Well, she does need help sometimes - which is the only time she’ll probably accept back seating or when you’re donating a superchat to her, according to her new rules. The general consensus says that telling the streamer what to do w/o being asked is back seat gaming regardless of intentions. I’d tell you to stop coming back to reply because it’d only stoke the fire trying to argue with these people. I’d also to tell you: just try to follow the rules of the streamer and be respectful. That goes for everyone in this reply chain too.", "@The Grand Alliance wait, you do realize if they didn't add dirt or a layer of blocks  right above the rails it wouldn't work, right ? Like if you're going to backseat at least be competent/useful.", "Mate, so many people have already said nobody cares about your justification, and you’ve already resorted to dissing even the vtuber herself. Maybe this kind of thing isn’t for you. Save yourself and everyone else some grief and maybe take a step back and reflect? The point of watching these is to enkoy, and I can tell you’re definitely not enjoying any more.", "@The Grand Alliance Uhhh, you are crying that you are being harassed, your not people are just stating their opinions which are against yours, but here you are writing a novel. Stop it, get some help.", "@The Grand Alliance I guess your parents didn't love you, right? So needy...", "@The Grand Alliance what do you mean 2 block air gap? If theres a 2 block airgap between the rails and the floor, the minecart with hopper wouldn't be able to catch anything from the floor.", "Backseating is retarded and unfortunately it can be a part of a streamer’s path as they become more popular. Usually when things like this happen I would say “no hope” however ever since Ame’s debut stream I’ve observed the community and found out that it’s unexpectedly good compared to the many other streamers with similar personality as Ame. And despite Minecraft corrupting things, there are still a lot of comments talking about spamming and such. ", "@The Grand Alliance dawg if she dont want people to backseat, dont do it. Just sit down and enjoy the content. Unless she explicitly asks for advice, she doesn’t want it. Discovering how to do things yourself is part of the charm of open world games such as minecraft and people like you are taking that away from her. And to my understanding, the advice you have her was incorrect anyway because, as another guy has stated in this thread, an air gap would cause the eggs to stay in the coop instead of being collected by the hopper cart.", "@The Grand Alliance furthermore you try to say that you aren’t backseat gaming, but everyone on the internet has the general consensus that to backseat game is to tell someone what to do while you are watching that person play, which is exactly what you are doing. It has a negative connotation, but it does not have that malicious definition that you gave it.", "@DisAppointment4 I agree, this are ironically the same people who cry years later that they could experience the game for “the first time” and fall in love with it’s wonder. So cringe.", "The people who were here before his comments were deleted must have witnessed something of epic proportions", "@Sev Yes. Yes indeed.", "@Sev I've never been hit by FOMO (fear of missing out) this hard", "46:18\name: go and be free\n*chicken runs back into slaughter fest*\nme: yup theyre kiaras children alright", "They are speedrunning life", "It's weird how some people find it really difficult to chill out and watch some anime girls play a game.", "Watson has a tendency provoke her audience", "@Julian Benali “provoke” it’s all for jokes don’t take it seriously it’s part of her persona", "Toby Some of it is jokes, but you can tell when she’s acting genuinely childish and shifting the blame", "@Julian Benali well if you feel that way don’t watch her streams", "Toby No, I like her streams. I just don’t like the parts where she acts immature", "@Julian Benali damn it's like she has lapses in personality like an actual human being damn bro that's crazy\n\njoking aside, it's quite refreshing to see a vtuber that isn't putting up a cutesy act for the sake of character. Ame actually acts like a person who plays games.", "@Where Is The Cat hololive vtubers have more freedom in how they want to act, its kinda rude to assume everyone follows a conduct like a robot. It really makes you sound like you are new to this", "@Lois sonic ayt I cant speak for EVERY vtuber out there but in the mainstream she's one of those where you sometimes forget she's supposed to be an idol (I'm certainly sure she's NOT the only one). \n\nComing back to the reason I made that comment in the first place is that people put these girls in a pedestal and expect them to be perfect all the time.", "@Where Is The Cat its more of idol culture. Putting idols on pedestals isnt really toxic. What is toxic is lashing out at them when they dont live up to your expectations if ever you meet them in real life. Sometimes the vtuber even chooses to follow up with a character like luna which is one of the reasons why she isnt really popular because most people find her character annoying. This problem in general isnt just limited to vtubers. Look at how actors are getting bashed just because the character they acted as killed their favorite character. There will always be people who cant differientiate real life from fake. Everyonce in a while i like to turn of my brain and just enjoy the fun.", "@Julian Benali I wouldn’t blame her because she literally had people nonstop screaming at her last stream telling her to play an overrated fake card game. Also no. There’s a difference between banter and provoking mate", "Most of the time chat is annoying. But sometimes they have a point. Save the streamer countless hours of unnecessary tedious work that isn't much fun to stream.", "@R3 if you don’t enjoy the way a streamer plays a game. Piece of advice DONT WATCH THEM PLAY THE GAME or PLAY THE GAME YOURSELF", "@Where Is The Cat You clearly only have watched hololive and think it applies to vtuber in general.", "@Julian Benali if an adult is getting provoked by playful banter, and uses toxicity to combat that...they need some therapy. Most of the people being toxic are probably kids...its whatever at that point...but if your paying bill and feel the need to be one of those people...that shits on streamers, you need to get some help.", "@Tru Null What you call \"playful banter\" I call annoying spam. You're acting like she gets psychotic or something. Bro she's just accosting chat for being annoying lol", "@Humphrey Cassel learn to read, im saying the chat is toxic. Shes the one with the playful banter.", "It already happen since HoloID.\n\nNon-japanese seems to be more toxic n weird and love to asks some trivial n dumb questions.", "@Julian Benali as said before, it's playful banter. I think Ame is doing pretty well for a new streamer having to handle regularly an audience of ~20-30k people. She does have really tough shoulders . insert your lewd joke here", "Shoutouts to the mods who were there during the stream, especially AO-chan, they were the real MVPs keeping chat a less toxic place today.", "I got a time out three times.  Once when I was spamming too many replies to Kiara murdering her \"family\", once when I mentioned hoping Ame or one of the other girls would work on Calli's house, and once when I said something about Kiara.  NOT EVEN COMPLAINING.  A small price to pay for salvation.", "WE HIT 500K WOOOHOOOOO BAYBEEEE!!!!!", "@The Grand Alliance IDK man, you seem tilted because there is finally order in the chat.", "@The Grand Alliance They were policing everyone real fast at one point, but they chilled out after a bit.  Better than every other chat being \"YOU'RE DOIN'T THAT WRONG\" \"IT HAS TO BE THIS WAY\" THAT'S NOT EFFICIENT\"", "@Blooper {Reloaded} he’s made like 4 comments already getting mad over it", "@The Grand Alliance are you kid or something..", "@SoosUnknown I know, if he's so mad, he could just leave, and we wouldn't even care.", "@Uncle Biff Yeah I got timed out too. Five minutes so it's not a big deal. But a few people getting mistakenly timed out along with intentional timeouts too, is better than the chat staying toxic and spammy. I'm just glad we have some mods now", "@TRAWESS Yeah, after that chat let me get away with profanity, toxic, lewd, ntr, boomer, etc. so it's fine", "@UCq-oFUmbxLXvZGz5b1PRP6g Shit's still spam my dude.\n\nEspecially since its 20k people. Would rather an actual mod than nightbot timing out 80% of people.", "@The Grand Alliance It's not often you see comments that deserve dislikes. Yours is one of them so thanks for the experience of letting me dislike yours I guess.", "Yea the mods pretty iffy at best. A lot of their muted seemed pretty senseless", "I guess whoever this “Grand Alliance” person was deleted their comments or had them deleted. What did they say?", "@Silverwind X Keeps justifying backseating despite the streamer not asking for help at specific times through some amazing mental gymnastics.", "@Robert Kristian Zambrano ah what a prick. I see that they were in several comment threads but none of their comments were there anymore. Good riddance then", "@Uncle Biff I didn’t get timed out once", "Truee, AO-chan is a great moderator,in the Ina hl2 stream did an amazing work moderating the spammers/backseaters.", "@LowTechGaming AO-chan have to work hard to keep the peace, having multiple reliable moderator would ease the burden I think", "@Solace Thats totally true!", "Umm guys? U r fine right? Why did u replying comment to people that never exist?", "moderation feels so good to see in a hololive stream", "@Wilsa Nazuha What are you talking abo-", "@Wilsa Nazuha Guy pussied out and deleted comment", "@wut wuut thats exactly what i talk about", "@Wilsa Nazuha W8, he has comment in another video, lol, he defending his sheet so bad.", "@Uncle Biff Maybe stop spamming, then. You are part of the problem.\nThis is nothing to be proud of.", "@Captain BaseBallBat-Boy Ame doesn't have a problem with that stuff.  She knows we're gonna \"Bottom Left\" or \"Bottom Right\" at lewd comments, or \"Toxic\" at her gamer rage.  She has no problem with that.  Her primary issue is people A) yelling at her in ALL CAPS  B) spamming the answers, solutions, and requests that she's trying to ignore .   The fact that me and countless others were still able to give those tried and true responses and the fact that they weren't mentioned in her rules indicates that it's not part of the problem.  Because that's just every stream, it's no different from everyone going LOL or LMAO at a funny moment", "@Captain BaseBallBat-Boy Yeah, she made it clear tonight that it's not about your typical \"Lewd, Boomer, Pog, Toxic\" spams that everyone does.  It's more specifically the people shouting answers at her in all Caps over and over again.", "1:35:12\n\n”You dare use my own spells against me, Potter?”", "Thank you, Watson, for still treating us kindly and giving us a treat at the end of the streams today in spite of the recent events. We love you and enjoy your streams whichever content you give to us and appreciate the hard work you put into them. See you later for the 500k milestone and have a great day.", "What do you mean by recent events? Did something bad happen?", "@IzsKon Lately, a lot of people have been backseat gaming even after Amelia asked them to stop.  It really bothered her during The Witcher 3 because she's getting into it and loving the story and every time she passes an NPC chat is all like \"PLAY GWENT!!  PLAY GWENT!  PLAY GWENT!\"", "Ame is different from many streamers in that she's not failing for spectacle, but actually gaming - learning and advancing. In the first case chat offering help is meant to be part of the experience, high engagement and all, but in the second it's unneeded. Many viewers just assume, by inertia, that all streams are of the first type of entertainment, and behave accordingly. Hopefully it will settle down after this initial growth period, as more people learn each streamer's preferences :3", "@Uncle Biff Thank you. I  didn't follow the witcher stream. Sad to know ppl were still backseating.", "@Uncle Biff It a shame that some people can't just let newbies learn for themselves. Everyone's a newbie at some point, especially when they are playing a game that's new to them.", "Yes I love the positivity and agree, I love ame and all her streams and EN girls. Ame is very kind and congrats on reaching that milestone and many more. I just hope this backseat gaming stops so she can enjoy herself:3 ", "Maybe by recent events he means the fact that Amelia was doxxed and it was revealed that she has a boyfriend. Keep giving her them simpbucks while she bangs some other dude for free after stream.", "@Menthols What the fuck are you on right now?", "@Francis Aquino It's either:\nA: Another chinese bot.\nB: A Pokimane simp that's jealous of Hololive's success.\nC: An angry Karen.", "@tailstwister yea if Ame really got doxxed it would be big news, she would probably also have to apologize too which hasn't happened", "@tailstwister Ah, that makes sense.", "@Menthols Lmao. Cover Corp itself would care more about her getting a boyfriend than her fans would.", "@Menthols thank you", "@ tailstwister im gonna go with all of the above", "46:23\nThe chick: \"I'm not ready for the outside world.\"", "But was the inside any better", "46:18 \"Be free, go\"\nLittle chick: No", "\"but I refuse\"", "DAGA KOTAWARU", "1:43:52 a hic that could stop wars.", "Watson Shaft\nHome to an Enderman with a dirtblock", "With an anger issue", "They should give it a name tag to make absolutely sure it never despawns, lol", "@Josh Riley agreed", "Really loving the dynamic between the BOTTOM duo lol\n\nAme got to show off her bottom right status and Kiara just sinks further into bottom left..", "What does Bottom right and Bottom Left even mean?!? I’ve heard everyone saying it, but I don’t get it.", "@Red_Dead_Lex In one collab with all members, i think the first, they put themself in a chart about intelligence and pureness, x being intelligence, y being purity and bottom left referse to being least intelligent and least pure", "@Kalec second* It’s on Kiara’s channel", "@Red_Dead_Lex \nTop Right: Pure & Intelligent\nTop Left: Pure & Dumb\nBottom Right: Lewd & Intelligent", "@Sev And it ended up: Kiara bottom left, Gura top left, Ame Bottom right, Calli top right (kinda) and Ina top center.", "I love that Ame's model allows her to do mischievous grins.", "With how fast these channels are growing, there are bound to be so many people that are new to streamers and streamer culture. Backseating is annoying but I dont want to approach any one with hostility because they may not know better. When i first started watching these streams, I was confused about the \"backseating\" thing because I thought the point of streaming with others is to work out the game together, between the streamer and chat. But I respected the wishes of those around me and kept on mind that it's annoying behavior.  After watching these streams for over a month though, I can definitely see why it's annoying.  ", "Yep, \"do what the Romans do when in Rome\" as a paraphrase on how to fit in the new group you like.\n\nSadly a lot of people don't do that anymore.", "I thought the quote “do what the romans do when in Rome” put displays it perfectly. Cause if new people come in and see a lot of backseat gaming they might think it’s ok to do so\n\nPS. I don’t condone backseat gaming, chat should give advise only when asked.", "it might take a bit to build a trap tower without reference, but it will be a great learning experience getting it to work.", "Our boss is threatening to fire the employee with the worst posture. I have a hunch it might be me.  Congrats on 500k", "Kiara: \"Fix your posture, Ina!\"\nIna: \"OK. I stand corrected\"\nKiara: \"...\"", "Badum tiss", "@Chaos Chris take your like and get out", "Bu dum psshh", "Thank for the stream\nChat need to chill and have a kitkat\nI miss ame eat her kitkat\nCongratulations for 500k sub", "Detective Watson with espionaged tech from jp server. Pekora is gonna send you a law suit ame", "Hololive owns the rights so Ame is in the clear.", "Pekora Construction: \"This technology is dangerous! Someone might try to steal it.\"\n\nAme: \"I'm going to steal this technology.\"", "@reklin That was about her TNT carpet bomb machine, wasn't it? Amelia hasn't gotten that bad yet.", "@Nina Rose Give it time. :D", "@reklin That was about TNT CANON the world is not ready for it yet. The technology has been sealed away", "Watching Amelia's Minecraft skill grow and be inspired from other Hololive builds is in itself rewarding.", "inspired by Pekora's corp", "Yes, I'm waiting she made some contration from the UK boi Mumbo Jumbo", "Me: puts on a chill Ame and Kiara Minecraft stream to sleep to\n\nTens of chickens clucking at the same time: \"no\"", "1:35:19 Time stamp for the “your mum” joke by Kiara and the face Ame makes after", "the way her face turns is gold. she knew what ever came out of Kiara's mouth next wasn't gonna work", "\"A woman walked into a bar and asked the bartender for a double entendre, so he gave it to her\"", "Our favourite detective, ceo of Watson Construction, developed the first fully automatic system of HoloEN and started the building of an automatic farm in one stream, be proud of her!!! And congrats for the 500k subs, you derverve it ", "Congratulations on your 500K! Amelia, be yourself and don't pay attention to anyone. We like you the way you are.", "Really refreshing stream, Kiara did wonders to our detective today. Also it’s a good stream to take a hint if you haven’t yet.", "37:18 Great now all my clothes are torn apart", "ONEGAI MUSCLE!", "Kiara: “Look at all the chickens and sheep I have!” *smiles cutely*\n\n(Chickens and sheep are cramped in their paddocks)", "Almost at 500K, congrats Ame! 💪", "for the stream, Amelia! And congratulations in advance with the 500k subs! \n\nEdit: And she’s finally reached 500k! Congratulations to our favorite detective!", "20:37 We finally hear Kiara speak her native language!!! lol XD", "Hi Amelia! I like to say this is a great stream. I support everyone equally, but my preference is still Watson <3. And because of that, It's sad that today was a time where a lot of people were being ignorant and immature that you can't think even bother to read it sometimes or even interact with it. I just hope that you'll also be able to relieve your stress for a new start!", "this also happened in Witcher 3 gameplay when chat keep spamming Ame to play Gwent eventhough she doesn't want to...\ni really feel bad if she ended up not enjoying the game if keep being pushed...\nhopefully no more thing like this in the future and the chat is more civilized..\nor else have to take a strict action such as longer slow mode chat or strict moderator", "Jeez how long did it take for you to write this?", "UP THISS GUYS, WE NEED THIS TO BE PINNED!!, Coz i hate it when Ame is annoyed by the chats :(( she needs to be free", "Chat to toxic and too much “backseating” I’m not surprised she doesn’t want to interact or play with us.", "Some of us like to be ignored.. So.... ", "@Ara Ara That's fair right?", "Im surprised any of the holos play with their community, all it takes is one person to ruin it", "Calling chat as a whole toxic is kinda unwarranted . Most of the back seat gamers are people who are new to live chat or are overly excited to type something in the chat. Most of them want to help but it comes off as annoying.", "Yes, a minority, but a loud one. Thankfully this stream seemed to be much better than yesterdays due to the mods coming in. Still a few hiccups though (pun intended) like the spammers going to Kiara's stream once they got timed out, and a few mistaken timeouts. But it should hopefully get better from here on out", "@UmmmOk Yeah, that's why having the moderators (I didn't know there were mods) this time was really effective, even if it wasn't accurate some times. A single timeout should be enough to make the person think about what they said, especially if they're new to watching Ame's livestreams. I was definitely one those new people, but I am trying, if not already, to become better.", "@Al Gallero You are a good chat member my guy, we need more people like you in the chat.", "@Al Gallero Hey, at least you got the feel of the proper conduct super quick.\n\nCompared to a lot of others.", "@TRAWESS well that explains why Kiara started getting spammed with y - 128. Even as a spectator it was annoying as hell", "@Al Gallero Well said", "Amelia: I make railroads and railroad accessories.", "Anybody else thinks if she does a playthrough of L A Noire it would be sick", "Seeing this world has inspired me!\n\nI'm going to make some things in Minecraft!", "Good luck", "The way Ame said \"but my way would've worked too\" (can't find the timestamp) kind of broke my heart. I don't usually partake in chat and when I do it's usually a \"lol\" or \"lmao,\" so I hope there'll be less of this in the future so I listen to high-energy, happy Ame all the time.", "45:05 Does anyone feel something with this \"Chicken killing ASMR\"", "'Grats on 500k subs. ^^ Sorry chat has been annoying lately... I'm guilty of adding to it at times too; giving unsolicited advice and what-not.  I'll try to be better about it, in the hopes that others will too and that Ame will want to interact with us again.", "We did it 500K!!!!", "10:51\nA flame, infinity, and power crossbow in under 2 hours \nTruly someone I should fear and respect", "I never tried to chat on every streams i just wanted the to see the chats reaction for every comedic scenes that happens on the streams, i especially enjoy watching ame streams and she is my most viewed streamer in HoloEN i like watching her chat reacts to her. But sadly its getting more toxic every stream, IMO it started on her Mario stream. First time I go full screen on her 3 witcher stream , the chat was cringe i just have to go full screen. Now idk if i can enjoy the reactions of the chat anymore. 😞😞", "What happened with the chat?? Wasn't in the live stream", "@Sebastian Ponce people backseat gaming. Intentions aside, anyone would get annoyed if hundreds to thousands of people tell you to do one thing when it's supposed to be a blind play through - I mean if what a streamer does is just so frustrating to watch then go find someone else right?", "I can't believe I woke up for this stream and then fell asleep again and missed it all T_T", "Hits 500k right after stream ends lol.\nCongrats on 500k Ame! <3", "Figured Ame would pick up some tricks after visit the jp server. It was like one of those episodes where a scientist visits the future and comes back to create it.", "16:05 \"DON'T STEAL DIAMONDS AND STUFF\" \nWhat is this an episode of Dora the Explorer \"Swiper no Swiping\"", "Soo.. Huke is performing at peak minecrafter effeciency.\n\ninb4 he gets an elytra in like 3 days.", "2:12:27 I'm fine.", "I've not been able to watch some streams because of my sh*tty internet, it's very sad. I know I'm probably late but congratulations on reaching 500K Ame", "Ok, here's my thought on the whole backseat gaming thing. I know some of you are going to have your pitchforks out regarding the \"toxic Twitch community\", but this tends to be how they handle things. If someone does not want backseat gaming, they will put it in the rules, as well as in the title of the stream. That way people have no excuses. The reason it is put into the title of the stream is that despite what some are saying here, backseat gaming is not a common sense rule. I'm not saying that because one should or should not have the rule, or that it is morally one way or the other. Just that it is not something people should necessarily expect with every streamer because some streamers are actually fine with it (these have \"backseat gaming allowed\" or something to that effect in the stream title often times). ", "1:43:52 Ame’s best HIC ever.", "500k reached!!!!! You did it, my dear Watson. Congratulations!!!!! おめでと！！！！！", "The small bonus asmr in the end tho", "1:43:54 wow that was a very high-pitched hiccup", "Good work for the mods for the purge on this stream!!!", "I joined late but I managed to be part of the experience.\nCongratulations for 500k Amelia!", "Congratulations on reaching the milestone! Best of lucks, Ame.", "AME, Congrats for 500 K  subs !\ngood luck for building TTT mob farm on EN server", "yey, she has reached 500k subs, congrats Ame 🤗❤", "50:28 Apparently Kiara is the literal embodiment of the devouring mother archetype (not serious disclaimer).\n1:10:07 If it's Kazuma, it's definitely lewd.", "Amazing!!! 500k Holmies have subscribed to the detective more hope for you Watson!", "37:17  SAIDO CHESTO!", "1:35:37 Start of the awkward Mom jokes and Ame's nervous \"ground pound\"  incident", "Thank you for the stream! Can't wait for your next stream!\n.\n.\nDmn, there're so many professor write their thesis in the chat.", "That’s not what professors do...", "@Julian Benali XD", "YEY Amelia got 500k Subs, LET'S GOOOOOO", "Wow I haven't played in ages and these textures really have come a long way. The game looks beautiful now.", "Congrats on 500K Ame! ", "Congrats on 500k, Ame! You're super cool! Thank you for being nice to us <3\nOh! godness, that \"Bye bye\" at the end cought me by surprise.", "Congrats on 500k subs, watching my favorite vtuber grow is great.", "Thanks for another great stream Ame! And congrats on reaching 500k subs! Am very excited to watch your future streams and I hope you get a well deserved nap! c:", "HOTSPRING HOTSPRING BEACH EPISODE", "1:10:10 Of course it's lewd. I bet that thirsty girl is imagining calling you by your first name", "Congrats on the 500k! We've come so far", "I like  how, when Kiara giggles, she sounds a bit like Peko laugh", "Ame should stream like a railroad tycoon game since she loves rails so much lol", "Huke papa the Phantom 6th member of HoloEN .. naiisuuuu", "Next Holostar?", "Amelia felicitaciones por los 500K subs 👏👏👏\n¿En qué minuto ocurre el genocidio de pollos??", "Congrats on reaching 500K,you deserved it and I guess thanks for the mods for making the chat bearable, I didn't see the  deletion since I am focusing on 2 streams at once. Thanks for the stream and once again sorry  you had to deal with that and have the bother to have mods on this stream now.", "Congrats on 500k Ame!!!!! ❤️ 💕 💗", "Congratulations on 500k Youtube subscribers!  ", "this pyramid is a huge project....\ni agree with the other comment: Watson's Wondeful waterhole", "CONGRATS AME FOR 500K, so proud of you!!", "50万人おめでとあめちゃん", "45:33\nI'm not strong enough to see it", "Hope you getting good rest lol u been streaming a lot past few days get good rest >_<", "1:52:48 is the start of Kiara's disappearing act :D", "Congrats on 500k, i slept through this stream 😔", "I don't know if that is only in my end \nBut her mic is little bit noisy right ??\n.....\nDespite that l really enjoyed the stream ...", "Congratulations on hitting 500k subs!", "It's weird watching videos from two different perspectives. It was hard watching it from 9 different perspectives in the Among Us collab.", "Wtf, huke papa has a Infinity power V flame crossbow?!? holy", "1:21:27 What a precision to put blocks. I almost got vertigo", "Grats on 500k :)", "过来看500k sub的小雨（あめ）", "Thanks for the chill stream!", "'I have too many chickens'\nOh it can't be that baAAAAAAD\nThe horror", "the highlight for me is Ame constantly turning down the animal volume to the point of almost muting it lmao", "Thank you for the steam Ame! 🙏", "When you most likely make another hostile mob farm probably should use a jigsaw type", "Wish it happened on stream but congrats for 500k Ame and nice work AO for moderating the chat hopefully all the EN members can get a dedicated mod soon", "Congrats on 500k Ame!!!!", "Congrats on the 500k ame!", "Congrats on hitting 500k subs Ame!", "Man watson's got a really nice shaderpack. I should play again", "Those 4 last seconds of this video Omg", "such a cozy stream~\n(except the chat war)", "I regret not waiting 'till the end. ;0", "I haven't seen every stream so sorry if this has been addressed, but Ame needs to figure out what she wants from chat. Ignoring them until she needs help just encourages constant backseating because you never know when she'll request help, which means you need to send messages fast because she might ask the question right then. I think the backseating was important for the general mob farm though. It's such a massive project and ame doesn't know minecraft spawning mechanics, also it's not clear how much outside research she did on the design since she didn't know the reasoning for using the ocean. If chat didn't stop her we would've gotten 5 hour stream that was as painful as the 10 mins they spent trying to figure out how hoppers work. I'm assuming she'd prefer if people told her how the game works and not to do things, that way she can figure things out on her own, but she responds to both so people keep spamming it. Never streamed so peak dunning kruger effect right here, just tired of chat being 40% backseating, 40% infighting, and 20% emote spamming.", "I think the best thing for Amelia and us to to is just ignore the “backseat gamers”. If they’re going to get mad at her for playing a game the wrong way, they’re going to get mad. Nothing we can do about it, imo. Never streamed before either.", "Well, on her YouTube community page, one of her recent posts was her rules and perception of the chat, so she laid out what she wants from it. One of the things she said is \"Sometimes, I will ask for help and even then, I may choose not to take your advice.\" I'm not sure how effective her wants are, but I feel she needs some sort of professional advice from a long-time streamer on how she can balance things out so that she gets the help she needs with problems/complications she runs into, but also still be able to play and learn the game on her own without the experience being commandeered by chat the entire time.", "@Paul Holzermen >one of her recent posts\nokay cool. Hopefully this will get ironed out then. This stream is pretty depressing. She needs to engage more with chat she enjoys to encourage that kind of response. She started these streams asking people for help so ofc people are going to keep spamming advice.", "@joe i'mjoe Better organization is needed. She is still pretty new to all this, so I'm sure she'll gain more experience and knowledge on how to handle things so that everyone is at least satisfied.", "@Paul Holzermen >new\nWell....", "@joe i'mjoe regardless of that, she's still technically new. her previous viewers weren't nearly as much as now", "Amelia's 'nyeah' is too much....", "I thought I was the only one who can't ride a bike now I feel at peace", "I like how Watson left the minecraft BGM turned on + doing the Bye bye ASMR at the end of the stream", "Minecraft stream with ame always got a lot of progess sasuga engineer detective!", "Congrats on hitting 500k!", "I finde es sehr süß, wenn Kiara auf deutsch zählt.", "2 hours of Kiara falling for Ame.", "7:02\nKiara: aren't u british?\nAmelia: Yeeee Yeeeaaa mAit", "11:19 holyshit indeed", "I would love to see her play more Among Us. With the chat, however? Probably not a good idea lol (unless maybe she made it member's only).", "I miss who usually make timestamp for the video", "It's 500k!!!!", "the cutest H I C of  Amelia is hidden in this very video", "The guy who’s suggestion got accepted by Amelia and kiara, I know he’s happy", "Congratulations on 500,000 subscribers! Here’s to the next 500,000!", "Amelia: said chesto\nChat: goes bananas", "Congrats on 500k sub!!!!", "Watson Industries ($WIN) IPO when?", "I think your spawning platform is probably a bit low. It's not devastating, but you will need to spend some time spawn proofing rest of the area.", "We have good news, maybe a movie is coming soon. Make sure to get your tickets!", "500k! Congrats!", "I will always support you Amelia.\n\nalso damn Papa huke has been busy.", "Congrats on 500k!!🎉", "do you read the apex patch notes? octane buff coming up", "Now this is epic", "If your sleep schedule isn't dead now. now it is. i dont remember what sleep was.\n\nlets gooo 500k", "Kiara laugh starts to sounds like Pekora", "Why does the stream time say 2562047788015215:30:07 🤔", "Congratulations on 500,000 subs!  Woot Woot!", "congrats on 500k subs", "I like how Kiara has glass panes but never put in the windows", "500K ! congrats", "this reminds me gura built a door in 3 hours 😂😂😂😂😂😂😂😂", "using Magma block to replace fall damage would it work?", "So this is the person in the r/apple discord server?", "it's time to block some backseating babies!", "I lagged when watson went to see the egg count", "What shaders does Ame use? They're so pretty...", "AMMEEEEE CONGRATS ON 500,000 DEPUTIES!!!!!", "Love the \"Bottom Right\" and \"Bottom Left\" collab lol. Really enjoyed the stream as always! (We will start a new week guys, let's improve more than this week!) \nP.S: We deserve the roast lol and thanks for the \"Bye bye\" ASMR\nP.S.S: Thanks for the Mods too and WOOHOO! 500K SUBS BOIS!", "When was it?", "@Silas Sales The \"Bye bye\"? It's in the last second of the stream", "500k!!!", "500k Congratulation🎉", "May the sweetness accompany you through every moment of the day, may safely walk through every moment of the moment with you, may happily accompany you through every moment of every moment\n甘い日々があなたと共にあり、あらゆる瞬間を通してあなたに安全に同行し、そしてあらゆる瞬間を通してあなたに幸せに同行することができますように", "CONGRATS ON 500K", "Congrats 500K", "1:36:33 mom guardian", "Karaoke stream....oh yes", "Congrats on 500k ", "500k congrats", "should call the mob dropper AAA, Amelia's Adversary Annihilator", "Congratulations on 500k subscribers", "WATSONS INDUSTRIES \n- FAST, RELIABLE, DURABLE", "Why Ame Minecraft water so beautiful is  there any other version@@?", "Didn't have time to watch this whole stream? What are they building?", "XP farm similar to pekora's", "LMAO all those chickens", "So... Ame became thanos D:", "Damn,i had school so i missed it.I hate living in europe", "Congrats on 500k", "Wait why does kiara have cape?????", "So many comments about chat. What's going on? Sorry, I don't usually watch them live. I'm fairly new to Hololive and rarely have the time for livestreams", "The chat in Ame's streams are toxic, and it got really bad last stream, so Ina's moderator came in today to help and they did a wonderful job moderating!", "@Blooper {Reloaded} Has it always been like so? I never noticed people mention about it before", "@SatriadiSS It's been like this for a while friend, and people have said chat was toxic, but yesterday night everyone finally took a stand against the chat in the comments.", "@Blooper {Reloaded} Only Ame's chat had this problem so far?", "@SatriadiSS It gets worse when there's a sudden spike in sub count.\n\n\nIt's usually harmless ribbing of Ame and chat but it was bad in the Witcher 3 stream.", "@SatriadiSS No, Gura's chat also has problems, but that's a given due to how many subs she has. Other than that everyone else's chat in Hololive EN is fine for the most part.", "Some comments are virtue signaling because they think chat is toxic", "@Julian Benali how is that virtue signalling lol", "SoosUnknown It is “publicly expressing opinions or sentiments intended to demonstrate one's good character or the moral correctness of one's position on a particular issue.” It’s not like Ame doesn’t know what’s going on her chat, ergo people are just condemning chat in the comments to virtue signal.", "@SoosUnknown because it not your responsibility to deal with it. She even said on Twitter not to get worked up about it. The anti backseating comments are as loud if not louder than the backseating. Many are even worse than just the backseating because people are going out on social media telling everyone how bad chat is. That is not helping either. It will just turn people away. None of us are mods. She and hololive are perfectly capable of finding a solution without 1000 people repeating how bad it is.", "Usada Construction been real quiet since this dropped.", "People complaining about the mob spawner not being high enough need to chill. Even if it's not, it's not that big of a deal. At some point the area below (including caves underground) will most likely get lit up as the world starts to grow and expand like the JP world did. As that happens and mobs will be limited in spawning down there they will spawn more up top. This isn't sky block/factory. This is just a means of making it a bit easier to acquire mob drops without having to always wait until night to find and hunt down those mobs. It doesn't have to be a be-all-end-all thing. Chill people.", "tbh... Ame said it was an XP farm... and about caves being light up I highly doubt that any of the caves will be lit up considering Ame uses her shader with a torch to see , but I don't blame them for not knowing tho, I too had a noob phase  of my own, but I really hope Ame does some research of her own cause just knowing everything from chat doesn't give a lot other information", "@Virro The Wizard Very True. Ame actually made a comment about that in a previous stream where she called out the fact that chat only spams half the answer. They say things like \"Go there\" or things like that. Comments that tell her to do things  but don't tell her anything.", "an F for Huke papa", "love those shaderrs", "banana boat will be the best creation in this server.", "So I'm confused is kiaras dad helping her?", "papa= her character designer", "Anyone know if these shaders work on bedrock?", "congrats on 500K Subs Watson you deserve it!!!!💛💛💛💛💛💛\nYou work very hard to entertain us and you do!!! We enjoy everything you do for us watson!! We appreciate you a lot and thank you for working hard for us you deserve the 500K subs!!!💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛💛", "how do i become a member", "Stream start: 4:50\n\nHiccup count:\n1. 16:27", "Chicken do gown the hole", "Wow how good is Ame PC?", "the blocks she uses vs the torches she could\n(redstone)", "you dont have to use redstone block to power rail you can dig two block and put a block on top of redstone torch then put gold rail it should power up", "there's MONEY.. IN A BANANA BOAT WATSON!", "Isn't she collabing with Haachama", "Yes, on the 27th", "That’ll be amazing, two drugged out blondies.", "this is getting out of hand, now there's two of them...\nlmao JK....chaotic is good", "Kiara is just testing out her wings by falling", "The glass platform will not gernerate the monster", "sup valk", "Hololive EN auto farm RTA", "Good shader.", "Can't backseaters just watch really good minecraft players if they wanted everything to be perfect and efficient? You're actually taking away the joy of building and testing stuff for the first time.", "Wait, is Huke papa a girl?", "no", "Amezing engineer\n\nwe also got a bonus 2:12:27", "That gave me the good chills", "Well that was short", "1:59:33", "500k woooooooooooo!!!!!!!", "2:12:26", "Is German Kiara's native language?  Trying to place her accent", "Yes Kiara is German", "1:14:56", "Does anyone else feel like Amelia is the reliable big sister of the group?", "Wow......", "Anyone know what shaders ame uses?", "Um... Ame? I Think Huke Sus. ", "Chat definitely better than earlier", "Oh nice she hit 500k", "I love u", "リスニング教材扱いしてたらいつのまにか推してた。どうみても単純接触効果だけどそうじゃないラブの方がレアキャラだし多少はね？声好き。\n\n配信楽しく見てます、頑張って下さい。Your live stream make me happy. Please keep it up.", "Is this Minecraft with RTX or a mod?", "It’s a mod", "Shaders, Seus shader", "Killing the adult chickens to make room for more babies. Kiara is basically the Joe Exotic of chickens.", "i suppose the \"meh\" at the end was aiming at Chad-kun who keeps backseating and spamming Ame right?", "can someone tell me what shaders amelia uses?", "She sait it's Seus, or something like that.", "Who is huke papa?", "Designer of Kiara’s avatar and the illustrator for Steins;Gate", "also creator of Black rock shooter", "Amélia is adorable", "ASMR 2:12:27", "i know there are too many coment about chat but let me say just this. amelia is a gamer like most of us,how woud you like it if you were playing a game and dozens of peoples were behind you screaming DO THAT NOW!!! Im not even playing and it pissing me off just imagine her...", "Who is Huke Papa?", "It's Kiara's chararacter designer. He's actually pretty famous in Japan because he's the creator of Black Rock Shooter and also the character designer of Steins:Gate. But I don't really know what's he's doing in the server, but I guess he was mentioned alot in Kiara streams and just like a real papa for Kiara's channel.", "Thats cool", "Someday Watson Kensetsu will reach the same level as Akukin Kensetsu and Usada Kensetsu\nPeace was never an option", "Can't wait for a competitive construction contest! Here's the goal, here are the mats - who automates it faster?!", "@Lishtenbird I feel amelia would get an edge. she's researching stuff a lot more compared to the others. the only one that does more research is Moona i think, but she mainly focus on redstone circuits and not farms.", "CONGRATS FOR 500K SUBS! Sad that it didn't reach during stream but CONGRATS! Were really sorry for being toxic.", "cluck cluck cluck", "", "Build a pirate ship in the lake", "Minecraft Sitcom!  ", "★★★", "The backseat isn't only annoying, they're often wrong too... If you don't know don't say anything. Well regardless don't say anything if the streamer doesn't ask but if you're also gonna give wrong info you're just terrible.", "Wow how does Huke can have Crossbow with a Bow enchantment.\nSo cool! No cheat at all!", "What are you referencing? When was Huke mentioned?", "@Julian Benali watch the stream newfanschama", "I feel like a cool compromise to the whole backseat gaming thing would be if Ame had a Reddit like Pewdiepie where the people who want to share advice can post it and she can check it on her own terms", "It might also help if she didn’t blame her chat when things don’t work", "@Julian Benali Can easily tell youre a backseater lmao. If you actually read most comments from chat they give like 1/4 or 1/2 the answer rather than actually explaining how it works. Also alot of the comments were just plain wrong because most of the time backseaters dont even know anything themselves kek", "The mod started muting people for telling Ame to read the super chat at one point which is kinda nuts lol", "backseat gamer spotted", "Hey haven’t seen you somewhere else?", "Guys. You are not mods. Amelia already addressed on Twitter that she will do something about the backseating and to not get worked up about it. There is a reason you report block and ignore. Nothing more. You aren't responsible for policing the community. All of you complaining are unintentionally making up a third group of spammers. Let amelia and hololive do their thing.", "Yeah, just stop the virtue signaling people. It is really really cringe.", "Thank you for taking the words straight out of my mouth... The amount of white knighting is honestly pathetic to see", "Forgive me if I am being presumptuous, but it seemed like you were feeling a bit under the weather today.\nThank you for the amazing content and we will always support you through thick and thin.", "She was. In her Witcher gameplay earlier. Too much backseat and play gwent spam in the chat.", "Ooguro Ryuujin It’s presumptuous to think that the chat was the cause of her being under the weather.", "@Julian Benali lack of sleep plus the backseating. If you're a gamer and someone backseat you even it's your friend, you also get frustrated", "Ooguro Ryuujin Thats how an immature “gamer” reacts to backseating. Ame just doesn’t know how to handle it maturely, and her exacerbates the issue. Just look at Gura, Kiara, or pretty much anyone other than Ame to see how to handle it maturely.", "Ooguro Ryuujin But yea, even if she doesn’t know how to handle backseat gaming, it’s still presumptuous to assume that that is the cause of her being under the weather.", "@Julian Benali and you think you're mature enough to handle it? Become a streamer then and i personally backseat every game you'll playing and see how it feels.\nI love how you bring up gura or kiara just to discredit amelia's maturity. Very mature of you.", "", "Was Kiara being serious about Huke actually accessing their server or was it a joke?", "We need people to sign up our petition for member among us stream...non-member can just watch\n(Joking)", "Who wants to see ame do hypixel bedwars/skywars.", "They are awkward together... no?", "different personalities", "@King Mufasa How does that even answers my question??", "@Pickle Morty they have different personalities that clash a bit right now, so it gets slightly awkward", "@King Mufasa sure Shapiro", "@Pickle Morty i don't understand what kind of response you want. were you trying to hate on them or something?", "@King Mufasa No I love both of them very much!👌", "bruh why do people donate 500 dollars to anime girls", "The power of kawaii", "Was anyone else placed on timeout? I really don't know if I said something wrong or it was a mistake but I was placed on timeout at the last bit of the stream. It was only 5 minutes, so not a big deal, but I'm just confused", "Maybe you kept backseating lol i don't know", "Didn't happen to me so not sure, could have been a mistake. Did you make sure to read the chat rules? (Under the stream, press show more)", "I commented most of the stream and didn’t get timed out, idk what y’all doing 🤷‍♂️", "@The Grand Alliance You literally tried to justify backseating in the comments. After yesterday we ain't letting that happen ever again.", "@The Grand Alliance then please leave, we don’t need spammers like you who can’t follow the very basics of chat etiquette.", "@The Grand Alliance Bro, respect the streamer and their mods, else please find another place perhaps this might not be for you", "@Mr Chips PH naw I don't backseat. The worst thing I do I guess is most of the messages I send are all caps. I wasn't spamming tho", "@SoosUnknown I swear I didn't say anything bad. I know the rules, and I try to follow them all the time. It might've been a mistake, but idk how the timeout thing works. I'm glad she's getting mods for her chat tho", "@DrunkMelonPan Oh yeah, I'm not new to this, I know all the rules and follow them, so I'm just guessing it's a mistake. It's really not a big deal, I wasn't banned or anything so it's fine", "@TRAWESS Yes it was probably the all caps", "@TRAWESS I see, it might have been the all caps messages then. Although I sometimes do it myself whenever ame says something lewd I write \"LEWD\" in all caps. So I guess try not to write long paragraphs in caps. c:", "@Deep Dark Fantasy ah ok, I'll tone that down from now on. anything to make the chat less toxic and the streams more enjoyable for everyone", "@TRAWESS oh wow you handle your timeout pretty well, not like the person above who almost unsub lmao. Maybe a mistake because you type in all caps.", "@Benjamin Yang I remembered a reply he deleted a few minutes ago (literally deleted it immediately after he posted it) that said that Gura allows backseating and that’s the reason she has 1 millions subs unlike Amelia.", "@Big Boy What? He is for real? Gura is gonna have problems at 1M if she doesn't scold chat for being backseaters.", "@Big Boy yeah that guy is very angry and commenting on everything about the mods. Maybe he got timed out for the rest of the stream for him to get so angry.", "@TRAWESSim sorry for assuming you backseated. You're actually a cool bro", "@Big Boy bruh moment, I watch gura a lot and she constantly makes fun of the chat for trying to give advice lol", "I think the mods decided to go ham and mute some people at random", "SoosUnknown Yea, Gura handles it much better than Watson", "@Mr Chips PH No that's fine dude, it's understandable that you would think that. Lots of backseaters in Ame's chat, so it's easy to assume that I would be one, after saying I got timed out.", "@Julian Benali ok", "@Julian Benali if you watched  watson's earlier witcher stream. You know why this minecraft stream have mods.", "Ooguro Ryuujin Yea, having mods is a good thing, it’s just preferable if the mods know what they’re doing", "@Julian Benali They undoubtedly know better than you do.", "Jello-mancy Their performance suggests otherwise", "Idk why some people are trying to virtue signal in the comments as if they’re not part of the problem", "The \"stop being toxic, chat!\" people? Yeah, they are really cringe. The mods can handle their stuff without them pointing out how there is annoying people in the chat now and then.", "Dr Frankenthot Exactly. Idk why the feel the need to go do that. It’s like if a white American started apologizing for slavery to every random black person they encountered. It’s not actually helping anything.", "@Julian Benali telling people to stop being shitheads =/= \"\"\"\"\"virtue signalling\"\"\"\"\"\n\nalso that's a um... odd comparison", "@thapoint09 when there are already like 50 comments telling people they are shitheads, yes, it is. At the end of the day its not your responsibility to police the community. Rule 2 is right there. You are just trying to show off how good your morals are compared to those pesky spammers. What you don't realize is you are just unintentionally becoming a spammer too. And yes, ironically my comment is also virtue signaling in a way.", "@GredyStar Ironic, isn't it?", "thapoint09 That is virtue signaling. Ame knows what’s going on with the chat, you don’t need to tell her. There’s literally no reason to bring it up unless you’re trying to make yourself look good, hence the odd comparison", "@Julian Benali Exactly, just look at how they replied too. Only proving that the ones trying to police the community are just as toxic.", "@thapoint09 I'm black. It's actually an accurate comparison.", "Dude are you really just perusing everyone’s comments looking for people defending Amelia to tell them they’re wrong lol? We get it, you are upset, we don’t need to hear it 20 times.", "Da hell drama going on here with backseat gamerz???? its not like they mean bad they just want to share commen information people have like example the time chat told her about the stonecutter and it ended up helping her. as a example", "Some people here don't know what the real (>E-sports etymology) definition of \"backseating\" is.  It isn't what you think.\n\nIt only means chats specifically designed to deceive/troll the streamer into a negative feeling, not constructive posts on gameplay.  If the chat/mods mislabel everything, the self-reinforcing toxicness will continue.  So don't chatpolice spam things that are misconstrued.", "It's more about the meta here, that it appears Ame has a special problem in chat whereas her participates are not appropriately educated in internet functions, and as a result are the approximate cause of their problems.\n\nIn other words, chatpolice breeds toxicity.  Responding to Asacoco bot friends just makes the chat unbearable.  Even if you disagree with (me) on this, spamming/moding people in chat will just turn off these viewers from the channel.", "Watson ended her stream without reading super chats because she thought it courteous to do so when a collab concludes. \n\nMeanwhile Kiara is still streaming, over an hour later, because she wanted to get her super chats out of the way...", "I'm sorry says a lot about what exactly?", "It says nothing at all, you dont know the reason why they don't do it or do it, you're just projecting your nonsense.", "It's was Kiara's plan the entire time to read superchat's after the stream, not Ame. So kindly shut the fuck up", ">steven universe\n\nThis says alot kek"]