["Ame is so cool, I'm so glad that these people are in hololive", "Who do you think the next hololive member to hit 1m will be?", "Amelia is my favorite of the english hololive members, also Gura is cool.", "@Epicrandomperson korone most likely", "@Lamato o yeah I thought so what about just EN?", "Same", "@Epicrandomperson probably Calli trajectory vise especially if she drops her 2nd EP.", "I love Ame because she isn’t afraid to talk back to the people in the chat with their nonsensical logic or their toxicity", "I don't think Amelia is really talking back, I think she's taking it all as part of the game. Streamers who see comments they honestly hate, they get unironically toxic and start shaming. Amelia gets that people are bantering with her and so she banters back. It gives a relatable levity that makes the whole stream feel more natural, especially the upbeat moments. It's something I look up to her over. She's becoming my favourite streamer, not just fave vtuber", "I love that about her too, but still I wish people would just shut up sometimes -3-", "@新城恵真 why expect a live stream without poeple talking?\nevery person how has seen live streaming knows that the chat will always try to get a reaction out of the streamer.\nthe only thing to stop a unwanted behavior is to \n1 Just say you wont do the thing they say and than actually trying to get as far in the game with out doing the thing chat told you to do.", "@Sownheard it’s really just a wish, not expecting much from people tbh.", "on today's stream..\n\nAmelia gets disconnected (45:27)\nBubba goes woof  (6:26)", "That scream can be taken out of context badly...", "wtf r those out of order timestamps", "lol headphone alert for desk-kun timestamp", "that disconnection happens to me in apex midgame, that pain is unbearable", "The question we all want to know is when will Bubba's 3D debut be?", "I want to leave a like.... but it already has 69 .... oh no, what to do", "Because YT block me ,so  let's count HIC:\n15:12 1-3(HIC\n39:07 HIC\n49:50 HIC", "Go back 5 seconds to 49:45 for that hiccup, and add this one 56:34. And I think those are all of them. Great work as always, and I'm sorry they blocked your amazing full-fledged timestamps :(", "hicタイムシフトすんげー助かります！！\n\nまさかやってるくれる人が実在するとは(´；ω；｀)！", "can you explain me why she hics so much?", "@Paulo Vitor Sure thing. Watch this https://www.youtube.com/watch?v=lf349SyH5kg and then this https://www.youtube.com/watch?v=rFIMVN-K-cs", "Why? 😑", "damn why. 😥", "しゃっくりって言われてるけど聞いてる感じチックが原因な気もするし、あんまり指摘してあげて悪化しても気の毒だと思わなくもないな\n\nHer hiccup-like voices seem to be due to tic disorders, and if so teasing her about them might make her feel unconfortable and make her \"hiccups\" worse.", "@田中 afaik tic disorder commonly appears in childhood, but she said that her hics comes not long ago,  couple years back, so maybe thats not it? Idk", "@Sultan  Yeah what you say will be true I think, but I hear in some (rare) cases adults can also develop tics after traumatic experiences. Anyway I just wanted to give a suggestion on dealing with her \"hiccups.\"", "@田中 yeah maybe you're right, but she'll probably tell us if she's uncomfortable with it. Let's just hope it's nothing serious", "Ame: Prepare for trouble\nHaachama: Make it double.\n\nThe day we fear has come my brother...................", "Watson concoction + Haachama cooking straight into my bloodstream, just fuck me up", "Nah, I predict a calm Haachama. She said she is nervous about this collab", "@eDon Akai Haato?!", "look like my prediction was correct. Kneel mortal", "@eDon overall great stream tho", "Collab so wholesome I think I'm the one going crazy", "To those interested in the candy, it seems to be a puzzle piece which forms a larger picture. The places these candy can fit in can be found on her twitter account, the one with the Halloween Image. I'm guessing the resulting picture is them wearing halloween costumes or something, and the art is drawn by a certain tako or reaper. That's what I've got so far.", "\"We brits adore the smell of candy. It reminds us of the hunt!\" ", "Everyone! Let's thank amelia for her efforts! 4 hours minecraft stream, this stream and soon the hyped Hachaama collab. She is giving her all", "Everyone doing their best effort you know? Not just amelia", "@ber liana then thank everyone like I do!", "@ber liana Does it cost you money to appreciate someone's efforts?", "@Shishir Raut i mean holo member bruh", "Stream Start!: 2:30\n\nHiccup count:\nWEE 12:04", "remind me when you are finished, thank you", "Welp can't wait to come back to this later lmao", "@Kqeva Done my dude", "@Mr Lakiro Check it out!", "@Camilo Gatica yes, you are god", "I love the hiccups-", "All the people in HololiveEN are so wholesome and fun to watch also the face when you miss the stream by 10 minutes", "12 mins late here", "Rip", "I only missed it by 15 hours", "Ame is not wholesome at all.lol", "@littledog humehumes yeah you’re probably right", "Whatever that was at the end was both blessed and cursed and it surprised and scared me. 1:18:52", "Some top tier ASMR right there.", "@DeadPixel yep 🤣", "Blursed", "Blursed.", "I just hissed back.", "Maybe a hint to the puzzle? Doubt", "@CraFteR_6 x doubt", "Now I see why she was so chill with Haachama. She got all the gremlin stuff and Amelia noises out of her system during this stream.", "And the jokes with Gura", "\"My internet today is garbage\"\nThat's every day tho, Ame wa warukunai yo ne.", "Fun fact: Innit is British for Desu.", "If the see saw itself have weight, it will resist flipping due to inertia, therefore it will take a while to start tipping. And how far towards the tip of the seesaw also is taken into account how fast it tips. Just a TIP for you.", "14:14 Shout out to that guy for helping out Ame,  pretty nice of you man!", "Nah that guy is pretty lame", "so true", "K0uhai. But.....why?", "@forcexjr Stream sniping to force a streamer to win sucks and isn't fun to watch", "K0uhai. Yeah I guess it differs from people to people", "Can’t lie that was adorable 46:43", "The Electric Boogaloo 2 meme comes from my knowledge originally from Breakin’ 2 - Electric Boogaloo being the sequel to Breakin’. The name to that sequel was so weird that bands, news sites or tv series used it as a joke. I first heard it in the series Its always sunny in philadelphia where I think it got the most exposure to get meming status. / Since Fall Guys deals with a lot fo Fruits here a fruit joke:  Mangoes in to a bar.", "Hey I got a joke too: What do you call Santa if he was a farmer?  \n\nA jolly rancher.", "@Golden good one =)", "Mangoes into a bar, he orders a banana martini", "1:06:11. I had to hit her with dat airline food", "Hope Watson can enjoy fall guys more by having a collab with en members. Sometimes co-op can help in some team play stages . ( especially for some stages in season 2 apparently you score solo but need cooperation to make it easier)\n\nWish you can taste the sweetness of champion finally.", "20:35 It's time okay go! It's time okay go! It's time okay go!", "Amelia voiced is always nice to heard, but this stream fulls of Amelia frustration and desperation voices are also good!", "Thanks for the short stream! Can't wait for Haachama collab! (We got 2 random numbers (23 and -1) and 2 candies (or 1, i don't know). Let's work together if all the numbers and candies are collected o7) \nP.S: Thanks for \"Nyam nyam\" ASMR lol", "So far in the Halloween candy scavenger hunt we got:\n2 candies we have no idea what to do with them, \na \"23\" in the previous stream description, \na \"-1\" in this stream description", "You need to up your logic game skills. The answer is very clear.", "Word play is common in Japanese. Convert the numbers to Japanese. Maybe it’ll mean something.", "Maybe the numbers are letters in the alphabet? That would be 1 - A and 23 - X\n\nMaybe.", "I think the candies are pieces of a bigger picture I mean literally scraps of a image the numbers have something to do with the order  of It just -1 is throwing me off.", "The heck? Where do you get them candies?", "its a puzzle piece", "@WafuRu Su they’ll show up at the end of her streams", "Alright boys, let's talk about those scavenger hunt hints and stuff\nWe have two numbers that have been in the descriptions: 23 and -1\nAnd we have two pieces of candy, and these pieces look like they connect together like a puzzle, but what I wanna focus on is those numbers, what do they mean?", "22?", "I believe we are supposed to subtract 23 -1 and we'll get 22, and then 22 will be used maybe as a hint. That's just my deduction", "@Ulysses Romero That's way too simple, but you may be right. But what does 22 correlate to?", "@Blooper {Reloaded} we’ll find out more as the week goes by", "@Arc lieutenant Jesse Yes, we should also make sure to check the other members' streams that aren't collabs or members only streams, they might have more hints.", "@Blooper {Reloaded} Yeah both of you are right, I guess all we can do pretty much is just wait for other streams and find connect the dots then", "@Blooper {Reloaded} yes and any guerilla streams might have hints too", "@Arc lieutenant Jesse You have a point, guerrilla streams would lead to missable hints if they decide to give hints during the stream.", "Maybe it will be best to share it through social media, like reddit or twitter to discuss about it, but it's on you", "Let the games begin", "Alright an update on those numbers:There weren't any numbers on the Convenience Store stream, maybe it was a fluke, but still keep an eye out", "@Blooper {Reloaded} Yeah, always check the description in every stream (Maybe that's the way to make people open the description to read the rules? I don't know either.)", "@Kyoro Kazoyori Ok that last comment I made is now invalid because I checked her stream description again and now there's the number 5.", "@Blooper {Reloaded} Oh yeah i saw it too, here we go again lmao", "The candy definitely seems to form an image. I have no ideas for the numbers though.", "Okay, we got number 13 in the description (What a number), got any idea?\nEdit: And another candy too", "Thanks for streaming so much ame! we appreciate you!", "I love Amelia", "I totally like the sounds that Ame makes in this stream.", "Indeed, A stream with a table slamming sounds completes the stream lmao", "16:32 why is this wheeze adorable", "OOF, That disconnect! That looked like a good run!", "As an Aussie I know what its like to have constantly buggered net\n\nits never good", "The lags that we saw is the timeline getting messed up. It fully showed the consequences near the end of the collab with Haachama. I suspect that the extremely lucky winstreak in the matching game was the reason, it was such an insane streak that she probably time travelled just to get that match.", "45:23 last game", "Amelia has been infected by the digivirus and has digivolved into - Amechama~ Haachama's Zvesda Plot continues!!", "Don't mind me, just making my own time stamp. 56:55", "I'd listen to an Ame podcast if I could, so her dropped frames don't bug me haha", "Watson playing Jellybeans~ Of course I want to see", "4 days later i get the notification", "WATSON AMELIA, GIRL I HOPE YOUVE BEEN DOING WELL ! I also hope you recognize this name, it’s been a hot minute since I got to catch your content!_", "1:18:51 Your only option is r u n", "14:14 that guy\n16:32 wheeze\n36:36*", "Don’t know why this was in my recommended but alright", "Welcome. I hope you were entertained?", "Welcome to the rabbit hole, enjoy your stay if you wish to stay", "Oi, Amelia, Your collab with Haachama was very cute, thank both of you. I hope those little tech difficulties in the end didn't upset You too much, don't worry about it if You do, please <3", "Rages like a true detective/gamer.", "私はあめちゃんの笑い方がとても大好きです\n彼女の声は私にとってとても魅力的に聞こえます", "20:37 quadra kill🤭🤭", "Ame is non-stop today", "20:12 Funny\n20:35 another funny part", "Beeeeeeeeeg hugz to miss Ame!", "立てー！！！立つんだアメーーーッ！！", "I don't know if it's just me but..\nI feel like somethings wrong with ame's energy:(\nHave you been sleeping well? I can't say for sure what's wrong but I do know that I can feel that there's something wrong:(, it's like you seem tired:((. take care of yourself~~", "She streamed 3 times today.\n\n1. minecraft stream with gura\n2. Colab with Haachama", "I felt that too, a lil bit, but I guess that's understandable.\nShe's kinda ambitious and an perfectionist. This week schedule was crazy, like 12 streams and also the halloween scavenger hunt project. And today is the big start for this crazy week with three streams in a row, but her internet kept messing around for the whole night and she can't do anything about it. Plus I bet the previous backseating drama still affects her. ", "37:49 L E W D", "1:18:52全集中", "y r ppl waitin at the end and not goin to the finish line? i smell stream snipers yo", "1:13:50 Wink <3", "Can anyone please tell me what the music is at the beginning with the mustache and when its a desk background with all the fan art?", "Having fun storming the castle?", "Is Amelia the rage gamer amongst the 5 lol? Funny stuff.", "I didn't expect that ending, but i did expect it at the same time. but not like this! kusa", "I am proud of this comunity.\nAlso, nice jumpscare at the end", "Amelia deskson F for the desk", "It is time for the fallen guys", "Bubu sounding kinda cute this stream 😤", "Is the haachma collab today? idk why but im feeling really confused about it", "It is today, it should be streamed in about an hour from now unless they push it back.", "At 49:18 the candy looks like a puzzle pice so it may form with the rest of the candy we get.", "AMELIA WATSON", "Are you winning Watson?", "3 stream nice\nI was super surprised in the end", "40:20", "Lovely stream ame", "39:09", "Ame is my love", "Can we talk about the one guy that sabotaged another guy for ame", "He would've won too if he didn't SIMP", "Ame is right. It doesn't matter how many people are on the side of see-saw. It goes no faster if everyone is on the outer edge or if one person is just past the middle. So long as there are more people on one side compared to the other.", "1:18:51", "1:18:52", "I am not looking at boingboing", "I don't think she's getting any sleep... And here Ame is with Haachama... You need to sleep Ame!!!", "I have to admit, the stream sniper grabbers are really freaking annoying. Just let her play the game...", "MAN I MISSED IT", "Same here bud😔", "1:18:50 :flushed:", "1:13:27 ty", "♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️♥️", "mmmmm......how old r u?????????", "Ame and Boba is like Pewds and Edgar. Same energy.", "5th", "Do all of these streamers live in japan? Or is it just assumed they do?", "The majority of Hololive is Japanese and lives in japan. There's an Indonesian branch with three members from Indonesia and out of the 5 English ones 3 of them live in japan.", "@K0uhai. Ah ok gotcha", "@K0uhai. you mean 2, Kiara has confirmed that she can only meet with Calli", "haaaaa", "Night detective:3 haachama stream was peaceful:)", "左足を伸ばし、悩みを乗り越え、右足を伸ばし、悲しみを蹴り飛ばし、ロープを見つけ、健康を守り、檻を見つけ、幸福を逃れる場所をなくしてください，あなたはそれを行うことができます! (＾▽＾) \nStretch out your left foot, trip over your troubles, stretch out your right foot, kick your sorrows away, find a rope, fasten your health, find a cage, let happiness have nowhere to escape, come on!", "ily", "A", "j", "So I gotta know what are Ame's fans called? I am a Chumbud! But I wish to branch out and support ALL EN!", "TEAmates, also thank you for branching out. They all deserve the same amount of love, enjoy your time.", "@King Mufasa Best I've gotten so far! Will gladly call myself a new TEAmate!", "Minecraft Gura Collab description: 23\nFall Guys stream description: -1\n\nThe numbers, Watson! What do they mean???", "It'll be hella funny if it's just some random number she puts up so we got confused and start assumpting, big brain ame.\nBut if it's not, then we might need other clues too, maybe other members stream too ?", "@Wishless Hero I think she did say to check other members streams starting today, except for collabs and members only streams, so the next clue should be in Kiara's Among Us stream.", "@Blooper {Reloaded} Really? I thought she said only in her streams except Members stream and Collab stream... maybe i didn't really heard that. Anyway, i think i can't keep up with the others stream, maybe someone can tell me the another clue? Big thanks o7", "@Kyoro Kazoyori I could be remembering wrong, so feel free to correct me if I am wrong.", "@Blooper {Reloaded} all solo HoloEN streams will give candies at the end. Not sure if all will have clues.", "@massmanton Thanks for the confirmation teamate!", "Give me a look at his original face Pelis", "Bababooey", "Bababooey", "あなたに感謝しない人は精神薄弱、あなたを悲しませてくれる愚か者、あなたを逃がしてしまう愚か者、あなたを好きな賢い人は賢い、あなたを幸せにする人は素晴らしい、そしてあなたとあなたの人生を過ごすことができる人は幸せです。永遠に幸せ！\nPeople who do not appreciate you are mentally retarded, fools who make you sad, fools who make you slip away, smart people who like you are smart, people who make you happy are great, and those who can spend your life with you are happy. Happy forever!ヾ(@^▽^@)ノ"]