["Here's to 150h of Witcher content coming  :D", "whats a war thunder youtuber doing here???", "Simping obviously", "Lol", "tfw hitler calls you a simp", "Do you really think 150 parts is enough? well if she streams 3 hours per part then yeah maybe? XD", "Cool, a warthunder youtuber\nI dont play war thunder\ncries", "@lavabis All types of people can fall into the rabbit hole, all it takes is one clip.", "Haigs descends to vtuber hell hole", "I really hope she finishes the game.", "@NEEE VIRUS heretic\nBut seriously..i think you should give it a try, it's pretty awesome\nI played both for some time and war thunder is better", "Not sure if she will. Didn't seem like she was too enthusiastic at the end there, maybe it was just because she was sleepy.", "i doubt it.. 30 max.. :D the main story isnt that long and i dont see her doing every side quest", "Can we appreciate how Amelia streamed for 4 hours, stopped because she wanted to see Gura's stream, then streamed for nearly 2 more hours then stopped and commented that she wanted to watch Kiara's stream and she would be streaming again if it weren't that she is drooling in her desk from pulling all of that.\nWhat a Chad.", "she stopped to eat spaghett tho", "@Dai - Belizariusz she even multitasks lol.\nWhat a mad lad.", "@Dai - Belizariusz To be fair I'd drop everything as well for the spaghett.", "The feminine of \"Chad\" is \"Stacy\", either way it doesn't means what you think it means.", "Truly what a gamer would do. Gremlin +1.", "@Al He \"Stacy\" is not the feminine \"Chad\". Stacy is the feminine counterpart to the masculine \"Chad\".  They are compliments of each other.", "Wait what part of that is being a chad? For being able to stream more than 2 hours a day or the supporting her friends part?", "@Loveisinportant the part that she stayed well above what she should had to support her friends AND streaming 2 times the same day.\nI don't know, I found that epic from her.", "@fallshimjager1 I agree she's great. But I regularly watch streamers who stream 8 hours a day 6 days a week. That's the standard I'm used to, personally. \nI do love seeing as much of my girls as possible, but I'm glad they're able to pace themselves. They too often talk about being tired and unable to sleep.", "Well boys, it's official: Ame is addicted to The Witcher 3. And I'm not even surprised.", "next we get her addicted to gwent", "Then it’s the Netflix series", "Gwent is skill gwent is life SHE DOESNT HAVE THE FUCKING DLCS Thats not a bro moment", "@Balaur One She does have the DLCs, she bought the game of the year edition.", "@Blooper {Reloaded} why even buy them separately when the whole package cost less then the base game", "1:09:41 personal use.", "I prefer the word Communal Use.", "@Darkened Rationalist \"Our sneeze\"", "Bruh", "ngl, i thought she was gonna fall asleep", "[Fight music starts]\nNo one:\n\nChat: ", "BANANA TIGER", "@KFP Mei Mesaki ah godamnit, I had that erased from memory and you've brought it back\n\nY u curse me man ;(", "LELELELELE intensifies", "1:09:41 くしゃみ助かる!", "Thank you so much jp bro, tasukaru!", "Arigatou JP bros", "22:40 Ah yes, Doritos is my favorite sign use to hypnotize someone...", "\"It's too small, I can't see.\" ", "erection \"NEVER MIND\"", "@flamingrubys11 😏", "Yes you are 50:01", "all you inventory is restored fully every time you mediate at the cost ONE alcohol. This includes potion oils and bombs. Use them like there is no tomorrow. You won't need a constant supply of the herbs you used to create them. Alcohol is one of the most common items from chests and loot im general.", "That took me ages to realize. They should have made that more explicit.", "I finished the game without knowing this fact LMAO.", "\"He put Doritos in his brain\"", "Easter Egg 1:47:16 ", "I recommend you go see the end of her building a tower in Minecraft stream if you haven’t already", "I’m looking forward to this 50 part series. Not being sarcastic, I’m loving this playthrough. Keep fighting Detective!", "1:16:26 Blessed moment ", "I don’t like to give tips of how you have to play a game because i hate backseat, but i think that it’s better if you choose the white dialogue options instead of going directly to the yellow ones, in that way you can understand more about the story. \n\nAnd i also think that’s better to do more sidequest missions, because some of them are really good and some can affect the main story. To me, that’s the best part of the game.", "Plus the goddamn food spam.\n\nI've been part of the chat saying this, but DON'T SPAM FOOD.", "If you hate to backseat game, then don’t.", "24:52 my heart cannot take this🙁", "36:33 I know the s are the most blessed but these panic shrieks are my second favorite Ame sfx followed by gremlin laugh. ", "I missed half of the first Witcher stream, so thanks for a follow up!\nThese streams are always great to chill in. Cya'll in the next one \n\n57:17", "DORITOS! 22:45", "アメリアちゃんマジで可愛い", "22:46 \"you put doritos in his brain\" bruh", "Thanks for the stream as always! I wonder, why chat really want Ame to play Gwent? Like, is there something special behind it?\n\n(LELELELELE INTENSIFIES)", "It's just a decent minigame that gets fun once you figure it out and start getting some more and better cards.", "We just want her to play Gwent cuz it's funny.", "Ahh, i see, thanks for the information!", "With hindsight I just realized my comment was absolutely dreadful and I apologise.", "So that the playthrough doesn't get too bloated, I will rank and explain as a guideline what's worth clearing live from most to least:\n- Main quest: To clear the game, obviously & Expansions: High quality content, great story, at times can rival the main game and its questline\n- Secondary quests: One of the game's strengths. They can miss but most of them are ranging from at least interesting to having a great, memorable story", "And damn I fell asleep between the break and didn't wake up in time to catch it live T_T Here I am, to the archive!", "@แรคคูน idk i think gwent is fun to watch, its one of my favorite parts of the game its very satisfying to play", "You know witcher is a good game when it has so much content that there has to be a guide to which parts of the game to stream", "I wake up and what do I see, not one but TWO Witcher streams?? Ame's new addiction incoming", "I can see her playing this for a few weeks now after her doing 2 streams about The Witcher 3 on the same day", "I love the Witcher 3. It is probably one of the best games of the decade. Glad to see you play it! I watched the whole stream before this one, and I am looking forward to see you continue through the story.", "I really want a game with Ciri as the PC all the way through.\nIt might be worth grinding some minor side quests off-screen and play the main quest/DLC on stream.", "Stream Start!: 2:32 (10Q @Zeres)\nSorry for being so late, y'all. Been busy the past days.\nHiccup count:\n1. 05:44", " for all the Hiccups I've missed", "And thank you for the wonderful stream Amelia! See ya and looking forward to the next one!", "@22:52 \"I put...Doritos, in his brain!\"\nThe tweet that led me here.", "11:33 KING CRIMSON", "49:54 Ame goes :o", "I really want to see more of this being played. I wasn't really interested in playing witcher myself but I could see myself watching a lot of this", "50:02 Mmmm yes, the floor is made out of floor", "I love these streams, they're so cozy and fun at the same time! Please keep them coming Ame!! <3", "I don't have high hopes that she will read this but here goes. Yellow options in conversations advance the conversation, white options are optional things you can say which don't advance the conversation and you can normally ask all of them, these normally give you more information which can be useful or extra story and sometimes can lead to more options in a mission. You should really try to exhaust all dialogue options if you want to experience the full game otherwise you will miss things in quests or things will make less sense as you will have much less context", "Also, you can't really rush the witcher as that will just make it less fun for everyone involved and you will miss a lot of things, just play it whenever you feel like playing it and make your way through it little by little don't try to finish the game before x date", "I don't want to sound like an asshole I am really enjoying the streams these are just things I feel would make for a better experience all around", "Here is a memory of me trying to grind for 2 hours while killing drowners. I killed the drowners nonstop and I gained like 10 exp. Then, I decided to just do a quest.", "I still don't understand the whole \"it's impolite to let the streamer know you were brought here from another streamer\" thing. People scoff at \"Twitch culture\" and how bad it is, but what's so bad about the concept of 'raids'? It's a jovial event where you  greet new viewers that came from another chat and after a couple of minutes of them spamming as they come in, it returns to the stream. I've been assuming this is some kind of rule Hololive in particular has set up. I haven't seen anyone else be so anal about raids. Nor the mention of other streamers, so long as it isn't overtly \"this other person did this better than you\" et cetera.", "Ame's getting addicted to every game she played.", "Hey ciri, wanna see me speedrun witcher 3", "Haven't played the Witcher 3 yet, only 2. But man, do I want to play it after seeing Ame play, so entertaining to watch live", "YOU👏BETTER👏FUKIN👏PLAY👏IT👏!!!!", "Nooo I missed this stream! 😭 I don't know that she's going to stream twice today.", "i hope you dont feel like you shouldn't stream the game for whatever reason may be, it was entertaining and it was nice to see you play whatever you wanted, just do what you want and we'll watch.", "I'm not even gonna question Ame's sleep schedule anymore", "22:40 Ame \" he put doritos into his brain\"", "Glad that it seems like Ame likes Witcher 3 so far. :) I'd say just build what skills you want though; don't let chat dictate your play-style.", "(๑╹ᆺ╹)", "⬇️ the amount of   daily", "Girl you are under-leveled. Do some side quests they are pretty fun and unique", "Love this game. By far my favorite RPG. Love you too, Ame.", "i wonder if amelia checks the post stream comments here.\nif she doesnt, she indeed should- communtiy interaction is important folks! ^.^", "Yesssssssssssss TW3.\nMore that CP2077 is less than a month out, hoping for streams of that as well.", "Damn i missed the stream", "There is a second movement style within the options. I don't know if Amelia has tried it, but if she has issues with interacting sometimes, it's a possible solution", "Hey Ciri, kyou no tenki wa ~", "22:42 Doritos.", "I live for these streams", "soooo, i heard there's Ame milk in this joint?", "Wishing you every second of your life is a happy one", "loving this playthrough", "Hunt missions r my favorite in this game", "Damn, she skip all the white dialogues...and the cursor on her screen tho.\nEdit:\n Ame if you see this, this is my honest opinion, you can play however you want and we still love watching you but don't rush this game, trust me, you will enjoy it much much more and because you may regret it later, the first playthrough is a experience you'll never get back. ", "She gonna miss a lot of good endings skipping the white dialogue like I get she zooms through games and wants it to be fast for the streams but you cant do that in the witcher 3 ☠️", "@Erikr Andersson let her play whatever she wants dont be a backseat gamer", "@BarzCaremelly I’m not a backseat and still like the games but she’s gonna have a lot of endings she doesn’t like if we don’t tell her not to skip lmao", "@Erikr Andersson no, let her play however she wants,", "@BarzCaremelly you be simpin too hard,\nChill and let actual advice by like I get it you all never had a girlfriend and have to white knight but let actual advice pass 😂😂", "@Logan C considering how often she asks chat for input I think simply pointing out that there are multiple endings and they are influenced by the conversations isn't going over the line...  but then again all she'll do if that happens is ask what chat for the \"right\" dialogue decisions so shrug", "@Logan C Its up to her but I think she should know about it, I would want to be told.  My only concern is that she'll just poll the chat for the \"right\" answers instead of making her own decisions.", "@Grazz you act like you’ve never searched a guide or helping end to a game in your life or had a girlfriend. Newsflash sometimes people dont want to spend 60 hrs of their life on a unappealing bad ending", "@Erikr Andersson think you're sending that to the wrong person.  i was advocating telling her that she needs to be told the dialogue choices will impact the ending.   If you're referencing polling chat for dialogue options, yeah I do think that's pretty lame.", "@Grazzthen stop being annoyed and being in the way of obvious basic things maybe", "@Erikr Andersson I get what they mean, I myself hate backseating too but sometimes when Ame herself is asking chat for our input, that's when we can say our own stuff, but if she's not asking please refrain from telling her how to play.", "@Erikr Andersson what am I being in the way of?   Honestly I'd prefer her to be 100% blind on this play thru but she threw that away almost instantly by constantly asking chat for advice.  I just think if I was running blind thru the game that I'd like to know that  those dialogue trees are not simply bullshit fluff and are actually going to alter the end of the game.", "It's probably better if she skips the unnecesarry dialouge. this game is long and I wouldn't want her to stop streaming it halfway trough", "Can't wait maybe for the good stuff", "I always get disappointed when players choose to spare the Baron's men at the Crossroads village. Because then the thugs are free to round up the daughters and wives of the village and rape them. I understand the point is not knowing the consequences, but it's so brutal to choose anything other than fighting them.", "1:13:00 Amelia's perfect Russian accent | Ватсон говорит о выпивке с идеальным русским акцентом", "Имеет большой опыт с кса", "Sounded more Scottish to me 🤷‍♂️", "ガチ恋しました", "Kiara and Watame last stream. Now it's Mio. Didn't expect the collab", "1:09:40 bless", "Don't want to spoil much but there is a good early game  silver sword (lvl5) near livendale that's the town right of crows perch it's one the question marks around that area under the river.", "I think Ame is just prone to get hooked on stuff. The fact that it happened now and on minecraft might tell us something. Can't complain as it is my case as well", "1:09:40 omg im dead", "1:47:16 Amelia: \"LELELELELELELE...\"", "Well, he/she played better than me when I bagan but it seems that it is not her skills but carefull planning so that he/she would not stuck anywhere. It would bu frustraiting to watch otherwise. But still like for showing Witcher 3.", "50:02", "Pleaseeeeeeeeee don't abandon this game, It's great", "Dam shadowbanned?", "LELELELELELELE", "BOO! Ame is no fun! Play Gwent! ", "Wind's howling", "Why are people always chatting that though?", "@Ryo Ryusaki If you have played the game then this a filler dialogue geralt always says", "Also, I dare you to play Mega Man X6.", "ah a man of culture\n\nx6 on xtreme :)", "NOOOOOO", "Ninja Gaiden II", "Bourbon... Or mud?", "@Yordle IRL I hope you make a superchat message with the following text: \"Suggestion: Play Mega Man X6 on Xtreme difficulty\"", "2:32 start", "1:09:41", "48:00 Cheers Kanpaii!!", "Man. I am a bit sad she is skipping all the secondary content. But i understand she would make this a 20 episode series if she went through it. \n\nBut for anyone else who might ger interested in the game after the stream: The main story is not that great to be honest. But if you look at any review its highly praised for its narrative. That is largely because of the side quests. Very few games manage to make side quest give life and personality to the world like this game those. Side quests you thought were irrelevant actually end up tying together many elements of the main story. The game is incomplete without them especially the Novigrad and Skellige sections.", "I agree with everything but I think that the story is actually pretty great. The only issue I have with it is that it's really disconnected from previous games, but seeing how many people didn't play anything besides W3 it wouldn't be an issue to them. Not sure if you played previous ones or the books.", "stop. backseating. please. She plays for the first time, let her do it as she wants", "@Kavirus how is that backseating? I specifically aim my comment to fans interested in the game. Se can do what she wants", "Tbh, I think most RPGs have a meh main storyline but the side quests make up for it. Then again, it makes sense that she just plays whatever she wants since it's not a complete playthrough or something, just for fun.", "That feel when she doesn’t want to kill murderous bandits that would have likely raped and razed the entire town given the chance", "1:40:15", "dont know what happen w the bear, geralt normally auto use the right sword, unless you make him draw a different one. weapon durability could also be it, 50 is quite low. It saps attack or armor( depend on type).Anything w fur gets cooked by armor. Feel free to potion spam, you will have way too many extra herbs soon enough.", "LELELELELELELE", "Best game", "Wait this is already part two? She just streamed part one when I went to bed", "Same, I just woke up confused", "It is because chat told her to get a break, so she went and ate dinner and then came back.", "@Boi Ah makes sense glad she listened. Gura did not yesterday and even though she had no sleep since her collab with calli still streamed for hours to thank the SC`s", "worst witcher player ever... talk to me if you want to improve. please....", "Lelelelelele was best part", "o7 bois", "Ame Milk hehehe", "Next she will be using witcher controls in minecraft", "Name: Chat\nObjective: Get Ame to play Gwent\nObstacle: \"Why? I don't wanna\"", "We'll get her eventually", "lelelele", "ooga shaka ooga shaka", "o7", "Amelia! For the love of everything that is holy and good on this world! \nDouble press and hold shift on the horse, to go into \"sprint\"!!! You go like 2 times faster!", "remember to buy every gwent card you see, it's not just a mini game.", "o7", "Jesus Christ chat sucks at advice.", "Not killing every living thing on your way to a quest is really dissapointing me from a guy that has both the dlcs and complete the game 4 times..."]