["I was a bit sleep deprived which made me a little cranky this stream; chat is chat and even with rules, mods, or filter, people will find a way to do whatever they want. From now on I will do better to not let it get to me so easily, sorry for letting you down! I will keep working hard 😘", "Oh Amelia you've let no one down! You're doing so good!", "We let you down, not the other way around. Best wishes!", "Sorry. It’s not your fault. Get some rest and we teamates promise we will do better.", "I enjoy how you play these kinds of games and hope you'll continue playing your way.", "Dont worry mate. I hope this hasn't ruined The Witcher for you and I would understand if you don't want to stream it anymore. Take rest!", "I swear you girls are such sweethearts! We don’t deserve you guys, yet you guys are here to have fun and bring cheer to us viewers! You being sleep deprived is to be expected since you’re collaborating with the others in different time zones. You girls work so hard than we may realize. All we can do is support, and help you in anyway we can! Member or not, we’re here for you Ame and everyone else in Hololive!", "It's good to put a sticky to warn the backseaters about chat rules. I hope you still enjoy the game!", "This is why a lot of twitch channels have a large number of mods to enforce rules. Rules can span anywhere from no back seating unless requested to don’t talk about politics. I know there’s a different culture on YouTube and Hololive and there’s a risk of over banning with volunteer mods, but that’s why heavy moderation is common.\nEdit: Also, I wanted to reiterate that you didn’t let anyone down today. I really liked your joke about your biceps being too big.", "Don't apologize. Bastards deserved to be yelled at for their constant badgering.", "You were in the right to be angry. I was LIVID with these Gwent spammers. Im loving seeing you play this when you are finding your own way while ignoring chat's toxicity, and that goes for all of your streams. Please continue to share this playthough with us.", "You didn't let anyone down! It's us as a chat and a community that need to do better. I hope you get a good rest!", "It's not your fault Ame. You didn't let anyone down. If I was you I would have ended the stream much sooner tbh. We just want you to enjoy the game. Don't listen to trolls and spammers. Though making chat members only for The Witcher would probably be for the best. You can't just ignore them. That's what xQc did and look at his chat now.", "You shouldn't go easy on them. If they can't behave at a basic level then they don't deserve to be treated nicely. Edit: Also it's not your fault. Don't feel like you have to apologize to people who doesn't respect you.", "It's fine, dont worry about it.", "It's not your fault Ame, get some rest, And don't listen to those spammers and backseaters, we're here to support you anyway we can Ame", "Anyone would be peeved lmao, you're only human. If chat bothers you to much, just ignore them. Witcher 3 is one of my favorite games but I understand if you want to stream it less often. I'll still watch whatever you put out so stay strong ok. It's not your fault, you've never let us down.", " You're totally fine. If anything backseaters can get bullied a bit tbh!", ":(", "Dont care about the bad side Amelia, we really like you and your streams", "Rest well ame, we will always keep supporting you, chat will behave i believe in the teamates", "We don't blame you at all. This issue was on chat not knowing when to stop. Please don't worry too much about it.", "Ame you haven't let anyone down, it's not your fault that some idiots can't follow the rules. What makes you fun to watch is for you to have fun your own way (and get salty as well lol), just ignore those backseaters!", "Do the neighbors hear you rage quit, beating your table, being toxic to the chat, and your inverted burps?\n\nI hope you feel better!", "Really? Come on now. This isn't the solution. Your chat will permanently be like this if left unchecked.", "You didn't let anyone down. You also have no reason to apologize. Witcher 3 is a massive RPG with nigh infinite ways to play it and a ton of optional content. There's no reason for people to spam \"GWENT!\" or tell you what to do. People should just stick to only giving advice when you actually ask the chat for help.", "Hopefully all the spam/backseating doesnt ruin the enjoyment of the game from you.", "It's understandable why you'd feel that way to be honest, going by the comments here a lot of people in the chat felt the same way about all the backseating and Gwent spam. It's fine to be harsh on chat if we're being too demanding or unruly, it's your stream and your game after all, not ours. There's no need to apologize to us, you did a good job today.", "Here to join the mob that's telling you  you have nothing to apologize for. Don't know if you'll even read our comments but if you do, just know it's rarely your fault. You're doing your best which is more than we could ever ask for. Hopefully the \"Twitch infected\" part of chat will learn to be better", "we chat are at fault. were sorry  :(", "Chat is to blame, not you, so please don’t blame yourself.", "Nonsense, they were being rude and should be called out. I'd much rather watch someone have a genuine experience with the game rather than having someone just do what chat tells them. Who would want that? You do you.", "no matter what happens, we always support you ame", "you're only human, detective. of course emotions will get to you eventually. it isn't your fault that some wankers can't just let you play your own way.\n\ngiving gameplay tips is one thing, spoiling and dictating how you play is another. especially in a choice-driven story heavy game like this. ", "However, I still feel that you should take all the precautions you can so that this doesn't happen again, including the things you mentioned in you comment.", "Please don't feel as if you need to apologize for a bunch of bad apples in chat. Most of us want you to take your time and enjoy the game your way. It's a very complicated situation I'm sure but whatever you decide in the future with either a playthrough or chat we will respect and understand. You work so hard for us Amelia, words can't describe how much we appreciate it and you", "Please don't let vocal jerks get you down, we all just want to watch you have fun however you like.", "It was chat's fault tbh, not yours", "It's not your fault, but it's ours! You are doing great! We will be better next time, we promise! (I hope)", "You can beat the entire game without playing Gwent once, it's just a way to skip side-quests", "You didn't let anyone down, please don't be hard on yourself! Chat was getting frustrating and rowdy, it isn't on you. Please do what's best for you with regards to streams! 💛🔎", "You have all the right to put your foot down if we get too annoying in chat. Being little shits to you is only fun if you're fine with it.", "It is impossible for you to let us down.  You are hilarious and entertaining and you never fail to deliver quality content.  There are just some people who don't understand that watching someone play a game is about sharing their experience.  And it is not YOUR experience if people are demanding you do it their way.  You're a grown woman, you're a gamer, and your decisions and your choices are yours to make and we should not influence them unless you specifically ask for our opinion or help.  I will continue to support you in every, way, shape, and form I can.", "Ame, just ignore the chat unless you really need help, you frustrations is totally a right reaction, but please control your temper too. Everyone, block and report those who backseats and spams in witcher, minecraft AND future streams.", "Chat needs to be put in their place every once in a while, it's fine, we don't mind it.", "You've  let no one down, Amelia. We just want to watch you enjoy yourself gaming, nothing more.", "It's ok, don't worry about it too much. sleep tight Ame. ", "Chat was honestly being more obnoxious than usual", "Don't need to apologise. Play the game how you want and take it easy!", "Ame, you are so kind, i hope you get some nice rest , chat is chat but theres a lot of people who will support and love you no matter what and just want to have fun with you .\nthanks for the stream as always was nice to watch", "It's in no way letting us down Ame. The chat deserved it. It's not wrong to scold the chat when they are overdoing it. Even if some of us would still act like nothing is wrong. The real fans know and will heed the rules. We love you no matter what Ame. Just keep playing the game your own way, and keep your head up.", "Here's a haiku for you:\n\nIt was a fun stream\nNo, you did not let us down", "Nothing to apologize for!! 😊 Chat was going way overboard. I wouldn't have lasted nearly as long as you did before saying something. Witcher is meant to be played however you want to, and that's what I, for one, enjoy watching. If you wasnt to enjoy the Witcher on your own, I don't blame you at all. Do whatever makes you happy!! 🙂", "This is no way your fault Ame, people should know better but I guess not.", "Awwww, don't worry Ame. We all have our cranky days and chat is annoying anyways. Get some mods for temporal bans (permanent would be too harsh) and they will calm down.", "I think we the chat, let you down more in this chat than you ever had let us down. Especially with how much you have prepped for this stream for us. I don’t dare fault you for this, and I'm sure many others feel the same. Ultimately, it's your call on how you want to continue Witcher, and we understand whichever choice you make.", "Nothing to apologise for Ame! There's always room for improvement, but chat went a little overboard this time with the spam, nothing you can be blamed for", "You're okay Amelia. I'm not asking a question, I'm just telling you that you're doing fine, and don't fall apart thinking you're not. \n\nDon't fret about taking a breath before getting back on stage okay? You got this: You're Amelia Watson! 😉", "There is no need to for you to feel bad Ame, you didn't do anything wrong. We all adore you because you are you, Ame. If chat and all is being difficult, that is on them. We all wouldn't be here if it weren't for the Ame we all love ", "We all agree here that you never let us down :D", "We watch your streams to see you play the games, not to see you play like someone else plays the games. You haven't done anything wrong.", "I'm surprised so many people like Gwent. After the first couple of times I didn't play it once. Play however you want and chat will understand, and if someone doesn't like how you play they can fuck off. 🙃", "Everyone's already said what had to be said but I'm just here to agree with the rest that you were in the right to scold the chat there. Don't blame yourself for being annoyed with chat misbehaving.", "It is okay Ame, it okay sometimes to put your foor down when necessary", "Ame, you did nothing wrong and it was us in the wrong.  We are the ones who apologize.  I can safely say that moderation will improve the situation, though.  I believe that would greatly help with spam and preventing people from doing whatever they want.  I might miss the collab later, but I hope it goes great and that you get some rest!!!!", "Don’t worry Ame~ be happy~", "Here, an AmeHeadpat\n🤚", "Ame , I think you got it the other way around . It was chat letting you down . We promise to do better and hopefully things will get better . Love you , have a good rest and see you soon", "I hope you feel better Ame! It is never your fault and do whatever you wish! We will always support you no matter what!", "the fault is definitely on our side so you really did not let anyone down. i still hope you can play games like these because they really are entertaining <3", "I’ll just join everyone else and say you have nothing to apologize for. Hopefully things get better from here, we love you Ame!", "We are all human in the end. Stuff gets to us, ya done nothing wrong. Love & support from a fellow TeaMate", "You let no one down. I understand you might be trying to defuse the situation because of the backlash to chat, but don't blame it on yourself. Get some rest!\nI'd understand it if you would want to drop the game even if I like it; I feel it's not the best stream game due to length and other reasons like these. Cyberpunk 2077 is coming out soon and everyone will be new to it so there'll be less assholery, if you wanna play that.", "Ame, you haven’t let us down. You’re not at fault here.", "Don't let trolls in chats get to you.  Enjoy streaming and try to get some more rest if you have to.  We will be here waiting to see your next streams.", "No need to apologize, you never did anything wrong. Don't stress yourself over this. Get some nice rest, you deserve it.", "i also really loved this moment in your playthrough. so chat, please do better https://www.reddit.com/r/Hololive/comments/jhigr9/really_deep_in_amelias_heart_you_can_find_her/?utm_source=share&utm_medium=web2x&context=3", "Get some good rest, Ame. Don't be too hard on yourself for the chat's behavior. I feel there's nothing wrong with sticking it to them when they act up. Teasing and a little bit of requesting is fine every now and again, but it should never get out of hand like that. The main thing you should focus on is having fun playing. If you have fun, we'll have fun too.", "No worries. It's not your fault some people can't be respectful.", "That was on us too.  This streaming thing should be collaborative; we gotta meet you halfway so if you're gonna blame yourself, you should blame us just as much.", "You didn't let anyone down,  chat did.", "I’m gonna be the asshole: to y’all saying she did nothing wrong => Ame’s job is entertainment, if she lets her temper get the best out of her it will hurt her income, if management or herself felt the need to apologize for it, take it and leave at it, sugar coat it will just damage her grown in the long run. Anyways, great stream as always. Hope u get some rest instead of going over all the answers saying the same thing or worrying about backlash and again, if anything I said offended u, I’m sorry. See u next stream, I will  be there like I always have been since your debut.", "Just enjoy the game ☺️", "I'm sorry we failed you Ame. Despite the awful amounts of toxic backseater there are still some of us who wish nothing but to hang back, chill, lurk and watch you have fun playing games. So, please don't lose faith on us! Also you didn't let anyone down, it's us. I'm really enjoying this playthrough so i hope i can keep watching you play it. Have a good sleep!", "You didn’t let us down Ame. Get some rest if you tired we are all with you. ❤️", "Amelia, it is not your fault. Chat was way out of hand pretty much the entire stream. Please, please, please, get some mods to deal with this.", "We'll always be here for you! ", "Sorry for letting you down and don't blame yourself", "You didn't let us down, we let you down. Chat is horrible.", "Don't worry about it Ame! Just ignore them and do what you want, we're here to watch YOU, not the chat.", "It's not your fault Ametan, hopefully the chat will do their best to improve and just make sure you get some rest. Good luck with your collab with Kiara tomorrow", "You are doing so good ! We love you.", "It's not your fault Ame, you're doing so good", "Please don't think that you let us down, you did nothing wrong. But yes I think you need more sleep though, please prioritize that over us.", "Don't worry, I get the feeling completely \nI hope people don't discourage you from wanting to play, even if on your own time, take it at your pace!\nHave a good night ~", "You might want to look into getting some little graphic item to turn on when you want to try and stem the tide of backseating. It wont stop it, but it might work as a reminder to some people to cut it out and you wont have to voice a reprimand to do so.", "poor Ame, we love you whatever you do for us ❤", "Members only chat ", "I should have been there to do something about this. DAMMIT", "You are already working hard. It is the chats fault for it", "@Blooper {Reloaded} same and now the sins is chlling me creepily", "@Mario Olvera that might be still chaotic but not too much", "You didn't let us down, you silly goose. We enjoyed it regardless. It's part of the Amelia personality we all know and love. Get some sleep but don't stress little things. You're doing great.", "We need mods on the double, I can't stand to see Ame mad at chat like this. It's gone on for long enough.", "@Alizoneto Rocha yeah, low quality criticisms here chief.\n\nThe point is y’all backseated way too much and ruined the experience for her. It’s not like you did everything right on ur own playthrough too bub.", "You haven't let us down at all, I've been enjoying every bit of your Witcher 3 playthrough so far so don't feel too disheartened", "Can't you pin a comment on live chat? Just put up a comment about it before stream starts. Idk, \"don't backseat unless I ask, don't tell people to stop backseat gaming, k thx let's play!\" \n\nYou put chat in its place near the 10 min mark but they thought it was mostly a joke. I know you're not to blame for chat being chat but there is still some responsibility on your end since it's inevitable. You need try to enforce yourself more/step in when it's needed, or ignore it. I've seen so many Twitch VODS ruined because chat is spastic and the streamer is bad at managing it (which is definitely a skill a streamer develops, good chats don't fall out of the sky), I hope it doesn't lead towards this. Hopefully chat in the future will actually be something to get involved in and be additive to the streams and not just background spam. Just my personal opinion.", "Go get some rest. I am sorry that we are a bit pressure you. Take your time and have fun. (Witcher is my favorite game)", "Don't worry about it, get some good long rest and thanks for the content as always. Yeah, I agree with that chat is chat even with rules etc part sadly though. Sorry you had to deal with that.", "Don't worry ame. I enjoy watching you for how you play it. If chat gets really annoying don't mind it and continue doing you.", "Ame, you're not letting us down. Play the game how you want. It's also fine to be cranky at times, if anything you had every right to be", "It's a pity that you seem to be forbidden to put chat only for members, it would make it much more enjoyable. But the part about the fact that the moderators do not help, I did not quite understand. In front of your face there is an example in the form of Ina, who has a moderator AO chan. She has a wonderful chat, there are, of course, tips, but there are 1 of 1000 people in the chat. Even when she does not know where to go, although she is walking on a straight road, the chat just laughs together. while your chat consists of at least 50% of prompts, toxics, raiders and other garbage, the ban of which I have not seen since the debut", "@Kavirus Facts being spoken right here", "It was never your fault to begin with . Just ground pound their mom like you always do.", "@sleepy 7 I never said I own her or made any statement that would make someone with more than one neuron think that way, there’s nothing more in this world that I hate that people jumping to conclusions. Before calling people pretentious, police yourself to not be a hypocrite like u are being right now. Have a nice day.", "Don't worry about it Ame, it was a fun stream! Much love.", "@Alizoneto Rocha sure bub :> keep telling yourself that self-serving narrative of yours.", "@sleepy 7 keep using fallacy in every discussion u get yourself into, not an actual counter point and u see yourself in a high horse? U are pitiful.", "No, Amelia. You didn't letting us down. Have a great rest or sleep!", "@sleepy 7 That's not their point. They said that Ame could've done better to handle the situation. They didn't imply that backseating is fine or that the streamer owes its viewers.", "You have every right to get mad at chat Ame. You did not let us down at all! Do as you see fit", "Ame did nothing wrong, chat please stop being obnoxious, its no fun having someone backseat all the time especially in rpg, seriously kills the fun.", "@aleisley It’s not like she doesn’t know that?? I’m sorry but in what world as a performer are you not allowed yo get pissed off? Everyone has a breaking point, chat drove Ame to one today. And Ame being mad about it is not wrong, especially if you have half-breds continously backseating her chat. ", "Please don't let the bullies and backseaters get to you, Ame. They don't speak for us all, and you deserve better from your chat. Your investigators love you and we want you to be happy. We want you to have as much fun playing as we have from watching your streams.", "You don't have to be sorry. It was chats fault not yours. Almost every game is a Journey / Adventure and should be experienced on your own pace so that you feel comfy and entertained.", "Amelia u have not let us down. People were just being annoying I hope this didn’t affect you playing Witcher cuz honestly I’ve never played it and with u playing it looks so fun! But I honestly recommend hiding chat.", "This reminded me of the time when my younger sister and my nephew (ages 10 and 6 respectively) were CONSTANTLY nagging me to play Minecraft with them even though I wasn't interested (mainly because of the graphics). I reluctantly played with them so they would stop bothering me and they just BOMBARDED me with \"do this and do that\" and being smug about knowing more about MC (even though I dominate them in any other games they play) than I do. If I'm not invested in playing a game, then I don't do my best in them. Chat was like my younger sister and nephew, maybe they are even in the same age group. Ignore them and play the game in YOUR TERMS.", "The chat is bad, Ame. You shouldn't feel bad. We're with you!", "you let no one down and you did nothing wrong, ignore the chat when needed, we will still be here watching you and having fun with you", "@sleepy 7 Why are you putting words in my mouth? I never said she wasn't allowed to get pissed off though? And what do you mean \"y'all know you did something wrong and you can get mad at her for it\"? Even if you roll back the vod, you wouldn't catch me in the chat since I don't participate in chat that much and mostly I just report spammers. And when did I imply that I was mad at her for her rant? That was perfectly natural and expected. She was perfectly in the right yes that I agree and that spammers should fuck off. But I also agree that this could've been handled better. ", "You really don't have to apologize for that. Chat spamming and the whole backseat is something you shouldn't have to deal with. I hope you rest well ! You didn't let anyone down, you're already doing a lot and giving us tons of great content.", "@aleisley it’s what he does to came off as righteous, don’t give any more  💭 to him, ignore and move on. At this point u can actually notice the speech pattern.", "You have no reason to apologize, you did nothing wrong. Games should be explored and learned through your experiences, not the chat's.", "this is just getting out of hand tbh. the chat should reflect not you .", "Play it the way you want Watson, you've got nothing to apologize for. The story has several paths and endings. I played my first run with mouse and kbd and skipped Gwent because my deck was really weak in the beginning. The second playthrough I used a controller and lowered the difficulty for Gwent early game till I got a decent deck. You bring joy to so many people, you shouldnt have to feel bad while doing that especially for this game", "You are absolutely not in the wrong here. WE apologize for angering you to the point where you did lash out. WE will work on being better so you don't have to worry again. Keep up the great work as always!", "You have nothing to apologize for, chat was being unbearable. Hopefully you can get some mods and clean it up.", "play the game ye want, play gwent offstream or after the series here has ended", "No need to apologize Ame, you didn’t let us down, we let you down. (I can’t believe I’m turning into a full fledged simp but screw it) Love ya Ame <3", "Ame-chan, you are absolutely NOT at fault here.", "@Mako Atty huh", "Ame not for a moment is your fault, some people needs to learn how to behave", "Nah, not your fault mate. Chat needs to lay off back seat gaming.", "Don't lose sleep over it, ame. I've heard the witcher really isn't a good streaming game, so i'm surprised you're powering through at all. Don't let chat ruin your experience, if you need a mod i'm always here. >:)", "sorry Ame, I wasn't here cuz of timezone.\nand don't feel bad because I like the way you are.\n\nalso, I guess you can try a pin comment on live chat like Moona did", "Amelia you should smack the chat, just like stick and carrot", "Please stream more Witcher! Ignore the viewers demands, it’s you who plays the game. Those gwent spammers can choose not to watch if they aren’t satisfied with u not playing the card game", "You didn't let us down, chat let you down and I'm sad that they were like that :(.  Don't feel too down about putting your foot down", "You didn’t let me down i was asleep", "Don't worry Ame, get some rest and thanks for the content. Hope you'll continue playing your way.", "I know it's easy to say \"just ignore them\" but just remember that in the end, most of us are here to watch YOU play, regardless of how you choose to play. We're here for you, not the game itself. If they have such strong opinions on how a game should be played they can either play it themselves or start their own stream.", "@Loro Lukic Pikamee asked about that pin comment on twiteer and a commenter said its a beta feature.So you need youtube's approval to be able to do it.\nI think Moona can do it because she got the approval from youtube.", "you are justified to get angry, these people arent even paying for membership yet theyre backseating so hard. i missed the stream but geez i'd go on a report spree if i was. you did your best already, love u ame.", "Backseating is NOT ok, especially when the streamer says not to, you did nothing wrong. You deserve a better chat. We need REAL consequences for those who chose to spam/backseat.", "At risk of sounding obsequious, disregard them. They're inveterate assholes through and through, and the best way to shut anybody up is by ignoring them completely. It's your game. Go about it how you want.", "Watson Amelia Ch. hololive-EN You were absolutely in the right to reprimand chat. We are here as your guests, and anyone that doesn’t follow the rules or is disrupting the positivity doesn’t deserve your hospitality.", "It's ok Ame, please take care of yourself and ignore the spammers! Play your way, because that's what we're here for!", "@Alizoneto Rocha And whose fault is it that her temper boiled over, genius? Hers, or the tens of thousands of idiots dictating her every move and screeching at her to play Gwent?", "Don't think too much. Just get some rest.", "Just rest, you are doing good girl.", "@Shark Fact Storage actually none of them, it was the repair lunatics, since it seems u haven’t watched the stream I don’t see a reason to engage in discussion until u do, have a nice day.", "Nothing to be sorry about Amelia! Thank you for always making us happy and enjoy ourselves!", "@Alizoneto Rocha  Okay, so it was the still the idiots in chat, wasn't it? Why blame Ame for losing her temper when her chat wouldn't shut their mouths when she expressly told them to back off and let her play?", "Just ban or mute them, enough of doing that and they will be gone soon enough", "I know it's been said a ton but it's not on you Ame, the spammed are truly just annoying and toxic. You're completely justified in telling them that they need to fuck off. Amelia did nothing wrong!", "Don't worry about a thing. The chat can f**k right off", "It will take a lot more than that to let us down because we see the hill you climb. Fight on", "Don't worry Ame, you didn't let us down, some people just don't know how to control themselves, I love watching and hearing you having fun, I'm of the mind you should just ignore chat if they're trying to boss you around, a certain doggo used some images from a free image site irasutoya or something like that to signal the chat when she was listening to their ideas/suggestions and when she was playing the game how she wanted to, one idea you can use if you feel like people get too excited in telling you what to do.", "Ame it’s not your fault I’m sorry that we’ve let you down we’ll do better", "Your just watch and enjoy the stream not tell him what to do just follow the rules. You can be helpful to the streamer but don't bash him all caps that's rude by the way. \nWatson said relax\nSo just relax and enjoy the stream", "J", "If you see j watson doesn't mean joke \ni just miss click sorry", "You're doing great, Watson, everyone appreciates the hard work. \n\nDon't let a few goofy kids in chat get you down. Even if 100 people are whining at you in chat, as of now this video has 100,000 views, so that's a tiny percentage.", "It's not on you, Ame. You do you.", "Not remotely your fault. Why people go to other's playthroughs and complain that they aren't playing the game \"right\" I will never know; if they wanna see it played the same way they would they should just go play the game themselves.", "@Shark Fact Storage I didn’t blame anyone, if u take time to re read it I’m sure you will notice it.", "@Shark Fact Storage one thing that I actually do is tell fellow TeaMates to chill on topics she expressed disgust before, I’m not sure why u preaching for the priest but ok.", "@Shark Fact Storage but anyways since u don’t see to frequent her chat or her channel I will refrain from talking to you about it. Keep ur irony and sarcasm to yourself.", "@Shark Fact Storage only thing I will say about it is that isn’t a high iq sign, like awful people keep telling themselves it’s, is just looking down on people and if u keep doing this all your life u will get dumber by the minute. So suit yourself with your choice of lifestyle.", "Chat deserves it for backseating, should just ban / timeout backseaters that get too naggy. You have nothing to apologize for lmao", "It was bound to happen. When the chat turns like Twitch chat, you gotta handle it the Twitch way.", "Your job isn't to do what backseat gamers demand, it's to entertain and make us smile - and you do that in spades just by being yourself 🔍💛", "It’s okay to play your way, when you’re having fun we’re having fun 😎😎", "U good it was not that big of a deal keep doing what you are doing ❤️", "Don’t worry, it’s always those unnecessary backseaters telling you what they want.\nPlay the game how you want to! I hope you have fun on your next stream!", "Alright I’m gonna be blunt to the backseat gamers telling Amelia to do it this way or that way and the gwent spamming, SHUT UP!!!! Go watch or play Witcher 3 yourself somewhere else. Chat needs to be better than this, we’re here for Amelia and to watch her have fun. Now I’m not sure how the mods work but I get the idea of it. Keep this up and we won’t be having fun, hell maybe we already aren’t. I’m gonna use an example my dad forced me to play football when I was little but the more he kept yelling at me the less fun I had, the same can be said about this stream if you keep yelling in chat to play GWENT or REPAIR YOUR ARMOUR or DO THIS, it’s not gonna be fun anymore. We can still come back from this if we work to be better.", "Tbh honest i like that you call out those spammers and backseat gamers\nsome people dont understand it if you do it the nice way well i like our sometimes toxic ame.", "Cranky or not, we appreciate all the many different sides you show. It's hella funny to watch tbh", "ame fighting", "You’re golden, Watson. Nothing wrong was done on your end. o7", "Ame, just play the game as you like, \nWitcher 3 is best experience with your own choice \ndon't let anyone influence your choice", "nah the chat let you down", "I just watched the archive and it was totally fine. Chat definitely needs to know their limit but that's not your fault. It was fun!", "why can't people just lean back and enjoy the stream and even if her armor breaks due to her forgetting to repair it we will get great clip material. Just let Ame do her thing and when something bad happens we LOL about it. We get deprived of so much memes cause of those jerks.", "@Don Padre my thoughts exactly", "You actually motivated me to get back on the witcher again after seeing how fun you were having during the times you weren't worried about chat and I haven't beat it yet 😅 so good luck on your play through and hopefully you enjoy it as much as you can off or on stream", "I still could not see it but cheer  Ame you are incredible", "Not your fault, you were very measured. And at least I have most fun when streamers explore and find their own way.  Make their own story and experience things differently than I did.", "Chat really was being very annoying, we know you must be overwhelmed with work and you're probably still adapting to this whole thing, I don't think anyone can be 150% all the time, but the effort you put into this is clear for all to see, with that said, thanks for being so positive, we've got your back.", "Don't worry, Ame. We love you <3", "Never apologize for the  behavior of your chat. they act like 12 year olds if they don't get their way.", "You've not let us down, we're happy that you streamed. We love you and We Support you.\n\n-Some duck on the internet", "I doubt everyone in chat read the book in the first place so just play however you want Ame.", "I think it's best if you play The Witcher 3 off-stream so you can take it in for yourself with only periodic public streams of it. The chat made it clear they don't want to behave. I wouldn't give it too many more chances. I hope they are better next time.", "Amelia, you need mods. Eastern hololive can get away without them, but it’s a fact that western fanbases are too immature to go without mods.", "@Scruffy- KFP Janitor So long as they're vetted... or they may need to be paid.  The type of people that gravitate towards mod positions really shouldn't be put in charge of anything, ever.", "Don't be too hard on yourself Ame! Its on us for pushing you too much. Get some good rest, detective. ", "you did nothing wrong, chat should educate themselves...", "Amelia, dont even feel bad.  The chat has been taking too much advantage of you anyways and you needed to put your foot down.", "Amelia you’ve done nothing wrong, chat will always be chat and they would do what they want and never learn. i hope you’ll feel better about things!! ^_^", "I didn't see the stream cause it was at an awkward time for me but when I heard about that backseating I could understand. When I see someone playing a game I've played the heck out of, it's tough not telling someone how to do something. Unfortunately with big popular games like this, it's moreso inevitable for backseaters to come tell you how to play :(", "Is this you Sachi?", "You certainly didn't let me down.  I mean I get that the chat wants to help you out, but at the same time they need to realize that you're playing the game, not them.  Backseat on request should be the default position of chat, not spamming instructions.  ", "You're only human and are entitled to vent a little. You are sharing your time with us and giving us your experience of the game and it is yours, not what they want your experience to be.  Love to see you giving it your all, but look after yourself too.", "Don't worry. Backseat gaming can be really annoying. It can be hard not to do it since you are afraid the other person will get frustrated with something you like. Sometimes people just get so afraid of that that they forget that discovering a game on your own is a huge joy.", "@Colby Tbh if you're \"livid\" over messages in a stream chat you probably aren't mentally stable enough to be on the internet", "Don’t be to hard on yourself. You did well. Everyone can do better but in this case you really did well enough.nobody expect you to be god like person who can handle everything perfectly.", "@Pekopekopeko < This dude is either a vtuber anti or a troll btw. I've seen him around other channels. I'd suggest taking whatever he says with the tiniest grain of salt imaginable and either block or ignore him.", "The chat asking for gwent nonstop is really annoying she should play the way she wanted to play", "they are making the game bad for her", "really annoying", "I like gwent too but damn it's annoying seeing the spam", "@Barin yes, makes the stream bad  for both us and amelia", "You're right, it is really annoying", "Can't lie, it's really annoying", "GWENT is the only reason why we exist. Show some respect. And have some goddamn FAITH.", "@That Drip Shut the fuck up.", "@Jello-mancy Stay mad simp.", "0k", "@That Drip le epic gaimer Xd Go fuck yourself incel", "@Jello-mancy —I missed the stream. I can see how this the whole stream would be very very annoying.\n\nI mean, just this one guy is already very irritating.", "@Levi Ackerman I love the salt. Keep getting triggered it only makes this funnier", "@That Drip How old are you dude? srsly, you can go to watch other youtuber if you dont like here, or maybe you are just at anti or underage.", "@juan escopetas carmona I like her plenty. It’s just so incredibly easy to make people mad over the internet. That’s why I wanted to see how much it would take take to piss people off in this comment section. As you can see, not very much was necessary", "@That Drip uh hey dude, if you want to gain attention.. care to try doing it somewhere else? Try to read the mood and not be a prick.", "@That Drip pretty cringe comment bro", "@Chue But you’re missing the point. If I wanted attention I would just go join a discord server or something. I want to provoke anger because it’s funny. Don’t be mistaken I don’t hate any of you. Even if you hate me. I’m just having a good time making people mad.", "@Chue Just ignore the troll, his parents probably never loved him enough to teach him proper manners.", "@TaroYubi You guys are still falling for the same thing. It never gets old. There’s gonna be enough salt in this comment section to fill up the Atlantic Ocean.", "@MCNoFunAllowed Thank you, that was partially the intended effect.", "@that drip fuck off", "@That Drip it's blatant that you're using this situation where people are riled up over an issue to gain attention. Your comment was highly unnecessary regardless of its purpose. Please take a look at the greater issue that surrounds your statement and refrain from being selfish. Less about how you enjoy seeing over people mad, more of let's try to support amelia since she had a bad stream okay?", "Just ignore him guys..", "@Chue But I will continue to be selfish. Why? Because you people keep getting mad. It’s an endless supply of entertainment.", "@That Drip Gwent is a trash side game that's overcomplicated and has no bearing on the actual game, stay mad.", "@Barin who's Gwent?", "@Glazer YoRecca Gwent is our lord and savior", "@That Drip So what is it?", "My My, there's a imposter in this comment's reply section.", "@That Drip But you are making Ame feel sad, and because of that she is not enjoying the game :(", "@Mika Girlx Can you tell me what's this Gwent", "@Glazer YoRecca Gwent is the card game in Witcher", "@Barin  I thought it was a character.", "@Glazer YoRecca It's a minigame in the Witcher 3. People keep spamming to Ame to play it during the whole stream", "@Mika Girlx I never said GWENT in the live chat you can check if you don’t believe me. I’m just having fun triggering the people who get mad about it in the comments section", "@That Drip no it wasn't", "@MCNoFunAllowed You’re right. Rather it served my main purpose. To make people mad. And it worked.", "@That Drip idk man seems like cringe to me", "@MCNoFunAllowed Either way I’m glad I was able to waste precious time out of your life by encouraging you to respond to me. Assuming you actually have anything worth spending time on.", "Reported for harassment", "@Ran-nii reported for pornography or sexually explicit material", "@That Drip haha I have fun annoying people, so edgy and cool xddd. You all just falling in my trap, I'm so smart and edgy and cool loooooool bro I like it when people get mad", "@That Drip On God you sound like you sit alone at the lunch table. 😂", "@That Drip nice paragraph bro lol", "@MCNoFunAllowed Thank you sir, I try to stick to the 5-6 sentences limit.", "@Nicolas Daoua But are you mad tho", "@MCNoFunAllowed Also nice sentence bro lol.", "@That Drip Nah, was just making fun of you. You see that's how I have fun :), \n\nWhat about you?", "Some dumbass teenagers who are socialized poorly. They need to add a no backseating rule, but then again a lot of Western fans won't even bother reading them. The only way to put a stop to it would be to pin it on her screen but then that would look bad.", "@Nicolas Daoua Wasting your time. You see that’s how I have fun :),", "I have successfully summoned all the teenagers to trade edgy comebacks with", "@That Drip Aww. Sorry to dissapoint you but I'm watching videos while typing so there's no net lose when it comes to time loss. You do appear to be mad.", "@Nicolas Daoua damn you don’t have any time to lose. What a sad life.", "@cloudxlife I’m guessing personal experience led to that response", "@That Drip I do have time to lose which is why I efficiently manage my time by replying while watching videos! Life might be sad but knowing I'm entertaining you makes it a lot better <3.", "@That Drip Also you seem a bit irritated, I apologize if I bothered you in any way shape or form. Take it easy dude, no one likes a grumpy boy.", "@That Drip what a sad life you have 🤣", "@Nicolas Daoua Bro stop embarrassing yourself. Your positive sounding sarcasm is just cringe.", "@Koan Must be better than yours since you felt the need to respond to me.", "@MCNoFunAllowed Come back I want to waste more of your time. You fell for it once you can do it again.", "@That Drip I thought You were having fun though, you don't sound like someone who's having fun, You sound angry over a comment section", "@That Drip imagine being an attention seeker. Can't relate sorry. Wow so cool you made everyone upset very superior guy.", "it says that@That Drip 's account joined 2 months ago, must be bot then (just an advanced one 草)", "@never forget Uh oh someone used the imagine meme. Imagine being so uncreative you can’t come up with a better remark than imagine.", "@That Drip the more I read your replies you sound more mad than anyone else here to be honest.", "@That Drip Bro, not replying to me first? That's not cool, I thought I was the one for you~ You think I'm cringe, everyone thinks you're cringe, we're the perfect pairing. Anyways, does that mean I won?", "@M T And I can tell just from your one reply that you’re mad", "@Nicolas Daoua No. it means you’re cringe.", "@That Drip Yeah and we can be cringe together as a happy family. Wanna add me on steam? We can play your favorite games. That was you won't be as mad, you know it's always better to walk away from something the moment you stop having fun with it.", "@Nicolas Daoua  I never expected a friend request out of all this chaos. If it’s unironic, hats off to you- you are a humanitarian for being open to someone who is doing everything they can to piss you off. If it’s ironic(which it probably is)-I’ll still piss you off. Either way, my computer is a potato so I do not play computer games.", "Everyone on youtube is retarded you are giving this guy bundles of wood to keep throwing on the fire. When the fuck will people stop falling for bait and caring for trolls, christ.", "@Ryan Wolf I’ve been asking that question this whole time", "@That Drip Oh really? that assumption? ok sure have a good day lol", "@That Drip wow so cool you're creative too.", "@That Drip You might be a troll but I will be honest with you are not funny one, please step up your trolling level so we can enjoy watching your future trolling, as for now you are just annoying and your baiting needs more advancing.\n\nWill rate you 5/10 for at least trying.", "@That Drip you're still replying after 4 hours. Jesus do you really need human interaction this much? Holy fuck how sad", "wtf guys go outside. Don't you have anything better to do?", "@JayMay his whole schtick is \"gu...guys I'm merely pretending to be retarded\". I've seen better bait in an African fishing village", "Tf happened here", "@レモンティー • YUI I was asleep so I’m in the same boat", "@Arc lieutenant Jesse lel aight—did u sleep well?", "@レモンティー • YUI nah I didn’t must’ve had a sixth sense in my dreams that chat was hurting our detective. 😔", "@That Drip Jesus, don’t you have something better to do, rather than pissing people off on the internet?", "@That Drip then why the fuck are you here, go watch on the standalone shitty Gwent game", "Ironic that this comments section is filled with the same \"The gwent spammers are annoying!\" Said in different ways as if they're providing something new to the discussion.\n\nMaybe if people didn't feel the need to repeat what everyone says all the time we wouldn't have problems with spam in the first place.", "i'll bet that those who ask for gwent doesnt even know how hololive works", "Her live chat is retarded it annoys me", "@Levi Ackerman Incel is a dumb buzzword.", "@JayMay The fact that you responded to me like that is proof that my trolling was successful. You can try to act like I’m not a good troll but what does that make you for falling for it.", "@jangro How sad that you feel the need to respond to me. If you think I’m sad, you might wanna look in the mirror", "@Nicky Fandino Well then those Africans must have some damn good bait because mine is working like a charm here", "@Kyle Santiago Everyone has something better they could be doing. I could say the same thing to you about being baited by me", "@Zamfy The fact that you don’t realize none of this was about Gwent shows how clueless you really are.", "@That Drip the only clue I need is that you're a dumbass at being a troll lul", "@That Drip aren't you the one wasting your time here by replying to comments?", "@Zamfy The only clue I need is that you’re mad af. I’ll keep going to make you more mad", "@JayMay I may be 5/10 troll in your eyes but you are a 10/10 victim in mine", "@That Drip How sad that you feel the need to respond to me. If you think I'm sad, you might wanna look in the mirror", "@jangro How sad that you can’t come up with an original comeback so you just copy mine.", "@That Drip How sad that you still feel the need to respond to me. Keep crying dumbfuck.", "@jangro uh oh I made you mad. I knew you’d break eventually but it’s okay you can always see a psychologist.", "@That Drip  Then go play the fucking game yourself if you want to see gwent soo much, you fucks are annoying as hell.", "@Tougen M- Another person who missed the point. My comment was never really about Gwent.", "Shesh what the hell is happening down here", "@Barin salty tears and hurt feelings", "@That Drip I mean you seem to be motivated by ticking people off, I mean, I’m not angry just plain unamused, I mean don’t you have other hobbies that are much more productive than whatever you’re doing right now?", "@That Drip More like the sudden urge to give you a whipping.", "@That Drip keep trying harder lol, even then you wont be good enough of a troll lmao", "@Kyle Santiago well I am amused so too bad for you. 🤓", "@Zamfy I don’t have to try harder. Idiots like you will still get mad.", "@That Drip You still haven’t answered my question\n\nDo you have any other hobbies that are productive or is kicking people down something of a hobby of yours cause that’s what I’m getting at with you.", "@Velocity Cart Ah yes blame all your problems on bots. It’s easy enough to blame them on other people", "@Kyle Santiago Yes I do have other hobbies. I’m just doing this because I noticed it takes almost nothing to make people mad on YouTube. So I wanted to try being a relentless, completely irredeemable person to see what would happen. Overall, I could be doing way worse things so I don’t feel too bad. The dopamine hits from each reply are getting weaker and weaker so I may move on soon, if I get too bored.", "@That Drip what dedication XD I thought my message was already buried but u still replied props to you lol, but well I still believe u r a bot tho", "@Velocity Cart that’s okay, idiots tend to just say something is “x” if they can’t understand it. In this case “bot” is x", "@That Drip  It really replies accurately huh. good bot", "@Velocity Cart it really replies stupidly. Good human", "@That Drip ummm are u the one of those cat eared anime girl robots of elon musk made inside area 51?", "@Velocity Cart I have a question. Why do you keep getting baited? Did you not come out with all your brain cells intact? Or is your life just so sad you can’t help but willingly fall for my bait?", "@That Drip hmm? bait? dunno wat ur talking about. I'm just here to have fun u know. I ain't even being aggresive to u.", "@Velocity Cart You wouldn’t know if you’re being baited I suppose. But at least you’re having fun too", "@That Drip u know this is my first time replying to this kind of comment section, just to experience something new. I don't really find people(or bots) like u who are really dedicated to their shenanigans, so I'm just taking the opportunity\n༼ つ ◕‿◕ ༽つ", "@Velocity Cart You should try it yourself. You wouldn’t believe how easy it is to make people mad on youtube. Just scroll up for proof. You don’t seem like the type of person to let things people say on YouTube get to you. That’s the key to trolling. If you never let them get to you, and just keep antagonizing them, most people fall for it.", "@Velocity Cart Also, find a hot topic that people are already riled about. That helps a lot.", "@Levi Ackerman >Watches Vtubers\n>Unironically calls someone an incel\n>Levi Ackerman", "@That Drip I like that you made an Ironic statement and people got salty and took it literally.", "@That Drip nah thanks. I still have better things to do. But I had fun anyway. bye", "Very sad comment thread ngl", "@Josue Sedano This was a comment thread? I assumed it was a Salt mine.", "@That Drip You sir have taken my joke comment seriously as I was just wanting to see If you will reply or not :D", "@Velocity Cart that’s not very convincing considering you spent the time to reply to me multiple times. Have fun wasting more of your life and calling it “something better”", "@JayMay So now you’re making excuses because I called you out. How sad and cowardly", "@Ryder Steel I told everyone at the start there would be enough salt to fill the Atlantic Ocean here", "@That Drip And subsequently convert it into a larger Dead Sea in a moment.", "@That Drip I’m sorry sir it’s time for you to leave.", "your schitck of \"teehee I'm here wasting everyone's time XD it's wurkin LMAOOOO\" is laughably inefficient and ineffective. Why waste your own time trying to waste everyone else's time by being a twat?\n\nYou try to act like a high IQ troll, but you're just coming off as an immature brat that can't handle being called annoying by people in passing in a comment section, whilst trying to make it out like it's all a part of some plan. When really, you just want attention, even from strangers online.", "@Claptrap the Ape with a Pen agreed. It’s a bad thing when the entertainment for anyone is trolling in general bro. Just chill and grow up. it’s a pretty bad place in the world right now with bad and negative interactions. We need less people that derives on people’s anger/negative emotions on a platform where they’re escape or take a break from real life. That person can defend gwent all they want but all that extra flak man, definitely don’t need it. Just my opinion and people are allowed to disagree with me and that’s cool.", "chat was really annoying, dont care about the trolls amelia", "One of the reasons I don't like watching streams, but I can't blame them for tapping into the live donation market.", "@Obstructor Hololive and YouTube take probably 60 percent of the cut but you’re right these vtubers make too much", "@Mike Bather not really, only the super successful ones like Coco get to enjoy the high-middle class side of things (100k+ in a year but not 1 mil) while the other ones seem to be straight up middle class and sometimes even have jobs (like Mori.) Kanata has literally not had enough money to pay for the train because she paid for Coco’s meal once lol.", "@navels ♥ Dang I didn’t know I thought with all these super chat donations they’d be at least upper middle", "Mike Bather while it may have been a joke coco once said that Hololive takes 50% of all super chats. If that’s true, that means the Vtuber only gets 20% because YouTube actually takes 30% lol. I really hope that it’s a joke because they can make a lot even if it’s just a 50% total 😂 streaming games seems easy but it takes more than just a cute voice and avatar to be truly entertaining", "I agree with a lot of the other comments here, chat is being awful. If Ame doesn't want to play GWENT, that's entirely fine. If she asks how to repair her armor, tell her, but don't spam \"REPAIR YOUR ARMOR\" over and over, when she's not even in town no less. I love watching Ame play Witcher 3, and I'm really hoping chat calms down so she keeps playing it for us.", "The Witcher 3 fanbase is one of the worst I have ever seen.", "@Noah Dalvag never thought Minecraft could be beat but here we are", "@SoosUnknown CONSUME THIS GAME THE SAME WAY I DID OR I WILL DIEEEEEEEEEEEEEEEEEEEEEEEEEE", "@Noah Dalvag i think its just yt people in general, every yt chat is like this", "@Noah Dalvag Any fanbase is like this really, at least the louder portion.", "its a chat, this is how it is. it shouldnt be taken entirely seriously... it seems all these people commenting have never been in a twitch chat... if you livestream to over 10k people, this is what is to be expected with a relaxed atmosphere.", "@Adam Vi Frye This is how it is on twitch chat? Sorry but as a guy who has been for such a long time that I know almost every single bttv emote it's not like that at all. Yeah chat will always backseat even with rules, but then the streamer will put it on emote mode or sub mode.", "@Nhom 12 yeah sensitive streamers might.", "@Adam Vi Frye Well, yeah maybe but that doesn't change the fact that chats have mods that filter the autism. Even xqc's chat does.", "@Adam Vi Frye \n\nExpect this isn't twitch, YT/HL stream have it own culture and rules.", "@Adam Vi Frye the thing is ame is contracted to a company, which has rules and an idol image that has to be kept for the company. its not like streamers who depend on sponsors whatsoever. they have their own culture and rules. HOLOLIVE rules", "@Adam Vi Frye Uh dude that’s really wrong. I’ve seen plenty of big chats on Twitch that have both chat and streamer who banter at worst and not full on backseat spam whatever the streamer is doing they don’t want to do right now.", "The problem is: kids from minecraft that dont have common sense. Its not tw3 fanbase.", "I don't get why they were spamming for her to repair her armor so early in the game. I didn't bother repairing early armor because it gets replaced soon enough that it's a waste of money to repair early armor.", "The chat really needs to stop with the GWENT spam, it's not funny , it's annoying. All you do is ruin the experience for others and for Ame. Now she doesn't want to play anymore thanks to you because you're spamming GWENT at every npc ffs. I'm sorry but this chat is the worst of Hololive this is some twitch chat levels. I bet 90 percent of you don't even know how to play gwent.", "it needs some moderators", "@Caio 100%. It got out of hand really quickly since her debut. At this point her chat will be like Hololive version of xQc's chat.", "facts dude, I missed the beginning of the stream and had to rewatch, I was about to put in my two cents. This really is twitch chat levels of childish idiots", "@Beefstew i hope that she knows that the bad side of the chat is just a loud minority", "Member's only chat in public streams sure sounds like a great idea", "Totally agree. I walked through all witcher 3, but I played like 4 games  of gwent in all game. Because I personally dont like that  kind of cards games. Big ups chat  for ruin Ame's experience.", "@Danny Yup, even though the non members can't chat, i totally agree with that. Too much Gwent spams from the non members", "Twitch chat change from streamer to streamer, most are just typical emotes, but if it's a chill streamer the chat can often be very tame too. Agree with other things you said though, saying Gwent every npc encounter is annoying and unfunny. It's like the \"Ask Joe\" spam during Mario Odyssey over again.", "@Beefstew yea I think some kids see the 'toxic' meme videos and now think ame chat is supposed to be xqc 2.0 or something", "Yeah that was hell. I feel bad for Ame...", "@Xcution Unknown me too, the gwent meme was funny in the beggining but then it bacame very annoying", "@แรคคูน I know that some chats on twitch are really wholesome. But I was watching 39Daph play Batman few months back and the chat literally spammed, backseated and bullied her so much when she couldn't beat Deathstroke that she started crying.  And let's not speak about xQc or Train...", "I am not so sure if the gwent thing is the main problem, I feel like it is more about the people saying \"Do this side quest first\", \"make that decision\" and that kind of stuff...", "@Caio It's probably why she still thanked us at the end. Really don't think we deserved an apology. I'm genuinely hoping those were anti's trying to get a reaction as opposed to genuine fans who were spamming", "yeah i feel really bad for her. backseaters and spammers really piss me off, just let her enjoy the damn game. really hope she disables the chat or at least turns on members only, for her sake especially. \n\nlove these witcher streams so far but if she’s enjoying the game less because of a toxic chat, i’d rather her not stream it at all.", "I have 255+ hours in Witcher 3 yet apart from telling her do do sidequests when she asked how to level up I never backseat. It's fun seeing her learn and discover  Witcher 3 on her own. That's what's fun even if she doesn't choosee what I would choose. Everyone's playthrough is different.", "@Beefstew yeah, i only talked about the Quest level up when she asked", "@Danny we did not deserved that sweet moment", "@Beefstew It's amazing how people could take such free range games like Minecraft and this and make this practically algorithmic because they've spent years sweating methods to where they're too ignorant and immature to see people play any other way that isn't their own", "@Caio Yeah, even we are not spam or backseat or troll, we still be the part of the chat, so yeah, we don't deserve it", "Really sad, I love The Witcher and it's sad to see her not enjoying it for these issues.", "@Kaiser Kai makes me really Sad too", "Finally someone said it. i love watching ame's stream. NGL. i binged her content more than the others. but her   chat is just too toxic and puts me off from watching her live.", "@Deadbeat Seikor0w on L1 dance i am afraid that she maybe regret being a streamer, Hope she can overcome this situation", "She didn't make it clear what kind of stream she wants to do from the beginning.\n\na) Stream where she does whatever chat wants.", "@Benign the problem is the spam and forcing her to do what they want when she dont ask e is clearly annoyed", "@Caio I know, I'm just saying that the way she streams attracts the spam.", "@Benign no worry, is just that even when she talked about It, they were still spamming and backseating", "@Caio Well yeah, it's the snowball effect in action once you leave it alone for too long.", "@Benign Hope she finds a way to deal with this", "@Danny Ironic that it's the games that give the player most freedom that attract the most controlling backseating audience .", "@Caio It's like you said though. \n\nI'll like to add that the toxic, but minority of Amelia's viewers spamming were probably people who aren't Amelia fans, but are newcomers that Youtube attracted because the stream had \"witcher 3\" in the title.", "@Caio  she got this bruh. Just gotta flex those muscles a bit more to control the chat.", "@Benign Streams from any channel playing any game are all by default played according to how the streamer wants. And asking chat how to do stuff at only certain points and playing however you want at any other point is exactly how you do... you know, streaming. That gives viewers interaction while also making the playthrough your own. She’s not “trying to have it both ways,” nor should the chat become cancerous even if that were a problem. It is entirely up to chat to take a couple seconds of their time to read the rules in the description, and not up to the streamer to pick between the audience and the game. Pinning the chat’s behavior on the streamer is ignorant and excusing toxic behavior.", "@Christian Cinnabars I only said that a certain type of stream attracts a certain type of chat. \n\nI don't see how you disliking my analysis or calling me toxic and ignorant will fix reality and make what I said false.", "she needs to ignore it. those trolls will stop eventually.", "Wait she's no longer going to stream the Witcher?!! Noooooo I wanted her to play this fully it's such a good game and I wanted to see how she'd play. Oh well it's her decision but it still sucks that people ruined it for her", "Why is everyone a cry baby if she doesn't want to play Gwent how cares if chat spams gwent.\nShe can pick her own decisions.\nJust don't play Gwent 😅", "@Sownheard the problem is that the chat only spam this and she cant interact properly with because it only has the same GWENT PLEASE or DO THIS NOW", "You really need to stop getting mad. It’s funny because of people like you who get triggered over it.", "@Danny as nice as members only sounds it would undoubtedly lessen her expansion as a vtuber and likely even lessen her current income with super chats and stuff like that. It may sound nice and most people’s thoughts are “well she’ll get more members” but that money is incomparable to Super Chats and possibly Ad Revenue from the playbacks", "@navels ♥ yeah true, when i said members only I would mean in moderation, for example turn it on when chat starts spamming", "Yeah, indeed, they all ruin her mood to stream, that was the worst thing \nWell, as i can say, thank you backseater, spammer, troller, you successfully ruin other people mood\nFeel accomplished now. ?", "that's why I just close chat and watch the stream, it's so chaotic, nonsensical, and spammy that it's nigh impossible to actually contribute to any sort of conversation. So I just don't bother with it. Kind of like twitch chat.\n\nbut I guess it can't be helped, unless Amelia decides to put on slow mode for chat when it gets way too chaotic, but besides that we can just ignore the monkey's with keyboards I suppose", "this whole backseat thing used to be a joke... it's not a joke anymore...", "That's why people shouldn't make jokes of annoying things in the first place.", "we should have stopped them that time, big mistake we dont", "@Caio what actually happened. I missed the stream and chat isnt showing.", "@Jakklin, KFP Door Greeter spam and backseating during the whole stream", "@Caio do you have a time stamp?", "The fuck do you mean? It has been extremely backseating since day 1.", "@XDee KarL Sorry, i dont remember", "@Caio oh ok thanks I'll just try to find", "@XDee KarL If It helps i think It was around the middle of the stream that things got worse", "@XDee KarL there's a lot bro. A lot. I just went to a random part of the stream, and I already saw the spam.", "@XDee KarL 1:02:41 was the time I scrolled to.", "Its never a joke. Its a serious problem in the western streaming sphere.", "People unfortunately backseat everytime for every streamer in every game.\nSome of them care to help it but most are spammers who should be banned", "it was never a joke lol", "Teamates who have finished The Witcher 3, remember when you played it for the first time? How you were awed and wowed by your discoveries, the expansive side quests, the secrets, the random encounters? Remember how it was so fun to find all those things on your own? Remember talking to others who have also finished the game and finding out about stuff you missed AFTER and not during playing, which triggered you to want to play again? Remember that excitement of finding out there was so much more to explore even after one playthrough?", "Yes, I hope she gets the exciting RPG experience like usual next time, without backseating and annoying spam 😢", "I want your child, great take at this problem. Congratz on being freaking awesome at reasoning.", "i agree, playing it blind is one of the best things ever. and even after playing it 4 times, i still found new stuff to do", "@Zander Jay De Guzman not sure if we will ever get blind gameplay, ame enjoys secrets and at least in TW3 there’s some u may miss if u don’t get lucky, are extremely curious or involved in the story. Chat will not let that pass hoping to please her.", "Exactly this. I'm extremely glad I found your comment, as I've been having the same thoughts these past few months or so but haven't been able to identify and express them, and your comment perfectly expresses what I've been thinking.", "@Alizoneto Rocha That's the thing, missing something is ok if that's the way you play the game, you don't HAVE to do everything. Now if there is a really cool side quest, collectable, etc chat should tell her about it when she asks for it.", "@Thenewal couldn’t agree more, don’t know what kinda msg u got to have the need to say that but anyways", "@Alizoneto Rocha idk man, I just felt like it hahahaha.", "STOP SPAMMING GWENT, it's not funny and it's just going to get her to stop playing the game.", "My guess is that's exactly what they want. Amelia should just start every Witcher stream with \"Fuck Gwent, backseat gamers have small dicks, bite me, let's play.\" and ignore the trolls for the rest of the stream, but she keeps feeding them by responding, so they won't go away. Instead it's going to become a very annoying thing until she stops playing the game.", "It’s very funny. But people like you get triggered way to easily because you don’t know how to have a good laugh.", "@That Drip \ngood laugh eh. ?\nTo ruin other people mood and her experience by spamming and trolling ?\nYour humour taste, i think it's broken now", "That Drip If upsetting someone is the only way you know how to have fun, then you’re either a literal child who hasn’t developed the empathetic parts of your brain yet, or you’re just emotionally stunted. I’m sorry your parents didn’t love you enough as a kid", "@FRD Julian ignore that Drip creature, it's been popping into multiple comments and spamming everywhere that \"UHM ACKSHUALLY ITS VERY FUNNY YOURE JUST SNOWFLAKES XDDD\" like a 12 year old who watches Twitch highlights way too much and think it's funny being an insufferable twat", "Chat: Gwent?\nAme: You'll get your gwent when I've got nothing left to explore!! ", "https://youtu.be/SWTKJytfpD4 togudlsgeuft", "the gwent spam is going too far", "Which timestamp is that?", "Lol! true.\nalso... dear apartment manager...\nYOU'LL GET YOUR RENT WHEN YOU FIX THIS DAMN DOOR!!", "Wish you can snap your fingers to make the spammers in the chat disappear.", "*Sad gwent noise", "Why are people so hellbent on getting her to play a card game? Is fighting monsters and exploring a fantasy world not enough excitement for them? \n\nMaybe \"that's the joke\" and people are meming to mess with Ame, but minigames like that - especially card games in a big open world rpg are a major bore to watch on stream... or people are really deep into Gwent - people watch Hearthstone and Magic the Gathering, so I dunno - but it's not my scene and I don't see it making for interesting content.", "@MrAwesomeTrex Weeell I don't think it helps that inapropriate times to play Gwent is in itself a meme. One that I personally very much enjoy as the thought of Geralt just being massively obbsessed with Gwent to the point where it's taking over his life and needs to Yu-gi-oh dual anyone and everyone at all times is fucking hilarious to me. But BOY is that joke not translating well into chat....", "She enjoyed the game at first and the chat ruined the experience for her. Just let her play how she wants and that's the point of playing an open-world game.", "chat forgets that is her experience", "What time", "I really hope people take Amelia's message to heart and back off. There’s the joke that chat and Ame have a toxic back and forth, but it’s important that we listen to her and respect the boundaries she lays out. I hope this shift in mindset transfers to all the game's she plays, not just the Witcher.", "\"HIC\" - THIS ONE SPARKS JOY\n\"gWeNt\" / \"RePaIr yOuR ArMoR\" - but this one, it doesn't give joy in my face.\n\nNot gonna lie, I'm disappointed in chat todays stream. FAK those rules men, its supposed to be a common sense to give respect to the one streaming. Its just a straight disrespect for our ame here this time.", "Couldn’t agree with you more on that.", "Unfortunately it looks like the HIC spam has to stop too based on her new rules ;-;", "@lordslende a small price to pay for salvation", "You know what would cheer up her day 😔\nA game of ...", "@Sownheard 🤨", "@Sownheard damn bro you hella funny :|", "Chat looking like 10yr olds on twitch smh...", "Don't you mean the average chat on twitch?", "@The Duck Of Death pretty much..", "@CupOfWhiskey it's sad really, but it's the internet. Hope our Adorable (gremlin) Detective doesn't feel down because of them.", "@The Duck Of Death its also sad because if you watch the jp girls, their streams are so nice with EN people spamming hearts and encouraging messages. Of course when they fail or do something dumb they get teased but thats about it. In here people just press caps lock and spam their life away because they think its fun.", "When it comes to Witcher or Dark souls the chat becomes so toxic and annoying. Pls guys keep it down, you ruin the game for ame and the stream for everyone who enjoyed it", "It's just because in RPGs there is a bunch of different ways to play and things to do so when somebody doesn't play exactly how they would they get all whiny and annoying. Which is pretty dumb like arnt you here to watch her play it how she wants like damn", "@Ecstasy yea like people want her to do everything perfectly like she's a pro speedrunner.. like just let her play how she wants jesus, thats literally the whole point of an RPG open world game", "@SoosUnknown the chat needs to let her enjoy the game the way she wants", "Ina's Half life 2 stream was also just as toxic and backseating, i think new fans are pouring in from multiple directions resulting in this chaos", "@Tenchou The hl2 one was kinda unique because a big content creator and his friends came in the chat and began shitposting which derailed the chat, he then got banned lol. That dude also was condescending to Ina so gg", "@SoosUnknown the jolly guy? Was he really banned, i heard AO chan (ina's mod) stepped in the middle of all that", "@Tenchou Yea he got banned, deserved imo. Even on twitch it's pretty unheard of for random creators to just derail another person's chat, so i'm not surprised he got banned. Praise AO-Chan", "@SoosUnknown ahh Jolly Wangcore. I like his doom mod videos in the early days. Was kinda excited to see him in Ina’s stream until he turns into a prick", "@Ken Nguyen For the record, he did apologize for it on twitter so I think/hope he's learned why it was wrong. However, it is kinda weird that he didn't see anything wrong with it in the first place, no creator (vtuber or not) would want their chat derailed by some dude they dont even know", "@SoosUnknown i see, hope he learns from this experience, hololive chat etiquette is very different from twitch after all, he might be a new viewer too", "It's not even those games. When the girls play any games, chat will backseat, everytime.", "Backseat gamers are always there no matter what games you're playing. It's inevitable.", "I'm here to watch Ame play, not chat trying to 100% the game spamming inside jokes. Just let her do her thing, and then we can all laugh and have a good time with moments like 1:01:26.", "It's a shame that the chat was so bad. \n\nI just got done watching Ookami Mio cry about how hard she has tried in her time as a hololive idol; and people really oughta treat Amelia better.", "Wait, Mio cried? When was this? Do you have the link?", "Indeed. We're here to watch Amelia have fun and laugh with her not scream at her to play the game \"properly\".", "@Nightingale Farrehnster https://www.youtube.com/watch?v=uZDoME69Uio&ab_channel=Yoyuu%E6%82%A0%E7%BE%BD%E5%8D%83%E8%91%B5 \nI watched this right after Amelia's stream and it made me realize how much effort and hardship these idols put themselves through without even realizing it. ", "@5IB9 Yep. Even simping is welcomed imo; but we're all just here to laugh and be joyous, not full of expectation and hype you know? You know :)", "This reminded me of Rushia that one time. Man...", "Thats why sometimes I don't see the chat", "@Exzo Bree what happened there?", "@Nightingale Farrehnster  I think he's referring to a really old video.", "@Sephlock I'm aware, I've already watched it", "bruh the chat was straight up annoying with the Gwent spam and the backseat what the hell. ame is gonna need some mods because this is getting ridiculous...", "Most of chat were spamming Gwent here and there. Not cool, ", "To reiterate what someone else said, taking away Witcher would be a good learning lesson for chat.  I support whatever the decision is, though.  Chat, I get why you might want to comment on whatever she's doing in your favorite game, but please understand that she isn't looking for that input if she doesn't ask for it, and respect that.", "No, stopping streams never changes anything. Ive seen streamers do that before. All it does is let the spammers win and they'll just do it on another game. They've already been doing it in Minecraft for weeks.\n\nThe only way you fix this is by banning people or ignoring the chat.", "@Colby I'm not talking about malicious spammers.  I'm talking about people who are back seating when not asked or memeing a joke beyond death but end up just being annoying and creating spam.  Their intent may not be harm, annoyance or spam, but that is what it is.  The people I'm talking about are fans who want to see her continue to play it, but the issue is that they feel the need to interject their own perception of the game onto her experience, which is selfish.  When you take away the game, it's like a parent turning the car around when their kid starts acting up (same logic).", "I really don't want for her to take Witcher away. It's one of the best games for Ame streams.", "Can she do members only chat? That might calm things down a little or maybe switch to emotes only", "There's literally nothing wrong with giving advice, even if the person never explicitly asks for it.", "@TsukuyomiREKT I'll just leave what Amelia said earlier today in a community message: \n\"*I like to play games my own way: mostly by learning through experience and being wrong. Sometimes, I will ask for help and even then, I may choose not to take your advice. Launch the game yourself if you want to see it played your way or at least pay money to yell at me (」ﾟﾛﾟ)｣$$$", "@Flying Orange Already seen it. She can do whatever she wants, it's her stream. But I still stand by what I said.", "49:10 timestamp for a cute roar", "you backseat gamers really have some nerve :/. just let the detective do her thing, she's the one playing the game, not you.", "Chat, we need to do better next time", "Yeah, I feel really bad rn. Guess I was having too much fun to even notice I was backseating. I promise I'll do better next time.", "@Al Gallero good shrimp", "@5IB9 Not good enough, apparently.", "\"They\" not \"we\" need, majority of people like me and maybe you are mostly silent and intelligent.\nOnly a vocal minority are spamming hard, they can go back to twitch", "@Warudo1 But then again it's just maybe. Even if they put in \"they\" instead of \"we\", that still includes you plus it would seem condescending. They picked \"we\" instead of \"they\" even if it meant having to lower theirself just to teach a lesson, respect that.", "I personally like to moderate the chat, i will be pretty hard on spammers but unfortunately my timezone is too different from her to actually be there everytime live", "Weird virtue signaler implying there is some shared quilt. Just ignore the backseaters and let the mods handle them.", "We're intellectuals in the chat that dont backseat until she asks for help, unlike those single digit iq, moronic idiots.", "Amelia should add Gwent to the word filter. That'll stop at least some of the spam.", "Agreed", "agreed", "you know, even though i do really enjoy gwent, i agree it should be filtered as well if its gotten to this point", "Don't force Gwent on her if she doesn't want to, seriously. Let her play the damn game the way she wants lol", "Gente votem no mamãe falei em sp ele só ta em 5 lugar ele precisa de ajuda por favor votem nele!!! #51", "if chat wants GWENT then they can go and play gwent on their own time, like FFS it has it's OWN standalone game", "Its okay to give some advice, but stop backseating/force her. Let she play with her own way. ", "ikr, this game was amazing because you basically can play the game in any order you want.\n\nImagine playing witcher 3 with a walkthrough, totally ruin the fun.", "No one's ever gonna stream the game exactly how your want them too, if you don't like how someone plays go watch someone else, \nDon't join a stream just to tell them what you think they should do. It ultimately undermines them as a person when you're walking them through everything, nevermind the fact that it removes and meaning or fulfillment from playing it as well as for those watching\nfor goodness sake have some respect and decency. This descent has been happening for weeks now, we're at Twitch Chat levels of degeneracy", "Really ignore the Backchat Boys for this. Witcher´s beauty to me is that the world has so many things to do and explore in a fairytale like world (albeit a dark one). I find it baffling that people have a problem with how other people play an open world game, just do your thing honestly. And Guys really try to cool it with gwent I know some of you are just meming but at this rate she isn´t going to like it at all - What did the tased guard say? Nothing, because he was stunned. The other though said: \"Wait is this a flying glowing baby?\"", "https://youtu.be/SWTKJytfpD4 wiscthejrth", "the chat is being very toxic", "Dang, not even a pun this time. Chat must have been terrible today.", "@VINCENTNATTI oh Boy, you dont imagine", "First time I see u being serious, I was impressed, then I read the rest haha. Couldn’t agree more with ya.", "@Alizoneto Rocha Not to toot my own horn too loud but telling puns also takes some insight hahaha, no but thanks I really didn´t want to write about this and Amelia herself responded to this ,so it seems that she has to have made up her mind  in her own way about chat.  I really find this community cool and wholesome but above all that interesting, seeing how many people can share an interest in this all and have a good time together with the content creators. But  like all large communities meming and joking eventually becomes a part of it , and more and more people want to be a part of this  joke culture and also show their participation to the girls, which is ok I do it too with my puns, while I am sure some people in the comments are annoyed to see me over and over again I believe that I haven´t really  bothered anyone with this and try to be harmless. Anyways with that volume of people or the way of approach they take to do this, it  can be sometimes hard to bear for both, ourselves and the the Hologirls. I don´t think the people who do this do this  from a bad space of mind but rather just aren´t aware of how it can be perceived in the context of time, quantity and even humor. I don´t really have an answer as to how to handle this myself, but outright ignoring chat shouldn´t be the solution but I think selectivly blending mentally parts of chat out when it is too much is ok and chat trying to became aware of this may also help this situation. She is doing fine till now and I believe this will not be a big problem in the future. Uff this sounds a bit arrogant =)  but I hope I got my point across.  I too am no stranger for not being able to read the room so rather than me talking with my nose high let´s say this is me speaking from past expierences", "@Casual Filth I didn’t mean to insult, sorry if I came across like that. I always look for your puns, cause they are definitely funny and clever. Ames actually gave a answer? I can’t see it, care to share?", "@Alizoneto Rocha nah I didn´t take it as an insult no worries there =) I just let out my thoughts about this whole thing since I thought about it a bit, rather I am sorry for unloading it there. Amelia commented here on this video it is the top comment but here  if you can´t find it: \"I was a bit sleep deprived which made me a little cranky this stream; chat is chat and even with rules, mods, or filter, people will find a way to do whatever they want. From now on I will do better to not let it get to me so easily, sorry for letting you down! I will keep working hard 😘\"  some comments suggested mods but with this she seems to be against that idea but if I  understood her correctly with that comment she will try to let these spam comments go past her and ignore those \"bad\" ones.  Also happy to hear that you like my puns =D have a nice day", "@Alizoneto Rocha pinned comment, refresh the video maybe? Basically she just couldn't tune chat out as well on stream because of lack of sleep, which makes chat being as annoying as it was kind of tone deaf.", "@Casual Filth oh you mean it like that, completely misunderstood you. I keep agreeing with you in every line.", "@Alejandro Vinasco I didn’t quite got the meaning behind his phrase, thank you for taking time to point out my mistake.", "@Alizoneto Rocha no problem =)", "\"Backseat Boys\" fits better but I agree with you.", "reading through the comments \nYou fools. Was gone for one stream and chat managed to mess up this bad. \n\nDo better chat. ", "Yeah missed this stream too. I actually wasn't notified of this going live. I was playing metal gear while all this happened....... Didn't think the chat could be extremely toxic.. oof imagine if rushia was fluent in English.... Chat would be much worse. I feel so bad for Amelia", "its chat.. what did you expect.. :D thats the most toxic place on earth lol", "Backseat gamers: PLEASE, just talk a walk.  I'm serious.  It's bothering the real fans, and it's bothering the girls.  I'm sorry that you're so OCD that you demand to see the game played the way you play it or the way you want it played.  If that is such an issue for you, go play the game itself.  I saw the same trash in Ina's streaming of Half-Life 2.  It's infuriating and it's making it less fun for everyone else and for the girls themselves.  Show them some respect.  They're gamers and you should let them game their way.  Subscribing does not entitle you to demand the game played your way from the person creating the content.  Grow up and behave or we're gonna see less and less awesome titles like this being played.", "I thought we were here for her experience not control her... At this rate... sighhhh", "gamers have issues with consent, nothing new. ban every Gwent spammer", "@Noah Dalvag A bit of a weird way to put it, but yeah a lot of gamers like to flex their gaming knowledge and this usually manifests itself as backseating.", "@Noah Dalvag Comparing annoying backseat gaming to sexual assault, are we? Really classy.", "@Dr Frankenthot That's what you did. Consent is much more than that. I can give consent about hearing certain kind of jokes, certain kind of topics I'd rather not talk about. And it's against a persons consent to pressure them to do ANYTHING they don't want to do.", "Y'all need stop spamming, geez there's people who really watch ame playing", "yes we watch for ame, not some pro player trying to 100% complete the game.. go watch someone else if you're gonna backseat so hard. (Not directed at you)", "I was looking forward to see how Ame would play the witcher 3 for the first time and see if she will enjoy this game as much as I do but chat was ruining the experience for both Ame and the viewers. I thought chat would be better on this series compared to Minecraft but I was wrong. I have to close livechat these days to enjoy her stream...", "It probably would've gotten better but got worst because of the W3 Fandom being the worst in my eyes", "Stream Start!: 3:00\n\nHiccup count:\n1. 3:25 (Stretching? Hiccup?)", "Why not try doing this stream but only members can talk?", "wat D: (jk whatever works best for this game tbh)", "Prerecorded Witcher 3 videos is also not a bad idea.", "Some members are backseating as well. Bad move.", "@pbo1929 If they still backseat, then they’ll be easier to find and crush into dust that you can throw to the wind.", "@pbo1929 yeah but most of the backseating spam was from non-members and tourists. The numbers are going to go down dramatically. It's unfortunate because I enjoy interacting with chat during the stream but I don't mind losing that benefit for the sake of making the streamers life easier.", "@K0uhai. It will get better but at the cost of popularity reduction. Honestly it's up to Ame.", "Plus, even if it's easier to \"track\" what are we gonna do about it? We can't do anything and we don't have moderators to ban or suspend these people.", "@pbo1929 That is true, the potential dip in views is something to consider. If you ask me people who can't enjoy the stream by itself without spamming in chat don't deserve to watch it in the first place, so to me filtering those people out is a good thing. On the other hand I understand the need for views and chat engagement, both are considerable options and it obviously in the end it is up to Amelia how she wants to proceed, it's her stream after all.  As far as the \"tracking\" rulebreakers thing is concerned I'm pretty sure people have been banned in holo streams before so it can be done if need be. However that's not necessary in a members only chat most of the time, since the percentage of members breaking the rules is far lower than the percentage of non-members doing the same.", "Members were spamming too. She just needs mods and a chat filter for the word 'Gwent'", "I really enjoy watching her goof around and enjoying the game. \nI hope the chat settles down a bit and doesn’t make her want to stop streaming Witcher", "Hey Guys. I like the stream a lot! I wanted to see AME play, not a walkthrough. There are a bunch of walkthrough there. But for Ame, I like to see her play and have fun while we interact nicely. Always remember the rules. Some members here are new in the Hololive, while they don't have the knowledge, we do. Let's just help them get around here. If there are unfavorable chats, just remember to IGNORE and REPORT. It's in the rules and we must follow the rules. Never the less, I really love Amelia since the beginning. Take care Amelia, everything is going to be better. I salute you. Next, do the things you want, not the things others want. if you need help, we can help in an appropriate time. The 'real' members will surely help you alot! Thank you for trying to help AME, but let's all help her in a positive way without ruining the fun. At some point, we are new to the game, so please let everyone do their own experiences in life.", "Ame, you should try playing Witcher with chat on Emote only mode. People spamming chat are just Trolls and you should never pay attention to them.", "Fr emote only mode would save the situation", "Members only chat might work too since ame or any other streamers might want to ask for tips", "@Ran-nii Some members are backseating as well.", "@Ahmad W Smh", "Is there emotes only on yt? I thought it was only on twitch though", "@Ahmad W damn that sucks. But I guess it would be easier to temporarily ban those.", "@Ran-nii AO-chan was on a message deletion spree on Ina's HL2 stream and Ame's last minecraft stream. But I guess 1 person is not enough to wrangle these people.", "Gwent is a side game you have to be in the mood for to enjoy you also need to collect cards and on top of that, it could be confusing for new players especially on a blind run. I get you guys want her to enjoy every bit of this incredible game but the spam is not the way it will just make her want to play it less", "Yeah. It's a bummer reading the comments before watching (as I had to miss it to sleep for work), and I don't honestly know if I want to watch it and see her get upset. I like the back and forth that Ame can have with chat sometimes, but reading the comments here and it seems to me that some people need to chill the f-word out (as Cali would put it).", "Also some people don’t really like card games, some players never really get into gwent but enjoy the game.", "@SoosUnknown I love card games irl, I've played Yugioh since a kid and still do, but I couldn't get into Gwent. Imo, Gwent in Witcher 3 isn't that great a card game. Maybe the standalone version is better, I have heard it's quite different, but if Ame doesn't want to play Gwent at all I don't blame her. When I watch let's plays of W3, I skip when they play Gwent lol.", "Please don't blame yourself and say it's \"chat being chat\" and that you were just tired. Ignoring the fact that they made you feel uncomfortable is not a way to have a healthy live chat, your experience being the best it can is what MOST viewers really want. \n\nFeel free to have \"No Backseating\" on the screen because I'm sure it will help with what happened today - including the Gwent spam. It got to the point where even people watching were closing chat, so please think about enforcing a healthy chat experience.", "RIP witcher playthrough.", "Good lord, as a witcher fan, this left me embarrassed to see chat devolve into gwent spam.  Ffs", "I was really looking forward to her playing Witcher 3. I dont wanna lose out on it because of the dumb babies who can't stop backseating or spamming! I hope chat can ease up or we reach A compromise where Ame only streams the main story beats at least.", "あめちゃんの可愛さに気づいてしまった！( ⸝⸝⸝ʚ̴̶̷̆ωʚ̴̶̷̆⸝⸝)", "56:28, The duality of Man", "Honestly and I'm sorry have to say this but if I have to compared this , I say this chat is worse than Gura's and Ina's. Usually I don't mind and normally don't get annoyed  since the chat is into this stuff, but this chat has taken a bit way too far. And you pushed Ame so far that she lost motivation to play , that's just absurd. Stop this spam/ backseating for real this time for damn sake.", "Now back to usual stuff, thanks for the stream. Good progress despite that setback....", "It's like expecting those backseaters to have some sort of self-awareness, they don't.", "49:09 don't mind me just want more of that cute roar", "Hey Amelia, just wanted to say, whatever decision you want to make about continuing the witcher 3 100% has my support, as well as the support of many others. What ultimately matters is if you're enjoying yourself or not. If you're enjoying yourself playing the game, then we'll be enjoying ourselves watching you play the game. Please, don't feel like you're obligated to continue this game in a streaming environment on our account.", "We really like you amelia, sorry for the spam and backseating, chat is going too far", "Sorry that chat was so bad today.. the gwent spam was really annoying to the point where I just turned off the chat. Sucks that today had to end like this when the watch-along was so good.", "I really enjoy this", "We might not get more if this keeps up.", "“There’s no right way to do anything. [. . .] It’s just different, it’s not better.”\n\nEveryone's entitled to play a game in their own way. Hers is unique and of her own style. If she copies your way of playing the game, then its not an Amelia playthrough, she lost her identity.", "I really appretiate that part when you said that you wanted play to hear some stories. Regardless of any of the back and forth that you were having at the time with the people in chat it was really refreshing to hear something like that, as it is rare for me to find a streamer who plays the game for what the story has to offer. I've heard that you prepared for this playthrough by reading and watching the T.V. Show and is a shame that maybe not everybody in chat resonates with that message, or that the people who do is not as loud as the other side of the crowd. The noise of negative rambling usually gets more closely and personally, after all, you are not to blame for that.", "I missed the stream but man, reading these comments before I watch the video? It makes me feel like I don't wanna watch Amelia suffer through that. Just do whatever you want with the game, Ame. Gwent is entirely optional. I've replayed TW3 a few times and only tried it in one of those playthroughs. If it's not your thing, then ignore it. Screw it, if you feel like playing it off-stream then so be it. I'm really sorry about this mess. It's such a great game. But you're not having the best experience.", "Ame, I recommend you to do two things:\n1. Mods that will shut Gwent spammers up (and a stern warning at the start of a stream and in the description).\n2. Play a bit off-stream to get the feel of the game more. You seems to have missed a lot of basics (or not doing much), like using Signs in combat, switching the current selected objective, basic stuff like those. I understand the feeling of being frustrated of seeing someone doing basic things wrong, but not everyone can hold themselves back from typing it out. Once you get the basics of the game more, backseating should decrease by a lot.", "Kent S imo mods aren’t necessary when ame said to stop backseating everyone pretty much stopped she should just put a warning at the start and ask chat to calm down whenever they get annoying", "@II8cookiesn That's not enough, it's never gonna be enough for these manchildren. That's why we need mods", "That's the main point that people are missing. It's just annoying to wait h someone do basic things wrong. Doesn't matter who it is.", "Come on, . We're better than this", "I do love watching your Witcher streams, but it would be understandable if you want to play it on your own and stop streaming it. Chat is getting real nasty here. If this keeps up I suggest just switching to member's only chat. It would be much more helpful for you too and far less toxic than the state it is now. I hope it doesn't get to you that much that they ruin the game. It'd be such a waste cause this is one of the best games to get lost into. Keep it up Ame and thanks a lot for the streams!", "Let this be a lesson for chat. Pushing old jokes too many times and backseating too much is not how you support Ame. Don't let this make you feel bad, Ame! You play it your style. Let them enjoy it, if not, just let them be. You can't please everyone.", "Sometimes i can't watch your live streams , i always look the archives, i don't know what happend with chat but Ame you should play game like you want and ignore the chat . Please don't be sorry for anything i love your streams and gameplays. See you soon Ame :3 . ", "Watson, it was a great stream with a lot of memorable moments. It's always fun to watch you play. I hope you continue The Witcher 3, on or off-stream, however way it will be more fun for you. Just want to send you some good vibes and hope you have a good rest. Can't wait for your collab with Kiara later! 😁", "Why would anyone want to watch someone else play GWENT? Maybe if it was two humans challenging each other...", "Maybe if Amelia played nonstop Gwent with the worst cards that would convince those spammers to make her stop lol", "My thoughts exactly, who wants to watch someone play a card game against a computer? Especially one that requires you to collect cards, know their value, and figure out the rules to a game from scratch. Just seems like people itching to back seat.", "@Eternal Memeage I did a playthrough without playing GWENT or collecting any cards and tried playing during the wedding in the Hearts of Stone expansion and yeah it wasn't a good time.", "Petition : Bubba should become Amelia's moderator like how The Ancient One which is Ina's book is Ina's moderator", "To the spammers: Next time if you can't chat in Ame's stream it's mean you was blocked by our reports. You played the game doesn't mean you can force VTs play as you want.", "Stream was great but the chat became the Backseat Boys once again 😭", "Who's really playing the game, Ame or chat? TW3 is such a great game, and I feel is best played on your own terms. Shape Geralt into what you want him to be, make decisions based on what you feel like, and most importantly, play how you want to play! Even if you have to ignore chat and just comment on things going on in the game, just remember that you can only experience your initial playthrough of TW3 once. Please don't let it get spoiled by some toxic kids looking for attention.", "Ame if you a re reading this, you should do a member only stream next time. This backseaters are getting other's nerves at this point.  So Pls, for sanity's sake, and have some moderators, but at the same time, control your emotions    (Ps. STOP SAYING GWENT OR BE BLOCKED AND REPORTED FOR SPAMMING TO FOLLOW THE RULES IN THE DESCRIPTION)", ">thinking a members only stream will stop spam", "I loved your gameplay today. I was actually a bit surprised that you managed to safely guard the Baron. I have seen so many people mess up on that section.", "Honestly I don't even know what people are expecting anymore with Gwent. Clearly even if she plays it she won't have any fun after all the badgering, and I feel like some of the people might just want to see her frustrated by it anyway for their clipshows.", "Guys stop spamming in the chat telling Ame what to do. She's playing the game, not you", "Sorry if the backseaters made you feel unconfortable Ame! I really hope you can still enjoy the game despite it all.", "Wth, brain?:\n>specifically waited to watch the stream\n>passed out as she started\n>woke up as she was saying goodbyes", "How awesome to see vtuber who likes to explore in Witcher 3. Most just boom and zoom straight to finish. \n\nShame that the chat will probably make her quit this game. I know I would if I had to deal with such people. Big round of applause for us Witcher fans, we are definitely not like the twitch stream brats, noooo we are so much more mature.", "What hurts the most is that Ame said how much she loves exploring on her own and discovering things, yet chat just memes away and spam stuff. Please let her enjoy the game on her own way.\n\nAnd I agree on what other people say. I believe on this kind of streams you should just...either get mods, or put chat on emote only mode. We love seeing you enjoy the vistas and explore, but if the most excited members of chat can't control themselves and are going to ruin both your enjoyment and the awe the game brings, maybe that's for the best.", "jeez, not even 5 mins in and already the backseating is getting called out. this feels like it needs to go members only moving forward, hope you continue to enjoy the game experiance ame", "Always rooting for you Ame! Don't mind the troll, they won't disappear that easily, enjoy the game!", "gwent lovers, if you want gwent, you have to be quiet and let gwent do its thing, go the slow way. Its already become spam, no good will come of it.\nIve a feeling there are people spamming it because its become a big funny topic, but its becoming negative now and its not funny to everyone.", "Love watching you playing and exploring this game!", "Chat, please be more mature. It is okay to give her advice but for the love of God, stop spamming and backseating. Let her play the game however she wants. \n\nYou guys are getting three strikes already. Show moderation and stop acting like you are on Twitch. Also, shout out to some of the members and teamates, you should also reflect on the spams that you did.", "Honestly just blacklist the word \"Gwent\" and all variants of it at this point", "49:10 well that’s one cute roar", "Dear Amelia.\n\nThank you for the 'Organize your life!' quote from a previous Minecraft stream before, I sincerely needed to find the balance between myself, my studies and my simping for Vtubers like you.", "49:08 the scary roar gave me nightmares", "Thanks for the stream as always! You can completely ignore chat if you want and we will be fine! (Please don't spam Gwent, backseat, or even troll. You guys want Ame to play Witcher 3 right? So please don't do that thing. If you don't want it or just watch it, please don't do that too. Ame gave us warning, so please behave, chat! There's a lot of rooms to improve! Thanks for reading my long chat!)", "We're watching this stream to see how Amelia would play the game not how you would play the game. I want to see her choices and how she reacts. If you wanted to see Gwent so badly boot up your own game. We're here to see Ame not you. Your spam is just ruining a great game and a beautiful experience.", "I usually can't catch the streams so I really enjoy the videos after the fact. I've never seen the witcher series and haven't been interested in it until Amelia started playing it. I really hope she keeps playing it and everyone calms out about backseat gaming.", "I feel sad that Ame is taking it as a problem with herself when she did nothing wrong. I hope she will see we don't think she is at fault and didn't need to apologize.\nAs for the chat, well if they can't get moderators for the next streams to help her, I'll simply go the Coco Defense Force way : anyone mentioning Gwent in the chat, anyone backseating, gets an instant ignore and report, maybe at some point (and if others do it too) this will teach them not to be so insufferable online. We prepared to do that for Coco, we can do it for Ame.", "Chat is trash and keeps getting worse. Maybe time to change it members only. Or disable it entirely. Nothing of value would be lost.", "ame, ignore the backseating and play how you wanna play, when you're having fun, we're having fun <3", "49:10\n\nTo cure you from the sins of chat.", "If you spend all of your time on streams telling people how to play the game then you just gotta stop watching streams. Its not you playing", "Wow, remembering a single off-hand Oxenfurt reference from the start of the game. A detective indeed. ;-) BTW You can do quests you are underleveled for, it's just the fights will be really, really hard.", "49:00 cutest roar yet", "Ame, I’m genuinely sorry for the way chat behaved today. It’s frustrating as a viewer when it’s all spam, I can’t even imagine how it is for you. Keep being you and sharing smiles with the world.", "growing a community this fast brings a lot of problems that are usually addressed over longer periods of time, which is why i think that ame needs to have an honest talk with chat,\n\nuntil now, the interactions with chat have been playful even when she tells them to stop doing something.", "Yeah chat is being very overbearing with backseat gaming, but I can understand where they are coming from with pushing you to play Gwen considering it is one of the most fun things in the entire game. If you like TCGs at least.", "I clicked on a random part of the video and it was \"now we follow the ghost baby!!\" and laughed very hard", "Let people play the game themselves. You've all done it first time yourselves and if you haven't shut the hell up. Enjoy the show. \nWe're here to enjoy these people play games and do what they do, even if what they don't do and do irritates you keep it to yourself.", "LMAO You gotta love Ame. 50:00", "You’re wonderful Amelia! Witcher 3 is one of my favorite games of all time and watching you play it feels like I’m re-experiencing it all over again. Keep being awesome! Cheers!", "You guys better apologize to her and stop backseating next stream", "I do hope you'll play more on stream, though I completely understand the annoyance of back-seating.\nNot everyone understands that questions can sometimes be a rhetorical device to communicate a streamer's thoughts and not actually asking chat for an answer.  Also, that giving unsolicited input, in particular requests or demands, can be very off putting.  Streamers are not monkeys who will dance for a copper, they are real people, and some behaviors can be insulting,  especially if they are done frequently, despite requests to cease and desist.", "Been a while since i last watched a Witcher 3 playthrough. Hope you're enjoying it, because I am😃", "49:10 Best thing i heard in 2020. So cute.", "This stream was Nicer..i enjoyed it.", "Ame is so real can’t get enough of this detective", "congrats on almost 500k subs", "I was listening in the background, but when the baby was making the noises, was Ame also making some sounds imitating the baby? I could not tell!", "I hope you keep playing this game despite the chat being so rude and toxic", "Dear Amelia Watson, you are strong girl. I always believed in you, I know you can deal with this small matter. You own this channel, this is your home, your world, your rule. 👍 \n\nLove you girl, keep strong! ♥️💪", "Thanks for the stream, you should keep playing the game the way you want to, it's way more fun that way", "Stay strong Ame. Just play whatever the way you want. It's already really cool to see you playing The Witcher 3 so just take some rest and keep it up!", "1:10:25 I've never seen a glitch like this before.", "Chat.. WHAT THE HELL DID YOU DO!? YOU SHOULD BE ASHAMED OF YOURSELVES.", "Come on chat, this is not a walkthrough on how to play witcher 3, this is a new player playing the witcher 3, even I had a fight with my brother because he already played the witcher 3 and keep backseating me. i bet all of you also will get angry when someone backseating you when you play a new game. and Ame need to face that like 100 of you that keep spamming and backseating. just enjoy and watch Ame play the games and makes some mistakes here and there. that's where the fun is.(and more clip we will get). anyway, only help Ame when she ask. just like when you search google when you stuck during a quest and you dont know how to complete it..", "I was not really focusing on livechat but on you. Please have a good rest, Amelia! 🔍🔎❤️✨", "the vast majority are silent viewers who appreciate your decisions, \ntry not letting hive mind chat spoil your experience", "What is gwent lol and i fell asleep before I could watch the stream :(", "You guys know that GWENT is available on mobile devices right?", "Chat please behave so we can watch more witcher content with Ame, we don't want her to be put off by the game ok?", "On a different note, I've seen you from somewhere before and I also noticed you also have somewhat the same channels you're subscribing to as me, also Good Mythical Morning.", "@Solace good mythical morning to you too", "good luck with the Baron's wife.. i couldnt save her.. but maybe you do :D", "People watch streams with a preconception about what they are going to see and what reactions are going to happen, all of which kind of defeats the purpouse of streaming in the first place.\n\nYou guys need to take a chill pill and let things flow naturally.", "49:09 The sound can heal your soul. ", "this is disappointing to hear  i kinda figured chat would be rough  so i just been ignoring it but it seems to be getting worse ,really showcasing how dire mods are needed", "I don't care about guys spamming\n49:11 hope you have a nice day<3", "Hope you didn't get too put off by the game today. I really enjoy watching you stream it!", "Love you Amelia, your humour and your wits are second to none. You always manage to brighten up my day!", "I just got done watching Ookami Mio cry about how hard she has tried in her time as a hololive idol; and people really oughta treat Amelia better.\n\nI'm not saying kiss her ass or anything: but have fun with her! ", "Cute ending, worthy the watch and the all nighter some of you would need to pull off. Ups and downs in chat, like always, but the overall experience is pretty standard for TeaMates, no wholesome moments but there’s some important message during the course of the story that Ames herself points it out.", "Damn the chat needs to stop with Gwent spam man", "Pls sleep well 😴, stay healthy ❤️🥰", "1:30:09\nAme is just too wholesome even with the toxic moments", "Isn't it on Cover to provide mods for the girls? I'm honestly surprised not every EN member came with their own AO-chan.", "That's what I've been advocating for. Every girl needs a mod, I mean, look at how good AO-chan is doing!", "Mods been sniping hard today. Viewers, even members chat got removed on stream.", "@Blooper {Reloaded} It feels like Cover is so behind on this basic stuff. Honestly, the moment Hololive exploded in popularity overseas months ago, ALL the girls should've gotten their own mods. But even now, still only a few of them have mods.", "@buluhterbang In this stream? Thanks for letting me know, I actually didn't notice.", "@buluhterbang Wait, do we already have mods here? But I thought AO-chan was the only mod?", "@Blooper {Reloaded} idk if it's AO but I notice most spam chats got immediately removed even from members.", "Amelia sama CONGRATULATIONS FOR GETTING 500 MILLION SUBS soon it's very close rn.\nAmelia sama don't blame yourself, just ignore the chat and do whatever you want like the rules said Ignore,Report and Blocked. \nAlways remember we are here for you .\nit's always happening in every streamer so i hope you understand that you really have to ignore them and starts focusing your play you can still read them but ignore it.", "I can't wait for the next one", "Oh, that chat was naughty. They even tried to bait her to play gwent with the promisse of her stuff being repaired from the blacksmith. That never happens in the game.\n\nOne hint I want to give you from the get go - Durring the questline \"Family Matters\", you may encounter some scenes or certain places where the audio is buggy. If that happens save and reloade, the audio should be okay afterwards.", "Congrats on 500k Ame! :D", "Epic chat\"LELELELELELELE\"", "Her chat is literally like twitch chat", "I really enjoy these videos and hope to see more. Maybe I will catch it live next time.", "I lol the playstyle and commentary she makes on the game", "Witcher fans being noisy turds? Surely not o3o\n\nWell at least it wasn't Dark Souls I guess. Maybe you should just ignore chat for specific games like this.", "Sub Indonesia please:')", "ROAR: 49:10", "I hope you will not hate this game becouse of trolls :D Keep plaing like you want.\nThank you for the stream Ame :D", "no carl this stream :(", "Turn on sub only mode, where your members are the only ones allowed to chat? As a non-member, I wouldn't even be mad.\n\nHonestly, the best thing to do would be to ignore spams/trolls and play the way you want. Although, as a primarily Twitch viewer, I've become desensitized to such things.", "Her members were doing the worst of the spam", "even Members are also spamming “GWENT”, not just non-members", "Ame just attracts the worst people I swear, she might act toxic, but she is a good girl. Don't do her like this chat.", "Let her play the game how she wants what the heck chat. I really thought you guys knew where it stopped being funny and started becoming annoying. GWENT is not funny. If she asks a question by all means answer it but don't go overboard and spam tell her what to do . Seriously I thought you guys knew better.....", "I think a member only chat mode is due for some of these streams", "Is there a full version of the outro music?", "When all the top comments are about backseat gamers in the chat, you know there's a problem.", "I still don't know how Amelia got stuck with such a disorderly fanbase sometimes. The only thing making it worse is that someone's gonna see her getting frustrated and annoyed with her chat and post a clip of it calling it \"Ame Toxic Moment\" like they're not the ones causing it.", "Seeing many's sense of humor I'd guess many lads in the chat aren't quite on the age of majority", "If the playthrough is going to be a members only stream from now on then i'll get ame's membership. i guess this is no different from when i used to buy a few skins from playing league; and chat is starting to get annoying as hell", "Well, the spammer and trolling still keep being rude eh, shame on them\nThat's alright Amelia, well if you don't have mood to continue this game, let that be\n\nInfact, they who's disturb your experience deserved that, for lesson to them, to have better manner and follow the rules", "this was main quest", "I haven't watched this stream but I do watch the first witcher stream and the second one. Ngl, I was also spamming gwent when there's gwent player nearby. If you didn't want to play Gwent, that's fine, I just spam gwent for the laugh anyway. But it seems i found from the comment section and a clip that you're genuinely getting angry of the gwent spam so I won't do it again.", "Dang, it's okay Ame!  We all have those days, and from reading the comments chat was the one at fault here (didn't watch it live b/c of early morning work shift). We want to see you enjoy yourself! And a lot of the fun for me, and I'm sure I'm not alone, when I watch people play games or watch stuff I adore, is to see them enjoy it themselves for the first time.  To wander around, learn, discover, and stumble into stuff like we did (and the vocal parts of chat seems to have forgotten).", "I really like these Witcher streams, it'd be a pity if Amelia had to stop because the chat is annoying her", "I'm sure some of the people shaming the qwent spammers also joined in at some point", "Chat has been really bad with the Witcher. Ya'll need to chill out. Not everyone likes Gwent FFS.", "People spamming GWENT are for sure trolls. EVERYONE IS ANNOYED BY IT. Dont fckin tell me that the majority of chat didn't want them to stfu.", "Chat ffs just stop", "I missed the stream but i heard the chat was bad once again.. jesus", "Backseaters smh", "We won't get more witcher if you guys keep backseating and spamming Gwent. So cut it out \n.", "I think Ame need some harsher punishment for chat if they misbehave like this. Like HoloID girls for example, Risu is not afraid to lay down the banhammer if her chat is out of line.", "part 3", "Im here for the roar", "Sorry the Gwent cult is hard to leave don't join. Just do what you want Ame.", "New Amelia stream with Haachama soon... poggers", "To be fair. Guys do you realize projekt red made a standalone game named gwent? Why you didn't watch that?", "Anyone who thinks constantly asking to play gwent has the humor of an agnsty tween.", "Jesus Christ chat is actually horrendous right now. Shame on you guys asking her none stop to do whatever YOU wanted instead of what she wanted. Go boot up the game yourself if you want to play Gwent so damn much smh", "bruh moment chat", "ame even us average viewers hate these kind of people, we mostly lurk, please dont let them get to you", "what is gwent and why is everyone asking for it ", "Chat spamming gwent are pretty cringe ngl", "Jerry of rivia, butcher of tom", "The general rule of the thumb is to STOP BACKSEATING. Just watch the stream and let her play on her own terms, only put your suggestions when streamers asks for it. Don't force your suggestions on her and RUIN the streamer's experience.", "That's dumb.", "@TsukuyomiREKT Nah", "You should all feel ashamed for spamming GWENT in the chat.", "take a good rest", "Why chat?", "I don't know if ame looks at the comments but with gwent i don't think it will be fun to watch you play it unless you WANT to play it, so please take your time and do what you want to do ;-; the witcher 3 is one of my favourite games of all time and I want you to be able to experience it with as much awe and joy that I did! I am still enjoying it so far and don't feel bad for bein cranky, I think I would have been the same if people were just shouting at me to play gwent haha", "Jerry of Tibia is my favorite RPG protag", "GWENT SPAMMERS WEIRDCHAMP 👉 OUT", "gwent maniac GTFO\njust be yourself Ame", "Gwent is the best part about witcher though", "@Lokk J to some player yeah i agree, but when it comes to a streaming played by one who obviously telling chat she didn't want to play gwent, those who kept spamming were not proper in my opinion, especially that may have more or less effected Ame's pace of streaming and mood.", "Here's something positive amidst the \"don't spam gwent\" comments:\n\nThe baron's quest is my favorite quest of all time. I'd love to see how she tackles this and see her reaction to the ending of this.", "And don't go telling in the comments and in this reply what will happen because of her choices.", "\"Ame bullies a grieving father\" someone writes. Were they watching? Grieving or not he beat his wife into a miscarriage. Kinda loses my sympathy at that point. The Baron isn't a simple straightforward villain but it's no great sin for Geralt to call him out for his actions.", "Its almost like some people play this game only to play gwent", "I really doubt 10 percent of people who back seat would read the comment or even if they did they probably wouldn’t care since if they actually care about people behind the screen they would just stopped before anything happens all they care about is to see what they want to see.", ":(", "EN chat is awful. a lot of jp streams dont even have slowmode on a lot of the times. En chat is bots and needy spammers.", "The Twitch refugees and redditors really don't deserve to have chat privileges if all their gonna do is nag her on how to play every game she streams.", "Hey us Redditors are upset at those brainless Gwent spammers and backseaters too :(", "Gwent, Pazaak, Blitzball, etc. are trash.\nOn a side note, chat is cancer.", "Jerry, the butcher of Blaviken ... nice", "Oh man, it sucks how toxic the chat is for Ame. I hope she finds out a way to fix this problem! Except she shouldn't have to fix it, it's not her fault, it's our fault. Chat, respect her boundaries, Let her play the game how she wants to, not how you did. It's just not fun for anyone that way, I hope the backseaters and spammers in chat get themselves figured out, because it's certainly affecting Ame rn.", "Gwent isn't even good.", "Lol it is though", "Chat, will you do ame a favor? If you want a nice stream. Dont bother her. Telling her what to do is annoying. Please just let her be. She is the one who is playing the game and experiencing it. Not you guys. Backseattersare not funny.", "Man, this is what sucks with open world games. Chat just want you to play the game they want. It's like undertale again", "Can she sub mode only? If the chat is going crazy? I feel bad for her", "Raaawr 49:10", "      ", "1:30:08 ", "Jesus Reading Live Chat Replay Gave Me Cancer", "Doesn't help that youtube livestream chat copies a lot of bad culture from other livestream chats like twitch. It's not an exaggeration when people say chat is typically spammed by the lowest common denominator of people, almost no matter which popular enough stream you watch. I've never found chat to be entertaining nor worthwhile at all to look at. As neat as it can sometimes be to use it for help, for Witcher especially, it's not great to look at otherwise. One thing to read superchats over the rest since you want to encourage donations, but even that can be annoying sometimes. As long as you're having fun, that's all that matters. I'd be careful about how you scold chat since people feed off from that, whether you give them a genuine reaction or not.", "You shouldn't be apologizing Ame, the amount of childish and rude people in your chat is getting out of control, its their fault not yours", "Gameplay tips for newbies\n\nRepairing does not really change anything at earlier levels, I’d say you don’t have to repair even once before level 10 or even 20, since you are going to be changing your armor a lot.", "stfu ur kind is the reason why she doesnt play it anymore. she plays on fkin normal and u still give tips like stfu let her fight wild hunt at level 5 if she wants", "@Devon Draco Learn how to take advice man.", "1:27:50", "Nice", "Please hire some mods! You shouldn't feel bad about chat being unruly. There are always going to be people misbehaving even you are nice to them. You should do you, that's why we are here.", "No necesitamos expertos que hayan jugado 50.000 horas al pinche juego.\nEn el chat de Ina ocurrio los mismo weon.\nPor favor dejen que las chicas experimenten los juegos a su manera. Si ellas tienen una duda o quedan atascadas en algo ahí pueden ayudarlas pero no vengan a con sus comentarios de mierda como \"REPAIR YOUR ARMOR\" que son muy molestos y sobre todo eviten el spam!!!!!!!! ", " pls", "Some of you be wildin too hard. Dial it doooowwwwnnnn everyone plays games differently yo ", "Ame - you should make The Witcher streams member only in chat.", "For the people who was annoying Amelia....IT PISSES ME OFF WHEN U GUYS KEEP BOTHEING HER OTHER THIS BRUH PLEASE LEAVE HER ALONE JESUS YALL NEED HELP EITHER STAY AND WATCH OR LEAVE. How can we have a good time watching when she dosnt want to play anymore, it’s really sad that she has to face backseaters. She need Moderators so they can shut you guys up. Smfh yall the worst", "saying the same joke about gwent 100 times ≠ funny", "For all the people complaining about gwent I'm surprised people aren't complaining about how she doesn't touch the notice boards", "Glad I'm skipping these Witcher streams kinda figure this was gonna happen because of the Fandom", "There are rules, and people keep ignoring them. Sadly, unless she starts using the banhammer these kind of people will never understand.....", "lmao, called it.\nW3 is a good game, but a terrible choice for streaming, especially with the fanatical followers who'll make sure you either play the way they want to, or not at all.\nIt's a bit of a shame, but I'd just move on and pick something different. It's unlikely to get much better.", "Its the same with any game that get vaugly memey. Its not even funny it's just a reference other fans of the game get, people playing it for the first time will only find it annoying", "Yes and no.\nIt's possibly due to its popularity and massive fanbase, but Witcher (3) seems to have way more obnoxious fans who get downright idiotic with their backseating and fanatical worship of the game, defending even most blatant flaws just for the sake of having its name untarnished.", "@Klaymen 47 I'm not even a streamer or content creator or anything, and TW3's fandom totally put me off playing the game ngl", "There's right and wrong ways to play games. 🤷", "@TsukuyomiREKT if you want to see someone play a game right then watch a walkthrough. The whole point of streamers is to see how they play and react to games.", "Sorry for the annoying chat Ame. It is a real problem sometimes", "The baron is a terrible man and their is no excuse of what he did. \nBut at the same time their is no excuse for what his wife did either.\nBefore you reply go play or at least wiki the whole quest.", "Unpopular opinion guys: Gwent is the least interesting thing in the witcher and a waste of time that barely affects the actual important parts of the game.", ">Unpopular opinion\n\nNot in this comment section. So you might as well delete that part", "@carlosraruto nah a lot of people in the comments still like Gwent, I'd get murdered if I said this to an average witcher fan.", "Playing Witcher 3 sincea while back and... god these sidequests are so freaking good, heartfelt, funny, gut-punching, tragic ever.\n\nGlad to see Watson getting invested in such a wonderful experience", "The fact that she has to apologize for nothing kind of upsets me the back seaters are actually annoying. Let someone experience the game on their own. YOU'RE NOT PLAYING amelia is get over it.  yeah and the gwent kids go shove a hot pocket where it counts.", "Gwent is the best part of the witcher though", "@Lokk J No no no", "@Koyomi \nHave you even played Gwent?", "@Lokk J I only play it during the story part of the game. Don't see what's so great about it.", "@Lokk J Nope and actually i've never even played The Witcher 3. That's why i'd rather watch her play the game for the story rather than watch her play a card game. On top of that i'd rather play a card game not watch someone play one, but everyone is different. I just don't think people should be typing in all caps about gwent or trying to force her to play it either.", "@Koyomi \nYou can't properly experience the game without playing Gwent, when I first played the witcher 3 I didn't play Gwent until halfway through the game. That was a huge mistake, Gwent is really good and I regret not playing it earlier, thats why people want Amelia to play it as well. Shes definitely going to like it if she gives it a chance.", "@Positivitea \nWhat do you mean lol, there is no Gwent in the \"story part\"", "\"Oh no she's just being a \"toxic gamer girl\" so she's alright and besides she has to entertain us anyways KEKW\" - Obnoxius manchilds who thinks they own amelia because they're donating to her or something. You all need to stop seriously, you guys are acting even worse than the twich chat lmao. Remember, she's still a human being behind all of this and a no means no. Just go to another youtuber if you don't like the way things are being settled here. Simple logic everyone. ", "What weird fanfiction scenarios are you writing here? Maybe don't make mountains out of mole hills.", "@Dr Frankenthot What? if you're questioning the valorant thing, I think it was the 4th video that was uploaded.", "Brainlet", "pog ", "DA DA DA DA DA DA", "To the people that troll and are ruining Ame’s experience to play this game. Just leave. Find someone else to bother. People like you need to grow up and let the streamer do their thing. Only give advice when they ask for it. At this rate, she may no longer stream the game and play on her own. I personally think it’s a lot more relaxing playing alone without streaming (I’ve streamed on twitch before and god it’s toxic). But obviously she wants to interact with us and have fun with us. BUT you dimwits spamming gwent and such have to stop or leave entirely. This goes for watching anyone’s stream in or out of Hololive. You want to be a prick? Go to Twitch or somewhere else.", "There's literally nothing wrong with giving advice, even if she doesn't ask for it.", "@TsukuyomiREKT well my point is spamming stuff can be a nuisance at times. Like telling her to repair her gear constantly while she was enjoying a nice stroll down a path. Sure some people have good intentions, but let the player enjoy the game and let them figure things out. She’s playing blindly, let her learn", "@TsukuyomiREKT There's a difference between \"Y'know if you this, it'll help you with that\" and \"DO THIS. NO NO NO DON'T DO THAT. BAD THINGS WILL HAPPEN IF YOU DO THAT\".\n\nI have no problem with the former, even I do it. It's the latter that's a problem.", "Screw Qwent\nAll My Teamates Hate Qwent", "", "ame deserves better", "Guys... yea chat was being a right b*stard, but turning the comment section into a sea of negativity over it isn't helping to fix anything. While there should be some threads pointing the bad behavior out, we should mainly be focusing on the good and funny moments from the stream; sh*tting hate everywhere about people being sh*t just makes everything more covered in sh*t.", "The main problem with the Holo EN chat is that there's so many of them that behave like Twitch chat, don't bother to open description to read a few rules, don't know about the Hololive etiquette and worst of it all lack respect. It's honestly off-putting and annoying for everyone.\nI really hope some people will actually notice that it's just making it less enjoyable for everyone including the streamers themselves.", "cringe chat", "AME IS SO CLOSE TO 500K LETS GOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO ANOTHER KARAOKE STREAM", "The internet has socially inept people. Shocking, very. Give suggestions at the right moments, not every moment.", "I'm one of the rare Witcher players that don't yell at Amelia to fix her armor or play gwent every 5 seconds.\n\nHell, I told her to sell her gwent cards, which will make any Witcher fan scream because you can't do that lol!", "Me too, I have 255+ hours in Witcher 3 yet apart from telling her do do sidequests when she asked how to level up I never backseat. It's fun seeing her learn and discover on her own.", "I just got done watching Ookami Mio cry about how hard she has tried in her time as a hololive idol; and people really oughta treat Amelia better.\n\nI'm not saying kiss her ass or anything: but have fun with her! ", "@Beefstew Ikr? Also you and me are Amelia fans first huh? \n\nWhile a lot of Amelia fans attended the stream, I bet just putting the name 'Witcher 3' in the title attracted many newcomers who are only there to push the lady around.", "You aren't actually rare, most people don't even writhe in the chat to begin with.", "@Dr Frankenthot I know... I just said that to shame the Witcher community.\n\nA rotten apple ruins the barrel, and it's a shame how rotten the Witcher community is.", "Ive played through the witcher3 2 times\n\nI have never played a single game of gwent nor did I ever feel any need to\nI dont get some peoples obsession with it", "You haven't truly played the game if you haven't played gwent", "@Lokk J Then I guess I don't want truly play the game 🙃", "@Lokk J Fuck off.", "Its not very surprising, witcher fans are some of the worst you can find, definitely the worst of any single player game except maybe dark souls. You will have to just have a heavily moderated member only chat, or even do witcher as member only streams.", "I knew the fanbase was bad on Reddit but didn’t know it extended to streaming as well :/", "If backseat chat is too much, this is what I do: ", "Shame where shame is due and I'll admit I'm part of the problem with the Gwent spam. I'm gonna stop with that and go only for Hic and the occasional joke when Ame falls off a cliff. \n\nIt's a little tough for me to say anything else as I already 100% the game and I have no wishes to backseat nor spoil her. I find Hint hint wink wink", "lul, I guess people can't be nice and help anymore. Oh well :^)", "Try Russian or Polish voice acting, they are very good", "Chat is gonna make her quit Hololive. Guaranteed she's thought about it.", "guys that is literally unacceptable that so many people were so toxic. don't tell her how to play the game, PERIOD. at this point, if I see anyone spamming her to do something in stream again I'm blocking and reporting because it's all we can do. you should do the same", "Gay Twitch chat lmao", "Some small tips even if you decide to play this offstream:\n-Swallow potion that you made for that girl early on is a healing potion that quickly heals you for a short time, good during combat. Food is more of a passive regen with Gourmet (but still useful, food is super important in higher difficulties)\n-Guys on horses - Aard or Igni will scare the horse and bring them down for easy pickings! Fighting on horse is....awkward, in this game.", "What's a Gwent?", "¿Gwent?", "So many white knights it's like Ame transported us back to the 15th century.", "I don't understand this white Knight thing can you enlighten me?", "@Daud ratsu People who come to a woman's aid in hopes of getting noticed by her.", "i will get hate probably but you know gwent is fun too i don't think the gwent spam is to make her mad they probably want to make her like gwent", "You people that complain about backseaters are just as annoying...", "Then maybe the backseaters should stop.", "@Positivitea they prolly wont stop... their aim is to make things bad for Ame anyways~ so lets do our best to support her~", "annoying for you perhaps, but at least they arent ruining the experience for amelia unlike the dumbass backseaters", "Ame complains about backseaters, do you find her annoying?\nI mean what do you expect people to do, ignore them and let them ruin the chat forever?", "Then you're part of the problem OP.", "Welp guys lets stop here.... lets just be better and support Ame~", "@Kent S WE should just ignore them, WE can’t do anything against them and typing a whole paragraph of how “backseat gamers bad hurrr durr” isn’t exactly helpful, actually it makes matters worse"]