["She’s trying to resist becoming addicted to Gwent but it’s only a matter of time. Gwent consumes all.", "Minecraft: Gacha Piglin.  Witcher: Gwent.  What's next for Ame?", "@jack mayor the Pokémon casino in gen 4 (I think).", "We are all of us drawn to the power of the heart of the cards.", "Not me. I'm a card game fanatic, and still can't stand Gwent. From what I recall it's the one thing standing between me and a platinum trophy.", "@jack mayor  I think it’d be cool if she got into a single player card game like Slay the Spire or something", "@Detective Olivaw You know what heart of the cards really is... right? They censored the show in the west xD", "@Freeman319 shut the fuck up its a meme at this point", "@flamingrubys11 Jeeze, somebody got triggered.", "“Up for a round of Gwent?”\n*Emotions less nods", "I'm not sure she has the patience for it. Got sassy about it on today's stream lol", "@Chuito12PR You mean how people harassed her in chat over Gwent, not cool at all. We'll be lucky if she even continues it.", "@Chuito12PR More like chat was being kinda shitty and spammed \"Gwent plz\" whenever they could", "I wish they hadn't ruined the standalone game. I loved that thing so much until the rework.", "Ame: \"I like how Geralt is nice, not just a monster killer\"\nAme: sees first, burnt down village, with crying people\" \"maybe I can loot this place?!\"", "The dead have no use of coin...", "@matchesburn with crying people", "It also applies to those who are fixing to be dead", "Clearly she's doing them a favor by taking care of their worldly possessions while their spirits go to the heavens. Including those who want to join them in their journey to the afterlife.", "@Martin Verrisin \nThere's some dead people around.", "She would be wonderful in a game of DnD", "@matchesburn \n🎶Toss a coin to your witcher 🎶", "She killed that grifin prety nice, I might put a notice up, wonder if she'll help me with a toad.", "You're not supposed to be here yet, Olgierd", "I would love to see her struggling for hours too", "So you are now watching VTubers after your curse is broken....", "so does this mean we live in the universe where Geralt saves you", "You're way too early mate.", "Moved on from iris to simping real quick there olgierd", "Olgierd von SIMP", "Olgierd von SIMP", "Iris would be ashamed", "\"MY CONTROLLER'S NOT BROKEN! okay, my controller might be broken..\"", "Amelia here are some non-spoilery infos & tips about Witcher 3 that may be unclear at first: \n1. Yellow dialogue choices almost always represent story/quest choices and/or push the topic forward while white dialogue choices give you side info and have mostly no consequences other than marked-ones that end the conversation, open the shop or let you play gwent.", "Added Info: As you refused the option to choose your own choices (as suggested by the Backchat boys) from the previous games in the beginning, the default choices has been picked which locked you from some options, quests and dialogues. \nThe guy that talks to you before you meet the emperor while you are getting shaved and groomed asks you questions if you choose otherwise their answers could have shaped your choices from the previous games.", "https://youtu.be/jcQ3_vB1tXs Fubuki so cutee", "@Bread Cheeks stop being a jerk while posting with Amelia as your pfp", "@Coolkid Gaming probably a troll", "Thanks for leaving these helpful comments! As always, Good work with the puns as well!", "@Fire Blaze No problem just hope it helps clear some confusion to not only Amelia but also to first time viewers of witcher 3 =)", "Good comments. \n\"One such choice decides if you get one of my favorite side quests tonewise in the game and has an amazing OST.\" Which one is this I can't tell, is it L?", "@แรคคูน yes", "@Casual Filth Oh I love L, though I don't remember the soundtrack from the quest. Funnily enough my first playthrough I loaded the wrong save from W2 and I didn't get the quest even though I wanted to see him lol. Only realising that after like 90% of the main quest done.", "@แรคคูน can I request something from you? can you Edit the Name from the character  to \"him\" in your Comments so nobody gets spoiled", "@Casual Filth Aight done I edited it. But I don't think it was much of a spoiler anyway. Without knowing the context of who he is first, there's no way to know what any of it really means.", "@แรคคูน still Thanks", "These are some good tips\nI have learned these by playing. Witcher 3 is truly a beautiful game the best open world game that hasnt fallen to the open world curse(repetative quests lacking luster, lacking depth) witcher 3 is truly a masterpiece so happy to see her try it out cuz if we support her enough this might just be a 20 stream game hahahahhaha", "I love how all these look. Like actual in game tips", "She could use a mod that removing death from falling. Also there is alternative controls", "this is actually really hype, I hope you can continue and finish this playthrough Ame!", "Finish the playthrough, nice one dude", "wow.. it gonna take roughly 60-70 hours", "@leonartha03 Took me 300 hours and I didn't even finish the DLC fully. I just fell in love with the sidequests and gwent.", "@Psyda same but she may not finish the  playthrough on YT but we all know that she'll finish the game because  she'll LOVE IT", "58:14 \"He's gone... he disappeared... like a wizard.\"\n\nOh sweet summer child...", "I wish I could've seen the chat at that moment but it was broken for me :( . I hope she makes it to hearts of stone I would really like to see a full playthrough dlcs included", "@BadgerButt probably she will since she bought the game with the dlcs", "@BadgerButt bunch of fuck boys spoiling thats what it was", "@Faķe Hero dlcs are free", "@Hasib Uddin Ahmed  i mean hearts of stone and blood and wine", "@Hasib Uddin Ahmed DLC stands for \"downloadable content\". Nowhere does it say it has to be free. Hearts of Stone and Blood and Wine are both DLCs", "I mean technically the game refers to the free extra missions and outfits and such as dlc and the two paid ones as expansions", "@BadgerButt Yes, technically", "Notorious G.O.D.", "This is honestly the perfect game for Ame in the context of HoloMyth: like Geralt, she too is a being with great investigative skills, uses mystical drugs to gain power, and is on the hunt for legendary and fantastical monsters in the form of the other 4 gals.", "spoilers bro", "Spoilers, please put a warning", "Don't forget geralt is a ground pounder too 😳", "To be fair, Geralt has his \"monster\" friends like the Godling, halfling, etc. Technically, the witches could be considered monsters since most, if not all of them, no longer fit the definition of a human. Technically speaking, neither does Geralt.", "Lulu Irais \nWhat spoilers? As someone who has not played the game yet, isn't everything I put just basic knowledge about the series?", "Geralt is an expert ground pounder as well.", "Ame minecraft murder spree when?", "Well, there are exceptions, as in the form of regis", "I mean let's hope the similarities don't end there Remember the succubuses", "but Ame gonna Smash the other 4 gals... ( ͡° ͜ʖ ͡°)", "Nobody:\nAme: milf guardians", "So that's it, huh? We're some kind of The Witcher 3: Wild Hunt?", "I’ve never played Witcher, but just of the main menu BGM this seems fire af.", "You should definitely play it if you can. Arguably one of the best if not the best game of the past decade.", "The fight BGM is also really good, makes you go LELELELE. Try also listening to Lullaby of Woe.", "I'll tell you that is not for everyone or must play. I personally and some other friends had struggles with the game. Maybe people slightly over hype this game. Is like when everyone tells you to see some series because is the best thing ever and ended up being good but not like they told you", "If you get a chance give W3 a try it's practically on everything current now.", "Big part of what sells it as a game", "@Carlos Arturo Mosquera Delgado if you like adventure rpg this is definitely one of the top on the list, not everyone can handle these types of games so it make sense", "I ve play all the witcher games..highly recommended,its a good game", "It won a ton of rewards and accolades for all of the right reasons. Definitely try it if possible. Playing the first two games is an advantage, but not required.", "@DJLDJ You might want to give Percival a listen. A polish folk band, that has been making music for the Witcher games, I think since the first one. They are fucking good.\nHere's a playlist https://www.youtube.com/playlist?list=PL7E208B456441183E", "@Asrashas I already like it. I feel like I should be a Bard in a DND campaign with these as my listed songs. Ty for the link. : )", "banana tiger", "Play it! It's fire.", "Man that game is awesome you should definitely try it. \n\nOr just watch Ame playing it and experience it with her.", "very good game, starts off pretty slow but gets a lot better mid-game. If you wanna get it, make sure to get the GOTY edition or just buy the 2 dlcs cause they're really worth it", "If you are not into lengthy story/character driven fantasy RPGs then it’s probably not for you. But if if you are into that you should love it, it’s a great game with a fantastic value. In a day and age where developers pump out half finished games and expect you to wait 2 years until they make content and lock everything behind paywalls. The Witcher 3 is a finished game with like another 50 hours of content with the DLCs. It deserves rewards for that alone.", "@Carlos Arturo Mosquera Delgado How can you struggle with this game....", "@Armi not sure. Don't get me wrong. In my opinion is a good game and I understand why people said it's probably the best rpg or one of the best in 2010s for example. But for me it's good but not great. I'm going with skyrim for example all day before tw3 it's my opinion. Maybe because I didn't play the games before and cannot really relate with the current tw3 history.", ".", "@Carlos Arturo Mosquera Delgado I mean if you’re not into story driven open world games then it won’t be for you but other than that it’s pretty much a must play", "@Riastradh actually that's my favorite type of games hahaha. Skyrim, AC Odyssey. GoW 4. Honestly I would recommend any of these before TW3. And again I'm not saying it's a bad game just not great for me", "@Carlos Arturo Mosquera Delgado I’m the reverse. But that’s likely because witcher 3 put more effort into things I enjoy, like satisfying side quests, enjoyable side characters and choices. Those other games are lacking a bit in those departments but make up for it in ways I don’t particularly care for. Except GOW4, that games pretty cool", "@Riastradh skyrim lack in side quest? Lol", "@Carlos Arturo Mosquera Delgado ones that make me care about the people in them. There are a lot of them though", "@Riastradh I personally disagree with that. I would pass hours and hours in skyrim before even killing the first dragon. Actually the main story quests are the very last thing I do.", "@Carlos Arturo Mosquera Delgado same with Witcher 3. If it weren’t for one of the expansions technically taking place after the main story. But Skyrim side quests just don’t pack that punch the Witcher 3 quests do. There’s no human feeling to 90% of the characters. And FUCK I can’t think of a single meaningful decision you make in the story. But with the Witcher 3 it is packed to the gills with details and changes that occur within hundreds of decisions all over the game. Skyrim obviously gets a bit of a pass being older, but it’s still relatively worse off. For creating your own character and roleplaying it, things like that, obviously the Witcher can’t touch it", "@Riastradh meaning full decisions? Destroyed or not the assassin's guild. Become or not a lord vampire.Join basically every guild or institution you want. Killing or not your enemies. Being the good guy or not. Actually in skyrim the decision are not limitated to say one thing or other in any moment feel like you have the control of your own story. And that freedom make you related more with your own character. In tw3 feel more like a dragon age to me. Yeah you \"take\" decisions but only when the game want you to do it.", "@Carlos Arturo Mosquera Delgado and a lot of those decisions don’t actually have any effect on anything. What actually changes when you become head of all those guilds. Pretty much nothing. What happens when you decline a quest in the Witcher? The state of an entire city changes. Your choices going forward change. And Skyrim gives you plenty of binary choices too. All I’m saying when it comes to quests, the decisions made and their consequences, the Witcher 3 is more finely detailed and impactful. Skyrim the only real meaningful decision I can think of is kill the vampires or blot out the sun", "@Riastradh do not have effect? Man im just stopping right here. You looking like never played Skyrim for saying that kind of stuff... The last thing I have to say it's. Again witcher it's a pretty good game. Really overhyped not sure for what but still pretty good. But when it comes to games is as subjective as music. And for me its just another good game that I really would not play more than one. Difference with skyrim and others RPG couse every save feels different. Good attempted but I would never think on witcher like the best rpg ever not with FF, Skyrim, DA. And many others that I personally feel are way more enjoyable. That's how it is.", "@Carlos Arturo Mosquera Delgado literally bought Skyrim the week it came out man, it sure say what you want", "@Riastradh and? Same here with the witcher and look me 🤷🏾‍♂️", "@Carlos Arturo Mosquera Delgado yeah but I never said you didn’t play the thing. Keep it together", "First death: 15:50\nAmazing haircut: 43:00\nLooking for a woman: 55:27\nTime to kick some ass: 59:32", "1:01:34 \"The MILF guardians\"", "Okay now Officially I'm in the hole", "Welcome", "@leonartha03 Thanks", "@Reg Another one bites the dust. Also welcome", "Enjoy your stay. You won't be able to come out for a very long time.", "Welcome brother", "Ahhh thanks everyone. The hole looks really comfy", "The walls are coated in honey so you can't climb out. The honey tastes really good though.", "Once you have it in you, it will only fade away and can be strengthened again,  but never disappear.", "Ame is so sweet in this stream", "Ok there’s me(Jesse), anakin, grievous and now obi wan Kenobi. How did we fall down the rabbit hole? 3:56:25", "The moment Kenobi is mentioned general grievous literally responds with his “You are a bold one!” Quote", "Ame is such a sweetheart. Showing support for her friend's milestone. ♥️", "Hic", "Hic", "Where is time", "@Aloe Virus Can't make a timestamp cause basically what happened was Ame took a break from her on going stream of Witcher to go and watch Gura's superchat stream in celebration of hitting 1m subs.", "The absolute mad lass\nFull play through with both DLC, let's gooooooo", "I witnessed history in the making: Carl finally became an investigator! After tons of his pointless and not-so-pointless superchats, he finally became an investigator with us! He sent so much during this stream lol, I think Amelia mentioned him 6 times during the superchat reading.", "Who's Carl?", "@Knoldpold simp", "Carl is a legend. He's probably donated more than anybody else to Amelia. Forever he will be known as the MVP on Ame's channel.", "7/10 - Not enough GWENT", "It takes a bit for the gwent bug to bite. At least it did for me.", "I don't like Gwent, but that's the fun of open world games, everyone plays in their own way, but the chat doesn't understand that sometimes", "@Julius Zeppeli Exactly I did not even play gwent in my first playthrough, but in my seconds I became addicted to Gwent. Play the way you like.", "Man I've never played this \"Witcher 3\" game, but this \"The Wild Hunt\" dlc sure is popular. I hear it even won game of the year when it came out!", "The Wild Hunt isn't really the DLC. There are two main DLCs though. And yes, it was game of the year. And to this day, it's still at the top spot on a lot of lists of best games since its release. It's not as flashy as other games, but it feels down-to-earth for a dark fantasy game. And it's just executed perfectly overall. You should try it if you can. Personally, I've replayed it a few times over... As long as the gameplay is.", "@SenseofNone  You have a fitting user name.", "\"But why?\" ", "6:19 \"I have to remember not to press the mute button\"\nLife lessons with Amelia.", "Watching Amelia jumping off the top of a building not just once but twice had me on the edit:floor 🤣", "This is pretty hyped of Amelia to play this game and the NSFW censors are comedic haha, wonder if she read the books and tried watching the netflix show.", "Yeah she read first couple of books and watched the show", "@Amandor nice, she should try to find the old tv show polish version \"The Hexer\", maybe a watch-along heh", "unequips igni\n\nAme: how come I can't use my abiiity?", "Honestly you could've not pick a better game for your character, wise choice Ame", "Witcher is kinda like a fantasy detective. Thats accurate", "Trying to go 1 second into the video without someone urging her to play gwent", "1:10:47 I can't remember last time I laughed so hard xD", "Ah yes the Minecraft is getting to her", "Hope she completes the game, it will be an epic journey.", "I really enjoyed watching Emilia Witchson play The Watcher Tree featuring well known characters Jerald and Jennifer!", "Ame: I don't really know what I'm getting into.\nMe remembering how the prologue starts: Hooo boi dis gon be good!", "I love how she's so competitive (TOXIC) on FPS games but is so chill and wholesome when it comes to RPGs.\n\nAlso, she's wearing her heart on the sleeve on this one. More lewd comments as usual. ", "Chill and wholesome... Burnt village with crying and broken villagers: \"maybe I can loot this place!\" lol", "@Moik-sama ngl, we all had the same thought. Leave no stone unturned XD", "*streamed 5 mins ago*\nme: eh its 3:27am..  might as well watch this", "Sleep is for the weak.", "\"How 'bout a round of Gwent?\"\nnods", "Is this what's here name?\nYeah Jennifer.\nMe: facepalm.", "This is a pretty chill stream but interesting too,  but man, chat really wants her to play that GWENT card game  more huh..as if her minecraft addiction was already becoming apparent each day. Anyway, thanks for the stream.", "\"Anyway Geraldo...\" \nOmg Ame, my sides. 😂", "Can we all agree Amelia is a murder hobo? She only seems to be motivated by killing and looting with sprinkles of being nice in dialogue.", "If I had a quarter for every time Ame asked a question this stream I would be able to quit my job lol", "Lol Ame was like a mom to chat during when she was buying gwent cards😂😂😂😂😂", "I'm disappointed that none of the superchats were \"toss a coin to your Amelia \"", "50:50 Lmao! Amelia as the mom and we're the kids at the store. Also, literally every mom ever, in the end, they still listen to their kids.", "Inb4 Amelia's addicted to gwent", "To all the Gwent Crybabies, there's a standalone game for that. Next time she asks what to play next, you can tell her about it.", "70% of chat was just \"Gwent\" lol", "I'm only like 50 minutes in and this is already making me really happy to see you playing witcher 3 \nyesssssssssssssssss", "It's kinda refreshing to see someone playing his first RPG :D", "Witcher is one of my favorite franchises, read all the books and played all the games. Glad you're enjoying the game Amelia! Don't let chat backseat too much and try to force you to play a certain way, Witcher 3 is a game about options and choices, YOUR choices.", "I adore Amelia, but goddamn this is painful to watch. HOW DO I EQUIP SILVER SWORD. HOW DO GWENT. WHAT AM DITECKTIVH SENCE", "Great stream as usual!", "I always recommend playing the game in the highest or second highest difficulty for maximum immersion.", "Ah yes, once again i can see my favorite game character Jerry of River in action again fighting those Milfgaardian", "It's not Jerry. It's Geraldo of Riviera XD", "Legitimately, this is your greatest stream yet, and I am so glad you are playing more now.", "What is it with vtubers playing a game precisely at the same time I do?\nLast month was Korone with Assasins Creed syndicate, I was by sequence 9 when she did.\n\nNow Amelia with The Witcher 3. Im around the bloody baron quest now", "1:10:47\nAme   : WHEEEEEEEEEE\nGeralt : AAAAAAAAGHHHKK", "Aw, she didn't get the raven crystal skull\n\"How long can a witcher live\"\nThat is kind of unkown. In the books it is said that no witcher has died of old age yet. Vesemir is probably somewhere around 300 years old.", "whow, this game is so right for Ame...\n- Wither does a lot of investigating\n- has lots of 'concoctions' \n...", "this stream was so good but the backseat gammers always get me :c good job tho ame! ❤", "whow, I remember that Wraith being quite difficult... and she killed it like it was nothing? O.O", "Likes to slap tree trunks for some reason and thinks big crows(ravens maybe?) look like chickens. Gotta love her, lol.", "This video was so good but chat was cancerous as hell,arguing with each other,back seating and basically making her pic certain options and then random idiots bitching about the title. I just turned chat off at one point since they were so annoying.", "Ame's chat is always so backseaty, I guess its because unlike Ina who just ignores backseating Ame always does the \"But, Why?\" which kinda encourages it.  The amount of \"don't pick herbs\", \"PLAY WITH CONTROLLER!\" an hour in, \"GWENT NOW\" even though she hasn't encountered a single gwent npc is super annoying.", "Amelia should play Persona 4 or 5. A real detective should know who the true culprit before the reveal...", "I concur.", "https://youtu.be/jcQ3_vB1tXs Fubuki so cutee", "if only Atlus weren't cowards", "Danganronpa too.", "Are you crazy.It takes over 100 hours to complete and they don't have time for that.", "@Abhishek Venkat wym they don't have time? Depending on how much they love the game they can zoom through it. Calli and Ina (i think) are already persona fans anyways", "Probably not going to happened. Atlus screwed a bunch of streamers, including vtubers from niji and other agencies, for streaming it with monetization on earlier this year. You can't stream it with superchats on and you are explicitly forbidden from playing the last palace in both persona 4 and 5. If you do, they'll copy strike you to oblivion.", "Why do these archived streams load so bad. I can watch the rest of you tube in HD but these stop constantly to buffer.", "32:00 \"MILFNGUARD\"", "I don't know if she'll ever read this but just a few tips for playing. \n\n1. Use your signs more often\n    - Always use your Quen before you engage in combat, and refresh it every now and then, to lessen their damage.", "4:13:55 Amelia in chat: \"Sorry viewers, no ara ara or special for today, o7 \"", "https://youtu.be/jcQ3_vB1tXs Fubuki so cutee", "Why even live?", "@Bread Cheeks how is this relevant to Amelia? Cool video and all, but how is it relevant?", "So we’re calling the endings Ames special?", "wait your telling me that she DID do something at the end? BUT YOUTUBE CUT IT OFF?!?!?! what did she do at the end? I don't wanna miss a post-credit scene :(", "Ey guys just a quick reminder you can switch to top chat instead of live to clear off some not very nice messages. I was really confused why people were making a fuss about rule 4 when I only read like 2-3 violations. Other than that just RIB like always and don't acknowledge them.", "Have to give Amelia credit, she was able to kill the Griffin without using Crossbow bolts.", "Normal difficulty griffin u probably can kill without swords equipped.\n\nCombat is not the stromh point of this game especially early", "Wish I was in Milfingard", "A great game for a detective is Danganronpa, look into it. Great game to stream.", "Did anybody mention what happens when you exploit the cows for loot?", "50 part Witcher playthrough incoming? XD", "Ame. This is an RPG. A role-playing game. The point of open world RPGs is to create your own character and make decisions that affect your story in the way you would like to play your character. What chat thinks is good is what they've enjoyed. Plus, if you rely on them for every decision, you'll be backseated to heck, considering all of these people have probably put a hundred hours into the game. Just play the game. Enjoy exploration. Enjoy experimentation. You can respec, you'll find your preferred playstyle. You don't need chat.", "41:00 ..... she's never gonna finish this game, with that attention span XD", "my attention span was that bad and it took me 165 hours to finish the game", "@Kumewko I have 109 hours (according to steam) :D and I still didn't play the expansions (no time, but I will one day, I swear!)", "@Martin Verrisin me too. My game time around the end of main story was around that, both expansions took most of my time because it was too good", "\"banana tiger\"", "The Novel looks good too", "It's like she's talking to children \nNo you can't have all the candy pick one no I don't have money huh don't make those puppy dog eyes huh I'll buy them", "I really have to visit MILFengard!", "Nice censorship from ame, i shocked she play this game in stream because you know nsfw thing and youtube kun can angry", "The fact that Ame doesn't realise that Gwent is end game content saddens me", "Looks like you\\re in need of the patented Haachama Sensor jail...", "This heathen tried to skip gwent?! Doesnt she know thats the main game?", "1:47:40\nI wonder where is she looking hmmm", "50:09 -  51:36 \nAme and chat in the toy store.", "\"Me Pan\"", "Thoughts; first stream\n- Ah, Ame calls Geralt Gary. Gary of Nivea is in! \n- Bathtub Geralt censoring is hilarious\n- Witcher 3 fall damage is a bit notorious especially around launch, so no surprise you fell to death after doing that lol, funny though", "Gary of nivea lmfao", "You might not even remember Triss from the Series, BUT you will understand why she's great once you meet her in the game!\n- The part might not have been big enough, but they did not pick the best actress...", "I feel sorry for her. Majority of her chat is obsessed with the card-game. xD I finished three of the books so far. The 8th book has a story that occured at the time between the span of book 1 and book 2, wich is why I shoved that one inbetween and only recently finished Sword of Destiny.", "I skipped around the video and its all backseat gaming. like damn guys chill out", "Took me 200 hours to beat this game and all the dlc along with all the side stuff.", "you'll love viper armor then, ame. but its only in the dlc though", "Hope she fights Detlaff on the highest difficulty", "damn i missed it", "Ame just have sum problems with heights eh? LMAO", "Best to focus on what you end up using a lot in fights, \nTips and Survival\nif your reaction is good, max dodge, it will become iframes at max level, always become immune to damage if timed well.( dodge over roll, faster counter). A single level of range block is also nice, no need to roll from arrows( though it doesnt look realistic) ", "shes making me think shes the kind of person that gets into the car to go to her neighbor", "Ame should try Assasins Creed", "my fav gremlin playing my fav game!", "Ame's chat is like Semi-twitch chat", "oh boy i love the adventures of Geraldo & Jennifer", "Chat was awful with the backseat gaming this stream...looking forward to the rest of the playthrough though! ", "The chat was awful during this stream...", "Listened to English dub for a moment. Like Russian dub more tho- it's much more rich, I believe (though it has sync problems)", "Sensitive DPI, shaking camera. Right, she's FPS gamer", "Honestly you should've gone with the arkham series or L.A.noire\n& Witcher 3 is a loooooooong game\n   But this is good", "When Ame plays fallout new vegas is chat going to demand she play caravan as much as gwent?", "32:00 Milfenguard", "i like how some people call Ame mom, so imma call her mom too", "Mommy watson", "it's the reference because she carry the team in minecraft", "Who's Ame? You mean Daddy?", "@imagine being a mouse you could call her that too, but my Dad is Ina", "@Virro The Wizard So it's Ina and Ame, Calli and Kiara and Gura and", "gura and doors", "Jerry and Jenny made my two days LOL", "Pretty sure the books don't reach this point Watson. CDPR's stories are more of a sequel to what the books establish if I remember correctly. Also, if you're still reading The Last Wish, pay attention to the Voice of Reason chapters because they basically tie the whole thing together, since the Witcher started out as short stories in a sci-fi magazine.", "Amelia baby!!", "ummm. witcher 3 ,  bang bang bang", "I'm just gonna put this out there - Yen>Triss. Good game choice, Ame!", "cyberpunk after this?", "Witcher?", "It bothers me how she will just go straight to the point in a conversation and miss all of the extra tidbits of story", "She did that since chat wouldn’t shut the fuck up and kept complaining about her choosing the white options,annoying as hell back seaters.", "Hi Amelia, short list of advices here. Please don't consider it a backseating, it's really about better experience.\n\n1. Don't ignore side quests. They are not just for experience and loot, the plots of many quests are really deep and juicy.\n2. Explore the map when you can, it's an adventure itself.", "This game sure looks interesting!\n\nIt's pronounced 'cat-a-stro-phe' (four syllables) in English. The way Amelia pronounces it at 3:55:00 is French. :P", "Also one of her favorite games as a kid was a french game coincidence I think not", "@Biton Charles what game?", "@Izzu D dofus, some strategy mmo", "I wanted too say that remembering your sweet voice inspires me to be calm when i am angry. Today I lost it and tore everyone  a new one and won. But this was not cool too me. Then I remembered u exist...  And a slight happy mood came back I play to have fun not get mad.", "I wonder what girl Ame is gonna go for", "It's gonna be a long but fun ride with this game", "Amelia i hope u finish my favorite game ❤️❤️❤️", "Tea time at 2:54", "i wonder who will finish the game first internet historian or amelia", "At least she guards our moms after she pounds them.", "I wonder if Witcher Amelia will accidentally enter a portal to the new world one day... I dearly hope so", "I'm here for the archive. But why is there no live chat replay?", "Takes several hours for youtube to process. The longer the stream the more it takes. Why  does it take so long for text but not for the video itself? Only youtube knows really.\n\nThe streamer can also leave it unavailable so that they can moderate it and then put it up later. But i don't think they are doing it here.", "Please don't spoil or backseat for Ame, unless she asks to..", "Good 3/10", "Will Ame be the one to play Cyberpunk?", "MILF'EN'GARD", "if it was voiced better wouldv been reaaally epic. he sounds like a soundboard.", "The english dub still hurts my ears", "Witcher is too easy on \"normal\". The real normal is blood and broken bones, they dumb down the ai on the difficulty she chose.", "The AI is pretty dumb on all difficulties. They just don’t gut you in two hits on B&BB and DM", "1:47:24 whoa\n2:28:40 nice", "Sup bro", "Poland gang rise up or something", "If you're reading this,", "Goddamn right, I can!", "More like Amelia Robson.", "While I'm a Triss man myself I can't blame folks for falling for Yennifer.", "Heretic! \n\nJokes aside I can get why people like game Trish, when we include book Trish though... well, then she becomes a hell of a lot less cute!", "@Wolfie See, people say that but I never get why. So she seduced Geralt. Not like him or Yennifer are exactly faithful...", "Ayy she fixed the title. It was Le'ts Begin before. Anyway, minor nitpick compared to the quality content you keep producing. Can't wait for stream #2!", "You are the best because you speak english correctly and i am happy", "El Brujo Pirujo 3", "yes", "Pretty sure the last time I played Witcher 3, over half the game time was spent playing Gwent.", "ikr.. i only went to finish the Wild Hunt side quest after i done with the Gwent Main Campaign...", "jeralt", "Not playing Witcher in polish.\nCringe.", "Oah", "Witcher 3 is one of the best game’s of all time in my opinion. Hope to see these streams continue.", "Garry and Jenifer \n..... -_- ........................  ...........      NOOOooooo why?!????????......", "This hurts to watch, so many missed dialogue options, not to mention quests.", "I can't wait for when she starts playing Gwent more than the actual game itself.", "To be fair there isnt anything \"not safe\" in the intro scene right? she was kinda overracting. Fair enough tho", "fun fact: dont breathe through your mouth, the nose is where youre supposed to breathe from, the muccus and hairs in your nose is there to pickup impurities in the air before it reaches your lungs, in the human body there is no air filter in the mouth, SO DONT USE YOUR MOUTH TO BREATHE", "Imagine a playthrough of Witcher 3 and not choosing to sumulate Witcher 2.", "Imagine caring", "As someone who played the heck out of this game and (currently playing this game again on ps4) she is painful to watch, is nobody telling her to loot the enemies, she missed quite a lot of alchemy ingredients", "I like Ame when she play other game but man, the way she play this game, she rush, not paying attention to game mechanics, skipping almost everything, make me feels kinda uncomfortable, like this tye of game is not for her. Hope she will be more patient and play better.", "I wouldn't worry too much, was the same exactly for me, and ended up buying the 2 dlcs and loved the game (except the novigrad part, fuck novigrad)", "Yeah man, hope she not listen to negative/ annoying backseat too much, this kind of game is best to learn and explore by yourself. She will love it.", "I feel kind of the same, sadly. Her mouse sensitivity in combat makes it especially hard to watch, too."]