["The ancient ones confirmed Ame is indeed lewd, Ina is NOT seiso, and chat is never getting married. \nF", "always has been..", "The Chat:\n\n\"Driven over the edge, taken into madness.\"", "And senchou's age is yes", "Don't forget that Gura is a shark and is over 9000 yo", "I wasn't on the chat at the moment, so me and whoever didn't talk still has hope! :D/", "F", "@The Lone Tourist \"How quickly the tide turns.\"", "@Maoh Emu fucking genius", "F", "Ina is a yandere", "Ame don't love you chat.", "Yeah, well it also said Yagoo isn't best girl, so take this with a grain of salt.", "thank god i was not in the chat.", "Ina did said that she's seiso when she says. so", "\"What is Marine's age?\"\n\"Yes.\"\n\nAO-chan why", "I almost spit out my water when this happened", "based", "The sequel to \"Calli, how old are you?\nNo.\"", "Timestamp pls", "@araragi Koyomi 45:18", "@Adriel thanks", "Y  E  S", "I think what it's mean is what ever what we thing her age is  😂😂😂", "The law requires me to say yes.", "@Harvey Eddyson my mind said marine is 28 so this is a big yes", "I feel like noel is 24 in that one live so maybe marine is 25 or something?", "\"is ame really a detective?\" : board goes to \"No\"\nAme: confused scream\n\ndoes that mean....she really is an assassin? ;p", "It's isn't even clear that she's a human", "Maybe is like Jackyl and Hyde she has another personality inside her", "She say the board doesn't recognized because she's a time travel first and detective second.\nAnother excuse she said:\n\"I don't have my coat\"", "She’s an architect - owner of Watson Industries.", "Maybe she's jack the ripper", "SHE IS A RULER JUST LIKE SHERLOCK\n\nOr...could she be a Avenger?", "she's not anymore, she's now the CEO of Watson Industries", "Kiara theorized she's the one behind the happenings in Kraven Manor.", "Shes an imposter", "She's like Dexter. She's a detective, with a darker secret... she's a serial killer.", "That begs the question is ame the one who assassinate JFK?", "Ame is a ruler/caster/berserker", "She's aa zoomer", "Time travel first, the detective is the only occupation she picks up along the timeline, she might even have alchemy job skill as she makes her own Watson's concoction.", "SHE IS A MIAMI MUTILATOR", "Well it does have ASS in it twice😉", "Ame is actually a human trafficer, what do you think all the drugs are for", "\"What's Marine's age?\"\n\"Yes\"\n\nUnderstandable, have a nice day.", "You make my day", "So it's confirmed: Ame is a toxic lewd boomer zoomer and Gura can in fact swim. These spirits are quite knowledgeable.", "Yeah, it's also good to know that we will never get married.", "@Nasu but hey, atleast we get friends", "n", "And she doesn't like Chat, but it's okay because Chat doesn't like Chat either", "First time?", "And she ain't a Detective", "@Lira Weon She's a time traveler first and a detective second.", "Since Ame already uses the military term, ground pound, we might as well call her another military term, boom n zoom", "@Dylan Stafford she's a CHAOTIC MESS first, then she's a time traveler and then she's a detective", "The most important thing is, takamori ship has sailed. And ina is not seiso", "She is a drug dealer for spirit's sake😂😂😂", "I've been saying this since the beginning sharks can't tread water that's why she needs floaty' s she can breath under water do of course she can swim just can't hang out on the top that well", "@Nasu  aa⁰", "@Nasu always has been..", "The Ouija-Session in a nutshell:\n\"The Ancient Ones are with us!\"", "\"The Ancient Ones are broken\"", "@sensei_1 \"The Broken Ones\"", "but they said no when asked if they were there.", "@Jo Stro they say no to everything", "\"Is yagoo best girl?\"\n\"No\"\n\nThats it im destroying that ouija board", "Enma is the new best girl", "it's because AO-chan wants ina to be best girl", "@a Facts", "Is Amelia toxic ? \"Yes\" well that was quick", "So much new lore.\n\nGura can actually swim.\nIna's not seiso.", "She's also apparently a Boomer + Zoomer, and her soulmate is an imposter 👀", "Time stamp pls", "I don't know if Ame being toxic counts as new info ", "@Stephano Piuzzi \nAme: I'm not toxic, I'm honest. Am I toxic?\nAO Chan: Yes\nAme: cute gremlin noises", "Marine's age is Yes", "Ame is also confirmed lewd", "turns out \"I'm seiso cause I say so\" isn't a valid reason", "@Gonzalo Vasquez oh I remember that", "Calli loving Kiara isn't new lore, everyone already knew. Everyone except Calli, at least.", "@Turd Ferguson 32:28 35:59 38:28 40:15 47:09 your welcome", "@Wrekt She is a detective after all, she's got some work to do.", "TBF, Calli never said she didn't love Kiara, just that Kiara is sometimes pushy loudmouth. Part of Kiara's charm, no doubt, but everyone needs their space, y'know?", "Gura also confirmed being a legal shark loli.", "Ame: Oh Ancient ones how old is marine Senpai?\nAncient Ones : Yes\n\nme:OMG  THE ANCIENT ONES KNOW THE MEME!!!", "They did it for the meme", "Ame : what is Marine senpai's age?\nAncient one : YES\n\nEven ancient one doesn't know. I'm guessing it's around Elizabeth II", "Sanvich", "Way older than 9000 since they knew Gura's", "GUYS I KNOW ELIZABETH II'S AGE, HER AGE IS-", "the ancient ones love Tourette's Guy more than I do", "@Yaboi_J-Lof ask captain or gura they maybe know", "Actually her age was already revealed, it was during the 3 third half of the second Season.", "I guess Marine existed before even the ancient ones, almost as old as time itself", "Concoction wore off, but the fact that Ame doesn't love chat still haunts me...", "Pog", "And don't forget chat is never getting married", "Don’t worry, that was just a bad hallucination caused by an overdose of the concoction.", "@Christian Cinnabars I hope so", "chat dont love chat also tho....", "@Christian Cinnabars probably.....", "It’s worse than getting friendzoned", "Ancient Ones tricked Ame into admitting she loves chat.\n\nEldritch Wisdom at it's finest.", "Ouija questions/moments:\n23:00 Yubi offering\n23:20 Ame flexes on a spirit by kicking it out and bringing in a new one\n23:42 “Are you there, spirit?”", "Nice", "Is groundpounding the ghost's mom count as necrophilia?", "@Dylan Punongbayan Mom is Mom", "According to the new stream.. Gura got imposter first. Gura x Ame confirmed??", "my man.", "@• Mochii Animations • oh ho ho! Ship confirmed!!!", "Yagoo isn't best girl\n\nHE'S BEST BOI", "aka: AO-chan bullies everyone for 1 hour straight (with watson concoction extras)", "This whole stream is not real it's not gonna hurt you\n\nThe Whole Stream:", "\"I'll skip the watchalong of the scary stuff and watch the next stream!\"\n\nThe next stream:", "Amelia: is Kiara top-right? \nAncient Ones: yes \nchat: confused screaming", "Huke: You're not supposed to do that", "I have a theory, the ancient ones said top right, because they read the graph upsidown, meaning kiara iiis bottom left :p jkjk", "When she sings, Kiara is top right. Otherwise she is bottem left.", "Always has been", "They also said she is bottom left. AO-chan knows what we all know... Kiara can be both top-right and bottom-left depending on the moment.", "She's a Schrödinger's Phoenix.", "Just like Mario, when you go further bottom left, you will appear in the top right.", "This was such a trip of a stream. Ame's reading voice had me melting for her even if it was Slenderman, the Ouija/AO-chan Board session was fun (the Takamori confirmation was the highlight for me), and of course the actual Concoction-trip moments. Love the effort Ame put into this, despite how scuffed it was. Would get high again!", "...but  for now, Marine-senpai's age will remain...\n\nUnsolved", "Sorry for ruining the fun, but marine is 27, she's not even that old. I wont tell who, but there are a lot of hololivejp girls that are older than her, so it's kinda funny she's the only one that's called a boomer", "@Comrade Bintang everyone knows that, party pooper", "Im surprised you guys didn't comment about the unsolved reference here?!?", "@Comrade Bintang just an inside joke 😀", "Hey ghouls, it’s me..... yagoo", "Well finally the drugs came back", "About time 😂", "While the others who watch the debut stream everyday just for the concoction :\nYou'll get used to it", "The drugs always stayed", "I wonder how many drugs she still hide", "Hopefully this will be a reoccurring thing, because I like it!", "Earth Wind and Fire", "The Ancient Ones are just biased against Amelia and decided to pick the most embarrassing answers on the Ouija board.", "I fear no man\nBut that thing...\n\nA M E", "Hey, I'm not gonna talk about that freak, alright? She's not here is she?", "@BarbedBLINGa HOW DO I GET THIS FUCXXXX OFF?", "You mean.... It scares a me  :p..... Badumtiss", "Ame should release an audio book! Her reading was so good that I actually thought it was prerecorded. All the work that went into this concoction was just great! \n\nThough I will say Ame’s soulmate being an imposter is kinda sus.", "Ame's voice is similiar like Choco. Good for your ears. \n\nAnd both should do some ASMR reading stream thing.", "Amelia should consider doing reading streams, it could be pretty comfy.", "@DBT naaa, mickey mouse called he wants his voice back. Jk\n\nBut ame voice is nice", "@gary Choco, not Coco", "Ame: \"Who is Ame's soulmate?\"\nAncient ones: \"an imposter\"\nAme: \"That's too vaue!\"\nme, who remembered the HoloEN Among Us meme: \"IT'S HAACHAMA!!!\"", "\"We can ground pound the spirit's mom\"\nFinally", "People: Just a British girl, what is she doing in HoloMyth?\nWatson: Hold my syringe.", "Here is my Hololive head cannon - the reason that the AO said Yes about Kiara on different sides of the spectrum is because she has infinite lives, which is also why the AO said that Calli loves Kiara. Kiara doesn’t always remember all of her lives and experiences in the underworld and the living world, so Calli is hesitant to open up to Kiara over and over again, so she’s jaded and calls her “Kusotori” to avoid the constant cycle of getting hurt from Kiara’s memory loss.", "Thats depressing", "@elnictomeku _ on the flip side, they’re always destined to be together", "@Google Poodle that makes even more depressing because it causes Calli to be even more attached", "Kiara is innately drawn to Calli, which is why she has skulls in her eyes, because her soul remembers her and that’s why Calli was touched. That’s also why Kiara feels so at ease calling Calli her wife right off the bat and flirting with her. It may be painful for Calli, but she gets to fall in love with a new Kiara every life cycle, since at the basic core of her, she’s the same person. It’s just why she has a hard time opening up to her, because she doesn’t remember all of the good and bad times, and they don’t always find each other, so they don’t end up together every single life cycle. These are all my nonsense hypotheses anyways LOL.", "@Google Poodle This could be a pretty good fanfic", "@Banana Senpai thanks!", "@Google Poodle Is this Re:Zero", "Fuck yeah I dig this", "I'll be waiting for a fanfic of this", "@Ritsukou Neptune リツコウネプチュン hahaha. Just listen to Calli’s new song and pretend it’s talking about Kiara", "@Hatsune Pichu lol nah", "@Google Poodle or Live Again", "I've seen 3 epic fanfics, is there anyone archiving them?", "@AryaZaky Iman Fauzy couldn’t tell you lol", "Bro this is the plot of Seven Deadly Sins", "BRO WTF MY HEART T👄T", "@Alysson lol nah. However, I’m sure you can draw a connection to any sort of fictional story involving time, reincarnation and romance. It’s not all that unique of a concept.", "This reminds me of Nier Automata", "Sounds like TNO.", "That's... \n\nActually tragic, lol.", "romeo and juliet who?? i only know life and death, kiara and calli :(", "\"Press anywhere to expand or contract that point.\"\n-Amelia Watson, Halloween 2020", "Ame : Does Amelia love chat??\n\nAncient Ones : No.", "Expect the unexpected", "This Ouija Session...\n\nIt's knowledge are enough to drive one into the brink of madness.", "\"Is gura actually over 9000 years old?\"\nGura in chat: \"uh oh\"\nBest moment", "Watson: \"Ouija board said I'd marry C-H-A-T in the future.\"\n\nChat: hear wedding bells", "Luigi board*", "13:43 Ironically the joke landed better with the filter breaking.", "Damn that was one hell of a roast", "Lmao", "Cutest monstah", "Has a lot of fun during this stream, 10/10 would be drugged again!", "56:00 this will haunt me for the rest of my life", "H̸̢̢̩̞̙͉͔̼̬̱̠̘̱̤͚͈̫̜̄̚̕ͅA̴̢̛̹͓̻̦͇̯̖̫̳̟̳͒͌̎̈́͊̈͋̂̾̓̑̄̄̍̒͊͗̽̔͋͗͘P̴̧̧̧̜͉̰͖̭̗̫͎̫̣̜̼̽́̎́͛̅͛͐́̂̋̾̈́̒̃̈́̿̑̆͜ͅP̵̢̩̐̄͂́͐̋̊̄̊͒͗̐̍͛̏̚̕͘͝Y̴̢̭̦͎̱̘͉̓̿͆̇͒͛̏̽͊͋̍͒̾̅̎̓͐̚͠ ̵̙̩̦̜͇̰̦̗̻̙̪͕̯͕͈̙͓̟̹̫̦͉͚͛̃̓̃͗Ĥ̵̠̲͓̠̩̳̰̟͖̤̘̟̉̌͊͑̀̓̓̓̽̍̀̚͜͝͝͝͝ͅA̵̧̛͎̮̿̆̅͊͒͋̓̀̀̾̀̀͛͌̔͛͛̀̚L̸̗͇͔̰͖̩̝̤͙̔̕̚̕̕͝L̶̩̟͓̖̖̹̘͈͚͈̟̫̻̄̈́̈͑̅͗̅́̐̊̓̓̒͛́͐̈́͛͜O̷̮̝̙̪̘̅̆͂́̌̍͆̂̈̕W̵̳͖̱̬͉͈̯̹̦̰̬̯̮̞͖̞̰̭̱̙̙̅͗̎̍̔͂̍̒̐̌̌͊́͆̓͜͠E̴̡͔̭̣̼̫͍̲̣̜̾͗͗̽͐͑̏̈̇̑̓̃͗̓̃́̄͋͝E̶͕̞͇̲͚̻̭̹̙̜̞̜̪̺͙̼̅̓̏͊̑́̕͜N̵͖͍͓̥̰̮̲̫̟̭̥̓͑̽̿̔̌͐͛̀̌͛̂͐͌̆̋͘̚", "@Lukiepies456 a happy doom guy noises", "32:27 just confirms my theory that gura wanted to give them a false sense of security, and an easy meal if they ever went to the beach", "Gura: Oh no, get him!", "The beach episode would have been gruesome af.", "Or she could've learned", " she could always swim. swimming=/=floating. im a prime example of this. if i stop swimming i'll sink like a rock but if i keep swimming i'll be fine", "The real Ancient One is the friends we made along the way.", "That ouija board session was a chaotic mess of “scarily accurate” and “scuffed as hell” lmao", "Its almost as if its random with a 50/50 chance! O: Serious though. Real Ouija boards are an entirely different experience. Really spooky.", "@Al'yelia I don't understand how they work... However, I myself am able to occasionally see spirits but have never been able to converse with them... But I have seen like alters and offerings that spirits do seem to congregate around on occasion which I am unsure how to feel about :/", "@Tyler Jaedon Naidu Its something to do with the people conjoining their mental powers or \"Soul\" power or something or other, The Astral energy that makes up our emotions and thoughts. The more people who channel their thoughts into a singular purpose assists in guiding energy to a beacon, And the ouija board is just an easy way to communicate, Other forms of \"Ghost talk\" Exist, Like a Spirit box. Or a Seance. Though a Seance works exactly like a Ouija board, But without the Board.", "@Al'yelia so accurate that there was an experiment where someone blindfolded the practicioners and somebody rotated the board 180° mid-session and the SPIRITS never noticed so the individuals were spelling garbage words because their hands just went where they thought the letters were", "@Ketsuban Solo \nOr that the guy who controlled it just randomly moves it.", "@That Guy That will always be a present issue in ouija board sessions. Is someone moving it? And to each their own.", "Kiara lives in a constant state of bottom left and top right", "Schrodinger's idol.", "top right: JP Kiara\nbottom left: EN Kiara", "She’s superpositioning. Quantum Kiara!", "I can't believe The 🅱️ancient One was here", "The most scary one in this is Ame doesnt love me :(", "Don't listen to the board. Ame loves all of us 😤❤❤", "I guess not even AO-chan can answer where Gura's bread is.", "Ame: FAQ Ancient Ones\nBubba: BARK\nAme: Bubba says FAQ too", "Okay so I was hung over before the Watson Concoction hit me, but why didn’t the rest of you help Ame out when she was drowning in blood?!", "You want a scary story guys?\nAme vs Kiara Chess match round 2", "NO MORE. That took years off my life.", "AAAAAAAAAAAHHHHHHHHHHHH-", "OH GOD PLS NO I DON'T WANNA SUFFER AGAIN 😭😭😭", "I'm literally shaking right now…", "Stop. Right. There. Mister.", "She doesnt love us guys😭😭😭", "She just likes you like a guinea pig friend. Dont be greedy.", "The most scuffed, blursed and cutest stream I've watched. Dammit Watson, you're too good, you silly donut.", "Cursed***", "@Echratus blessed + cursed = blursed lol", "@Wrekt i know", "@Wrekt just saying this is cursed in my opinion", "How do you call Watson Amelia when she's sleeping? Watsoff Amelia.", "13:44\n\nFilter is on: Haha, that's funny\nFilter is off: AAAAAAAAAAAA", "\".....I run to protect my mom from the Amelia Gremling but when i come.........\n She was already ground pounded! [Dramatic Chord]", "If Ayame used the Ouija board will it be called", "then, if rushia has one, would be called a chest boa-----", "then, if Marine has one, it'd be called a horny board", "If korone has one it will definitely be called waterboa-", "Bro . . . . . .", "If Yagoo used it, it'd be an Oji Board.", "This stream revealed some highly valuable information and verified some we already knew", "she tries to tell a scary story but everything she does just adorable and you can't help but not be scared by the story", "49:04 \"My strongest concoction would kill you, chat. You cannot handle my strongest concoction.\"", "I would surely have nightmares now, but look at the bright side. \n\nI'll get to see you in my dreams.", "Ame's talent: narrating stories. Damn, that was awesome to listen, I would like to hear more of her reading!", "My greatest Takeaway from this stream: Amelia is Married to Chat. \nA horror story all onto itself, but one with such sweet undertones. \nA very unique horror special compared to the standard fare of horror game streams <3", "Ame: asks Ancient Ones if she can ground pound their mom\nAlso Ame: Crying when they say she's lewd", "Let's be real, who needs to do detective work when you can literally ask the Ancient Ones any question.", "You lose a lot of SAN that way", "@Necromancy For Kids A crawling chaos will crawl at you tonight..", "Because Ancient Ones has been trolling us and not answering half the questions", "16:22 that voice made me feel some things", "go to horny jail", "It wasn't only you.", "Went and used the Oujia board.\nIt said \"Leave me now\"\nI'm guessing it was trying to protect me, so I went straight outta there.", "The only bad thing about this stream is that it’s too short, we never get to experience much of it, what I see as a shame. Love your work Ames, keep it up!", "Stream start!: 3:35\nThat ending... was really something else...\nHiccup count:\n1. 14:20", "😂🤣😂🤣 good job", "That first one though", "14:20 Best ｈｉｃ", "which watch along collab?", "@Ulodan horror double feature", "@Ulodan Ah, sorry. A miss wording of mine. I tried to say the double-movie watchalong. This one https://www.youtube.com/watch?v=Y20iZ_jUF0s", "Took too long to find this comment, thanks anyways.", "@Boblob Chippymig Try to look for my name next time. I usually do the hiccup timestamp work in almost all of Ame's videos. The one in the Watchalong is more rewarding than this one.", "Nice storytelling voice honestly didn’t register story. Just enjoyed the sound of your voice while being lost in thought.", "\"We can ground pound the spirit's mom!\"\nThe spirit turns out to be AO-chan\nUHHHHHHH-", "oh no \n\nWhy is she getting closer\nNo", "I still can't get over the fact the tsundere spirit allowed Ame to pound its mum. \n\nAME WHY!? - I - i mean, how?!!", "Nooooooo, Missing most of the stream, the scariest thing of all.", "\"How about we do a scary story first ? this one's a classic\"\n\nChat : Sure, what is it ?\"", "Me who hates scary stories: its Ame im fine", "Yo, the entertainment level of this stream is off the charts. Really had fun lol", "Nobody's gonna talk about that bug flying around Ame's face? It even hit ame's eyes lol", "didn't realise it was going to only be about an hour, also this start oh my-", "Ame flexing her creative muscles is the best. Thanks for spending your Halloween night with us!", "There is a Jumpscare somewhere guys watch out!!!", "Her soulmate is the killer, pretend to be Amelia’s friend\nDog sensed foul smell with that strange thing(Ouija Board)", "There is a couple folk tales around my town, one of which is a man called \"Smoky Joe\". It's said that a bunch of kids pushed him into a fire and he ran screaming the entire way. His remains were never found and the screaming can be herd from only a few camp sites.", "48:57 Ame turns on filter.\nChat: \"POTION SELLER! I AM GOING INTO BATTLE...\" XDDD", "Man, the ancient one is memeing so hard, he must be from reddit forum", "vamp. amelia:”wanna take a bath with me.”\nme:man that bathroom sucks full of blood", "Sweet jesus this is actually creepy\n\nSomeone please let me out of here, I can't getout OH SHES HE-", "Ame this stream was SUCH a good idea and the implementation was great. I think you really knocked it out of the park on this unique and super fun stream!", "I'd like to imagine AO-chan was pulling answers from different timelines and parallel dimensions for this one", "56:00 honestly despite how scary it is it reminds me of makuta from BIONICLE.", "2 Things.\n\n1st: I love this versión of the background music\n2nd: Where does one signed up for the Christmas dosis?", "Achievement unlock : Detective Ground Pound Mother Ghost", "In this episode, the gremlin from her debut stream has returned in full force.\n\nHow blessed.", "Halloween was last month?\nFeels like it was yesterday", "I asked the Ouija board that Ame used where Gura's bread is. Ouija board said it's \"Close\". So I asked again and it said \"Near Water\". Asked again and it said \"Location Unknown\". lol Okay so, I guess even the spirits don't know the location they just know it's close near water. lmfao", "Ey lets gooooooooo\n\nI love the actual in-universe “lore” videos we get, as rare as they may be", "The sprit being AO-chan makes sense considering how much of a troll it is, I'm sure he consoled ina for a couple of the questions.", "The most creepy part of this stream is I tried to open another page but there was no response from my chrome and my PC-kun suddenly restarted itself .....", "i honestly thought the scary story at the start was a troll and it was just a narration of Resident Evil 3 intro lol.", "Now we all know how Ame REALLY solves mysteries...", "That Ouija board bit was incredibly enlightening.", "Ame : Is chat gonna get married?\nNo\nAme : Laugh\nEveryone in the chat : Nooooo", "35:25: The ancient ones Donates $100. \"In time, you will know the tragic extent of my failings\"", "This was the definition of blursed.", "When your already freaked out 4minutes in the stream\n👁👄👁", "Damn these edibles aint shi-", "Ame's pronunciation of words is so cute, her reading a spooky story is so relaxing. ", "51:45\nAmelia Quarkson, your wavelength is showing.", "Chat: \"Hello Amelia, I'm going into battle and I want your strongest concoction.\"\n\nAmelia: \"MY CONCOCTION ARE TOO STRONG FOR YOU TRAVELLER\"", "You've had your say concoction seller but ill have mine, you're a rascal , a rascal with no respect for our mothers, no respect for anything but your concoctions", "Lol Ame is really something else XD Ao-Chan making an appearance was not expected! this was 11/10, above and beyond content!  Happy Holo-ween everyone!", "the language of spirits holds many truths.\n\nunfortunately, the truth hurts omegalul", "Ame : are you there spirit?\nSpirit : no\n\nAme :", "Finally another dosis of my dru- I mean medicine", "This probably doesn’t help the fact that I’m tripping balls rn", "*Takes Ame's toxic concotion*\nBros I dont feel so good...\nTakes the whole bottle", "Bro tell me why that spooky intro music literally SLAPPED\nThat was so good.", "GUYS GUYS guys", "Ina is human, she is just a priest of the ancient one.", "Ah yes, the Luigi board", "guys, it's real, i tried that ouija game, and i asked about \"is ame lewd, is ame toxic\" it says YES,,, LMAO", "Not seiso? Say it ain't so.", "I never thought the day would come, that always being impostor in among us is a blessing", "Aaahhhh, finally, a fresh dose! And I hope we can get more of your concoction in the future, cos I'm really scared to know what withdrawal feels like!", "Alternate Title: HoloEN being exposed", "That was scary! I can’t believe Amelia Watson did that.... I’m literally shaking right now smh", "Nobody:\nMy sleeping paralysis demon 54:12", "mom: why don't you play with the neighbor's son?\nthe neighbor's son: 51:25", "If that Ouija Board is honest, you’re in danger. Ugh, I hate Ouija Board. I’m not talking about courage. I paid attention to that dog. Is the dog sensed bad spirit?\nHow did you die?\n-Maybe Later", "13:44 I like how the effect stayed during the explanation of the context but not in the demostration itself", "This is THE Amelia I remembered.....", "real video title: AO-chan exposing the real Ame", "When you going to start Amelia Watson Production Studios?", "This was so gooooood! hahahahaha totally unexpected Ame! I had a lot of fun from start to finish, maybe only you can make a series of totally fun filters in unthinkable levels! The reading was also wonderful. \nI hope we can hear more from her in the future.\n\nAo-chan only answered negatively because he is jealous that Ina is one of your 4 wives, yes, it sure was like that.", "Saw a comment said '' imagine if we summon Korone''lol", "42:40 remember that Gura was the imposter about half the time in the collab stream...", "I'll lead this with Ame is always cute, but Ghost ame looking kinda cute ngl", "The bad trip starts here, 20:15", "So... if it's true Amelia really isn't a detective.... Does this just make her a roleplayer instead?", "My dear Watson, you did such a great job today. I missed the stream, but I really had fun watching the archive, thank you.", "Here's the truth everything that ouija borde said is false the opposite is the truth.", "This is top tier content, unfortunately I wasn't participated, The chat was having so much fun", "It seems like Ancient Ones has something against Ame", "16:21\n\"Amelia Watson special halloween concoctions.\"\nMommy Watson", "Ame's soulmate kinda sus.", "Its my birthday on nov 1 so technically i was born on the day of the dead. Oh the irony", "4:12 \n\nAme: who is my soulmate\nAO: An imposter", "16:45 Oh my god Kirby Otaku watching this I mean like he/she must be a fan of this but still long time no see feeling is hard in me haha", "I love how it’s so scuffed but so Ame. At least she’s having fun with it.", "wait, is Ina's mod actually the one who controlled the Ouija? sorry, i was late into the stream.", "The Ancient Ones really out here exposing Ame WWW Humu-Humu", "I regret not being here when this started 😞😞😞", "A Watson's High Leveled Conspiracy", "Does Ame love Chat? -no\nChat's mom? -...", "i wish my president dont \"tokhang\" me after watching this", "Amelia got exposed 5 times in less than an hour and I find that hilarious", "What an amazing stream. Truly blursed. Thank you, Ame!", "14:22\nthat wasnt a hic\nthat was a chirp", "I'm gonna consider all that The Ancient One said as head cannon.", "45:18 Important questions were asked.", "This was satisfying even if it's not live ngl.", "Funny coincidence is i was getting a morphine shot while while on the waiting screen... so i was really on Watson Concoction mode all stream", "Someone in chat said there back with the pizza. And I for one, want a slice.", "Youtube notifications betrayed me yet again. I even set a reminder wtf", "When are we getting our next shot? Shoot me up doc", "It was fantastic stream! I love the effects 13:37, 16:10, 49:10, 50:40 ( Ame ghost 13:15, 15:50), the story and ouija session. Finally yes, Ame is lewd even the spirits know it. 38:00", "BLOOD FOR THE BLOOD GOD!!!! SKULLS FOR THE SKULLS THRONE!!!!", "22:56\nOh, great spirit Inugami Korone, we offer you our yubis.", "39:44 Ancient one: but I don't even work here", "this is like Watson Amelia's dark hour", "Ame is so cute. Bruh", "Finally, a Watson collab with Ao-chan to uncover more absolute truths about Holomyth! :o", "I laughed so much, thank you Amelia for one of the best Halloween experiences of my life!! This was the best Halloween stream that I have ever watched! Quality content 😍👍\nMan I love Holomyth so much!!! ❤❤❤", "I thought the dude in the scary story was none other than Yagoo", "LMAO this was actually funny 😂🤣😂😆😆😆", "And here i thought I was the only one that didn't get sauce on my nuggies", "19:15 Suddenly, a wild Rushia appears!", "Notice how Amelia is the only one that has ever said, Gura needs floaties. What was she projecting? Hmmm?", "I really wish I knew where to find the background music for the Red Clock's BGM part as it sounds great.", "Hello Happy HAllowEEEEEEEEEEEEEEEEEEEEEEN HEHE :3", "I even set a reminder but got caught up on work. the minute I got out of it and open youtube , youtube tells me it was streamed 5 minutes ago", "16:21 You will be wanting this for later.", "17:24 well you are asking so politely so how can I even reject this offer.", "Really cool to see Ame pull off so many whacky special effects/segments live!!! Thinking back on things like Slime/Sheriff Amelia, the headpatting, or even that one bit with the minecraft brightness settings... she does so many silly things live that I've come to really appreciate!\nAlso I can't pick a favorite moment from this stream. If anything, I think you just need to watch the entire thing for the Experience LOL", "Ah, yes, the original Slenderman story from the old Ichor Falls site.\n\nAme should do an audiobook of those old Ichor Falls stories. I think she'd really like The Fulcrum, Candle Cove, and Excerpts from A Room At Cedarspring", "The intro song is called Requiem, by JD, i still can't find the instrumental version", "Ame West: I am a Detective. I've covered cases, you know.", "Frick! I go into the store for just a fewwww minutes and its over 😢😢😢😢\nHappy Halloween everyone! 👻🎃👻🎃👻🎃", "Here's a theory ", "Someone know what history she read? My english is not that good to follow her sadly so i missed most of it...\nRegardless, it was a fun stream, im ready for more concoctions in the future!!!", "It seems to me like she read a slenderman story, the specific story she read I'm not sure on, but I'm sure somebody knows.", "I think a monthly spooky story stream could be pretty neat to be honest.", "everyone gets injected\nMe: Wait mine just had air~ oh no", "This was a hellouva show! ", "Dear me,this have got to be Amelia in her cutest form. OMFG >_<", "Can someone help me, in 46:25, what means is \"I have my pdf\"? Why this can evidence Ame is a detective. Thank you!", "the most cursed hololive content i've visited in a while.\nbless this detective concoction.", "DD:I can watch this all day\n\nChill:Mon help me!!! there are strang woman on my screen", "i just finished watched the archived...... please allowed me to say something .......... \n\nTHANK YOU Amelia WATson for the POWERFUL and SPOOKY injection!! i didn't regret that i took theis injection. i can feel that you put a lot of efforts on doing this, the sound effect, the animation....... everything are PREFECT. ", "No matter how hard Ame tries to be spooky, she will always be cute", "Looks like the Watson Concoction has become more potent than ever.... slips money for more doses\n\nAlso, this stream only increases my desire to see an Ame reading stream.", "I require your strongest potions, potion-seller", "10:03 d a m n\n\nnow that's a creaking door", "\"am i toxic?\"\nOuija board : Y e s", "49:10\n \nhello potion seller,I'm going into battle and I want your strongest potion.", "No I missed the live stream :(", "46:29 - Is Ame really a detective?\n47:16 - The spirit didn't hesitate to say yes if Ame is toxic", "Top 10 best streams of all time", "Twas a veri spooki stream \n\nTis veri sad that Ame doesn't love us", "14:46 Gremlin Watson is real.\nEverybody hide your mothers.", "The story may have been short but still kinda spooky! Haha. Look forward to more narration. That was good", "Ame's soulmate is Haachama. Ancient ones said \"an imposter\" and Haachama is the imposter inside holoEN.", "sooo... no one gonna talk about how lit that intro song was??", "40:24\nI'll just put this here for later", "Yeahhhh Baby, This is what we are waiting for, vtuber bedtime story\n\nOhh yeahhh another concoction", "Why is the music sounds like I'm playing Daughter of Essence?", "ame's soulmate could be Polkka, Ina, Gura... 👀👀👀", "Brooooooo, I missed it!!!", "Scary story time was fun! Everything after was a trippy fun!", "16:27 watson's yandere voice", "49:11 I know an ahegao face when I see one and thats definitely an ahegao face", "I think AO misunderstood the question and instead told us that Marine-senpai is indeed old", "33:37 it’s a demon stop it’s very Dangerous", "17:26 What a silly question detective", "20:27 this is the kind of abuse I come for lol", "What injection was I given to see this", "People who already married : 👀", "Well, I was late. ", "I love this streaming! I feel that I gradually get addicted to it wwwww", "I never had thought that I would see a dang Ouija Board in an idol group.\n\nWhich means this is a dang blast.", "わあちゃま？！Ame's married to us confirmed!\n17:25 YES.\n23:25 Spirit machine broke? Understandable have a nice day\n25:10 yab", "12:58 does this bring back memories?\nMe: m ( @ 人 * ) m", "A camera going into a Live2D model going into another face filter. We truly live in the future.", "The one who really scared us on Halloween among Hololive", "9:59 for high quality performance yall ", "She sounds like a Lector in an auditorium", "My Friend’s why don’t you like anime? Me:", "12:50\n\n._o Christ. What was in that?", "That door creek though 😂😂😂😂", "14:22\nThe highest pitch hic EVER", "Missed the stream  \n\nRegardless, thanks for the treat Ame!", "38:00 Ancient one knows everything", "28:51 Of course it says yes!", "This concoction is quite powerful indeed", "6:27. \"The Blank Face\" creepypasta.", "She ruined the spooky after the story and made me smile", "45:19 Daring Ame lol", "The spirit is a simp", "HAPPY NNN Y'ALL, HOPE YOU ALL THE BEST!!!!!!", "I missed the stream because  schoolwork bogged me down like walking through a swamp.", "Congrats to who's ever named Chat plss take care of amelia", "For my first Watson stream this was great to watch XD. She's so cute like the other girls.", "32:28\nGreat spirit.. Why do you lie?", "40:53\nI cri everytiem", "14:21 squeeecc", "It's official Ame is Zaboomerfoo", "What does ame mean by \"don't take the backseat\" on the description?", "46:55  I clapped for the ancient one ", "Secret Amelia AO-chan collab.\n\nWhat's next, Enma Ao-Chan collab?", "That was really entertaining! Thank you for the effort you always put into your streams. \nYou girls made this Halloween very fun.", "this gremlin never fails everyone", "Its confirmed, ame is actually a door 10:02\n\nEdit: she sounds like a balloon too", "Regret missing this stream lol", "This tons of fun, thanks for all the hard work Ame!", "bgm at the beginning of the stream was awesome. Really creepy. Anyone know what it’s called?", "48:56 made me blurt out WTF..😂", "This was so good nice work!", "14:45 ame's real form of her gremlin", "49:22 \ndont need to thank me", "That was amazing", "Don't worry about The Ancient Ones they're just tripping some concoction off stream.", "Ah yes, another entry for the cursed archives.", "lol i was asleep while this stream happened whyyy", "I missed this stream because I decided to watch The Thing (I watched the original and the remake).", "That was great <3", "Amelia was a cute dork during the filter session lol.", "We need a 1 hour extension of that intro", "Can't wait for Amelia's Christmas concoction", "''Ina is not seiso because she didnt say so..'' :v", "Oh man, she put in a LOT of work into this video!", "There's a secret ending guys , don't miss it", "I missed the stream but it was still worth watching of course!", "Props to amelia for the effort she put into this video. Really enjoyed it spooky ame", "thank god i was already on the toilet", "The impostor soulmate is Towa-sama. An angel pretending to be a devil.", "It could be Ina hahah she could be related to the Crawling Chaos..", "@Ritsukou Neptune リツコウネプチュン That’s a doujin waiting to happen hahahaha", "I am having Wasabi flavour Seaweed, scary.", "=Time for your 7PM Watson Concoction=\n\nyes dear...", "Marine's age is actually yes", "Will chat ever get marry 24:45", "Trick or Torito :D", "54:07 top 10 screamers", "I need me some of that Ame sauce", "The perfect way to spend Halloween in these troubling times... ^^ Thanks, Ame!", "TakaMori confirmed by AO-chan! Many other things too lmao", "the born of Watson.EXE", "Who tf r u ?", "14:40 if you want to see her inner gremlin", "I thought the bat cursor was a bug on my screen", "5:04 Is that Mocky Mouse from señor pelo?", "This video gave me chills down my spine while watching. It looks so real.", "40:20 lol watson", "JAYSTATION 2", "Yes very kawai-- i mean spoopy detective", "why is amelia the scariest member of holomyth", "I entered the stream on 12:51, it is indeed spooky asf.", "4:59 START", "I think I was given a little to much concoction this time around", "Happy Halloween Amelia Watson.", "Thanks for the Halloween special Concoction stream! (Gotta watch again because i missed some part) The lore is expanding thanks to Ao-chan lol:\n- Gura is a shark \n- Gura can swim (Without floaties?)", "I already want my Christmas Concoction", "Wouldn't be surprised if Calli was messing with Amelia", "Watson Concoction: not even twice", "I’m scared ame hold me!", "Quality content over here", "Its harsh but true waifu’s aren’t real", "I don't see her as toxic.", "Lol 27:00 someone in chat ‘Weird name’", "5:04 happyyyy....HALOWEEEEEEENNNNNNN!!!!!!!!!", "Asdfghjk, I missed it 😢", "I can't believe i missed this ffs", "Excellent way to Celebrate Hallowe’en, thanks Ame - really great work :)", "22:00 she started playing a board game", "First guy couldn't spell xd", "56:00 Venom", "Yagoo's dream by the way", "\"what do we offer to the spirit? no, not bubba!! oh our yubis!\"", "Hol up I'mma just refresh this spirit", "I think Amelia contacted the spirit of a Magic 8-ball when she used the ouija board.", "Love the BGM.", "ame-san ecchi but cute i iant simp\nIts just soo cute hahahahaha", "no.. im going crazy..i think.....i need more injections", "Tommy want em drugs that watson has", "Bedsheet Ghost Amelia is the cutest thing.", "That laugh at 16:27   YES", "Whats liquid fire", "blursed, and its a good thing", "Amelia: her uncle killed her in the house and buried her in the basement but, the house didn't have a basement\n\n\nMe: wait what?", "My first thought the basement is probably sealed behind a new concrete wall as some forbidden room that no one can find it.", "Gura's bread belongs to the void", "But Ame, 3 am is the Witching Hour, not midnight...", "31:17 did gura eat people", "yep, she is toxic confirmed", "Am I hallucinating because of lack of sleep or is a nightmare for all of us????", "the stroy suppose to be spooky and scary, but why i keep laughing at it, why is AME like this, why I still watching it while complaining this wwwwwwww\nshe is confirmed a comedian plus pro gamer.", "wait, offering yubis, is god dog the great spirit?? xDDD (no im jk wwwwwww", "This is what you guys came for: 38:02", "Well, that was nuts\nHappy Halloween 🎃", "Come close and listen here little ones... Let me tell you a secret...", "Sanity check failed", "46:20", "What injection?", "Happy Halloween!", "That was amesome", "i liked the spooky story. thanks for this video during Halloween Watson.  i needed this since there was not tricking or treating.", "Tha Ancient Ones speak of no cap.", "12:42 It begins", "13:05 SUCC", "That ending", "Ame's soulmate is sus", "Happy Halloween!! Ik im late by the way", "What is that the END\n \nHOLY mama Mia 😱", "What an experience lol", "Ame don't like us\nReward \n54:25 candy", "What the f is this? I love it!!!", "15:31 CURSED IS CURSE", "38:03 40:53 44:35 46:20 47:10\nAmelia exposed.", "Ame is  lewd confirmed", "This ouija board ist canon\nI might not marry but yagoo is best girl\nYou know so it dosent count", "such an awesome stream!", "I'll let you guys know if I experience some supernatural stuff thanks to that ouija board smh", "52:19 pink gold Amelia Watson\n(Nathaniel bandy screaming in the background)", "Nathaniel\"Scuttlebug\" Bandy every time.", "You can play with me all you want Watson ☺", "The return of full on Witch Ami", "Spooktober is over :(", "Is Ame high on sleep deprivation?", "40:18", "Was that the Are You Afraid Of The Dark candle?", "Blursed Stream 11/10", "He ate expired candy", "12:43 wwwwww kawaii", "Tbh that story was scary  as freak💀😅", "I can see ouija board being on chats side", "This was scuffed and that's what makes it hilarious.", "TrippieRed is old news now we have TrippyBlonde.", "I couldn't understand EN perfectly but...but, I just understood this stream is yabai lol\nたのしい配信ありがとう！", "Ah yes..the sacred Luigi Board", "49:10 reminds me of haachama", "detective", "Ugh... That... witch... stung me again... H-how many more times will this happeNONONOSTAYAWAYFROMM", "I'm-I'm okay everyone. I just never expected this to degenerate like that. I'd rather take AsaCoco over that... STUFF.", "What is the meaning of botton/top right/left?", "What is that melody that's playing?", "Yo...... the opening 😱", "Maybe you could try playing phasmphobia, it would be more fun to play with friends.", "Her tummy go brrrrrr 12:42", "Eroi", "So basically, Amelia with the Watson Concoction is Amelia on drugs?", "spook~~~yyyyyy", "LUIGI BOARD!!!", "Spooky Mama Luigi Board.", "Thanks for the stream ", "Gold mine for clippers", "this stream is GODLIKE", "we do not celebrate holloween but looks kinda fun 🤷", "I'll need a batch of what you have", "OOOOOOHHHHHHHHHHHHHHHHHH", "What am I watching.", "i'm scared", "Here 51:54 watson horor game scene", "Happy Halloween 🎃", "かわいい", "Love the candle GIF", "bruh its luigi board stream", "What's the point of the schedule page on hololive if no ones puts it up beforehand? xD", "I don't know what's in that concoction but can I get 5 more to go please?", "Injection ASMR???😳", "What's the bgm?", "えっ、コックリさん⁉︎外国にもあるんですか⁉︎日本とどちらが古いんでしょう、、、？", "27:44", "the bgm is soooooo good", "that pizza board is scary", "キング・クリムゾン!", "51:54", "Drugs are good kids here's the proof", "HIC at 32:25", "Yo, wth?", "14:45 Amelia Uchiha", "Even though I am not a fan of Halloween, I kinda like the spoopy background music when Amelia was using the Ouija Board... Not gonna lie.", "I also have an idea for a question for Ouija Board... Here it is.. \"What is the Unknown Seeker's real name?\" I thought of that because his real name is only known to him, and to everyone else, he is anonymous.", "SpOwOkY OwOkY", "What story is she telling here?", "I like scary turtles, but amelia with needle  is even better", "Uh.. ????? Ame...Why?", "Ancient Ones are total trolls", "I took a bad trip with this video", "Its not scary, this is funny", "Hi Boys 😍💋 💝💖♥️❤️", "24:56 \nDid someone sneeze?", "it's bubba", "Ouuh, okay", "I know I might come off as a ignorant bastard but who are the ancient ones? Their manager?", "Probably they're talking about Ina's book. The book is the reason why she has those tentacles and stuff, it's part of her lore. The ancient one is supposedly all-knowing.He sometimes appear in her chat as a moderator. Mainly as moderator not manager.... I think lul.", "I missed it ", "ask him if he likes pineaple on pizza", "あいらぶゆー", "JAWA?", "Cursed.", "Please inject me mommy", "Where kowai and kawaii meet", "I for real am confused as to what top right, top left, bottom left and bottom right mean\nOnline class has made me outdated\nCan someone tell me? XD", "Y axis means purity, x axis means intelligence, ame is bottom right because she is very inteligent but also lewd", "@abraham camarillo loza ohhhhh ok it makes sense now\nThank you XD", "I'm juiced up", "ame kinda lewd", "10/10", "Надо было учить английский", "Can someone explain me the o7 meme? :(", "It's a picture of a person saluting, proudly used by those who stayed till the very end.", "@Lishtenbird ohh got it, thank you wise human.", "Spooky", "ghost ame kinda cute tho", "Spoopy Ame.", "No please", "luigi board", "boomer zoomer ame lol", "Pls be lethal", "Great", "Good & surreal 😁", "yes honey", "0:17\ngirlsofyourcity.online", "Sooopy", "thank you Amelia, I had a lot of fun xD\n\nHappy Halloween from SEA~!", "Zoomer", "What is a concoction?", "Not just any concoction, a Watson Concoction", "Concoction means a mixture", "Nut", "Nice", "", "", "", "Still waiting for slime Amelia to make a full hour stream while wet", "Can someone give me the detail  of the stream? My life is so pain that i dont have time to watch my fav vtuber", "", "", "", "", "", "Happy HalloWeeb", "49:10 amelia wautism", "Wtf this direct are very strange", "ayo first", "How many moms must she ground pound before she is satisfied?!", "o7", "I love you amelia ❤", "This is a comment", "this is a reply", "@Lhlmarques this is a reply to your reply", "@SCP-106 Uncle Larry this is a reply to a reply to your reply", "I got banned in chat just before the last concuction of the stream and I literally don't know why, now I won't sleep thinking about it, like what ??? God tier stream tho", "Good morning", "Pog"]