["I like how Amelia went from saying she didn’t like Minecraft to becoming addicted to Minecraft.", "Legit thats everyone tho..", "Happens to the best of us", "Remember, when someone said that they didn't like Minecraft, force them to play. Occasionally, it works.", "@Jamie Stubblefield Even I’m being slowly won over despite having no prior interest in the game.", "Probably because she was able set a goal for herself this time, which is the railway. As long as she keeps setting long term goals like that, then she'll have plenty to do for a while.", "And that's on character development looool but yeah I am the same way, I don't like minecraft at all because I don't have anyone to play it with. Now she has 4 other people to play with and help them. She also made goals for herself which she can now work toward to help the server and show everyone ", "@CupOfWhiskey Yeah I get that. I wouldn't play these open ended games without other people. \nOn my own I'd rather play story based games like JRPGs. \nBut if my friends get involved hell yea I'm gonna grind some mining.", "@ern 100% agree lol", "Yeah I got interested to it when I watched the collab so I tried it on my PS4. But the thing is it's not much of a controller friendly game, feels different. I think minecraft really works best on PC huh", "Minecraft on its own is like a 6/10 game. Decent, but it can get tedious after a few hours. Bringing friends along on a server pushes it up to a 9/10, since suddenly that tedium is magically gone(I don’t know exactly how it works. Somehow, knowing that other people are in the server makes digging for hours not as dull). With some good mods added into the mix, it is probably the closest I’ve seen a game get to a 10/10, having insane replay value and an bottomless supply of really fun moments.", "That is also me in a nutshell.  The game is zero fun when you have no idea what to do but once you watch or someone help you do things it becomes fun", "Pewds flashback", "@Dankest Memes \nSeriously. I actively avoided Minecraft as being pointless and too mainstream, but then maybe a year or so ago a tutorial/let's play crossed my feed and I've been on and off obsessed ever since. Given half a chance it'll surprise you.", "Maybe because she has friends to play with now.", "@Christian Cinnabars imo it's still really great even when alone. however the friends bit do elevate it to another level", "@Dankest Memes I dunno I haven’t played it yet because it doesn’t look interesting.", "@Siris play it once then", "@Joshua Noble exactly the same. I was like its a child's game then seen some lets play then jumped the gun didn't stop playing for atleast 9 months got addicted lmao", "@Dankest Memes idk it just doesn’t look like my cup of tea.", "wait when  did she say she didn't like minecraft. Did I miss a stream or something.", "@Dankest Memes played it. Not my cup of tea.", "She said in her 6 hour stream that she tried it before and couldn't get into the solo play. But she likes it more now because she is playing with friends and has goals that benefit everyone.", "Same to Pewdiepie", "Stream Start!: 2:35\n\nHiccup count:\n1. 38:40", "Why is it so cute", "Bro you are a god sent", "“so we back in the mine”\nEveryone in chat:sings the whole song", "Got our pickaxe swingin' from side to side", "This task a grueling one", "Hope to find some diamonds tonight, night, night", "Heads up! You hear a sound, turn around and look up!", "Total shock fills your body", "COUNTRY ROADS, TAKE ME HOME", "TO THE PLACE I BELONG", "WEST VIRGINIA, COUNTRY MAMA", "TAKE  ME HOME, COUNTRY ROADS", "Yeah I’m gonna take my horse", "coughs\n\nSWEET HOME ALABAM-", "Timestamp pls?", "Why did the young railroadworker fall on the tracks? He was undertrained", "God of Puns is always the first", "the god of puns has arrived", "i love your pun", "bu dum, psh", "@Aebel=)", "Ok ina settle down", "He has arrived", "Ina stop using your alt account", "or he was suicidal", "Her ability to count seems to be limited to 8..\n\nAnd that's enough to educate me", "9 is just an upside down 6 so really the octal system is best", "better than gaben who cant count past 2", "8 is a really good number anyway", "She might be a dancer or rythmic gymnast. Counting by eights is a pretty common way to find the beat of a song, and if you do it long enough it becomes second nature.", "@Joshua Noble New potential lore unlocked", "This comment made me grin", "@Test Account octal system just goes to seven", "@Juan Cruz Hopefully next time she will start counting from 0.", "Ame is absolute best girl, moving herself to the right so that we can enjoy the Minecraft and stream chat on the left. THANK YOU AME!", "Oh i just noticed that yeah, best girl", "Yagoo is best girl. But yeah ame is good too", "@k4 yagoo is wife but ame best girl", "Except for samsung tv users (like me) since chat is on the right for the YouTube app :(", "Great stream as usual! Chat is also better now. Let’s see each other again in an hour!", "Chat was chill today. Enjoyed the stream 🤘", "An hour?", "I'm sure chat will settle down over time", "@stopdahrain there is a collab on Mori Calliope channel", "Yeah there a lot of new vtubers dan that need to learn rules", "@Holo TheWise Wolf i see", "@Shishir Raut Probably because most of the troublemakers were asleep.", "Water ASMR in the end\n1:22:58 we are right guys\n1:23:06 \"you guys were right\" that felt good\nThe chat tonight is being good for some reasons", "Because the normal toxic idiots weren't awake", "@Matkingos oh yeah....its morning for them", "Ara Ara i wonder which country the toxic fans were from.", "@amok 1 maybe in the west", "@Ara Ara definitely the west- it was around 3-5AM\n\n\nEdit: And yes, this is entirely a callout directed to my fellow American fans- remember to follow the rules in the description!!", "probably because Gura mentioned the rules in her last stream, and Ame often scold chat for backseat gaming", "@amok 1 Pretty sure it's not just one.", "Well, there were a few that were still pretty bad. Like telling her how to place the redstone torches when her way evidently works or telling her to change of FOV when she’s fine with it.", "@Stefescope Thank you! Im midwestern american and love her streams. Its unfortunate when people get too into it and cause problems", "@amok 1 This is a toxic attitude to take.", "Friendship with Amtrack over. Now Ametrack is my best friend.", "Omg, that's what they should call railways built by Amelia! It's perfect branding!", "*Ametrak", "Avelia liberty? No, now it’s the Amelia Liberty", "I literally was 6 seconds late...the most disappointing moment of my life                                   👁👄👁", "I like how she plays multiplayer games, Always thinking about helping her friends and working hard to make things easier for the other 4 members", "When you miss a stream by a few seconds\n\nFeelsbadman.mp4", "Ame's pretty good at things related to planning and calculations. I'm glad she's enjoying Minecraft and building things in this game.", "She's clearly more inclined toward puzzle games than action games (as evidenced by her Mario Odyssey streams 😏)", "Ame : So-\nMe    : So what??, i dont need sleep i need answer", "SO WE BACK IN THE MINE", "No ara ara this time :'(", "Listen kid this is what addiction look like:", "don't be like ame, seek help", "From not liking Minecraft to consistently work on a long-ass railroad in Minecraft. \n\nBest anime arc ever.", "I just got a YT notif that Watson Amelia is live\n6 hours after the stream ended \nThanks YouTube 🤦‍♀️", "Taking a break exercises be like:\n“1..2..3..4..5..6..7..8”", "Oh man Ame would love a Minecraft mod called Railcraft. So many track choices and you can link carts together to make trains. There's even cute little locomotives that go choo choo! Not sure it's been updated to this version of Minecraft yet though :(", "The first person to actually motivate me to do any sort of rail system in my world lol. I always talk about how I'm gonna do it one day and then I NEVER do it. Not this time tho!", "How’s that going so far?", "@Google Account I actually just started when I wrote this comment", "Amelia successfully made me motivated to do my planned nether hub", "We need \"1 2 3 4 5 6 7 8\" 10 hours loop clip", "Lighting up an area stop mobs from spawning in it, you should light up your rail track to prevent anything from high 5ing you when you go for a ride.", "Ame, I just wanted to tell you that you are an amazing, hardworking streamer and that I appreciate everything you do. Keep up the great work and have fun <3", "Loving how dedicated Ame has become on her Holo Railway. Also quite interesting how the server has been developing, wasn't there for the JP server so it's exciting to see how it's growing", "Thanks for the chill stream, Ame. These are nice\nWas gonna rest after Calli's stream but I had to hop on this surprise one lol\n\n19:56 yabai driveby", "Amelia: At one point in my life, I slept for a few hours. I'm good to go!", "SO WE BACK IN THE MINE", "GOT OUR PICK AXE SWINGING FROM", "@Gach Man SIDE TO SIDE", "This task a grueling one", "HOPE TO FIND SOME DIAMONS TONIGHT", "Night night night\nNight night night night night", "NIGHT, NIGHT, DIAMONDS TONIGHT", "HEADS UP", "Idk why I find ame casually swearing wierdly pleasing and chuckle worthy like when the bat fell into the lava", "I missed the stream I thought it was youtube teeling me about the old stream because of the same thimbnail lol", "I never played Minecraft and yet, Ame's Minecraft streams are my favorite atm. I'm positively impressed by the progress she's been making so far. You go girl !", "Everytime the cart passed by creeper I get anxious attack, it might explode if the cart is a little bit slower. \n\nAmelia just vibin tho'", "Thanks for the stream, Ame. I 'm glad that the chat has calmed down a bit when it comes to backseating compared to the last one. Good progress on the railway. Some close calls but you managed to survived it so that's great.", "I just want to say that my railways use nothing but powered rails the whole way through", "Feels my soul is healed in someway through Ame’s railway construction!", "Wait untill she learns that she can make charcoal by burning trees in the furnace", "\"Iofi Senpai! Good Morning/Evening!\"\n\nKonbawatson?", "The one totally unnecessary bend in the uphill rail really bugs my OCD ~ Great stream regardless! :)", "It is always a good time with you Ame - catch you on the next stream!", "To answer your question at 42:45 because a simple yes/no answer is not really enough:\nMinecraft's map is very, very big. The amount of all types of materials in any map is massive. But some materials can be made by the player indefinitely - dubbed as renewable. One example is Wood - Wood is renewable because trees drop Saplings, which can then be used to make another tree, then in turn drop more saplings. Others, such as Bone or Gunpowder, are renewable because monsters drop it. ", "I forgot about this stream lol I was sleeping-", "A thrilling assortment of 8 counting, spider dodging, and creeper booping.   You performed excellently.  Amelia, thank you for the wonderful content.  \n\nWe all had so much fun, and we hope you continue to enjoy your infinite Minecraft journey.  An' may your dreams be a bit more comfortable.", "Thanks for the stream as always. ^^\nMonsters can spawn even in the dimly lit darkness by the way, so that's probably why you're seeing them in the railway and in your house still (the upstairs under the trees was pretty dark).  With your current torch spacing in the railway you could probably put 1-2 extra torch in-between the current gaps and it'd cut down on that problem by a lot; maybe even 1-2 on the opposite wall.  Just my two cents though!", "27:46 OCD screaming at me: What is this nonsense? Snaking left and right left and right", "she's gonna be PISSED when she finds out how the Nether works. Also when she finds out about packed ice + boats.", "Oh noooo i missed the stream T^T", "1:33:27 The rest of Hololive has ruined this for me", "Very smart Ame. Brew the tea and after two minutes or so add ice cubes so it cools down to merely hot and can be drank immediately.", "Not much backseating this stream, which is good, but I've been wondering why Amelia gets backseated by chat the most? She's probably one of the best gamers of the group, yet she gets backseated so much, it's strange", "she attracts the better gamers lmao", "I've noticed that over the years. You gotta either play games ABSOLUTELY 0.00% of the public has ever even heard of [difficult/impossible for streamers it seems] or just ignore the ever living Hell outta chat. I like the latter, to be honest.", "chat will find their way to backseat even if it's 5 years old playing with her barbie", "when your so early you dont know what to type", "How much obsidian should I get?\nA)20\nB)8\nC)30", "I'm honestly so invested in this railroad project and the counting is blessed", "UwU ur so cute <3\nily", "When you slept in today because there was no Zoom today but forgot about Amelia's minecraft stream. 🙁", "oh shirps i fell a sleep and miss the stream :(", "I like how happy and calm she is when playing Minecraft 🥺❤️", "Chill time with Amelia, just what I needed.", "Waiting for the time stamps guy", "how she has to look back after 8 times 2 lol", "Oh man I just missed it", "It’s sad it took a telling off from Ame and Gura to get the chat to behave, but behave it mostly did I’m glad to see.\n\nVery relaxing to watch.", "That creeper in the beginning was really dangerous, might want to put more light in the tunnel.", "Oh no, I missed the stream", "Move it. I'm mining over here!", "Thank You for the wonderful stream Ame!!", "This stream was brought to you by the number 8.", "I missed this stream and it’s 7:21am in the morning. 😥", "Goodness gracious!! When does Watson sleep? 😁", "Rip her 27something levels", "Pro tip: Jump", "Aw man, missed the stream. Was streamed live at 5am 😔👉👈", "A shame I fell asleep two hours before she started", "1:22:00 - I think it would be easier to just rebuild this part and straighten this up.", "you're right", "congrats on finishing the rails on the holo en mycroft server", "Those floating trees are giving me cancer lol", "Nooo  I missed a guerilla minecraft stream. Consuming  archive now", "53:13 bookmark", "I see that the surrounding area lacks trees, perhaps someone should try to plant tries or else eventually you’ll all need to travel far for wood.", "1:19:08 randomly jumpcuts\n\n0-0  so much speed on those corners", "the stream lagged out", "I lost the streaaaaaaaaaam, i was sleeping 😭", "Ame is probably the next stand user in Hololive.\n-\nHer stand is: King Watson\n-", "ame looking stoned as always", "I ain't get to farm no wheat, I ain't get to mine, no iron\nI was stuck up in the dungeon, ain't get to see my diamonds\nAin't get to hug my Alex, couldn't even give her no kisses\nCan't even go to the cave again 'cause these zombies always be hittin'", "for myself\n14:43", "Amelia has helped me achieve true ascension", "Amelia thank you so much for entertaining us We love you", "Bruh ame is gonna be the pillar of the HoloEN server lol", "Good as always, nice Amelia.", "1:11:36 why did I think that was Herobrine?", "unexpected Minecraft stream even though it's not on the schedule..\nshe really did addicted to Minecraft", "did she know Japanese?", "She kept edging the creeper", "Great Stream  ", "Officially the Minecraft master among the HoloEn ", "is that shortest Amelia stream of all time?", "Yay! Minecraft. :)", "TRUE she really was mining tho", "I had to go to work sigh\nah at least its archived", "Gura vs Amelia drag race when ?", "Ame for the witcher, on the topic of your confusion, they kinda DID know about eachother, and honestly if your whole purpose given to you by your dead mother was to find this one person who was guaranteed to protect you and you finally found them, you’d probably hug them.", "I hope she finds those rails in the far right chest in her house", "Should rename this one 1,2,3,4,5,6,7,8", "She really needs to create ender chests for her her subway. They are a godsend for mine cart storage.", "the mine cart is slowing down because it crashes with the corner of the block when turning left or right if the rail in near them.", "who are here to hear her voice", "Biggest character arc, Ame went from not liking minecraft to liking minecraft.\n\nSame thing happened to me.", "dem this was unplanned stream right?", "Yea she have talked about it in Mario stream tho", "@Yakksan yea remember her rage quit, i know that she want to mine but i didint expect for her to stream it since i thought she was gonna watch witcher with while doing it", "She should start branch mining .", "46:16 ame bullies zombie\n47:50 ame bullies another", "✋😳😳😳😳Nice nice watson", "Welcome to Amelia railroad co", "The way Amelia counts is so cute ", "I don't see chat in archvie\n\nAnd one part around 1:19:00 was cut off", "the stream lagged out", "So~", "At least Amelia's aware that the game comes across as much darker for us than it does for her", "last train home", "Who’s going to tell her that she could have done this in the nether 😬", "real gamers use overworld travel", "one unit...", "time to  finding fireflies and put it in a bottles for better light source", "A railway is good for transporting items, but not people. Fastest and most affordable way to travel is by boat on an Ice runway in the Nether, Blue Ice if luxurious.", "They haven't gone to the nether, or enchanted yet. Ames probably making the blue ice when she gets silk touch+nether access. She seems to be researching some stuff off stream, so I got my hopes up.", "Plus, it's gonna be so quick when she does it if she does", "Yeah she will get there eventually, she's still learning.", "They are learning dude. Let her make a railroad first. Also, the nether is gonna be a massacre if they go together wich is gonna be super fun", "I like how people always do this. Yes, you can tell them the cutting edge tech stuff, or maybe it will be fun for them to discover new stuff gradually. That's half the magic of this for me at least, five newcomers trying to discover this virtual world.\nIf you wanna see super pro gameplay, there are probably enough seasoned veterans out there too.\nAnd if you just wanna show that you know so much about this game, I doubt many care frankly.", "@umbaupause I agree with this. Everyone pushing them to do certain things is starting to get annoying, let them figure it out. It's fine to guide them a little when they need help, but the straight up backseating isn't fun for anyone", "@Twerkinator true lol", "let them play how they want, backseat viewers are the worst type of viewers", "Ores do not regenerate, they generate when you explore new terrains. And the world is not infinite, but it's very big", "I just hope the chat didn't make her super toxic again, lol. I like toxic ame-chan that's having fun with it but not chat is making ame-chan toxic toxic... if you know what I mean. I love ame-chan... that's why I membered up...member... lol", "Boing boing", "This is our winning daughter", "wow,Ame is so dedicated to this rail road,I guess she won’t be getting derailed any time soon", "Found Ina's alt channel.", "@Christopher wait what", "@Luca Fiorentini the joke is Ina likes to use pun. Just like Kyrel over here.", "aight that's inaff internet for today", "Has no one mentioned the nether?  Making a rail network there is better.  Hell that isn't even the fastest.  True speed is a boat on the blue ice.", "The nether is scary though", "Gotta get over the fear.  It prepares you for the absolute lose everything void of the nether.", "Mobile and pc", "Hope she doesn't discover Industrialcraft or thaumcraft, we would lose her forever.", "Start \n2:48", "Hi", "1 2 3 4 5 6 7 8", "these backseat gamers are annoying. let her play at her own pace like jeeeezzzz man", "I only watched the last 30 mins.\nWas the chat salty has before?", "chat behaved good in this stream, but there still some backseat-gaming tho, but it’s pretty much all good", "@Not Janny at least...", "ok", "Ame ame ame", "1.2.3.4.5.6.7.8.", "Among us with gawr gura and ninomae", "holo gulag", "did the chat really think the minecraft world is infinite? do they know about world borders?", "I dont think JE had world borders set naturally. Maybe it changed since i last played on a PC though.", "@Szandor Don’t know about Bedrock but Minecraft JE is finite, and it has always been finite for a long time. If they removed the world borders recently then I wouldn’t know about that. If you watch Antvenom like I did in the past, or just read the minecraft wiki in your spare time, or you do a lot of things involving commands and command blocks, then you would know about the world borders.", "@Szandor yeah it used to not have world borders and you could reach the farlands", "but the world border in game now is naturally set to 30 million now so it would take a really long time to get there even with nether travel.", "Interesting. I havent played on Java or really done work with commands in about 6 years so i wouldnt have known.", "Ame and Gura are my favorite EN streamers.. it's sad that toxic people in the chat caused so much drama the other day", "what happened?", "@VolcanicAshes1 1. Gura started her stream, so many people started to write \"LOL, AM OUTTA O HERE FOR GURA, BYE\" in Ame's stream\n2. Super hard backseating.\n3. Endless SHOUTOUTS TO AMELIA because Gura suffered so much in her stream. ", "Мы русские , давайте покажем что мы тоже существуем", "Нет =D", "so-", "lol she used recipe book for planks"]