["I'm starting to think the old switch wasn't actually broken, Ame just absolutely tortured it before joining Hololive.\n\n\nCan we get an F for Switch kun", "F", "F", "F", "F", "F", "1:57:33 Ame gets the chat to roast itself", "Congratulation you played yourself", "we got played. damn.", "The chat was being belligerent", "No desks were harmed in the making of this video", "Sr Pelo: Finally, an opponent! Our battle will be legendary!", "1:50:05", "Oh thank god I missed this stream, I'm glad Desk kun won't be hurt this time around.", "Desk-kun -1000 HP", "Alternative title: Detective gets tilted beyond oblivion and declares war on tomatoes", "Watson: 1:09:54\n\nChat: -28 HP you didn't want to give a chance, huh?", "ready your superchat bois, Ame need a new switch soon", "28 SLAM WOUNDS. YOU DIDN’T WANNA LEAVE HIM A CHANCE, HUH?", "I kinda want to see her play Detroit Become Human after seeing this reference.", "2:08:56 F for the dude that got destroyed.\n\nYou tried your best.....", "did you know what pick up line that was?", "@Mad Tech i think it was \"what i want in the menu? Me n u\"", "@I regret my previous comments ahh cringe indeed hahaha", "LOL damn I wish I didn't miss that live xD", "1:06:44*\n1:09:50*\n1:31:27 Watson\n1:50:03*", "Stream start!: 2:40\nWas that a pitching fork at the end?...\nHiccup count:\n1. 4:10", "Thanks timestamp guy 🕰⌛️🌃", "Doing the Lord's work my friend 🙏", "Aw man, missed the stream by 3 minutes!", "2:09:04 aw yeah it’s me", "Funny name 😆", "Hi Bob", "@SilverZerg thank you 🤣", "@hy le nhu hello!!!", "This is the third time i see you", "Hope some day she calls you by your full username", "I hope she's having fun playing this game. For the viewers, watching someone raging can be entertaining, but i'm not sure she's handling her frustration better than others.\n\nAlso, let's stop Desk-kun and Switch-san' abuse.", "That was legit anger near the end when she tried the platforming tomato challenge. Even passive-aggressively saying to the chat the fireball won't work when she didn't know how to beat it", "Another stream of ground pounding? \n\nMom get ready.", "Hololive version of Tyler1.", "She rates her self  5/10... Cheer up detective and stay calm~  Don't let your anger get into ya.. or else you will become the Detective Doom slayer - the slayers of tables,  controller  and ground poundin moms~ too angry to play!\nok im sorry .. that was a lame joke.. Thank you for the stream ^ w ^", "Amelia don’t give in to hate that leads to the dark side.", "Ame not figuring out that she had to capture the snow dude for the race and spending ~30 minutes on the dash flower level gave me some major Vinesauce flashbacks.", "Amelia's toad voice is strangely on point.", "That split second when the stream crashed out of her rage from failing to dash over the water for the...12th time? Still golden. XD", "1:51:23 Project Diva (≧▽≦)/", "?", "@Agga Viriyo Amelia owns project diva. The one that's got hatsune miku on it. The blue haired girl", "@KamoGaming owns?", "Big rage 1:09:53", "The snow in this part of the game is actually salt", "Amelia still brought it tonight. She let everyone have it, even that damn old Pro controller", "Thank you for a good time Ame! Had my hands full, so was only listening in, it was good fun as usual.", "I hope she continue playing this...\nI really enjoy it watching this game play and\nshe really making this stream enjoyable, despite the salt.\nCan wait for next mario Odyssey stream. Love you :3", "Switch-kun are you okay? \nSwitch-kun are you okay? Are you okay Switch-kun\nYou've been hit by\nYou've been struck by", "Smooth brain detective", "Other youtubers: I cannot cuss, otherwise YouTube will demonitize my channel and I might lose it!\nKiara and Amelia: Hold our tea and chicken", "This brings a whole new meaning to the term 'blind playthrough'", "HAMBURGER BEANS\n\n1:20:31", "So once again, \"Failure is always an option.\"", "30:37\nDon't mind  me, just providing myself a time stamp for when I might be feeling down and need something to cheer me up.", "Thanks for the stream. Loved the tomatoes war part and that rage quit tho. Poor controller and desk. Glad you are handling what happened on last minecraft stream very well.", "Poor switch kun getting beat up for our entertainment", "5/10 stream, too much tomatoes 🍅", "Ame and Coco have such good times at \"idol meetings\" because they are doing Any% gamer bottle runs.  They aren't 100% speedruns because they're just emptying gamer bottles out.", "Ame should buy a sandbag so she can hit it instead of bullying switch and desk-kun.", "As funny as it is watching her rage, I can't help but be concerned about her equipment. I mean, the Elgato, Switch pro controller and the Switch itself don't come cheap. I don't know, I'd just hate to hear Amelia say she broke something.", "Rest in pieces desk kun...", "Can't wait for the inevitable \"Prrrrrring!\" montage.", "I feel sorry", "NEW MARIO STREAM WHEN", "The rage-quitting detective!", "56:26 personal timestamp.\nNothing to see here", "56:48 Piss time", "Use my mouth mommy", "@Pucopocre....", "Ah yes the disgusting part of the internet", "the salt must flow!", "1:31:26 Sherlock", "Thanks for the stream!", "she said so many bad words during the stream that the only reason I can think of for her trying to say “what the heck” in luncheon kingdom is that she has a swear jar in her house", "Thank you for the stream! ❤", "I’m dumb I missed the stream because for some reason instead of reading the schedule like\n12\n34\n56", "You got this, ame! Never give up!", "赤さ棚浜やら和", "Can we get Amelia to play doom eternal???\n  It would be fun to see her torture her desk", "Well, the efect would be the same with sans. (do your desk wanna have a bad time?)", "really glad that the music in the rocket flower room doesn’t get old", "Maybe just me but Ame should probably shift her character to the right of the screen because the left is where the chat scrolls as well in full screen mode so can't see her avatar.", "Many thanks for the stream Watson.", "Ame should really learn some controls😂😂", "After the winter all the snow finally melted. Noice / How do you call a dinosaur to lunch? Tea, Rex?", "Sip", "@Taylor Slurp", "I adore salty Ame.", "Be sure to rest, you deserved it.", "The rage was real today, but it was such a fun stream. Thank you so much for your hard work Ame. Get some deserved rest 😄😄👍", "Does anyone know the song at 54:45 ?", "ah yes ame roasts the chat once again", "The hecc, why are vtubers in my recommends jeeez.", "Does it annoy you?", "Verical 3 dots on video --> Click \"Not Interested\" ---> Profit", "@Fax'd It was done like 1 and a half week ago. No need to reply to this.", "@power star417 I thought it was useful information, but alright", "I'm sorry, but that rocket flower bit in the Snow Kingdom was absolute DarkSydePhil gameplay. You see the rocket flowers on tiny platforms, you'd think \"HMM, MAYBE I SHOULD THROW MY HAT TO IT\" but nope. That was REALLY painful to watch.", "1:50:05 -20 HP", "Poor Ryan....", "Super Mario Odyssey streams are fun... for Amelia maybe it's not lol.\n\nLooking forward to the Minecraft stream later.", "We love you ame", "Amen", "Hopefully when she comes back to Odyssey, she’ll be refreshed to say the least. It got frustrating for both her and us—she struggles to get past the tomatoes, we keep trying to tell her about the fireballs and tomato lava. Speaking for myself, but honestly it’s one of the many unique things that made Luncheon Kingdom my favorite!", "I mean, backseat gaming is still awful.", "Watching her go through the bonus stage in the Snow Kingdom was painful. Chat kept telling her what to do but she never looked at it until she got the moon. I get she wanted to figure it out on her own but if she started to get mad it would be best to look for help.", "@Fenris At that part, we really were trying to help her out of her own frustrations, by pointing out just one thing only. Though doing so was hardly of any use, anyway.", "Yes the streamers should let chat backseat game", "@Ninja Movie They could always just die numerous times and then blame the game for it", "@DuBstepAnDa98 eh sometimes anger can still be a part of the game that's enjoyable, as contradictory as that sounds.  Like playing dark souls with a suboptimal strategy on a boss.  Makes you feel proud of doing things your own way. Either that or you feel like you've wasted time but that differs from person to person", "Tomato is my enemy. 🍅", "Ame was extra salty and toxic today lmao \n\nFs in the chat for desk-kun and controller-kun..", "She rage quit but its okay", "Dark Side Amelia", "🥳", "MOOOOOOOOON", "🧂🧂🧂 this stream in nutshell. so much salt and rage!!! we love it. and you Ame  o7", "LMAO LORD SHE'S SO TOXIC AND I LOVE IT! LMAO", "o7", "rage ame is best ame", "Yup the best", "hicc", "Start \n2:43", "Nice art thumbnail you made it?", "Poor sachi- I mean Ame...", "o7", "here is discord server https://discord.gg/hhjxF2 o7", "🍅7", "@Left Testicle Already joined o7", "@Left Testicle what happened to the right testicle...", "o7", "https://discord.gg/hhjxF2 here is discord server", "@Left Testicle sweet", "🍅7", "I never seen someone sucks so much at Mario but that was the best parts! Can’t wait for the highlights", "Have you seen Kiara play SM64 lol? (Not a diss tho her streams are great)", "@Intestinal Clouds Yes. Oh my it was so painful! But, it was fun at the same time.", "I'm sorry but I have to admit that I find Amelia's constant \"How do I do this??\" whenever she comes across a new situation a bit annoying.  She might just be playing it up for the chat but I'm hoping that she can turn that down a bit.", "Yeah I felt that way sometimes to. But then you have people like in this very comments section mad that Ame wasn't looking at their advice for the flower segment so it's damned if you do damned if you don't it seems"]