["I hope Amelia doesn't feel like she has to do anything or do \"proper\" ASMR for that matter. I reckon many of us just enjoy her talking to us, telling us whatever.  \nSoft voice zatsudans are nice, whether they count as ASMR or not.", "", "Amelia is my favorite vtuber from hololive en, but even listening to her ASMR, I don't understand what its essence is, does someone really enjoy the fact that someone is eating snacks? Thanks to her of course for the stream, but I think that the usual communication, answers to questions, etc. would be better", "@Kavirus Some streams are really just meant for the viewer to listen to, and streams like these you can listen to \"off the side\" so to speak.", "Yeah, I hope she won't pressure herself to do something she's uncomfortable with. Personally I've enjoyed all of Amelia's content so far, and I think she'll be able to make fans happy regardless of whether she decides to do more ASMR or mostly sticks to talking.", "@JustYumeChan spot on", "Yeah. No one wants to listen to someone who's forcing themselves and isn't feeling it. I don't want to be an annoying \"concern-person\" but if Ame doesn't like doing it then there's a lot of other stuff you can do for member streams. I personally enjoyed it though and with just some minor adjustments it could become a really fun segment.", "@Kavirus without the proper mic the effect is lost. With the correct mic the sound hits your ear in a way that can't be described. You need to experience it for yourself", "I hope she does try new things and challenges herself though rather than always keeping it comfortable.", "\"Soft spoken\" to me IS ASMR.  Before that was even a term I used to seek out soft spoken videos just because it didn't have a specific name.  Once it got the name ASMR that is when a flood of creepy whispering people flooded the market and that became what ASMR primarily is.  Not knocking you if that is your thing, but I actually really enjoy ASMR style videos if they're soft spoken, but 90% of what I find are whispered ones.  Thank god for emergence of unintentional asmr aggregators.", "Feel sad for someone who can’t get tingles", "", "Yeah I hope she doesn't feel forced by chat to do things like this.", "there's also nothing wrong for a streamer to upgrade her mics and equipment lol so why not.", "#PoorGang\nRise up my brothers we may be a day late but we won't stop supporting Ame!!", "#PoorGang  Rise up ma bruda", "#PoorGang ✊✊✊✊", "2 guys become member just for dislike lmao", "Wha...? Lmao", "👌👌✊✊😎😎 #PoorGang", "#PoorGang", "That's the spirit! ", "#PoorGang", "Poor gang rise up", "Respect", "#PoorGang", "#PoorGang \n \nFXXK 😭😭😭😭😭", "#PoorGang\n👊😎", "@Brenda Leal its just a joke, we are family united for the detective", "Im with u brother. 👊👊", "#PoorGang", "DAMMNED COLLEGE TEXT BOOKS!", "#PoorGang brothers in arms are brothers for life!", "I dont have a job and im still illegal. \n#poorgang", "STOP WATCHING THIS BROTHER! FIGHT THE MDLA!", "#PoorGang 👌😎", "👊👊👊", "#Poorgang damn right u are", "#PoorGang", "#PoorGang is what I stand for", "I support but miss the stream almost always", "#poorgang", "#PoorGang", "#investigatorgang", "Some of my favorite highlights of the stream \n3:10 Paper Cut\n6:32 Marshmallow ASMR\n9:32 Ame Sounds + “I don’t like it”", "Bless you kind stranger ", "Thank the gods you have blessed us 🙏", "Thank you!", "Thank you for your service for the Motherland comrade", "Umm,i keep press the 22:40button,thanks a lot bro", "You are my hero dude!", "Arigathanks", "Thank you so much my dude.", "the jelly succ sounds wrong....", "jelly succ sounds sus @ first but is actually so entertaining", "Thank you bro", "Thank you for your hard work!", "Thank you!", "My brain stopped at her silent night performance", "Heartbeat ASMR is the most wholesome tho. Knowing she's alive and healthy...", "Nicely done my comrade!", "Lol paper cut poor ame", "41:14 gremlin noise *", "oi,u miss a hic mate 21:40", "@Leon Roy thank you, damn I knew I was missing one. I was trying so hard to find that.", "41:14 yes very cute sound. Tysm edit1:00:05 omg ty again <3", "Cutest ASMR ever", "@Joe Donh bwuh", "My god how long did this take?", "H I C", "one of the best thing is H I C C :^)", "I love how she took a bunch of different requests at the end like blowing, heart beat, joint cracking, and stuffs", "Timestamp on the heartbeats?", "@Celestial 1:09:25 It doesn't really pick up, but she tried", "But the whole stream is wholesome ;-; no need for timestamp", "@CodyJackH She said she put it against her neck. Don't think that works lol.", "@zankioh its still audible but waaaaay more faint. Gonna need one of those fancy expensive asmr mic if it's on the neck.", "Blowing?", "@Zarromi you know, like exhaling air with force", "@LittleCart ohhhhh. That also good. Thanks.", "Yaay, Broke gang isn't left behind.\n\nDamn you college textbook prices!!!!", "Laugh in pirated e-book", "Getting kicked out of college was life changing moment for me. It defined who I am now.  I do miss it sometimes.", "go to a trade school fam. best choice I made in life.", "zero9112 ok adachi.", "@zero9112 I see well it's hard after all... But I hate when they keep changing the Units so the subjects won't be validated", "@Aixona lmaoo", "\"tastes like burning hair\"\n\"like boiled plywood\"\n\"like how department stores smell\"", "Truly, a detective’s mind is something beyond our understanding ", "Correction! She said \"tastes like how burning hair smells\"... which isn't any less weird tbh 😂", "Bruh she tweeted saying the minecraft dirtblocks look yummy", "Some things just kinda taste like what certain things make you feel...ya know? \n\nLike the smell of gasoline or the warmth of a dumpster fire on a cold, winter night. Or the loud squeak of a marker on a white board. Or the feeling of gently rubbing styrofoam.", "@Lalo I get it. I do taste how something smells sometimes. It's just funny ane cute how often she describes tastes as such, even during the snack collab stream :)", "i get it, too, what i find funny is just how specific and unusual her descriptions are.\nhow often do you smell burning hair, and how often do you taste something that reminds you of it?\nwouldn't want Ame any other way tho", "@massmanton Smell and taste are basically the same sense, just two different ways of experiencing it. That's why having a stuffy nose dulls the taste of food.", "@Dicebaggery I know. Thank you though :)", "Ngl those descriptions are actually pretty good", "@Dicebaggery that's why I always sniff some new food before trying it lol. \n100% accuracy at knowing if I won't like it.", "She sounds British enough to become a Watson", "other : make membership asmr(especially the first time asmr), make public asmr after than archive for member only\namelia : make membership asmr after than turn into public\nthanks for public amelia \npoor gang ;(", "She is an Angel", "Si, gracias por mostrar a los que no podemos tener membresia", "So true", "Is that what happened? I was so confused seeing this in my subs.", "#PoorGang", "@Kango234 Yes, non-member can watch the archive 24 hours after the stream", "@Payguy 001 blessed, now i  seeking for a job  to pay member", "Has she done any more asmr vids?", "So we gonna talk about the 2 people paying just to dislike?", "i mean to be fair someone could be a member yet dislike the content of a particular stream", "happen to gura's member stream too, like 5 people dislike it on live lmao", "Antis will be antis. Just ignore them.", "or maybe they pressed it accidentaly, it happened to me too i almost disliked ame's video thank god i noticed it and immediately undislike it lol", "some people don't like the content for that specific stream and that's fine", "15 now.....", "@Professor Penne This is what happens when you DONT ignore them, when you give them breeding ground. With all bullies, its important to never give them anything to feed on.", "Come on, this is YouTube. A video declaring  \"world hunger is solved\" or \"the cure for cancer has been invented\" and it would still garner like a few hundred dislikes. Don't put too much worry in it.", "Misclicks", "well it just got public so...", "@Gacha took the kids  Exactly--- Why do you guys assume anyone simply disliking a video is an anti?... Yall way too sensitive... I'm sure Amelia can take having a few dislikes on a video that 99,6% liked, no need to whiteknite so hard", "@ppoverheat Yup. Ratios help channels know what works and what doesn't. As an analogy, If I was ordering something online, I'd rather buy from a shop with 4.2/5 ratings than one with perfect 5 stars on all fields. I forgot what paradox(?) this is.", "@ppoverheat i mean like like and dislikes don't matter too much it won't take you're video down or something", "i mean maybe they just don't like ASMR  but loves amelia i guess", "Amelia out here making members-only stream public so broke gang can catch up to her. Amelia so kind", "REMINDER! Just in case!\nSnack ASMR and Goodnight whispering ASMR are two different thing.\n\nAnyways Amelia you have an Angelic Voice! no matter what voice level or what sounds you make. I really love it❤️", "Well since some people were expecting for something...", "That's fair", "Imagine not being a member", "I literally can’t.", "Imagine there's no heaven", "Couldn't be me", "Imagine not spending Trump bucks on anime girls", "I'm not a member", "Man :\"(", "Ikr cringe", "Imagine....", ":(", "broke gang", "I would but im broke asf", "i can’t but i really want to 😔", "We don’t need to imagine", "Well then, I'll see myself out", "What was this a members only stream? I just got notified of this?", "cries in poor", "Region-locked.", "This is bullying", "Reality can be often disappointing", "Stop attacking us", "Sir Rivet she uploads member only streams I think 24 hours after", "It hurts", "imagine having money for your own.", "I don't have to imagine! ... ... I-...", "too bad I'm poor", "@Luke C So thats why the replies on this thread suddenly blew up", "I do", "Me broke", "Imagine losing your job because of covid, no money to spend on simping and barely have enough for yourself just to get by rn.\n\nI know this is just a joke but I really want to become member but it's hard.", "I don’t have a job, F", "Not available in your region gang where you at", "Oh man :(", "Im broke asf lol\nEdit: This is where the Amelia Watson Broke gang starts lol", "Only loser's aren't members ..... 😔", "I’m sorry :(", "Sorry, I need to simp College right now :(", "Bruh 😔", "Damn, Sorry that i’m broke.", "I hate you so much but you're so right I'm missing out and getting left overs.", ".......", "Imagine", "broke ppl am i right", "Imagine having money in 2020 lmao", ":''''''u", "Although everyone is pretty cool here😎👍", "Bruh", "Imagine not having money", "facts", "Non member gang rise up", "Can't imagine either", "", "Imagine having money.\n\nMust be nice.", "@mrvn same", "Dam😔", "I am poor, I can only join one membership 🦈", "ew an elitist", "@Cosmoman78 same here but with my boi 💀", "Im poor :(", "I can’t afford it );", "Too much pride to give Cover Corp any direct revenue.", "Imagine half of you nigga's using your parents' credit cards on this. Couldn't be me", "broke gang wyaaa 🤘", "Lul", "@D Avid Dab", "@spark* Bounded。 Not even broke, just don't want to be spending $5 or more on every single person I watch on youtube/twitch. Twitch prime already is more than enough for me lmao.", "broke gang FeelsBadMan", "fuck I hate not being one.", "😭", "Literally cringe", "No thoughts\nWallet broken", "all i know is pain. its annoying that the youtube app doesnt have the join button for Ame yet 😢", "😔", "I will join you... soon... I hope :(", "ouch", "Sucks that all these kids are harassing you now lol", "Ikr", "I can", "Well I’m sorry. My country doesn’t allow me to purchase one goddamnit.", "Hello there", "I already simp for Vinesauce sadly", "Lmao", "I don't have to imagine", "its not our fault we were born broke af☹️", "ah yes the feeling of unfounded superiority", "fuck", "Lol imagine that honestly those people are idiots-", "Meeeeeeeh ;_;", "I’m broke", "This hurted me in a different way I've never felt before", "Imagine having 50% of the total amount of the subscription in taxes and living in a crumbling country.", "@Roberto Altamirano Let me guess, Venezuela?", "@zero9112 god no, but close lol", "@Roberto Altamirano なるほど. I was like that over 20 years ago. My condolences.", "Amelia is a blessing to commoners like us.", "I’m glad you can see them", "@SearBurrito745 I'll join the membership once I get a part time job again.", "Yes, yes indeed", "Damn right, peasant", "Poor gang, our queen has graced us this day. Bless her soul for giving us this fine gift today.\n\nJokes aside tho, Amelia if you aren't comfortable with this stuff don't feel forced/pressured to do it  (　´∀｀)b \nYour streams are always fun to watch ᕕ( ᐛ )ᕗ", "Getting stepped on by Ame more than makes up for the date's NTR ending", "Bro this comment is so cursed", "@Vassal Of The Night yet so true", "Were all gonna have to work hard in order to beat the allure of Gura ", "Why not both? Imagine this: you're stuck under the dinner table while Ame is stepping on you, and all the while you hear her laughing and having a fun with her date with someone else. Now THAT'S next level ASMR I'd pay for.", "@Druidlover in that case there's no hope for us", "Bold of you to assume that being stepped on and NTR aren't both good", "\"I dunno... what I'm supposed to do with this...\"\nrealization strikes mere seconds later\n\"NO.\"", "IMAGINE NOT A MEMBER BUT STILL CAN ENJOYING THIS STREAM", "Mana from Heaven, Hololive keeps on blessing us!", "IKR...", "This was a gift from the goddess", "I hope she doesn't feel forced to do this if shes not comfortable with it.", "is it a good feeling or a bad feeling", "The French Fancie huh?", "@77Yuja_ your hope of her not feeling forced", "The French Fancie oh I meant it as I hope she isn’t feeling forced and uncomfortable doing these types of streams since a lot of people were requesting them.", "Bruh how do you feel uncomfortable by doing this? It's literally just talking, probably easier than putting on a show while streaming...", "@Draven I never said I was uncomfortable", "@77Yuja_ And I never said you were", "@Brenda Leal She also denied the headpat. Punishment for chat", "\"hopefully it doesnt hurt\"\nme: hmm... if its you amelia... its ok if its hurt ", "Be gentle", "@Keeys no be rougher", "I wanna say that's what our moms said \nBut I think that jokes got a bit old \nSo I am gonna say, \"Hol up dude...\"", "@Rajat Sharma say that's what she said", "@Keeys what", "@test what? 👀", "She should have make a Joe's joke while whispering into our ear", "I have that saved to playlist just because I like how salty she gets", "When she pulled out her broken arm I had flashbacks of the 8 min straight watson’s concoction effect. Fortunately nothing yabai happened. Whew.", "Yo, this actually makes me want to be a member. I'm gonna go find a job mid pandemic just to pay to hear this live.", "IKR hahaha... Long live the broke simps hhahaha", "Hope you find one. See you in the member streams! ", "don't worry about it dude. Being a member for Ame doesn't mean that much since she makes the videos public", "Ame thought something like this ASMR would be weird.\n\nClearly she doesn't know that we consider waterboarding a dog or Donald Duck with lung cancer ASMR.", "Those are cursed", "Ame's childhood of knowing the taste and smell of burning hair, boiled plywood and the shoe section of the dept. store? can't blame her since I ate paint and glue when I was a kid. got curious about it thats why I did that 😅", "Playdough hair and glue the legendary non edibale objects", "19:20 this random detective ground pounded my mom then called me a nerd wtf", "1:04:47 Lmao that chat \"hello people from the future\". He knows", "including the arcade date, its no wonder", "If Amelia's personality and voice weren't enough to brighten up someone's day (which they are), then watching her model mimic her as she tries the snacks will do it. So adorable to watch.", "And then there is her wicked sense of humor, she has enough wit to resurrect the British Empire.", "Lol", "this got so weird... but thats why we like ame isnt it", "9:31 don't mind me, just getting a timestamp for myself", "The Members be flexing", "I’m too broke to become a member :/", "Same brother, same", "I'm with le poor gang", "@Maxi Jay college has me by the balls", "Boys we now have the best worlds of Ame, \nloud and toxic with calming and relaxing....perfectly balanced as all things should be ", "Thank you for considering people who don't have membership Amelia! To be honest, seeing this kind gesture and the great content makes me want to join membership so I could experience the benefit of seeing more cool stuff like this earlier / live.", "I would definitely want to join if I had the money and my own job. Her joyful personality + her character is more than enough to make my day 100% better :D", "@Kenneth Huang Amen brother. She's the best.", "Ah, so this was the stream I missed. Time to watch!\n\nEdit: This was actually the kind of \"ASMR\" stream I had in mind when I first heard your voice: just talking softly without forcing whispers. The spirit of \"ASMR\" is in stuff that's nice to listen to anyways, and you're very nice to listen to here, eating sounds and all.", "i like how she still opens it up for public even after saying that she thought she did a weird job and didnt want to open it for public xD bless her soul", "Amelia: there's this thing I used to do as a kid...\n\nMe: oh no, here we go again", "I was wondering if she'd actually unarchive this since she said she was weirded out by the idea of it.", "I dont think she was weirded out but she felt she didnt do it \"right\" cause I dont think she knows much about asmr.\nTo me it was better that way cause I dont understand asmr either so I just rather see her be more of her casual self.", "Can't remember the last time I fell asleep with a smile on my face. Thanks Ame.", "1:03:50 for getting stepped on. Well, I will say I thoroughly enjoyed it lol", "こんな可愛い子がねちゃねちゃ音出してると思うとお菓子に生まれてよかったなって思う。", "This ASMR saves my soul.\nI'm chilling when listening her cute voice.", "I don't listen to other ASMR and never plan to, but I did watch this. As expected, it got weird, yet I enjoyed it a lot because of Ame's interactivity with chat and fun reactions from both sides. Thanks Ame.", "Dad:*Comes to my room*\n\n\nMe:", "I switched to the six digit site.", "7:17 here I commented about this being a mukbang asmr stream and got roasted for it, honestly felt pretty good not gonna lie", "I was never interested in ASMR... until today, that is. \n\nThanks for the ASMR stream, Amelia! It was a great experience for me.", "I miss it\nI guess this is her first time ASMR", "I'm not really into eating  asmr cus I think it's a little bit too weird, but thank you for doing something for the people with membership Ame!bl It's okay if you're uncomfortable with doing asmr and don't really want to continue it Ame. Just keep producing quality content as always that you think suits you better ", "Personally hearing some one eat especially smacking annoys the hell out of me, it's why I like to wear an ear bud and watch videos when eating around others", "It's not weird. It's the audience that makes it weird lol.", "Amelia's voice is just great\n\n\nIt's now also posted for non members", "this was a blursed stream and I loved every second of it ", "Me enjoying Amelia asmr\nDoom eternal ad in loud scary voice", "I was half-asleep when I was listening to this. I swear, I thought this was a dream until she posted the archive. LMAO", "If anyone call you toxic, remember that I want you to step on me! Feel free to be as toxic as you want!!!\nThis anti-toxic bullsheet is one of the many cancers killing videogames. Be you and f the haters. I only care to self censor here because youtube do sh adow b an comments.", "anyone know why she seemed embarassed of this on twitter?\n\nits great", "Might be her first time doing something like this, it probably is since this isn't technically a \"proper\" ASMR setup. It's kinda of strange too, just EATING on stream and people enjoying listening to the chewing and tearing noises. She did some other things on request too. Youtube-kun also historically has been cracking down on ASMR content with several Hololive members getting demonetized for it. So it's kind of risky having it archived for non-members. ", "@Joe 冗 for what it's worth, she's not bad at all. As someone who regularly uses ASMR to manage my insomnia, I see the potential in Ame for some really good ASMR streams. There were parts in this stream where the sound was soft and relaxing and her little 1 minute video she posted following her debut was really good. When she's not in full on gamer mode, her voice is soft and comforting.", "@Lalo She did say it it's fun for her, just a bit uncomfortable.\n\nHopefully chat doesn't get too weird with the requests. Chill, improper ASMR is good, as long as she's fine with it at least.", "She just doesnt understand it very well and she felt she didnt do a good job because of it.", "29:38 look at that mouth and slow head turn lol", "normal people: eating snacks for an hour cus I love food\nAmelia - an intellectual: ASMR BTW", "Me: Volume maxed out ready for the most pleasing ASMR experience in my life\nYoutube: plays ads to give me literally every ear disability in existence", "Finally, a blessing from the gods", "15:02 that is good ole left 4 dead reference. ( I’m guessing it was Louis when she said it)", "There are some legit ASMR moments in this video. Tbh, it doesn't have to be a whispering stream, just Ame talking without BGM is quite lovely.", "\"they're kinda like nerds but more sour and less tough on the outside\"   so... it's us?", "A non-member ASMR....\nIs this real life or is this Fanta Sea? :')", "This honestly is my first \"ASMR\" experience and i gotta say........ I'm not disappointed", "Amelia....this is epic\n\nI hope you do more in the future, your voice is perfect for it, but don't feel bad if you're uncomfortable doing it. Always make sure you're happy", "I always thought her voice was naturally smoothing even when she's raging at mario", "This was actually really nice. I'm watching this after work and it's helping me relax. Might just go take a nap.", "That was nice and can't wait for more, even if it's in a month!", "Bless Amelia. I don't think there are any other Hololive members who make their Member-only stream public after a couple of days.", "Broken arm was the perfect ending for this live lol, great stream!", "1:03:41 Amelia: \"want me to step on you?\nMembers: \"YES! YES! YES! YES! YES! STEP ON US PLS!\"\nMic-Kun: \"No! ME!\"", "That thumbnail is the definition of “Be careful what you wish for.”", "the guy who said \"flatline\" during the heartbeat request", "Amelia : eats snacks\n\nEveryone : WHOLESOME", "the only asmr I need is 3 hours of hiccups", "Back then, I could barely afford some stuff had to set priorities, I had to even once choose between laundry detergent and a snack.\n It was All or muffin.", "I really wish this didnt have ads so I can just enjoy the ASMR goodness all throughout the vid w/o the ads killing my ears.", "This was a stream for members only so I think she make it public but with adds or youtube put the adds", "Amelia asks us if we hear her heartbeat, and it takes me some time to realise that all I hear is my own one. I hate my inability to deceive myself.", "Yay the gates have opened for the peasants", "I like how members gets to experience this while everyone else is like wtf xD", "she broke her arm just so she didn't have to give us headpats", "Why is there 500 ads", "I enjoyed the stream. The Pop rocks was my favourite. Her arm. Not again.", "ame do really loves making asmr huh, even toes cracking. She just brought asmr to the next level", "Ah yes\n\n\nSNACK ASMR", "This will have to keep me fed until the next one ", "When she did that tounge twist, my mind also got twisted and got less sleepy by some reason", "Im sad im broke and missed this live", "After the eyelid ASMR, I caved and applied for detective membeeship", "Your slow speaking/reading streams without any music would be godlike", "This was awesome! Dont feel like you have to do more asmr i saw your posts about how you thought it was weird bit if you feel comfortable i'm sure we'd like more", "I'm a simple man. I see ASMR, I will give it a try.", "The honored Investigators funded this epic wonderful moment, I'm thankful for you service bois.", "Yaaaay! Thank you so much for this type of asmr Amelia! Your voice level was perfect. I like that it wasn't whispering because I like to study to asmr but too many whispers make me sleepy lol. I hope you do more in the future, but if you don't we'll still watch all your content anyways :)", "i never thought i spend a bit over a hour of my life watching a cute vtuber eat snacks. phenomenal hour i spent", "This was very entertaining and chill Ame, thanks!", "発音が心地よくて寝れます", "this is poor gang representation and I approve", "Bless My Soul, Amelia's voice is so soothing", "Holy  Father, I am thankful for the life you've given me. One that involves a cute anime girl whispering and eating in my ears", "\"It's free real estate\"", "I was chilling watching Tommy in it th then you came into my recommended now I hate my life thx", "43:12 banana. nothing else.", "The pop rock part was amazing!!! All of the stream was good but that part was the highlight.\nGreat ASMR for being the first one.", "I didnt know snack asmr was a thing but im glad it is.", "Why is she licking Dream in the thumbnail?", "Finally a wholesome side of the Internet, no hash, no political schemes, no sexual exploita- boing boing                                                ", "I wasn't around for the livestream but watching the vod it's pretty comfy. I'm not really used to asmr stuff and it feels very different to listen to but I liked it at least. Hope all the snacks don't mess with your tummy too much, thanks for the stream!", "Absolutely loved this, pls do more ASMR in the future", "I’m eating dinner while watching this, also shoutouts to the low-class, peasant bros watching after it went live", "This is my heaven for now on. Forever insane, in the endless cycle of vtuber asmr.", "ASMR is still weird for but I'll try to watch this as long as I can😂", "When i wanna sleep to this but i also reeeeaaalllyyyyy wanna comprehend what's happening. \n\nAlso non-member gang finally experiencing heaven. TSKR 🙏", "Thank you for the stream Ame this was a weird but delightful highlight to a bad work day ", "Thank you for the good stream Ame, look forward to hearing you sing again some day. Your ''Kiss me'' cover was lovely!", "Finally publicized ASMR 😍 ", "membership fans: not so fast kiddo", "I dont even care what she streams, if she is happy I'm happy", "This is cleansing my soul. I feel refreshed.", "Great way to spend my birthday for once I was able to relax with everything going on in the world awesome stream Amelia!", ":o didnt realize this got archived, heck yea", "There are so many ads on this, there's no way I can fall asleep :'^(", "I don't know what that was but I loved it.", "She do be spitting bars tho \n\n(talking about the tongue twisters)", "Ame really good at this🥰", "She should def do more of these.", "Wow this video has more as breaks than a tv show\n\nAlso, this is already starting great. Your normal voice is relaxing.", "The thumbnail gave me weird feels ", "finally we plebs get to watch it \n:')", "RISE UP POOR GANG WE MAY BE POOR , BUT WE WILL KEEP SUPPORTING AMELIA", "extremely blessed\ncan't wait for more :D", "That was a very enjoyable asmr stream", "So I watched the entire archive....\n\nI dont know why but thank you for the pop rocks", "26:44 her laugh ", "41:40 tastes like a purse lol", "Keyboard smashing ASMR", "Ame, thank you for making the video public!\n15:35 57:28 1:03:25 1:06:48 quiet hic\n52:00 She really be spittin flames\n1:05:35 \"God I wish that were me\"", "It's open for everyone now! Expect more content even during the supacha reading :D", "Great stream, very chill. \nTo the gang who stood into the stream to receive Sugar Song to Bitter Step Humming and \"Special Step Content\" ...\n...o7", "Amelia I missed the stream even when I placed a notification, could you please investigate why I didn’t get a notification when your stream started? Thanks", "This particular live stream was \"for members\" only", "Omg yes finally an English vtuber did asmr", "this direct was for the members right?  even so, I think the live was very good.  very interesting and relaxing 👏👌❤", "I love your voice, it's very funny\n\nFor you ame, you .. yes you .. love you", "Blessed. Thank you :)", "22:40 was the strangest noise i’ve ever heard. laughed too much at this", "Oh this was member only content no wonder so low views count", "Blessed stream, thanks", "ASMR is not for me, until now \n(OMG I love this torture in my ears)  ", "I never like asmr with food but amelia really makes it enjoyable", "Blessed. Thank you Ame :)", "Oh, thank you Amelia! I know you said you weren't sure about archiving it, but we're happy you did! Try to be more confident detective! We love you! 💛💛💛💛💛💛", "YES SIR THIS IS WHAT I'M HERE FOR", "You have a very gentle and sweet voice,\nThank you for this video :)", "Even without a membership I love this video. Good girl Amelia. Love holomyth and Hololive girls!!", "NGL Gonna sleep well with this playing. Thanks Professor", "I missed it :(", "It was a members only stream bruh", "That eyelid thing made me laugh ", "CRIES IN BEING POOR", "Heartbeat sounds never lewd!", "Me: I'm not a fan of asmr.\nWatches video\nMe: I'm a fan of asmr.", "This is too cute i can't take it! ", "9:28 that noise.\nEdit: minecraft cat", "my ears are not even bleeding :P they're sobbing of joy smh maybe because i've took a shower", "Ok I am not a member\nNot because I am poor\nBut because it isn't available in my country", "i thought this was a joke title from a highlights channel. lol what a madlad to upload this.\nWhy is there a papercut emote? oh nevermind i realised it's an ear bleeding", "Never thought I’d get to hear eyelid ASMR, but Amelia keeps on surprising me.", "3 minutes in and she's already bleeding", "Your streams are wonderful and you do an exceptional job and nailing yourself downs a fan favorite.\nThough sometimes I wonder if trying to please the crowd pushes you a bit out of what your comfortable with at times.\nI assure you that you needn't go too far at all to please your fans, you do a wonderful job simply by being yourself- or I suppose the persona you put on for us.", "I turned on notifications but I didn't get the reminder and missed this ", "Thank you Amelia, you are an angel, we non-members TeaMates are grateful. Muchas gracias :D", "10/10 would get stepped on again", "Thank you Ame for this stream  What? I can't hear you...", "This place is cursed. Thank you lol", "Honestly just the thumbnail kills me", "Whatever, you're a very interesting and cute creature, Amelia :)", "Oh so, this is the ASMR stream I could not watch :)", ":) you are not alone ma bruda", "1:29 I don't need anymore my work thanks to, p  a  i  d t o b e h o m e .c o m", "WAIT WHAT\n\nWHAT", "26:10 I guess I’m not the only one who does that.", "Enjoyed it a lot, thank you Ame!", "Ah, Ame, you know your fans so well!", "uhh\nmy mind:like i did to your mom last NIGHT JOE MAMA\ni swear im not going crazy", "Ide love to enjoy this but every 5 minutes right before I’m about I’m about to drift away I hear an ad about a car I don’t even own. But I get it y’all on that grind and have to get the bread somehow. but maybe chill out wit it on something that’s supposed to make me calm not hear an ad about providence plantations or a shoe getting squeezed into a wall. Any way I enjoy the content just chill with the ads", "I rlly rlly enjoyed this! nwn", "Someone please edit 52:02 to go with a beat.", "Damn I didn’t need to be a member to watch it? Feelsbadman", "Wait this is reupload or what?", "Thank you!!", "So... i have a homework to submit tomorrow... this really helps to concentrate.", "God, I wish that was me  :3", "Never knew  ASMR could be this cute", "定期的にasmrやって欲しい", "reason why i become member 💕", "Thank you for the stream", "I'm simping so hard for her", "AaH I'm not member and still watch this (?)", "She just make it public", "22:40 cat\nIt was cat... I know it was a cat...", "Hey Amelia! The noise suppressor seems too be a little too strong for the asmr but other than that it sounds great!", "One time at a highschool bonfire me and the homies decided to throw sunscreen and axe bottles into the fire. They exploded like grenades.", "OMG THANKS", "1:03:41 Ame steps on us ", "I’m scared", "Ame blessing us plebs, 2020 redeemed", "51:58 tongue twister", "Wonderful stream, thank you ", "We don't deserve these blessings 🙏", "yes ame, fill my ears", " and whip-snackity-wackity-crackity I missed t'the g'gosh d'darned s'soft-voice c'clackiting w'wrackiting s'stream", "I fell asleep to this lol", "I loved this so much.  Amelia you are amazing.", "would love it if you did more whispering asmr!!", "Ok ngl dis low key 👀 pretty good", "Ame : Its time to make you hungry :)", "WHOA only SIMPS in chat", "ok thank you for sharing the asmr Detective Amelia.. This is first sighting of me seeing membership only stream asmr on public.. I appricate it and very Great full. I'll listen to this later ^ w ^", "that was an interesting ASMR Thank you for the snacks now im hungry... sleeping 😅", " my ears are blessed ", "OH MY !!! ASMR !!!", "早口言葉おもしろいッ！", "SHE IS SOO CUTE MAN MY ACCOUNT MY YOTUBERS MY WAIFU AMI RIGHT #NoMask #Blesssed", "I can see why the 2nd thoughts around the end, boy o boy.", "Blessed voice. thx you. ", "1:05 start", "Her avatar has the best tracking i have seen", "はいいいいいいいいい", "Damned college text books thank you Ame for giving the poor people the sounds that they want to sleep to lmao", "Vibing with Amelia is my favorite past time.", "Are you sachiowo you two are so similar you even sound the same or am I going crazy", "Poor gang blessed", "That thumbnail is a bit on the nose Amelia. You really had to find a picture of me and put it up for everyone to see.", "Imagine not going to sleep to this", "2020 is a wild year\n...and hololive is the future", "1:03:56\n\nSayori much ?", "Comment #666\nThat's it. Hullooo fellow members and Ame fans.", "22:43 Amelia goes PURR", "Krrrhh, hrum, hrum :D", "Was something cut out? My notifications say uploaded 25 minutes ago", "Was a members only stream 2 days ago. It's all there.", "massmanton oh ok", "Blessed", "Just a waifu doing waifu things", "i wasnt here :(", "ty for the asmr stream  thumbnail is funny.", "My new favorite vod.", "How does the audio sound?\nAngelic", "''Sorry'' sorry for what? for make me happy?", "I wanna be Pop Rocks……", "While I may not be an ASMR fan, I appreciated the effort and wanted to show support. I was also anticipating a BRRRRRRRRRRRR at any point, like a jack in the box playing pop goes the weasel. Thank you.", "I can relate to the smell of burning hair, my brother put a lighter on my leg and the smell was pretty bad.", "I'm here for some laffs", "Lol its just for members haha.", "Amazing thumbnail", "True ascension moment I am probably about to expierence", "Is this an only member live stream?...I guess it is..", "woahwoahwoah everyone thinks im nuts for liking raw ramen", "i feel blessed.\nI can only support 1 phoenix....\n#Brokegang", "WAIT THAT THUMBNAIL.....NOOOII", "She liked to burn hair too?! Me too! I may not have plucked out my hair, but I did use the hair from the bath's drain! I even heated up paper clips and had plenty of fun with my sister, using them to melt the wax~!", "her voice. beautiful", "Poor gang!", "声、落ち着くなぁ", "pop rocks part was great lol", "POOR GANG AWHOOO!", "I enjoyed this way too much", "Public Arcived? My dreams came true", "darn, everyone are sponsors in this comment section... ive got no money ;-;", "Wait what??????\n \n????", "Oooh its been released to the public???", "Bruh moment", "It might not be real ASMR, but her voice is so nice I can't complain, maybe she'll get a proper ASMR binaural microphone some time in the future.", "She said in a previous stream that she personally doesn't like it when she only hears a sound from one ear or another. So, she'll probably stick to this type of \"ASMR\", that's of she ever does it again", "But it is proper ASMR. ASMR is anything you want it to be.", "eyelid asmr. yamerooooooooooooooo", "Thx for considering us Amelia.\nWe are your fans who cant afford 3.99Usd/month, or some people in the country where's a SC and Membership were unavailable.", "i have slept to this for 4 nights now", "STOP WATCHING THIS BROTHER! FIGHT THE MDLA", "いええ", "kkkkk v-tuber fazendo asmr", "This was done well, but don’t force yourself into content you’re not comfortable with", "I thought this was live lol.", "yeah", "When was this stremed", "About 2 days ago, live for members, released as archive for all.", "Non Members gang rise up", "Damn, the ads kusa", "Yummy snacks", "Fantastic 😍💋 💝💖♥️❤️", "man i really respect the memberships and all that, so i didnt watch the vods of the date and this one i might as well, so yeah.", "I think its fine. I mean she said she would make it public after 24 hours of the membership stream, well this one was 48 hours actually\nShe's an angel", "Woah membership stream made public", "To think that I missed this wonderful stream...", "Was for members only, but she's so awesome that she releases the archive for everyone :)", "@massmanton Oh, right. Whoops.", "My ears level up", "amazing", "Relentlessly based.", "日々のつかれを、このASMRでいやそうとおもいます。ほんとうにありがとうございました。", "Lovely asmr", "That was great! A fun ASMR, not taken too seriously. Lots of good sounds and even better lol moments. \n\nCould not resist, supahchattotimed just to hear her say my username softly ", "6k members? wow and that thumbnail", "If that's true then she making bank. She probably gets 30% after everything. That's good the more she doesn't have to worry about finances the less stress she'll be under.", "@akuma2095 wow that nice to hear and yeah I think it's definitely like around 7k members since iam one of those notification campers notification campers usually get like 15 seconds ago or 1 minute ago", "If you listen extremely carefully at the quiet parts, you can faintly hear people talking in the background", "Asmr with Watson", "Esto es extrañamente relajante y tierno", "- sad non member noises -", "<3", "It would be nice if she could put up pics of the packages for the snacks so we can find and try them.", "my hates are blessed by her majesty amelia", "No way damnit, how'd i miss this?😭😭😭", "it was a members-only stream on friday, she made it public only in the last hour.", "@PcMikeGaming Ah alright thanks for letting me know.", "i actually dont like eating asmr but of course amelia manages to make it sound good and relaxing.", "why do i like amelia and fubuki so much........", "Her hiccups are cute af", "Ohhh look new strea.....zzzzzzzzzzzzz", "Why does this video have so many ads on it, YouTube is being toxic on mobile", "Why does this feel so cursed?", "MUST LEWD", "Don't apologize for greatness.", "Can she do a Watson concoction memebers only stream?", "Nice stream.", "I see, no one else is talking about the fact that if you want to do ASMR you have to eat with your mouth open. Ame goes Nom Nom Nom. I dont mind...", "Non member gang", "I still don't really get ASMR but the crazy taste descriptions were funny. I haven't heard pop rocks in forever either, that was fun.", "I think a lot of people have the wrong idea about what asmr actually is. It's supposed to be like a specific reaction that you experience in response to different sounds. Soft speaking  comfy Ame stream is nice but I don't think I would really call this \"asmr\" :/", "Namo Amitābha\nAmen God bless you\nNamo Amitābha Namo Avalokiteśvara  Amen God bless you  Аминь, Бог благословит тебя", "This is weird lol", "Yes.", "いいねぇ", "41:14", "When did this happen?", "2 days ago", "Oh she posted it", "BROKE GANG", "折原臨也…？", "Ame is a freaking tank..casually burning hair..another thing to add to her list of alr wild stuff she does.", "Wow 107 comments 14 sec", "This was an membership only stream??", "couldn't watch it live, I hope you don't delete the archieve. Thanks for the stream!!", "Oof. I see why she wanted to take this off the archive....", "こんばんは！\n僕、日本人ですけど、\nしゃっくり 、大丈夫ですか？\nなんか、今までの配信した中で全部出てますけど…", "ayy lmao", "So many adsss", "I Love you", "Likes the smell of gasoline, pyromaniac who lit her own hair on fire, played with hot wax. Uh yep, you're not getting out of the bottom right any time soon there, Ame.", "Why am I not getting notified when she goes live for members?", "Members only streams are treated as a special unlisted video, so you have to pay attention to when they're scheduled.", "I didn't get a notification for the \"date\" stream so I actually checked the time for this one. It could just be a youtube thing since I also didn't get notifications for Ina's member-only streams.", "If you turn on the bell / channel notification you should be getting a membership only post notification in the community tab where the video is and you can open it there to set reminder when it's live. Otherwise it's YouTube thingy or something such as notification settings", "YouTube why do u betray me, not only did you not notify me about the stream but show it to me a whole Day later", "You should've checked the community tab", "Sup yo", "1:15:00", "I still have no idea what krank is supposed to be and how do you manage to burn tea", "kranch is ketchup mixed with ranch lol", "DO A FLIP", "Nice asmr video... But uhm would you be kind enough to remove the add? Because having adds while trying to sleep is not a good experience", "Well maybe youtube put it or she put it with adds because this was a only members stream", "I love youu ", "Oh yes...she archived it ", "Autonomous Snack Meridian Response?", "no sand???", "She forgot the Minecraft dirt blocks on her order. It happens!", "It says sorry in the description but there ain't nothing to be sorry about", "Non member moment", "#poorgang moment :)", "did she mean you make available to all?", "Yes. She was undecided for a while, said she felt weird about it, but looks like she's cool with it now lol", "🥳", "Ok i subcribe", "Is this a member only video?", "It was a members only livestream 2 days ago, archive now made public", "Yaaaa", "I love u amelia", "cronch", "Hey wait a sec, isn't this supposed to be members only?", "She was debating whether or not she would release it later, must have decided to do it after all.", "You don't have to be sorry for this Amelia this was okay!", "to be fair, starbucks coffee is garbo", "Fox in Socks is best Dr Seuss book.", "We have snack asmr and goodnight asmr, but I want toxic gamer girl asmr, I want table kun to suffer!", "ASMR is such a weird trend. I don't get it. Honestly I prefer the usual loud, funny, and toxic AME more. I love her laugh and grinning face.", "good for sleeping", "Aren't this video should be a member only?", "nice", "Noice o", "Noice", "I am not a member.", "Isn't is suppose to be a member only stream? If so then why am I able to see it because it should be member only even when archived.", "She puts them up 24 hours later.", "@Dangledoop Ah okay, Thank you", "Why does she say sorry in the description? Also side note why did she make this public, I thought this made her uncomfortable. Not complaining mind you lol.", "Is this supposed to be members only?", "It was for members only live. She was thinking about whether or not to release the archive for all, and now decided to do so. ", "Is she not japanese", "Missed the stream so, gotta catch up!", "31:58 Amelia just talked about burning her hair on purpose.\n\nAmelia bruh.", ">she actually made it public\nOof. This cannot end well.", "@Master Dungeon Nothing?  It's a normal asmr stream", "AAAHH!!!! I MISSED AN EXCLUSIVE STREAM AGAIN!!!", "Paimon sure likes the stream! Too sad Paimon is not there though...", "HEY! PAIMON IS NOT GONNA BE EATEN!", "poopj", "", "A", "I lobr u", "", "", "R", "#PoorGang\nGlad this masterpiece is archived tho", "", "", "", "", "", "So mom jokes ASMR when?", "wwwwwwwwwww", "      ", "Lol not my cup of tea, but im sure another teamate enjoys this content.\nI don't wanna be horny.  I just wanna be happy. \nIf Ame is happy then we are all happy.", "God this was juicy. Slurp", "Poor  gang go brrrrrr", "ASMR..please cut CM please..", "I think this video is for only members lol", "Confused by some of the replies. She’s clearly doing ASMR because she wants to. Nobody told Calli before debut “youre going to be a rapper” and nobody told Amy “youre going to be an ASMRtist.” They decide the types of videos theyre going to make before debut, and Amelia announced at debut that she’s going to make ASMR videos. It’s even possible that Amelia was an established ASMRtist before this, since that’s not too uncommon among Hololive (e.g. Noel).", "Yes.  I hope she does more.", "pog", "a", "Guys that one dislike is looking kinda sus, I think I saw him vent", "There's two dislike now '-'", "@ニコ Two imposters after all", "God I hate ASMR don't understand how people enjoy this irritating noise of bags opening, let alone chewing..."]