["I love Amelia’s and Gura’s chemistry together. They have the best collabs imo.", "They've got the same gremlin energy lol", "Their collabs are so wholesome I can never stop smiling", "i prefer kiara and callies", "@Schedy Jr they also have great collabs", "@Schedy Jr nice but for me its time to leave those ships :p", "Amelia/Ina is also great (especially in Minecraft)\n\nAnd don't forget Gura/Callie for those \"what?\" moments xD", "@65daysofretreat OwO thats cool! cant wait for  the collabs coming soon next weeks !", "@65daysofretreat What about Kiara/Gura? Kiara/Ina? Amelia/Callie?", "Also Amelia's dog", "Yep, their collabs are the Best from hololive eng imo, but lets don't forget about Korone /Okayu from jp", "Hololive fans: \"I've done nothing but watch Minecraft streams for three days.\"", "Among us: Am I a joke to you?", "Is the holoEN Minecraft server same as the jp ones?", "@Norman Readdis nope", "@Norman Readdis It's called \"holoEN (Minecraft server)\" for a reason, <-- so no", "@Ven80 i didn't see it I'm sorry for being inferior", "@Igloo Igloo it would've been nice tho like moona\nJp girls can learn more English to other girls\nHolojp server is basically hololive social hub for the girls lol", "They play on the same server (JP and EN on their own servers) so their Minecraft gameplays basically has its own cinematic universe at this point", "@Norman Readdis holo ID get permission bc there is only 3 person and from those 3 only moona who active playing it, maybe after gen 2 HoloID come they will make their own server", "Same", "I bet this period of Hololive would be known as the \"Holocraft Era\".\nImagine Minecraft popularity raises again thanks to Hololive. XD", "Also Hololive fans: \"Looking forward to the Minecraft stream tomorrow! 😊\"", "others - Who's gonna want to watch another Minecraft stream at 3 a.m.!?\nHololive en fans - OH BOY 3 A.M.!", "Villagers: \"Travellers, our settlement needs your he-\"\n\nAme and Gura: \"If you wish to be defended, we must train for another 100 years.\"", "Didn't expect technoblade's reference here", "Ame: brings a raid into the village.\nAlso Ame: not my problem.\nDamn, i really love her personality. The Witcher 3 is indeed a fitting game for her.", "Lets hope no one piss her off", "@tony otaku If she nearly broke her switch from playing Mario when someone pisses her off it'll be really really scary", "Gura: \"What if getting distracted is just a ploy so that I can get to spend more time with you?\" \n\nThis stream is just so cute and wholesome I can't", "Time stamp", "@Glitch -S 2:08:15", "@kohi san thanks", "@kohi san My joy is immeasurable and my day is saved", "Alt title: Gura and Amelia Honeymoon!\nEspecially at the island resort.", "teetee", "No,just friend okay?", "Stream start! 2:50\nHiccup count:\n\n1. 3:00", "mad lad is doing God's work 10Q", "My goodness why does she hiccup so much 🤣🤣 just drink some water or hold your breath", "Is that a hiccup?", "@Dawex23 I think she said they are actually sneezes but she makes them sound like hiccups", "Thank you, you are doing gods work", "@heshiram ahhh ok got it", "@heshiram not sneezes, but more like burps", "You bloody legend", "Only time stamp we need for IMPORTANT stuff ;P you madlad", "@Aliel Khaldune reversed burps", "Amelia's Internet: Prepare for trouble!\nMy Internet: and make it double!", "I had both streams running, so I simply took the audio from Guras stream. And honestly, that helped. Those interruptions are far better to bear, when there is no audio interruption. ;) \nAnd yes, the stream was very enjoyable.", "Lag was hard, but, this stream was good. But only when playing minecraft she get lag, I don't know why.", "This post was made bye SEA internet gang", "Despite all the troubles, these Ame x Gura dates always make my week better", "@Arestris lucky >.< I wanted to do that too but my sister is using my computer for her online class so I can only watch one of them on my phone.", "@Cristian Freisz maybe coz of the shaders? It's super pretty tho", "@Arestris whenever I'm multi streaming i only play like one of their audio, it gets hard to listen to with 4 of the same voice playing at the same time", "\"To live would be an awfully big adventure.\" - Peter Pan, J.M. Barrie\n\nThe true gameplay of Minecraft will always be aimlessly walking into the unknown, trying to find something new...With a buddy.", "Can we just appreciate the lengths Amelia went to to make Gura happy?\n\nBest Hololive pair hands down! :D", "10:41 \"What else do you gonna open?\"\n\" Your mom\"\nWoah right there", "She said groundpound human", "The girl last tour : trip to building Atlantis - Episode 1 is the best \n☺️👍", " oh wait, this is episode 2 right?", "Someone made fan art based on your comment.  It was @walfieee on twitter.  It’s really cute ☺️", "@andrew rainey oh wait you're right lool!", "You can clearly see how well ame and gura vibe with each other. They compliment each other very well with ame being very goal/focus oriented and gura being a go with the flow sidetracked shark lol. They both play off each others humor and are funny together, make fun of each other and tease, and stream for long periods of time when they collab and there's not much dead air if any. It really is like watching 2 really good friends play a game together lol, these 2 without a doubt are my favorites", "Lol , that thumbnail. Mama Amelia with her child leash on Gura.", "The thumbnail is too damn adorable. Maybe it's because of the drawing style\n\nHnnnnnnnng god it's so cute", "Gura and Ame Minecraft collabs are the best, am I right guys?", "U got it right ;)", "Yes", "I like how in Amelia's thumbnail she has Gura on a leash but in Gura's thumbnail it looks like Gura is chasing Ame for a hug", "on today's minecraft stream:\n\nAmelia builds a big (2:01:32)\nGura kills a sheep (2:30:00)", "Tonight, on Bottom Left...", "out of topic, but i love the fact that you could change amelia, gura and the chat with clarkson, hammone and may and it would still fit in with the rest of the top gear intros.", "Gura’s thumbnail: go together!\nAme’s thumbnail: good boy!", "An accurate representation of Ame being an extreme S.", "@pbo1929 great representation with ground pound", "Them finding netherite was probably the craziest moment of the stream. Chat went crazy lol. There was also someone who typed in chat; \"Imagine if they find netherite lol\".", "Finding Netherite without even knowing what it is. As you do", "I mean... They found the temple just near the new nether portal. Gura's jinx bring a huge luck for them i think.", "it's like girls' last tour", "Me, who read the manga: VIETNAM FLASHBACKS", "Girls last tour but not dark edition", "Imagine them being in the same world as in girl's last tour amelia and gura", "But without the despair and hopelessness", "It was a fun stream and the chat was very calm. The moderators did an amazing job\nhope to see more streams like this", "This might be a dumb question, but where did you guys see the mods? I guess I didn't notice them because I wasn't breaking rules. I don't see them like AO-chan in Ina's stream.", "@Joe 冗 just because they don't talk, doesn't mean they don't exist", "@Joe 冗 These mods don't seem to like to make themselves known unlike AO-chan", "I got banned for saying \"shh no backseat guys\" Is backseat a ban trigger word or something?😅", "@ÒwÓ \"if you see trolling or spam do not respond and report or block\" it's against the rules to respond to misconduct.", "@Spicy Love otherwise half the chat is \" pLaY GwENt\" and the other half is \"bE QUiEt GuYs  StoP SPammiNG\"", "@uskan yup that sounds about right", "@Spicy Love Ah i see the new rule. Thats kinda strange for a ban cause I was going against the back seating... well, gg's i guess :/ man.", "@uskan I mean... without the spammers and backseaters people wouldn't have the want to type \"stop spamming/backseating\".   Banning the people (like me) that are against the spam/backseat just feelsbadman. Like we're put in with that group all together.", "@ÒwÓ Well, it is a lesson and we might need play smart next time. \n\nXD", "@Alexandra Ross #feelsbadman", "@ÒwÓ Yeah because saying ppl not to backseat spamming has turned into spams itself. Just report and block anyone who backseat and you're good to go", "@ÒwÓ Don't feels bad. \"Be better\" - Papa Kratos\n\nXD", "@uskan i dont understand why \"play gwent\" and \"shh no back seating\" is bad, explain please, im new to the rules", "@ÒwÓ rules are rules. spam is spam. Use this as a learning moment instead. They won't magically stop spamming if you tell them not to, sometimes the option of the better person is to ignore it and let the mod handle the rest.", "@Gacha took the kids learn what? Not to spam? I only typed it once. Why must the good be punished for the ones that are bad? And with the same punishment at that...\n\nA friendly reminder not to backseat is not a good thing to do? damn.. sorry for caring.", "@ÒwÓ Yeah, you and others lol. Rules clearly says not to respond to spam because that makes another kind of spam.\n\nOr maybe you just had bad luck and got caught in the crossfire... :(", "Pd2: \nIn Amelia Thumbnail Amelia has Gura with a belt.\nIn Gura Thumbnail Gura it's trying to catch Amelia \nIt tells a lot how they see each other. XD", "I thought Amelia had Gura on a leash considering how she can wander off at times.", "Thumbnail\nIt seems that Gura can’t stay still in one place.", "if you wanna Sync between 2 live\nAME : 2:56\nGURA: 2:35", "I wish I found this yesterday", "Comfy stream with so much LAG, but u know, still good.", "2:08:15 And this is why I love streams with Gura.  Also, the fish piss comment by Ame at 2:08:50", "2:20:55 her eyes twitch\nno post credit today", "yes they did!", "We'll probably get a post credit treat during the fall guys stream", "@Blooper {Reloaded} maybe", "shark more like", "@Alpha Beef green dude on a swamp", "the time difference is killing me  it's really hard for me to keep up with the livestreams, i usually watch the archived ;-; but this stream will be a great watch for the long holiday this week", "Long holiday???", "Yeah, these things starting deep into the night is a problem :/", "I honestly just watch all of these streams as archives because I do prefer to watch everything from the beginning. Most times I'll hop in for a second while it's live then come back a few hours later for the archive.", "@Alexandra Ross yea, im asian. theres a religious celebration for muslim, tho im not muslim so im just enjoying the perks", "@『Platnum Breaker』 what i've been doing for a few weeks now", "@gabriella joyce Oh, i see. I recall it is from Wednesday to Friday.\n\n But, my College only tolerate Thursday.", "@Alexandra Ross calendar said its starting today but idk why i have classes  im confusion", "@Lishtenbird omg i always see u i just realized. its cool to see regulars", "@gabriella joyce It really messes with the sleep schedule, but I try my best :D", "3:51:25 Happy ocean land > Atlantis", "What’s with the “23” in the description? Am I missing something???", "22", "The numbers Mason! What do they mean!?", "21", "20", "19", "@Rappy_ 18", "17", "16", "16", "19", "15", "14", "it's probably a mistake", "13", "12", "11", "10", "9", "Her fall guys stream has “-1” in the description I’m scared", "8", "7", "Probably something to do with the upcoming Scavenger Hunt", "@Shidi Wen yeahh might be but she said she wasn’t gonna put any “candy” in the collab streams so idk", "@Lamato o Yea, we’ll just have to wait and see or wait for some investigators to piece everything together.", "This current stream has a -1", "6.", "5!", "4,", "3", "2", "1", "@PhatAssMitsubishi進化 ah dang it, i just finished the archive lol", "If you collect all the numbers you get the coordinates to find Sherlock's dead body.", "Watching these two is always a treat! Also the ending with them watching the sunset with the music and all was super satisfying\n\nAlso 2:08:16 WHOLESOMEEEEE", "13:23 whose voice is that lol", "Bubba", "bubba has a handsome voice", "It's always fun to watch Ame playing with Gura, they're just so matched together.", "Watching this is like watching a minecraft Playlist from 2011 only with beastmode graphics and 2 hololive streamers", "2:08:15\nTeetee Amelia and Gura moment", "Dang it, how did i miss a 4hour stream.", "2:37:30 Kame House", "What do you call an underwater adventure with a Great Dane? Scooby-Diving", "MOAR , I will Follow you , Give me MOAR this", "@wolfz KFP Health Department Advisor watch the girls videos and you will naturally find me in the comments =)", "Ina, is that you?", "@Anh Tuan Tran Nguyen LOL 😂", "Bu dum, pshhh", "Featuring 60k framedrops from the ISP series!", "Well this was a calming stream", "Still a better love-story than Twilight.", "3:31:31 finding rare item, but ame doesn't seem interested", "Very \"but why\" energy", "So, the stream drops are caused by... Bubba downloading lewd contents in Ame's house? wwww", "4:45 - Ou yeah baby! \n\nDon't mind me", "53:13\nGura asks Ame if she might want to do a movie watch-along together sometime.\nIt kind of seemed to me like Gura was thinking about asking Ame for a while but was nervous and was trying to build up the nerve to ask", "Put her under the spotlight right then and there XD", "Imagine coming up on a pristine, untouched beach and thinking \"yup we definitely already found the treasure here.\"", "Dat thumbnail... so now you're babysitting gura ??", "Another lovely Minecraft stream!   Thank you, Amelia Luckson!", "Gura asking if she can help is like a child asking their mom if they can help cook in the kitchen <3", "Gura: What else do you ground pound?\nAme: so you have chosen death", "Damn it, I got into vtubers a couple weeks ago with Pikamee and then I started watching Kiara and Hachama. Now this stream has got me wanting to watch Amelia and Gura. The list keeps getting longer and I only have so much free time. Perfect calm stream this was. Girls Last Tour indeed.", "It's like watching me playing Minecraft with the homies", "gura on parody and fair use: lets go baby i know the law", " for all the Hiccups I missed, and see ya and looking forward to the next stream Amelia!", "there's a 5 second offset between the two streams for the multiwindowed", "I miss the atream... but after watching this..\nI feel like young again.. its like seeing my own 2 sister playing game together when i was young..\nSoo nostalgic", "Shame the Live was choppy, great time nonetheless.", "Thumbnail: DAWGSHAARK", "Even though I ship them so much\nGurAme Streams are the best and are so wholesome", "1:15:58 Iron Golem Farm plan", "Wholesome collab stream yeah! Looking forward to another Watson Industries to make anything possible! (Chat is KALM too and that's a plus!)", "They're always calm when gura's streaming at the same time. Most of the rowdy ones probably watches gura", "@Luna Freed Hopefully they don't do that again", "This was so fun to watch lol so much MC content is amazing", "3:23:33 what about Amellia WotSon or Amellia WideSon and she's always in frame", "1:31:50 baby bunny!", "cute Ame sounds 1:32:11", "Ame Speedrunning conversations with Gura^^", "Hope the lag gets better, but overall fun stream!", "Imagine that the pillagers tracking you down because you killed on of their captains and then you just lead them to a village which they pillaged in retribution to you killing one of their captains...", "Ame doesn't build no shabby shelters. She really puts work into even the temporary ones.", "The engineer equivalent of artist's \"I just doodled this real quick\".", "@Lishtenbird you mean Ina?", "Just ten seconds in and we get our first HIC", "ぐらが自由奔放すぎて意思の疎通が上手くいかなくても、なんとか応えようとするアメリアの人柄の良さが分かる回だった", "Everytime bubba borks I think you know what life ain't so bad", "No banana counting today, only teetee :3", "Finally~ coral reefs", "What texture pack is that, that you are using??? It looks really pretty", "it's a shaderpack. i think she's using SEUS shaderpack with optifine", "What?  How does Watson not know what jammie dodgers are? \nAren't they apart of a British person's staple diet lol", "Ame Death Stranding'ed", "Bruh all I see is a dog taking her shark for a walk", "a dor made out of wew", "1:32:03looool", "Lmao that thumbnail", "Amazing stream even with the issues Ame", "Hopefully those issues don't carry over to the Fall Guys stream", "Defective shark wrangler.", "3:31:27\nThey hit Netherite", "1:34:27 Mood 0% \nRelatable", "Anyone got a timestamp for the moose conversation?", "1:28:23 nvm", "Dang it I'm 8 hrs late", "Amelia with a child lease on Gura makes a lot of sense.  She's basically all over the place and needs to be under heavy supervision at all times. lol", "Guys, if I join membership now, will I get charged at the start of November also?", "You get charged every 30 days from the day you start, not at the beginning of the month.", "@Jendrej Thanks!", "Did ame just say runescape???", "Bubba feeling jealous and wanting attention is soo cute 😍😍😍.....", "best couple 😀", "1:24:20", "Amesama!", "1:59:44 So she made the thing that looks like an H, I've seen them before but I'm a bit new here, what does it stands for, the H, for Home or is it a reference for something ?", "Hololive", " @King Mufasa Or HIC as someone pointed out in the chat..", "I am speed.\n\n\nnot.", "So many backseat gamers this stream. If you wanna have Minecraft done the way you want it to be done, then play it yourself. \n\n“Optimal” or not, let them have their fun!", "Best grills", "Backsound is good :3", "Yeah, cause it's Minecraft's", "AmeSame!!", "the west", "Lol wot 1:34:00", "Pd: Amelia Watson? More like Lagelia Lagson! haaha.. ok i stop sorry", "I love the cover", "Did anyone know that what did Gura say at 23:23? I can not understand?", "“Oh dang it! I looked away”", "@Luke C Thank you!", "did amelia lose her Watsword?", "I love voice super super súper beatifull", "Nice.", "Oh man.... almost 4 hours stream\n \n😵", "Anyone know what shader Watson uses?", "amelia chillson", "24:40", "Lol", "Not again im late", "Both are so cute", "AmeSame 💛💙", "Epic stream", "What's the shader she using again?anyone?", "SEUS shaders, I believe.", "@Austin Fields oh thanks, I'll try and see", "Haloa aku indo", "Gura on a leash", "The shaders Amelia is using are becoming more of a hindrance than help. Low visibility in the darkness, lower render distance, pickles only lighting up when there's four of them is the final straw. Why on earth would a shader pack do that???", "I know I sound like a noob but what texture pack is Ame using?", "It's called Sues or something", "Seus", "She's using the SEUS *shaderpack which you can get here - https://www.sonicether.com/seus/\nTexture pack is still vanilla", "I couldn't get over how good the game looked the whole stream.", "Also, Shaderpacks are resource-hungry, she is not only using a heavy shader pack (Seus) but also a High-Specs one\nThere are shader more resource friendly (Like Chocapic) but doesn't look so pretty like the one Ame is using", "@Rappy_ i love this shader. but night is too dark.", "a", "I preferred their relationship as friends minus the flirting and lewd chat spamming but it is what it is I suppose.", "That thumbnail is basically Amelia and Gura in a nutshell", "https://youtu.be/NAOWEccIQhc\nGawr gura and pirates", "https://youtu.be/NAOWEccIQhc\nGawr gura and pirate", "These girls can be a little... special sometimes. I can't help but need to correct them.\nThe name for a baby sheep is lamb.\nThe plural for goose is geese.\nThe plural for moose is moose.", "you don't need to correct them, they were making secret references that you obviously don't understand", "あなたに感謝しない人は精神薄弱、あなたを悲しませてくれる愚か者、あなたを逃がしてしまう愚か者、あなたを好きな賢い人は賢い、あなたを幸せにする人は素晴らしい、そしてあなたとあなたの人生を過ごすことができる人は幸せです。永遠に幸せ！\nPeople who do not appreciate you are mentally retarded, fools who make you sad, fools who make you slip away, smart people who like you are smart, people who make you happy are great, and those who can spend your life with you are happy. Happy forever!"]