["Amelia: \"I just want us to have fun!\"\nMe: Aww Ame is so wholeso-\nAmelia: \"But sometimes I want to yell at you guys\"\nMe: ", "The duality of Ame ahhahaha", "time stamp?", "that's a win win situation for us", "You saying that like we don't like being yelled at by Ame", "YES", "Hey that’s a win in my book regardless of how odd that sounds. Just like the flip of a coin!", "@Samuel Dantis 39:35", "Rules: or at least pay money to yell at me (」ﾟﾛﾟ)｣$$$\nCan we can pay money for her to yell at us instead?\n(No, don't.)", "Sweet Ame vs  Toxic Ame", "yes please", "Ame: no more super-chat\nChat: Ignore that order\n\ntoday chat was cool chat ", "Maybe some of the jp bros didnt catch that. I saw some yen going through. Maybe im just worrying too much", "@Eh why should you be worry, it’s not a bad thing", "@ Not Janny i guess my words were wrong, its more like i feel bad their messages weren’t read", "@Eh oh i see, Ame will definitely read them in another stream, so no worry", "Stream start: 3:53\n16 crystal clear hiccups\nHiccup count:\n1. 6:12", "Commendable effort sir", "@Ecstasy Always a pleasure, fellow teamate.", "Doing the god’s work", "im kinda curious i got hiccup when eat spicy stuff and eat dry food until got stuck in my throat. is there somebody got hiccup without reason??", "", "@payback super https://youtu.be/lf349SyH5kg check this video. Amelia explains it herself", "yoooo i thought im the only want how addicted to ame's hiccups ! you ma man bro thank you !", "Thanks for the chill stream Ame, hope we can vibe like this more in the future!", "1:17:00 Daily mom clip. Your day is now saved.", "23:30 A laugh \n1:25:38 A smile\n\nMy work is done and I am satisfied", "Bless you", "2:41:54 Pst pst pst pst pstttt~~", "she did the thing guys!", "Cats: \"WHOMST HAVE SUMMONED THE ALMIGHTY ONE??!!\"", "32:04 best hic", "This cured my depression.", "For a moment I thought Ame was going \"pspspspsps\" to her cat", "Do you mean \"kzkzkzkzkzk\"?", "This was a good stream, we were all healing and chilling the fuck out of recent events. Secret end is there, her genuine laughs too, slowly but surely winning some trust back, to every teamate I’m sure it was reassuring we could and will do better. Congratz for the 500k Ames, I’m happy to have been with you all the way and for being able to see you growing and helping your fanbase to be better people. That all said, the real fun is plug dj chat, we are still fighting against the oppression. Thanks for the help Ao Chan, Desk Kun and Imagine Breaker Kamijou San. 150 NEVER LEAVES.", "I love Amelia yelling at us but I dont like it when she is upset", "Had fun hanging out with Amelia and the chat today  even though I couldn't get into plug dj for half of it lol\n\nI also took notes of the upcoming streams cause there seems to be a lot.. (wait for schedule for official announcement):", "Nice", "Grats on 500k, Ame!  New rules and chat moderation are great. We 100% needed an iron fist\n\nGlad my song played right before the site crashed and the stream started lol\nSorry it was 8 minutes long ", "today chat was much more better", "@Caio All thanks to my guy AO-chan", "respect for cutting the song off at 4 minutes but honestly I wouldn't have minded it playing all throughout. i thought it started draggy but it was such a bop", "I don't think that ao chan at all", "Respect for ending it early. People don’t want long songs because it’d affect other songs from being played I guess.", "Man, I wish other streamers would adopt some of these rules. The caps spam really gets old.", "Cd projekt red said streamers wont have to worry about the music so we can jam out to some SAMURAI as Ame and Johnny Silverhand set the city on fire", "Breathtaking", "That's pretty damn good news.", "Cannot wait!", "Great stream as usual, pretty chill and relaxing, specially if you could enter the site with the music. Hoping next streams keep the same vibe, now with clearer rules.", "Its was fun\nHappy 1 month anniversary guys\nThe website broke tho", "I got into it once but then when I wanted to add a song it told me to login, and then it didn't work anymore...", "\"I don't choose to groundpound the groundpound chose me.\"", "2:32:20\n\"Just like the simulations\"", "We’ve captured a command post!", "2:32:24 ame wierd dreamception\n\n2:29:30 ame noises (maybe ame was imitating a velociraptor)", "LMAO VELOCIRAPTOR", "32:06 High-pitched H I C", "This is my moment , I love you Amelia WA¬atson\nPs: Thanks for read my superchat question\n\n1:12:40", "Nice", "It feels weird having the same name as that guy. And for some reason I got muted by the mods too. ", "😔", "Mark is a evil force", "how do you know you got muted ?", "Feelsbadman. That guy was pretty cringe.", "sad times I would say changing your name would be for the best until later", "You have my condolences", "What happened?", "@Pucopocre , it seems someone was spamming or asking amelia to marry him and saying that he was a decent guy. Just what I've seen from scrolling through the comments not sure about it.", "@Pucopocre There was a guy who donated a lot of money to Ame and people started laughing at him, that guy shares the same name as @Mark Mesa", "I got muted too for spamming too much @Mark Mesa", "Rip", "remember everyone, from today onwards the plural of \"moose\" is \"meese\"", "Look at all those meeses", "@Eh meese*", "Understood.", "The djplug thing during sc reading is such a good idea. Very comfy stream.", "Ame you probably won’t see this but it’s worth a shot try watching The haunting of bly manor if you get a chance it is a mystery horror show on Netflix. I’m sure you can solve the the mystery as you watch it 😉.", "F for everyone except the ~600 people who didn't get to witness the \"secret ending\" in plug.dj", "what was it?", "Iirc she played god tier song", "@Sultan I already found out it was i'm mining song", "context for those who still want to know: https://www.youtube.com/watch?v=kMlLz7stjwc", "Edit: lmao jk it actually went on for about 2 more hours after that for some reason. here's secret ending 2 electric boogaloo: https://www.youtube.com/watch?v=oIscL-Bjsq4", "F for choukis, Ame banished him lol", "@Sultan what do you mean?", "@Abraham he played a song that was normal for 30 seconds but then switched to ame’s cover of Never Gonna Give You Up, which then led to him being perma banned (rip)", "@Abraham the madlad rick rolled everybody with Ame's cover", "hahaha Big ups for that guy", "@1:20:00 got exactly the desired reaction, haha. Thanks Ame", "Also the fact that the very next SC was from a guy named Thicc Anime Waifu", "Reminder :\nAme is for everyone...", "not only for mark. dont be like mark", "@Caio i agree", "idk he is for real or just trolling but kinda cringe", "Sharing is caring lol", "I think most of us teamates understand that. Mark is either a troll, or actually needs a psychologist.", "That sound like communism lol", "@TaroYubi I thought the legit crazy ones were purged on 10/1, but there might be a few stragglers left.", "2:02:40 and there goes my superchat virginity", "Lots of wholesome moments in this stream, I’ll let the time stamp people find these moments.", "1:25:28 Just Time stamping my first red one so I can look back on it lol ", " 3 Whole hours of just vibing and Ame saying how good our choices are in plug.dj. Bless.", "For my purposes, mine at 1:58:55, does her introduction and a wink!", "Mark needs some help", "\"will you marry me im an ok guy\"", "I missed that part but I kept seeing it chat what was that about?", "@TheNoobiestNoob well.....mark was a peculiar guy", "Mark is probably a troll, but if he isn't he does need help.", "@Blooper {Reloaded} definitely a troll, he said something about fucking getting drafted lmao", "He donated $260 in total, either he was a troll with a lot of money and time or he seriously needs help", "@FruitsPunch  kinda sus", "For my own use\n1:07:54 double HIC\n1:08:54 chicken sounds", "We had a super nice chill stream today lads, good job", "Mooseus is how you say moose plural.", "The detective nurse strikes again!", "She's going to watch Hereditary?!\nShe's gonna be traumatized....", "May the sweetness accompany you through every moment of the day, may safely walk through every moment of the moment with you, may happily accompany you through every moment of every moment\n甘い日々があなたと共にあり、あらゆる瞬間を通してあなたに安全に同行し、そしてあらゆる瞬間を通してあなたに幸せに同行することができますように(*๓´╰╯`๓)", "2:16:46\nOjou-sama", "2:13:20 for reference the numbers were 4,8,15,16,23,42", "Everyone: Whoa! This song is great!\nMe, not listening to it cuz the web broke: ...wut?\nReally enjoyed the superchat reading stream, love it! (Mostly KALM and wholesome chat, good work chat!)\nP.S: We are cats now lol", "What did the arctic Detective ask a suspect? Where were you on the night of November to February?", "The \"attach rails to everything\" idea is great. I love it. ", "I want to hear Moar Ame's Gremlin roar.!!!!!!¡", "2:17:09 expert phusuks", "I was feeling really bad so I couldn't catch the stream, but I wanted to congratulate you on 500K! You absolutely deserve it.", "The song idea is really good and hope to see it more on future superchat streams\nThat being said, this was definitely one of the better streams because we got to hear more of Ame’s genuine laughter and just whatever was on her mind. If we can chill with each other without issues then we’re all winners", "Good time as always Ame, congratulations on the 500k the chat was also good today, keep that line guys.\n\nContent that is not related to the subject to report, remember to do it, there are many of us and stopping for a moment will make a difference.", "Shout out to mark shinji, hope you get some help champ", "10:09 The banana counting cult is acknowledged by Watson #BananAme", "Nice 🍌 o7", "By the way respect to chileax, star creator and cometeor for supporting Amelia with an sc every stream.", "2:16:46\nListen at 0.25 😳", "Thanks for another great great stream. T'was fun listening to the songs chat picked out while hearing you read spachas!", "ame i saw that secret ending in the plug dj LMAO", "May i know what is it, fellow Teamates?", "Tell me fellow teamate, this knowledge must be shared!", "@Blooper {Reloaded} she played 'i'm mining' when everyone but a few had left lol", "@Kyoro Kazoyori she played 'i'm mining' when everyone but a few had left lol", "LMAO, thanks for sharing o7", "@SoosUnknown Oh, now that's funny!", "TWO Double winks at 1:50:51 😘😘", "Missed this one but hope this went smoothly and everyone had fun, yourself included Ame. Congrats again on 500k!", "Stream starts at 3:52 for anyone wondering", "2:34:28 Noiiicee", "vtubers are human people need to get this. \nthey are not traditional actresses in any way or form \n they show how they feel and their human personality that they use all the time\ntreat them better or you will actually hurt them.", "Bit delusional if you think they are your friend/family ur nothing but a walking simp wallet to her xD her job is to entertain nothing else and no I don’t treat her like anything I just observe with chat disabled I’m just putting out facts is all", "Ok bro everyone already got that message. You don't have to keep white knighting. It's pretty cringe.", "and people like you sound like those psycho japan fans that get pissy when their waifu interact with men. They're adults and pretty much all had experience with online content(maybe ina a bit less), they can figure it out along the way so cool it with the babying ffs.", "Reads all 4 comments\n\nGrabs popcorn", "@MrHamsterpower  you aint even subbed to her you anti", "@carlosraruto Yo dude, can I have some too? Because I wanna enjoy this.", "mrham and blackwolf indeed are not subbed to ame  they are just antis from twitter", "srsly why are these trolls projecting?  they are the only ones that would get mad if ame had  interactons with other people i bet they are all  /jp/ trolls", "@MrHamsterpower  you disgust me", "@Aamon i don’t even know what an anti is xD this account is my phone I’m not on my computer where I watch them you guys really went that far xD pathetic really", "@MrHamsterpower  if you dont know what an anti is you really shown yourself as a troll. have a good day mr troll", "Trolls vs Mega simps. This battle will be legendary!", "Imo saying whiteknighting is cringe and telling others to stop is pretty cringe within itself", "Say what u like the first comment I did is the truth not a troll you guys just can’t even retort a proper argument so your response “huuuuuurrrrrrrr durrrrrr he ain’t a sub he must be an anti go away mr troll” lol ur comments mean nothing to me just proves how over the top simps act like when someone shows them reality.", "@Kyros Stupid name Just saying it how it is. 🤷‍♂️", "@MrHamsterpower reality? i would not care if she had a bf or was married you simply dont treat watson as a human being\ngood bye u chunk of fecal matter", "@Aamon what? Dude stop liking ur own comment it’s fucking obvious and what ???? don’t treat ame like a human being xD", "@MrHamsterpower \"xD xD xD\"\n\nWow if it wasn't obvious what your age is, you sure are doing a great job letting us know!", "Why do people get so mad when told to treat creators as human beings, Jesus Christ lol", "@MrHamsterpower You first comment already made clear you are either a troll or don't understand concepts like  'support' appreciation' and 'gratitude'. (And I'm not even talking about money involved either) \n\nBut that doesn't mean others don't.", "@carlosraruto people overstep in the fandom thinking they know them personally it is a fantasy treating them more than what they are which is an actor to entertain to get paid like everyone else they are not your friends or family that is all I was saying.\n\nI’m not bad mouthing ame I treat her like every other streamer a human being but nothing more I’m making a point that simps use mob mentality/irrelevant insults to avoid the truth", "@MrHamsterpower I do agree that it's not like a friend/family, BUT there is a special relationships of being a fan and an idol. And yes Ame is an Idol because Hololive is an 'virtual idol agency'. But anyhow, thinking yourself as a walking simp is also wrong. I was saved by Hololive talents (especially Rushia). It's not a romantic way, but it's where you can say you love them and care them a lot. I'm hoping that a lot of the viewers would get that feeling of happiness with Amelia. It's not just the word you can describe as 'entertainment'. Not everyone agrees with me, but I would call myself as someone who appreciates Hololive as a whole. That's why as a fan of Hololive, I tend to see them in a different light. ", "Sorry but isn't what you said super obvious?", "@Scared Samurai same here. Also love your pfp, can't wait Demon Slayer to come back", "@MrHamsterpower  I think I see where you’re coming from. You view Vtubers in a different light because to you they’re playing a character, like actors in a performance. The character is a facade that completely separates the actor from the audience. Everything she does is a rehearsed act, thus making you think the supporters who donate and claim to understand her on a personal level are getting overly familiar, by which you call this behavior as simping.", "F for mark shinji \n\nthat man was a legend", "Me: \"Aw man, the stream is at 4:30am in yuropoor hours on a workday, guess I'll skip it. It's just SC reading anyway, what could I possibly miss?\"\n\nMy pain is immeasurable.", "Same bro. 😢", "@XnRz_ Ah well, win some, lose some, I suppose.\nI won't be missing the next one, that's for damn sure.", "I love how adoring u are!", "すき♬♪ヾ(*・。・)ﾉ ♪♫・。・", "505(k) subs. grats!", "Mark was the real MVP", "Ame is so good at the American accent but sometimes her British accent comes through and it just blows my mind. You guys know what I mean?", "32:04 \nSQUEAK", "Sucks i couldnt get into the site for the music but still watched everything", "Luv after the stream end and there\n\nWas still 600 to 500 people left on plug.dj.", "Absolute War Zone between chat and boss Ame hahaha", "yup lol", "@Tuấn Đinh lol what happened ? Missed out on stream, was around 3am my time.", "@XnRz_ yes it was crazy I thought she was gonna close the sever or something but she got on dj stand started jaming after few hours later she use bubb4 to destroy chat and the whole chat was trying fight back\n\nAbsolute war zone", "@Dr_ Frosty bubb4 ? Is that the new moderator ?", "@XnRz_ yes I thought it was but he's a bot that was being controlled by ame", "@XnRz_ sorry I couldn't reply earlier I was watching Kiara among us stream 2 hours earlier I was going watch it when it came live but I fell sleep too tired from ame after party", "@Dr_ Frosty lol all good bro, thanks for the report  o7", "Keep talking and nobody explodes with Haachamachama? Ohhh! Exciting!", "2:21:48", "Hahahaha, the chat actually broke the site sort of. I guess the chaos did calm down. Thanks for the chill stream.", "there shouldn’t be chaos anyway lol, because it’s just a chill superchat reading stream", "Awesome🤤 🙏🏼🖤", "かわいい", "1:53:11", "Hey that's you wow incredible", "@Ecstasy I know wow", "For the people who left the djplug room, be glad u left.\nWhat happened next was absolute chaos...", "War is happening in here hahaha", "It's a good thing. 😂", "lmao yes... I'm making a meme out of that", "Oh man, hereditary is gonna mess her up. I couldn’t sleep for a week", "it's a bad movie?", "Toni Collette has given me constant nightmares since About A Boy.", "32:07", "1:21:07", "I hope we can get to download the Holo EN/JP Minecraft world once they are done playing in that world.", "woo Golden?", "yeaahh its golden", "Golden", "me always seat back not even try to touch the keyboard: fine, i'll lie it down \nbut no, seriously RESPECT the rules ", "1:09:15 😂", "hah", "this is super rocking, really amazing job fam. You def got my support. Let’s be YouTube friends and grow together 👏☑️", "\"moosesus\" Is that a Senzawa reference?", "Yep", "1:25:45", "Who's shaun?", "@Ecstasy me", "A knee slap is not a head slap but fine...", "", "No", "Moosesus is the word of the day", "a", "", "", "I want to have breakfast using ame milk", "", "Ggs \n\no7 to Mark for his determination", "What does o7 mean?", "@Ecstasy Salute my dude", "@Curiosity mislead me I think I'm blind o7", "@Curiosity mislead me thanks I've been curious about that for a while. What's it from?", "@Intestinal Clouds According to google:\n\n“Emoticons such as those actually originated on the PLATO IV computer system in 1972”", "Where's Mark?", "check chat replay for mark shinji he sends $5 every here and there he's probably a troll but it was still funny lmao", "Chopped up and fed to pigs don't worry about it", "Play Witcher 3 in it’s Motherland’s language which is Polish!", "Don't think that plug.dj was a good idea", "yeah, it had a low capacity, but we were having a good time in there"]