["Man, she really is British. Making public transportation in even the most hellish areas", "Hellish areas?", "@Vimal Manoharan Hellgate London...", "The \"Netherlands\"...", "@Vimal Manoharan Birmingham. o3o", "Cornwall", "INDIA", "19:30\nThat raw and genuine \"-t the hell is that!? Hey! Get out of my cart!\"", "This is why i love Ame so much.", "That was a hood gangsta lvl reaction", "natural reaction for a gamer like Ame", "Also, 2:29:28", "17:25 \nhorror movie chase scene.", "WTF, that was genuinely terrifying!", "That's true definition of a horror train", "man that was scary", "Thank god for that crafting bench", "Bruh, that's scared me", "it was hair raising seeing that live. damn it", "@Ryoki Hama crafting bench-kun, thwarting both roommates and phoenixes!", "plays running in the 90s", "There are so many jumpscares by mobs in the whole cave exploration even an ambient cave noise would bring chills because of the altered atmosphere and its very eerie considering its only Watson who was playing the game and exploring the abyss and the depths of the unknown by herself.", "Jurassic park vibes", "Also, \"wtf was that damage my guy?\" reincarnate.", "This needs to be clipped", "Enderman was just trying to bring back the block that she dropped", "Bruh moment", "Oh my God, i know Enderman is scary but not like that!", "@AryaZaky Iman Fauzy https://youtu.be/1qXjd1jX_Qg\n\nHere you go.", "@Ardantop132 n/a ey thanks", "1:13:08 Someone in chat says “Use Ina’s chest, it’s an anvil.”", "Does Ina even have a ground pound attack?\n\n\nWhat am I saying, of course she does.", "@shingshongshamalama funny enough, she actually does. go watch her Hades stream", "maximum O O F", "That must be named\n\nWatson Heavy Industries Corp. (WatsHIC)", "Get my upvote. Take it", "Ame, please use this.", "I'll campaign this name until Ame use this in her stream", "heavy industrial corporation sounds nicer to me", "*Hic*", "@Snaps Yea, this one rolls off the tongue more.", "This shall have my support as well 😆👏", "Usada Construction:Watson Industries? Our battle shall be legendary!", "Finally, a worthy opponent!", "Don't forget the legendary AkuKin construction...", "Have you seen the peko gundam pekora built the other day...looks like they're getting ready for battle alright  😂", "@Frankie's Silencio damn i didn't even finish watching her stream then my phone die", "@Hoshizuri Azu power bank exists bruh, spare some from shrimping allowance, it's a small investment...", "Usada Construction made a peko gundam\nWatson Industries? battle armor ofc", "Don't forget there's Moona", "@RICKY リッキー It's amazing how Moona became a pro in just a matter of days. Then again, it's easy to catch up in the jp server due to its booming economy.", "24:48 Ame being sweet to chat", "Just a few streams ago she did the exact opposite to a certain viewer.", "Amelia - the type of person who can kill billions and heal them at the same time.", "she’s like the witch of wrath from rezero", "@pbo1929 crazy diamond?", "i love how chat just exploded lol", "@Acemcbean Piff cool", "@Trix Fix well, he was kinda rude imo and she used a very generic phrase that I wouldn't even consider a real insult.", "@Trix Fix wait what stream?", "Watson Industries: Resource Mining and Railway Transport Systems, newly built (file Unknown)\nUsada Construction: Originally a Transport and Railways Company, now an Unethical Resource Research and Development and Acquisition Company, responsible for Villager and Monster Deaths\nNenecchi Corps: Mercenary Company, Raid and Siege (activities currently unknown, Botan currently stockpiling insane amounts of weapons???)", "what about gura mining compay though", "@gagaopui Ame has taken over that", "Moona too. Her contraptions have impressed Pekora", "@gagaopui Gura has moved on into making doors for a living. Takes her hours but there the best doors you can find", "@atariDC_ Moona’s an employee of Pekora", "This is like EVE online all over again", "MoonArchitect was previously monument-automated agriculture company with a dash of residential construction, but is now a subsidiary of Usada Construction", "@TheMobius but if she wants to she can make the moonarchitect.Inc or HoshinovaTech.Inc", "@TheMobius What a smart move by Pekora, taking a Genius under her wing before her business blows up.", "I guess gura is an explorer now, as she always get into new zone and giving out first hand information in their collab.", "This could be a synopsis for a great story! If we are lucky that story might just crystallize organically. 😀", "@Mikael Olofsson Oh, it will. And considering all Holomembers' antics, it's probably gonna be crazier than this", "57:43 57:52 1:49:32 cutest “but why” u will ever hear", "Ba wae", "just need her to say bruh and it would be the best thing I've ever heard.", "Minecraft eats up a silly amount of computer juice for how it looks. Especially with shaders. There are more lightweight ones than Seus' you can use, like the one Kiara uses (Sildurs Vibrant Shaders Lite). If you're still feeling like Seus Renewed makes MC a bit choppy for you then know that there are alternatives you can try out and experiment with! ", "BSL shaders is my favorite one. not super heavy, easy customizable, doesnt look super dark at night and is super pretty!", "Yeah, Minecraft has always been poorly optimized. If I'm not mistaken (I remember reading this in some website), one of the reasons \"bedroock edition\" exists is because the original java code is a big mess and hard to optimize.", "@BATTIS94 definitely. I was always wondering why Minecraft ran so bad in my PC. Then I tried Bedrock edition and started playing with 44 chunks and every setting in max without fps dropping :S", "One more reason everyone uses Optifine.\n\nAt least the game actually does multithreading now though.", "is she using SEUS here? it looks so good! which version is it", "Oh, I just made a comment about Sildur as well. Maybe I should have read the others first. BSL is a good choice too but I feel like Sildur, with the Lite/Medium options does a good job of looking good without much performance deficit. Kiara is running the Sildur Lite on a 1050.", "there are a number of reasons for that. The most obvious one that everyone calls out is that Minecraft was written in Java, and Java was designed for portability, not performance. The actual big issue, though, is that Minecraft has always been pretty terribly optimized, and the retro-style graphics are one of the few ways the game could even run as well as it did back in 2008-9 when it first came out.", "@Ryoku BSL is one of my favorites", "Complementary Shaders are really good too", "02:56 start\n03:33 no it....beautiful!\n05:10(seting readly?)\n05:30 a little lag?", "holy! your quick! but thank you", "50:57 NICE\n54:10(check CONN\n55:50 stripmine= taking off jacket ?\n57:18 don't get lost", "1:33:35pick up thing\n1:34:28 HIC\n1:35:10 OOPS\n1:35:52 never mind", "2:24:14 GO GOME\n2:25:12 LOL\n2:26:28 make the house?\n2:27:02 Panik!/need to build the portal", "Oh god... It's the legendary timestamp dude...", "Thank you!", "Thank you kind person", "carefully, he's a hero", "マジかみ", "fucking hero", "Thanks man", "Everyone listen to this\n3:20:38\nAME GOES BRRRRRRRT!\nAME can bless me with an earape", "wow,Amelia is even making a Holorail in the nether? I guess she’ll Nether get bored with Minecraft then.", "okay ina.", "she really praised chat today ;-; i'm so soft", "The one time i had to skip a stream too ;-;", "@Amiel Pines well glad I wasn’t the only one that missed it I was sleeping it would’ve started around 4:00 am in the morning when she streamed.", "Thanks for the chill stream as always, Ame!\n\nTimestamped some moments\n15:34 AFK 2:41:32", "On behalf of the late gang, thank you for the stamps", "i love bread, my favorite bread is walnut bread. What's yours?", "Thank you Amelia for playing Minecraft for us in the steam after played with her friends. She was amazing that she really enjoyed to play the game for fun and interests. Now she must be tired and sleepy for playing more than 3 hours in Minecraft, so I hope she'll take some rest and sleep, keep bring us lots of fun and joy. Thank you, Amelia.", "Excuse me sir, her name is amelia", "@V4X DN Changed, thank you. This is my own mistake.", "Surprisingly she is playing more than the other girls despite saying it makes her sleepy and not seeming too excited for it", "@atariDC_ a true addict lol", "I kept denying it but now i can't say i wasn't an addict of minecraft. I often played for over 6 hours non-stop back in my high school days.", "Haven't touched minecraft in years...and yet all this minecraft gameplay from the entire hololive en crew is making me wanna go play it again...", "Pretty much the boat I’m in. Haven’t really touched the game since it’s prime, but have the itch to get back into it", "Watsword\nSharpness II\nSweeping Edge I", "I hope her diamond sword name becomes the legendary Mompounder", "@KevGaming me either", "HoloEN collab ends\nMe: \"Ok, that was great, now I should go to sleep because it's 3 AM. I don't think anyone is gonna be crazy enough to stream again so soon at like 5 AM or something...\"\nAme: \"Oh boy, 5 AM!\"", "it was earlier than that for her", "@Coolkid Gaming Yeah I know. It's just how it felt for me with my sucky timezone.", "3:05:22 Every girl in a 5 meter radius within me", "2:15:15 mine in abyss player here, you will actually have to join the server as the project relies on plugins instead of mods. The downside is that you will have to join the server but the upside is that everyone can play without installing anything. All you need is the newest Minecraft version.", "the plugins are all open source, im sure that if you join the discord offz would help you set something up\nThere is however a mod that actually functions the same way but with better transitions at the cost of more lag called cubic chunks", "It would be best if you tweet this to her", "dont forget server capacity is like 80 in case of viewer influx, at best", "Abysa Ranbu „at best“ TRUE", "15:36 cute!!!!", "34:05 more pls", "3:05:22 more f word", "\"its safe here\"\nphantom noises", "Enderman be like: YA LOOKIN FUNNY AT ME HUH? IMA GONNA HIGHFIVE YO FACE! COME BACK HERE!", "You got a loicence for those railways?!", "Lack of torches may still be a thing for monster spawning problems. However, I did notice on last night's Collab that Ame's brightness was much lower than the others. I have no idea how the shader pack will affect game brightness without seeing them side to side (seems good). Kiara's shaders looked darker on stream compared to others but still *slightly* brighter than Ame's stream without shaders.", "2:50:11 daily dose of Ara Ara superchat\n (づ￣ ³￣)づ", "You're doing god's work!!", "I haven’t heard her say that in a long time, long time.", "@Arc lieutenant Jesse only member stream she say it", "@Ara Ara fair enough lol unfortunately I’m broke so I’m not gonna be a member any time soon. 😥", "@Ara Ara but in her last 2 stream of member only she didn't say it", "@Viloid DDF yup in her latest member stream", "Your welcome", "@Ara Ara are you fine with me still superchatting under this name or do you want me to change?", "17:10 Gamer mode off\n1:32:45 Gamer mode on\n1:33:44 Ame being Ame lol", "1:27:42 The price of overconfidence.", "Mine in Abyss hololive playthrough actually sounds so hype", "Love the banter between Ame and chat", "But why? ", "Please check  かみ箱 comments!. They did an incredible job timestamping not only the hiccups but other moments too!. I'll list the ones they missed below. Please remove 5 seconds for every of their timestamps. There's a little delay.\n\nMissed hiccups:", "shes so fricking cute", "Enjoyed the somewhat chilled stream despite of the backseating still continues. Thanks.\nChat did have some moments like when they are  proven to be right but still. Anyway, the part that Ame got into the same situation as Gura when she got cornered into a wall was something.", "Its a minecraft stream We can never escape the backseat...I can only hope it will stop  when they become really good", "@Kangamanga 25 lol I doubt that. There's still backseating in Pekora's mc streams. Just enjoy the show", "@Jus Astroknot Hahaha Il'be damned I guess not understanding japanese was a blessing in disguise.\nI was so sure the Japanese fan were different in that regards but I guess were not so different", "While pekora has alot of more hours in minecraft and does more advanced stuff they both rely on chat, but yeah I agree that its annoying.", "I think most of chat just wants to help them get better at the game and that's why they \"backseat\". Back seating is kinda similar to giving tips just saying. Except backseating is telling someone how to play and giving tips is giving advice on how to do things or make stuff when it is relevant in the stream.", "Ina's minecraft streams are super chill and relaxed, and then Ame's chat is like \"Do this!\" and \"Do that!\"", "@Brook Davis Meh they were backseating in the last stream her first minecraft stream.\nThats what convinced me that this game transform the chat into backseater for some reason because Ina chat is not like this normaly", "@Kangamanga 25 I never really look at the chat, I prefer letting the person figure it out for themselves and only give tips if they ask for it. So you're probably right there!", "2:00:16\nAme: \"its cool  to be efficient!\"\n\nAme two streams later: makes with Ina the most innefficient and expensive railtracks in the nether ever XD", "Hey I'm a builder on mine in abyss, though I haven't been on in a while, and to clear up some confusion you dont need to mod the game to play on the server as it uses plugins", "\"i'm not addicted to minecraft i swear, i can stop anytime\" - ame probably.", "Damn two Minecraft streams in one day. She really got addicted to Minecraft haha", "What did the miner say when he struck gold? Au, yeah!", "I once got a gold bar dropped on me,and I shouted Au as I was in pain", "@- Kyrel - =)", "If your next pun is gonna be about iron then I'll just kindly ask you to Fe-ck off :))", "This guy was first Comment :O", "@Cye_Rye  Hey that´s Ru-de. Take a look at my Platinwatch it isn´t time for me to go yet =)", "@- Kyrel - Seems like you were the victim of bullion.", "Not a joke to the uninitiated.\n\n\nIt would take some heavy slurring for it to sound like \"bullying\".", "I don't know why... This guy is always in top comments in hololive en stream", "@Adhio Novice Anantayeah... should we rough him up to get the answer out of him?", "you nerds\n\n\ni love you guys", "@Casual Filth yes nani?", "@Adhio Novice Ananta I flank him from the left you go from the right", "\"I wish I could look up recipes by the ingredients\" There is a mod for that.", "2:50:11 I asked about dead by daylight here is the response. We might get a dbd stream", "\"Mushroom's a mushroom\" Ame that's how you either die or get so high you end up in space", "41:29 literally a sound from paranormal video activity. Ame spooky", "I don't understand English, but I do know that your voice is very pretty.\n\n\n(I'm studying English.", "For someone who is never played Minecraft, Ame is pretty good.", "She seems like a fast learner with logic skills, def the most advanced in their MC thinking of the bunch...", "24:48 thanks Amelia, my eyes are blue as the sky.", "50:55 :weebs when we someone doesn't give the sauce", "47:36 invisible zombie\n31:19 Cave noises 1\n41:29 Cave noises 2", "One of the most best streams i ever watch, so many gold moments", "Default 3d is the best texture pack with shaders. it keeps the game's aesthetics", "Hate back seating, but maybe turning up the game brightness instead of gamma would really help in general", "Man I always enjoy watching her play this <3 \n\nAs a side note, I like the idea some people said in the chat, they really should build a TTT  to gather resources, and if Watson industries is a full thing, maybe an iron generator would be useful too. All in its due time tho, I love the pacing of how holoEN server is going.", "The Enderman chasing her through the tunnel was suspenseful", "thank you for the chill Sunday viewing material, Ame!", "Damn, the people in chat seriously need to calibrate their monitors; the settings looked absolutely fine just the way they were.", "Nah that's horribly dark. People like seeing what happens on screen.", "@Zanpa No, it was fine. It's other people's screens that are horribly dark.", "@Lunar Delta yes lemme just up my gamma levels on my phone oh wait ... -_- Youtube + low brightness/gamma in games = shitty dark mess for anyone, especially on non-monitors.\n\nRemember what the person streaming sees is not the same as what the stream feed gets because it isn't seeing any monitor enhancements... From experience: it's ALWAYS darker on stream than what the player sees.", "YouTube makes videos darker because of the way video streaming compression works especially on YouTube, waaaatson \n\nAlso smartphones display darks much darker than monitors, waaaaaatson", "Yeah shaders are almost always awful for streaming/videos.", "but why?", "@Misheru Video is just a stack of images. Compressing a video works by taking the image (frame) and  not including the difference between them. If image 1 is all black and image 2 is a gradiant of white to black, image 2 can compress or save space by remembering to just reuse the black space from image 1. Additionally, image 2 with Youtube Compression is more lenient in saying dark gray is  close enough to black and just cutting out that detail. Suddenly, a dark image with gray outlines you see while playing just appears as black to save space on YouTube.", "Which one should i do?\n\n1. Watch amelia streaming\n2. Do my homework", "Doing your homework and abandoning it at the same time :o", "Put the stream on as background while you do homework?", "we all know is 1", "Do your homework", "I do it while watching the streams lol", "I'd kill to see Ame play New Vegas ;-;", "If you decide to get a Resource Pack to change the textures I'd recommend checking out Chroma Hills, as it's very vanilla-style just with better detail.", "That Enderman chase in the tunnel was so epic!\nBtw, damn you, Calli! I can't unsee the tennis racket now! Hahaha", "17:25 I hear that Re:Zero sound effect everytime she looks back at it.\n\nEdit: This one https://youtu.be/r43-iirtQoc", "When you forget you are streaming and are just having fun it is more fun for us too.  This is not a bad thing.", "00:06:40 petition to brightness 100%", "I like when Ame reads super chat at the end of her streams. If only Gura did the same UwU", "12:06 feeyancy enchaaancey ryoom", "ty for the stream, Ame!  I got kinda nervous when she read my comment about brightness when chat was moving so fast omg... ahhh I should've been more specific\n\nLooking at it on desktop/mobile, the unlit areas in Amelia's streams are.. noticeably darker?? especially when compared to the dark areas in the other holoEN girls' streams. It almost feels like a gameboy color with no backlight hahah", "Yep, unless she adjusted it her in game brightness is only 20% which makes the lighting vanish super fast and makes it more stark.", "Honestly, seeing her kept procrastinating from reading superchat felt like a personal experience", "And the enemy will never know what hit them when Watson is on the case", "Jesus, I nearly choked when she looked back and the endermam was chasing her on the rails.", "When i play minecraft i always end up liberating and transforming a village into a single walled structure and then get lost in a massive cave for 3 weeks surviving off of rotten flesh and muttering about my 'precious'", "Seeing her being a newbie really nostalgic", "17:28 when you play cs and your crosshair is always head level for every game", "oh man\n\nnow I wanna build a massive serpentine railway system with labyrinthine strip mining tunnels", "This was such a relaxing video to watch.  Thank you!!!\n\nWanted to watch it Live, but I passed out as I held my phone.  Ughh.", "Ame: oh we should do this\n1 min later...\nAme: wait what am I doing?", "15:36 Amelia “Pow pow” sounds", "This stream had so many wonderful moments xD", "Neighbors making noise*\n\nWatson: shut up!", "Did Amelia ever get her Background Music back? Its my favorite BGM of all the Hololive girls.", "Despite being a detective, Ame really seems to forget what she was doing often.", "Thank you for making my day Watson!", "Sadly i missed most of the stream, but it was great!!!\n17:25 i think with this escape, \"The Watson Railway\" was worth it ", "17:20 if you are here for the enderman chase part", "17:47 WTF was that damage my guy? moment", "A wise shark once said \"So long as I don't get backed into a corner we should be fine\"", "2:12:42 for Amelias parseltongue speaking", "Strip mining: Main shaft 2x2 so you can properly count the distance between branches. Branches are 1x5~ (tall) spaced 3 blocks by 3. You can then later repeat a floor below so you cover most of the diamond spawn range.\nThere are many other ways of doing it, but this is simple and good enough. I might have gotten some heights wrong though.", "Thank you,Ame mama,Let EN team can enjoy any journey with full resource.", "Building transports in Hell? Making a road/railway near cliffs and near-death paths? Dangerous roads and noisy environment? A very toxic but sweet corporate officers?\n\nsounds like The UK alright", "17:27 jesus christ that is mortifying", "Minecraft: NO\nRoller Coaster Tycoon : YES", "Oh Dr. Zeus, a childhood favorite", "Nice!!🔥🔥", "The watson railway back at it again.", "Amelia thinks too hard when it comes to figuring out game mechanics. It's kind of cute.", "I really wanna see them play that mine in abyss modded world, or any modded Minecraft, specially since I haven't seen any vtuber in Hololive play any modded Minecraft.", "Wasting no time on a nether rail, good, good", "AMEEE, Next time try make some holes in the waterfall wall and put some light inside, to see if it get nice, or you can make one cave on the waterfall, it might be awesome!", "JUST A SUGGESTION... you could label your chest and organize off stream while ur just chilling so you can find stuff easier", "watson and other holoEN should play in JP server IMO, its should be more fun for everyone when there is other player instead of playing alone", "2:03:20 Extreme ninja moves", "Elementary, My Dear Watson", "word for the stream (day)\namelia: but why??\nso kawaii", "sometimes things are put in just to be cool, like naming", "I need to know how she got that notch", "Can you imagine Amelia playing ark she probably one rage quit r two be the first one to unlock tek and become a ark god lol", "Mine in abyss ia actually a pretty good server", "Wait im askin where can you download a minecraft though? i have on tlauncher but the version still has no shaders ... i kinda want one... too....", "47:37 Invisible Zombie\n2:37:32 Light Jumpscare", "I thought I was suppose to be a short stream a to 1am.... Oh well", "I dunno, but watching Ame olay Minecraft feels soooo relaxing", "this girl already addict with mc.. ahahahhaa", "going for the realism mode i see", "Press 3 to be blessed.", "17:28 A Movie worthy plot", "Hey Ame, try audiobooks, so you can play and read at the same time", "Would highly recommend BSL shaders!", "Now I wait...for her collab with moona, haato or coco", "Imagine a 2nd generation of hololiveEN... that would be so much fun.", "What's next? Space exploration?", "Oh it will come", "I'm new round here", "Love you Ame. Thnx for another fun stream ♥️", "You could build an iron farm in one or two streams for all hololiveEN's iron needs.", "If the game (or pc while playing) goes laggy, you should get a bit down the render distance (i recommend 8 chunks). The render distance is how far you can see. Or you can change the shader to a version less ¿shiny?... to another shader that consumes less resources.", "I want to Watch Made in Abyss but I can't find the Dub and I refuse to watch anime in anything but dubbed. \n\nI read too damn slow to keep up with subtitles. Only way I can watch Sub is if I pause every 2 seconds, to allow myself enough time to read what is being said... Which I have done before with watching the Battle Royale movie but it's not something I really enjoy doing at all.", "Amelia! You should try using blocks and your terrain to your advantage when out numbered.\nFind a tunnel or a tight corridor then place blocks at head level so they cant pass. Then you're free to hit their legs! :3", "Amelias character definitly not running smoothly\nChat: You are fine...\n\nLike what? Either help out or don't say anything, it's not that hard.", "pretty sure they were just saying that to not stress her out and continue the stream", "@King Mufasa i hope so", "Not sure if ame reads the comment section but optifine is really good to use especially with shaders. Really helps the game run smoother", "HoloEN's railway baron further expands her control.", "I've been watching every single minecraft stream so far, but this week will be tricky, after this a Gura stream, then another Ame stream, then Ame and Ina collab, then Calli and Gura collab then another collab later in the week! Wow, I just hope I can keep up!", "Good luck I have just been jumping from stream to stream without watching the whole thing", "@Just your typical Emo boy I'm a completionist, I can't watch the next stream without watching the previous ones fully. I even watch at 1.75 speed sometimes!", "24:48 is this gap moe?!", "what makes her hiccup so much haha", "Never stop being bossy, Ame.", "I realized I’m using the exact same shader", "52:25 Emperor Hachama", "I recognized that Nvidia Geforce GTX 1060, see you soon", "i recommend bsl shaders", "Amelia is so good at Minecraft, and so cool and collected. The game keeps throwing things in her way, and she just sails through it all. I am in awe.", "Wow Enderman can move on the rails?  First time see that.", "sleepy ame is a good stream. HIC.", "Don't feel bad Ame, I'm also not very good with the dark, kinda funny that work over nights then.", "Should maybe try kiaras shader pack, worked fine for her iirc", "Watson Industries is a cool name for a company", "Her hiccups are cute af lol", "Not to sound like a creep or anything, but I think Amelia's hiccups sound. sooo. cuuuuuuuuuutee!!!", "I think Ame is coming down with dragon sickness.", "Her callous disregard for the importance of bones is infuriating.", "Minecraft content is so wholesome", "She felt in the minecraft addiction", "Funny, I could never really get into Minecraft myself either (I'm not generally a fan of sandbox-y games), but if I had a server like you have with the other Holos then I could see myself getting more into it too. Funny to see the change though, I mean I hope you are having fun with it :p It's pretty chill either way.", "but why?", "ok are we just gonna ignore the fact the hiccup timstamps are dissapiring every stream", "Minecraft legit scary sometimes", "Cute, Ame worried about getting new shoes dirty, even though she never goes outside ", "I feel like Amelia might enjoy playing this game just a bit...", "Better with bgm😉", "Ame being chased by the enderman in the tunnel was too funny.", "2:48:35 \nNigerundayo", "These shaders be like \"Hey hope you like orange.\"", "If you want to see a cute part \n27:10", "Welcome Hachama Amellia :V we like your 30000", "I LOVE YOU AME", "but why", "with that long af rail tunnel.. i wonder if she mapped it", "Cutey Ame❤️", "3:19:22", "Anyone know why they aren't using BGM's?", "damn ame, get some sleep", "2:14", "1:55:20 Rail go BRRRRRR!", "2:02:11", "You can look at enderman eyes to stop them in their tracks.", "Herobrine @2:20:45", "Damn hiw much time you playing this games u got so many times 😲", "Hololive en will overtake Hololive", "Hello", "24:49-25:08💓", "The only thing the Hololive EN railway system needs now is a redstone mechanism to collect and re-place minecarts at the ends of each railway, like a small subway station. Then it'd be perfect.... well, maybe not PERFECT but closer to perfect than ever.", "I wonder why Amelia has those hiccups? Isn't it dangerous to have a hiccup like that?", "She explained it a few times, but it's basically burps because she breathes in a lot of air in her stomach. She doesn't know if it's a symptom of anything", "@Zanpa ah, ok, thank you", "Anyone notice how whiny she has become the last week or so? Since she started with Minecraft. Even if you ignore chat she just complains and moans and refuses to do the right things then complains more when it goes wrong. Also shaders = no watch.", "Ame PLEASE dont play with shaders. I absolutely hate the way they looks and it's super off putting especially seeing realistic water next to perfect square blocks. I understand why some like it but i and others cant stand it.", "I genuinely cant even watch this because the shaders make it look really strange.", "Same... Well, water is nice here, though... but lighting is extremely off.", "Ah, my superchat wasn't read, though  I sent it before she said she would stop reading :(", "Maybe because of lag. Idk...", "Man. Your fans are all Ms", "Nice Minecraft shader. The only thing I don't like about that is looks a bit brownish for the torch lightning. Best of luck for the Nether Minecart she going to make.", "10Q Amelia", "Amezing and comfy stream! Thanks for gave us a compliment(?) lol (Hopefully Ame won't lose trust to chat, it will be terrible if that happen...)", "Have a good rest ame please look after yourself more better", "HIC", "Comfy", "I think Watson has an addiction prblem. XD\nI love it!!", "I'm not sure how to feel about a v-tuber who originally said she didn't like minecraft and knowing little of it to in a  couple weeks handling redstone and technical building better then I have in over 8 years playing the game lol I mean I can build ridiculous thing but i've always been redstone dumb, the only thing that triggers me a bit is the grass inside and dirt walls but I've overlook that I guess.", "@28:05 \"Put more torches? Why? I only have so many\" \nPLANT TREES. Log -> charcoal + sticks = torch. Tree = torch. Plant MORE trees. Way more trees, never have too many trees.", "Playing Minecraft Indiana Jones style.", "Bubba sounds like he wants a friend to play with during Watson's streams.", "Bubba has a sister", "Since it continues to be a topic, here are my thoughts on “backseating” and Minecraft.\n\nI feel that Minecraft, unlike most other games, largely benefits from sources outside the game to understand and learn.", "Bro......im all for expressing our opinions and what not, but people don't come to comment sections to read essays damn shorten it up  lmao", "@Danny lol yeah.\n\nCan easily be cut down to \"Minecraft is a game where people like to explain how cool stuff works so I get backseat gaming with it, but guys, you gotta just suggest WHY Ame should maybe do something, not just give her direct orders\"", "Sir, ever wonder to make youtube vids?", "You're right. Nobody should ever try something for themselves. They should just be guided by everyone else. No need to pay attention to the game. No reason to enjoy the game. Just do what you are told.\n\nOr instead of backseating, you could just play the game instead of Amelia.", "I would like something similar to pewdiepie minecraft series where people gave pewds actual helpful tips in his reddit its way less chaotic than a thousand people giving vague tips and hints in the chat", "You are just encouraging people to backseat btw lmao.", "@IDKmyBFFJill Are you illiterate or just trolling, there is no way that's what you got from that.", "TL;DR, don’t give Ame orders, you are limiting the amount of things she can do on her own. Instead, explain to her why you want her to do your request. \n\nHonestly, it gets really annoying when chat backseats her, or any of the girls for that matter. How are they supposed to learn to do things on their own? Chat is just basically playing the game for them. Let them figure it out on their own, so that they can maybe find out other game mechanics that they would possibly be stuck on later.", "Yeah, but what about those people who literally backseat at every little things like eating and stuffs? Like seriously, if she needs help, she just can ask, but it’s a different matter if chat decided to backseat at every single little things which will be so annoying to those who just want to watch and even to ame herself, and y’all wondering as to why ame is being toxic or roasting chat sometimes now.", "Yup, i know you said that Ame needs some guide. BUT, she will ASK if she needs to, i still can't believe some chat still said 'Eat', 'Alt+F4', and something similar like, dude, Ame knows it, you don't need to tell her or troll her. Besides, trolling and backseatting is really bad that she can lost her trust to us, chat.\nEdit: Make some edit, yeah.", "@lawrencein he probably just wants attention so he can feel noticed", "I disagree. You're defending people who says things like\n>AME. DO THIS FFS!!!\n>AME. NO YOU CANT DO THAT SMH!!!\n>AME. SLEEP IN THE NETHER!!!", "@SBB Head You're completely right and I agree with you that this could've been shortened. I would like to point out though that the main message I was trying to get across is not what you've stated. \n\nYes, it's important to include the WHY when helping someone out. And Minecraft is a game where people like to explain how things work. But I was trying to get across that Minecraft is a game that thrives when players are the ones actively in charge of their own exploration and problem solving, yet almost paradoxically requires outside intervention to fully explore.  ", "@Nick Name Technically it is shorter than your initial comment, but its that other guy's fault that he didnt specify how short he wanted it to be, lmao.", "@Kai I'm sorry that this primarily reads as a defense of backseating.  \n\nI wanted to include an explanation for why Minecraft in particular seems to be plagued with this problem. I've since written a reply of my point without the proof or explanation. I hope that helps.", "", "I think her mic might be breaking.", "", "I think this marks the 7th or 8th time we’ve seen Amelia play minecraft in a week or so. Yep she’s addicted.", "At the end she was changing her monitor settings. Soneone tell her to reduce the shadows!", "i hope she watch dream too and act like a pro", "How much time passed since collab? totally not addicted", "the light was completley fine i dont know why so many people in chat complained. maybe the should get a better monitor", "Chat must be blind as Hell. Lol. I watch these girls [and a whole bunch of other folks on Twitch] with literally zero problems on my phone, or even my old ass iPad Mini3.", "@Halim Colson yeah i have 2 different monitors with different settings an no problem at all. dosent matter if youtube or twitch. even on my phone. half of these people probably still use a CRT Monitor or something lmao", "@ChaosSpaceMarineX LMFAO I'd bet money I don't have on that, actually.", "Ame you might have a problem\nAren't you playing too much minecraft?", "People who try to give hints/tips via super chats make me facepalm everytime lol", "imo that's still way better than constant demanding spamming with caps over the unimportant thing, like EAT EAT EAT", "Don't spam click when attacking enemies. Wait for the weapon to 'cooldown' or you will just waste durability.", "I wish i could hack in their server just to make a hundred stacks of torches and spread all over their chests so they stop being so stingy with lighting the place up", "look at the bright side, at least when mobs spawn we'll be in for a treat", "It's fine guys, she's not addicted", "Shaders are looking good. I'm personally a big fan of the Sildur shaders that Kiara is also using. I found they are less resource hungry but that might be different for each machine. Kiara is running the \"Lite\" version and it's running on her 1050 Card surprisingly well. There's also some more beefy versions of it. Maybe experiment with it a little bit to find a mixture that works well on stream?", "Minecraft is not a horror game\nMinecraft is not a horror game\nMinecraft is not a horror game\nMinecraft IS a horror game ", "IN THE next group stream people should tell them that they should burn wood blocks with wood blocks, to make charcoal, instead of making torches from coal. Coal is very useful for emerald trade.", "getting real sick and tired of her asking \"but why\" and \"whats the point\" 😂😑", "well people need to explain things the first time.", "@Darkvoltinx yeah sometimes though, but for like the netherite stuff chat did say its better than diamond and she still said but why? So its less likely you die! I feel like she was doing it on purpose to annoy us too", "I would like something else besides Minecraft. YouTube already has tens of thousands of these kinds of videos. I think you are addicted.", "There's From The Depths, a building game wherein one can make working vehicles from blocks.e", "there is gameplay videos on every game to date, where do you draw the line in what games hololive can play? 100 hours of gameplay across youtube? 1000 hours?"]