["Amelia with the beautiful voice set up. Whenever someone speaks, their avatar lighting up was so helpful. Thanks for that Ame, as expected of our #1 detective.", "Yeah, Botan had something similar which was nice.", "It’s actually quite relaxing as well like... you feel like they’re all together", "Does anyone knows how this setup works?", "That was brilliant to be honest! Respect to you for getting a heart from our #1 detective.", "I'm so jealous\nYour comment got a heart", "@Aisha nah no need to be jealous of them instead let’s congratulate them and wish them a great day!", "They should all do it in the future, makes it easier to see who is talking and also looks nice.", "This boi got a heart from amelia. Mad respect.", "Remember not to edit your comment after it's hearted. Lol", "@boodesultan12 I'm guessing she has software hooked up to their discord call to recognize when each of them are speaking, software that does something similar to what the site does to show that someone is speaking", "Yeah Ina had the same setup.", "Very helpful, thanks Ame!", "@Aisha We can share! More than enough love to go around <3", "No one mentioning that when they light up they jump up a little bit which that part I don't think I saw in anyone elses setup", "I think botan and ina had something similar", "@Necromancy For Kids Thanks for the heads up <3 sharing the heart with all of us", "@Dat Lam 😊", "Cute", "I thought it looked like Amelia's with her harem. lol\nLook how happy she is from the start.", "@Kleimeen A Yeahhh, is too much easy to me (for exemple) to know who's talking", "Ina as well", "Ame and Polka as the imposter is the equivalent of Batman and Joker teaming up.", "I would say this should be top comment, but this is already top comment", "Batman: The Brave and the Bold", "Gura makes a great imposter even when she’s a crewmate!", "now this is a top tier comment", "LMAOOOO", "POLMAO.", "Too bad the Apex Dream Team was too strong for them to handle. RIP Botan getting RNG'd at the last seconds though", "Spoilers for the Arkham series, but Polka encouraging Amelia to kill from beyond the grave reminded me of when Batman was hallucinating Joker who keeps pestering him for quite some time.", "Ame didn’t do much other than get lucky though. Polka did all the work", "Yes its accurate & reasonable.", "You mean Celes and Kefka.", "Hi", "imagine nene and ame 🙇‍♀️", "Is this today or the last  one?", "She lied. Amelia Watson lied as naturally as she breathed.", "Why did she lied about,??", "Ame showing off her detective skill right here, got almost all the impostors right and that solo oxygen was epic. If not for language barrier and game experience she might keep winning the game", "I was feeling bad for Ame at first because of the language barrier since Ive thought about it before and she was a bit quiet. In the end, its great to see that she could still get her message across and had a great time.", "As a beginner she is pretty good ngl (not as crazy as Okayu or Botan). But yea, she really got potential right here. Just need to play more.", "If she keep playing, her detective skills are equivalent as toast.", "The language barrier honestly made everything so interesting. Everyone from Gen 5 really had to try and get to her and Gura lmao.", "Summary:\n- Ame called out an importer correctly 5/6 times when she was a crewmate.\n- She won her 1st imposter game even though she is a newbie.", "inporter polmao", "does anyone know what minutes ame became an impostor?", "The in pasta", "@Justme K' 47:14 dozo", "She trusted Gura too much at that round + not knowing how to tell if a task is being faked. Still her intuition is crazy.", "@Justme K' 1:02:59 koko mo mata", "Pls No spoliers guys 😂😂", "@Jeffrey Pollisco she's watson afterall", "@ٰ Now, do you know, several scenes where ame dismantled the impostor, hehe sorry I was a clip viewer", "Her maxed out luck is real", "She wasn’t actually all that good at imposter though, Polka got most of the kills and she was just lucky that no one else checked reactor when she killed there. She spent like two seconds at each task and sabotaged at really odd times. Not blaming her or anything, I mean she’s brand new to the game, but if it weren’t for Polka killing so many people she probably wouldn’t have won the game.", "@Spaceman Alph You’re missing the point. I doubt a lot of people that played Among Us won the game as 1st time imposter as this is stressful for a lot of people.", "@Radzimir Potapovich I did win the game as my first time playing, but that’s not to say there was any skill involved in my win. My other imposter carried me for the entirety of the game and I just happened to get the victory. Amelia acted as suspicious as possible (wandering around aimlessly, quickly faking tasks, not fixing emergencies, not talking much during discussion time) and still won because most of the other people playing were relatively new as well and because her other imposter killed most of the people and did most of the sabotaging, including the one that won them the game.", "@Radzimir Potapovich It's really stressful. It takes experience to be good as an imp, unless you watched imp gameplays firsthand.", "@Spaceman Alph Again, that’s not the point.", "@Radzimir Potapovich But it is? You’re trying to say it’s impressive that she won her first imposter game despite the stress, but I’m saying she clearly let the stress get to her and only won because of her teammate and everyone else being new.", "@Spaceman Alph The only thing that I said is: “She won a game as 1st time imposter” which is a fact. Whatever the reasons may be, they are irrelevant as the original comment refers to objective facts without any specific information. If you still don’t understand then I’m sorry I cannot really advise you other than reading the original comment again until you get the point.  I would say that concludes this conversation.", "@Radzimir Potapovich We all watched the video, if you’re really trying to imply that you only left your comment to point out something that was blatantly obvious then all I can say is that’s a dumb reason to leave a comment. It’s obvious you were trying to imply that her winning as imposter was impressive, you even replied to me initially saying “it’s very stressful playing imposter when you’re new.” Why would you say that if you weren’t trying to argue that her winning was impressive? You’re moving the goalpost here.", "@Spaceman Alph “Missing the point” = Talking about something completely different that is unrelated with original comment. The first reply is when I elaborated on the point to solve the misunderstanding and explained “Why people don’t usually win their games as 1st time imposter”. I didn’t imply anything as that idea was born in your head. If you’re saying that you know meaning behind the comment better than the author himself, then fun fact: No, you don’t. Thus this ends conversation here.", "@Radzimir Potapovich I already established that if your point was to point out the blatantly obvious, then that’s ridiculous. You can say the point was whatever you want it to be, but your comment clearly implied that Ame’s play was impressive. Why else would you point out that she called out the imposter correctly 5/6 times and then follow it up with her winning her first imposter game? It’s obvious to everyone else in this replies that you were suggesting she has some skill at the game. If not, and what you just said is true, then your comment literally has no purpose and adds nothing to the video, neither comedy nor information nor an interesting talking point. You just pointed out what happens, a feat anyone with eyes (or ears) can do. Your elaboration only furthered the idea that you thought what she did was impressive. You weren’t clearing anything up, you’re just back peddling and trying to make it out like the point that you were obviously trying to make wasn’t actually your point and using the “well I wrote the comment so I’m the only one who can know what I was talking about.” No, dude, anyone can glean the meaning behind what you’re saying, someone doesn’t need to outright say something for the meaning behind their words to be obvious. You’re either backtracking on a point that I simply said wasn’t entirely true, that being that Ame played impressively as imposter, or you actually believed that it was worth pointing out what happened in a video and adding nothing to it. Either way you’re just making an ass out of yourself by attempting to be condescending. I didn’t mean to insult you personally by saying Ame wasn’t that good at imposter, believe it or not, I was literally just saying that she wasn’t very good at imposter.", "@Spaceman Alph you mans really out here writing essays for a 5 dollar party game lol,  it ain't dat deep", "@R.J Ramales It isn’t, you’re right. I just don’t like how he’s clearly trying to change the point of his original comment from what it was just so he wouldn’t have to admit that my original comment was valid.", "I was laughing my ass off at 30:25. Two blondes fight for a blue eyed detective’s attention. Sus transcends all language barriers. Near the end Polka sounds like she was genuinely getting thrown off the ship.", "i'd repeat this clip all day", "The three blonde stand off", "Both trying to win Ame over with their English. Amazing stuff.", "I love Polka's voice fading out as she flies away lmao", "My favorite part is how right at the end, Polka tries saying \"Trust me, we're both blondes\" but realizes halfway that Nene is blonde too.", "Polka always sells the performance.", "This was my absolute favorite part, too xD", "Amelia may not be good as imposter but she really good as a crewmate", "She basically carried that round with Polka. A little quiet but not terrible", "She correctly identified voted off at least one imposter in her crewmate games", "@Poly Rolf Yeah, really Amelia just need to learn the sabotage stuff", "Indeed", "Amelia never did the oxygen or anything. She just watched other people do it which is mad sus", "She's a detective, they're supposed to solve murders not commit them", "Makes me think she had plenty of experience playing detective in TTT back in her Gmod days", "@Phosgene Meme that game is nostalgic especially all the collabs it bring", "If the update comes i wonder how she would be as detective", "As a Teamate", "@Poly Rolf I’d say it’s the other way around. Polka got so many kills and she actually knew that you have to stand there for a little while when you’re faking a task. Amelia would never attempt to fix any of the sabotaged tech and would stand at a task for two seconds and then run away when faking them. She only got a single kill and it was purely luck that she didn’t get voted off. If Polka didn’t sabotage O2 immediately then she might have still lost. It’s not her fault cause she’s never played before, but she didn’t carry at all. Polka got almost every single kill.", "@Spaceman Alph But if she plays longer I'm sure she'll be a good detective to this game just like disguised toast.", "Mori's Japanese voice sounds like an angry old man.", "The Big Onee-san of the group XD", "It's like she's yelling but rapping at the same time. It's aggresive but not offensive wtf is this?", "Wait whos mori sorry i am new here lol", "@Twinshely 789 search up Calliope Mori", "Ame as crewmate: Genius detective and clutch teammate. \n\nAme as Imposter: MORIARTY", "This is why detective is scary when being the imposter", "27:48 \"Huh\" gura ghost\n41:08 Gura is safe.....gura Not safe\n1:11:40 \"do your task\" by ghost gura🤣🤣", "The second one reminds me of the star wars moment. Sector is clear, not clear not clear.", "@Sigmund Freud - KFP Psychologist we’ve captured a command post.", "The gura safe thing is  like Korone saying have confidence.... No confidence", "gura ghost also said do the task around 30minute mark 😀", "@Aly Rafsanjani 30:20", "Ame \"i don't know what i'm doing\" Watson", "Ame \"pretend to task when nobody is around and get carried by Polka\" Watson", "Ame “win using lots of luck” Watson", "i mean she did say she put all her points in luck so that checks out", "Ah, the irony, Death itself being killed first in the first two games. But if you think about it, if there’s no death, then no one can die, thus impostor can’t kill and crew mates will win. Big Brain Move", "Oh yeah, big brain time", "@Manuel Lopez Ramos true but she’s just the intern", "I'm laughing so much on that fact", "She's the apprentice, nothing major happens when she die", "Nah see if she dies first she'll be able to get ready to reap their souls and not worry about tasks getting in the way of her job", "41:05\n\n\"ᴳᵘʳᵃ, ᴳᵘʳᵃ'ˢ ˢᵃᶠᵉ\"\n* gets killed by Gura *", "Ame Timestamps:\n\n10:38 First round (Gura and Lamy)\n11:54 Discussion (skip)", "What a legend", "you.. you are true hero!", "30:25 Lol I was sort of hoping this would happen where Ame would be left with two JP members she can't understand. Nice to see she chose the right one.", "it was best moment for me,blondies madness", "Amelia: As a detective, my biggest enemy is me. Hic.", "Haha when Ame is with Polka and Nene and don't understand both of them are trying to win her over, GOLD !", "3 blondes, gold indeed", "idk why but my dumbass (who didn't understand a word they said)  thought that it was nene and polka fighting over Amelia about who gets to be a part of her harem lmao", "@Amara Zelise timestamp? What are you talking about", "@biribiri around the 40:00 mark end of the the round", "The text chat was the funniest\n\nNene: Nene trust!", "Alternative Title:\nGremlin has dual personality", "Amelia prove to be not only a ace detective but also the perfect murderer.", "In order to catch thy enemy you must know thy enemy and think like them.", "Lmao anyone couldve done what she did, to me she looked clueless as impostor, Polka carried her hard via sabotaging.", "She looks hella sus, if you play randomly like that, you will get voted in the next meeting with no question asked lol", "do you guys know how to overlay your discord voice chat like this?  when your friends talking, their character just move and glow like that.", "@Viloid DDF yeah but they are playing amongst each other and none of them are better than decent at the game, they're all fairly new", "@Cristian Gómez Calfumil But Polka has been playing alot of Among Us recently, compared to Ame, who was playing for the first time.", "@iBacka yeah thats not up to debate, Im replying to OP here, who said Ame is the perfect murderer. That said, i do look forward to see Ame improve his Imp game, she looks promising.", "@Cristian Gómez Calfumil She only needed one kill to win but instead walked around until O2 did it for her", "What I expected : Amelia Watson the detective\nWhat I got : Amelia Moriarty the patriot", "Amelia as imposter: \"oh good they fixed the reactor, nice!\"", "She knew it would be less entertaining because it already happened two times before, Ame puts entertainment above wanting to win!", "Ame actually stream MVP. Won on both sides. Had girls fight over her. Proof she's a real detective.", "\"For a detective to catch a killer, the detective must experience being the killer.\"\n-Sun Tzu, probably", "I would love to see a collab between just Watson and Polka.\nTheir energy is fun and chaotic.", "Sadly, that's not possible for now cos both of them do not know each other's language.", "@NоiR I mean coco did a collab with polka once, it was an english only stream and it turned out gold if you ask me", "@Someone with no life well, Coco is kind of a special case, cos she has a lot more experience with collabing and knows JP in case something happens, it might be a bit too hard on Amelia to hold a conversation with a JP member one on one tho.", "'I don't want to be imposter'\n*Immediate gremlin laugh", "Will the detective find the body? Remains to be seen.", "Of course she will. She murdered the body herself", "@Rahadian Arkananta Hmmm. I don´t know better skip this one", "@Rahadian Arkananta This sounds like it needs further investigation 🔎", "23:48🐧", "Ame actually did decently. She won R2 as crewmate because of her luc- I mean detective skills at the last voting round. And for R1 and R3, despite losing, she correctly suspected and voted off at least one impostor in those rounds.\nLuck striked her hard in R4 because of bottom left Kiara. Her only bad game was the last one, and it's because she's too afraid to kill anybody, and because Ina is too seiso to defend herself.", "I like how Kiara and Gura voted together but Kiara is somehow the only mentioned haha", "Basically \n-GURA lives up to her title as Apex predator\n-Amelia shows some detective instincts as crewmate\n-Amelia runs around cluelessly as imposter but gets a win due to Polka & bottom left", "Calli basically got Fubuki'ed... Crewmates curse.", "Seems like only Gura knew that sabotaging lights is really strong for picking up kills. The rest of Hololive EN needs more practice! The shark is too OP right now! (Play Among us with us Ame!)", "She not apex predator for nothing lmao. But yea cant wait for mext among us collab now that they have more exp with game.", "Sometimes its better to not do lights though", "@ShadowViper7Z *Shadvi7Z* true, but in cases like the last game where ame was in a 1v6 situation, I think sabotaging lights would be the easiest way to pick up some kills", "Sabotaging lights its kinda cheap, plus its not the strongest cause when you get used to light kills everyone knows its you when a one happens.\nThe strongest is reactor/o2 at late game, forcing the crew members to spread or lose inmediatly as the time runs out, giving you a good opportunity to kill specially if its less than five players left.", "@Blue Wolf ? how are they gonna know its you? magically?", "@Jake Long I already explained, if you keep repeateadly doing light kills in many games, when a light kill happens its gonna be assumed its you.\nWhen playing among us with friends its all about learning how each one plays as an impostor, doing the same kind of kill through sabotage its incredibly obvious.", "@Blue Wolf Yeah buts its not like you're the only one whos gonna use that strat. Humans can think the same thing if you didn't know.", "@Jake Long dude you really never played among us with friends and it shows.\nThink whatever you want, not like its gonna change much.", "@Blue Wolf Well actually yes I have. Its a pretty common strat. Also don't like your own comment its pathetic . Humans can have the same thought so I don't know what rock you've been living under, but you're wrong about this one.", "@Blue Wolf See when lights are off. You actually have a chance of killing someone, but when reactor is off everybody most of the time goes together.  Lets just say when you and someone are alone. You can kill them and run away without being caught. While reactor over here you can see anything broad as daylight. Sure you can say somebody is going to camp fix lights, but you can just kill them and vent and all you gotta do is make sure nobody saw you go in, but since the lights are off they can't really see you.", "@Jake Long you have never played among us with friends and it shows. Tell me, if there was a body and there were 2 suspects, one who is well known for self reporting and one who is brand new, which do you think did it? I would go for the self reporting guy bc if they constantly self report, what's stopping them now? Picking up on the imposters habits is a part of the game and if you constantly do the same thing, people with pick up on it and call you out until either you stop, or more people pick up the same habit.", "@Steaki Did you know that friends could play with each other for a long time in a game and just use the same strats? Its not like I play with new friends everyday. Your whole essay is just assuming I play with no friends. Literally the only time I ever play Among Us is if they want to. You play the same map and everything, everybody is going to use the same strat because there's nothing else you can do. I don't think you understand the human brain.", "This has to be one of my favourite streams so far, despite the language barrier they still managed to somewhat understand each other with the help of Kiara of course, the true MVP of the game.. hope this could be a weekly thing!\n\n30:23 Ame's best detective work", "I couldn’t finish it. I’d hope if they do this more they find a way/take  time to sub more stuff in English. It isn’t as enjoyable for me when I can’t understand most of what the JP girls are saying", "@Iso blue There are some channels subbing segments from it now.  It takes a little bit of time.", "The solo oxygen at 29:26 into a 50/50 with JP at 30:27. Nice job, detective. I doubt anyone would envy her position.", "Ame looks hella sus when she was an impostor", "Well, she looks sus even when she's not an impostor, so it's not out of her character.", "Cover the code with Mr been: no\nCover the code with black screen: no\nCover the code with waifus: yes", "Let us all remember that there are actually 10 people present there", "That's so cool how she was able to get every member's portrait highlight when they speak in real time like that", "Ame your setting with the pictures is impressive.", "Can we all just take a moment to appreciate the effort that Ame puts into every stream? Like she always upbeat and happy and on top of that, she had the avatars glow up whenever they spoke! like damn good work watson 😉", "Sadly I woke up a couple minutes after the stream finished, good thing the VOD is here so we can see the detective at work.\n\nEdit: I’ve watched the majority of the stream and F for Calli. She just can’t play the game, killed at the start of every game and can’t get the Imposter for the life of her. She also seemed to not have much fun compared to everyone else. Ame is um, well,  the detective with all stat points allocated to luck.", "Calli is super tired. she has been dealing with moving.", "i see Calli is following Rushia's footsteps with the mic quality", "VodGang here, killing off Ina and Kiara effectively cuts off any 5th and EN gen communication, haven't watched the full vod yet but sounds like a funny thing to do.", "I think Calli speaks well right?", "too bad she always dies first lol", "I don’t really know the extent of of Calli’s Japanese, she can speak phrases for sure but she needed Kiara to translate for kokorobeats so it can’t be completely fluent.\n\nssg ya boi", "It would've been legendary if she won the last round. Regardless, this stream overall was so enjoyable. Watson Amelia flexing her detective skills! 11/10.", "30:23 I just realized the only girls that are still alive are all blondes LOL\nAlso the clutch, of course the Detective herself must make the decisive vote\nAlso starting to cultivate that Moriarty side-character are we, good stuff", "31:30\n「初歩的じゃないか、ワトスン君」\n　\"It's elementary my dear Watson(kun)\"", "Both Ame and Botan as Crewmates are formidable. When Botan's out, Ame's still there. Ame's deductions are all correct. No wonder when Ame's still there while Botan's down, they'd still win as crewmates, they're both good in deductions. Gura's good as an imposter, she knows when to kill and when not to. Well, she's an Apex Predator after all. 🤣", "Amelia CLUTCH 32:20\nDETECTIVE SKILL 100", "12:24\nCalli is the first dead, and Botan comes in with the big funny.", "1:11:41 Gura's spirit haunts their chat", "Calli: I'm gonna kill everyone\n5 sec later\nThe Iron", "They say there's a thin line between detective and criminal.", "> Amelia detective \n> 3 times being imposter\n> Cali reaper killer\n> no imposter", "19:27 Gawr Stream\n10:47 Amelia Stream\n\nI was trying so hard to trying to get the vids lined up to listen to at the same.", "Rule number 1 in hololive among us: kill Amelia first, or she is gonna find you with her detective skills", "Thanks for the high quality stream layout Watson, yours looked the best of all 9 streams! Very fun to watch, hope you guys are able to play again sometime soon!", "the voice layout is so useful!!!", "Ame and Ina needs more practice but on Ame's side, she just needs to understand and know thw game mechanics more. But, i think she did a pretty good job without knowing the game mechanics that much so gg.", "I really liked the voice set up. Especially how each avatar kind of jumps and lights ups when they speak. I loved the stream, I hope we could see more Hololive EN and Hololive JP collabs in the future!", "I'd love seeing Watame playing with them and the only thing she knows how say in english is \"Watama did nothing wrong\"", "Watson's judgment was on point several times! sasuga detective", "This made me realise why business communication class exist in my uni. Not saying anything bad, just that I think if this happens in a business it'll be big yabai indeed. Love the collab tho!", "23:48 , she just run past the body, pro detective", "It blended in with the railings", "@MrOiram46 poor chicken", "Nobody: \nMe as Imposter: Yo guys it couldn’t have been Yellow, he was with me in the vents.\nOthers: Oh, ok. So it isn’t yellow or you... Who could it be?", "47:33 that laugh gives me chills ngl", "50:50 “My Heart Will Go On” reference", "This was great. More EN-JO collabs would be awesome.", "36:05, blessed", "do you guys know how to overlay your discord voice chat like this?  when your friends talking, their character just move and glow like that.", "its just an overlay added to streamlabs or some other stream software she might use, you cant add it to discord", "Discord does have a simple overlay where it shows peoples' icons on the top left and makes it go green when they're speaking.", "@pandevil i know how to do that. it just 1 simple button. but i wanna try like amelia do.  it just like add little touch to your video 😂", "I like Amelia's imposter tactic of creepily staring into rooms while others do their tasks", "At 23:00 that's my lewd folder, your WHAT", "Seeing them play among us together randomly made me think about how well fit this game would've been for Aloe, and then I realised her birthday is 28th of October, oof", "Really liked Ames setup with the light up faces.", "Despite not really understanding how sabotaging works and never going into vents, she still managed to pull off some amazing plays. Well played detective.", "ame is really a detective by luck", "Daang, kinda regrets ame's stream, didn't know it looks high quality", "I never actually noticed Gura typing My Heart Will Go On in response to Amelia.", "Title: Time for some REAL Detective work!\nGameplay: Time for some REAL Serial Killer work!", "Ame was pretty good! She guessed well and her instinct was at the right point. Really showing off her detective skills i see.", "I imagine the 5th member tries to speak English and the English members tries to speak Japanese", "Listen to when Kiara was dead (and couldn't translate) and Nene and Polka were trying to convince Amelia to spare them and space the other. Glorious. 😊", "\"oops, you walked in to that one chief\" happens at 41:04 here and 49:57 in Gura's stream. For those looking. :D", "Polka's English version of \"楽しかった！\" being the same words but with a SLIGHT English accent made me actually laugh out loud.", "It was around this moment Gura jinxed herself 1:10:48\n\"Somebody kill someone!\"", "\"It's not me, right?\"", "@Agga Viriyo \"I beg your pardon?\"", "@Kaiser Peanut pardun?", "I absolutely loved Amelia's detective work. Even though she's new to the game, she was doing so well and guessed almost everything correctly. The last standoff between her, Nene and Polka had me on the edge of my seat. Good job, detective! With some more practice, I think she could become absolutely deadly in this game. I'm looking forward to her learning the ropes and becoming a master manipulator imposter.", "The stream setup was so good, each member lighting up when they talk + being placed in a non intrusive way on the screen (considering they are so many) was very smart.\nAme puts a lot of effort on her stream setups, it feels very organized, tysm for your hard work Ame!", "Wait .. is it just me or kiara didnt get the chance to introduce herself?? Feels kinda bad if they forgot", "Expectation: time for some detective work!\nReality: amepostor!", "Oh cool EN Vs 5th Gen sucks I missed this live XD also love how you have when some one speaks there Avatar lights up because a few of tee he girls sounds some what the same thanks for that Ameila", "The Ame Polka impostor game was crazy lucky for Ame. It was hilarious watching them turn on Nene. Ina wasn’t experienced enough to carry Watson the next round unfortunately.", "30:50\nNene: Polka kill. I look. You.\nPolka: Ame. That's wrong. Uh, listen. Actually... NENE did it!\nPOLMAO", "47:30 She actually did it. She did ground pound our mom.", "That was the best stream so far! Don't remember last time I felt so hyped for a stream! Thank you, Amelia, very cool!", "To the person who when I recommended this game said \"Oh yOu wAnT hEr TO plAy WiTH ToXic PeOpLE\"\nWhat did you think I had in mind for our lord and savior", "You know Ame really does have maxed luck when she got all the wires the same color in a straight line", "I can’t wait for more colabs like this. Especially with 5th gen and EN", "32:39 amelia is so cute", "23:50 Ame, casually walking right over the corpse of a fellow En member.", "1:01:21 woah ame actually toxic. Not nice ame", "Lol. Chill. I think she meant to say that because they were imposters/murderers that time 😁. Murderers aren't nice🤣", "Polka is chaotic neutral at best", "Can't spell 5th Gen without En.", "I just love Amelia's mischievous laugh when she became impostor. The detective has joined the enemy to get an inside scoop", "And then you remember she said that she don't want to be an imposter makes it funny. 🤣", "\"Gura is safe\"\nGura wasn't safe...\n\nI'm having fun watching all perspectives~", "I love the moment when you defeated Nene, her expression and how you managed to win with luck was a legendary moment", "39:45 is so funny to me", "1:06:50〜 あめちゃんかわいいポイント", "Ngl the introduction is kinda awkward lol", "I love how Gura's has a \"Dum\" sticky lol", "This was so adorable. I hope they do it more often so we can see them improve their strategies. It's fun to see the different generations do things together, especially when it leads to growth.", "I sadly didn't have enough screens to watch all of them at once when this was live.", "“Infinity war is the most ambitious crossover in history.” \nHololive among us collab: I’m about to end this movies whole career", "55:28 Ina ga shinda!!", "What if Ame and Kiara(Phoenicken) or Polka(Phoenix Fox) have a child? I guess you can call him ...", "\"Lammy uh... Bye Bye\". Iconic", "The vigilante detective, killing for justice!", "36:50 Lol Gura faking divert power task as if it were download. That task takes less than a second.", "This has been the best thing to ever happen", "Inaから始まったWatson〜でWinkする習慣とっても好き", "41:08 Sector is clear............NOT CLEAR NOT CLEAR!!!", "That was a big play there reporting your own kill, you really had me at the edge of my seat there!", "Sasuga Tantei-sama😂😂 I laughed when Calli died first on the first round even though she said she'll kill everyone😂😂😂", "I really hope that Ame separated the two lovebirds on purpose lmao\n\nTakaMori and ShishiLamy are so far away RIP", "56:50 Ame just doing tasks\n\n57:16 Ame just chillin while an important decision that will decide the fate of the crew is made...", "Wow just finished the stream and had a lot of fun seeing Polka and Nene great job Ameila as the Imposter 😎 highly looking forward to seeing yall play again in the future", "22:59 I NEED THAT FOLDER\n30:25 The most dramatic vote!!!\nAme trying to solve the case meanwhile Nene explain her and Polka flattering her while trashtalking Nene LMAO\nShe actually was a good detective!!! Also she didn't show the \"goblin mode\" with Holofive lol if they know how she is inside", "They need to play this more often; none of these games ended with a kill!", "31:00 is blonde wars", "This was fun to watch, I hope Ames gets even better at it", "57:20\nここアメちゃん高みの見物で草", "Good job for being great Detective and great Murderer(lol). As always, thanks for the collab stream!", "You put every member holo di nice place with a photo of them all. And we can see to who speaking beacur of the light will shined.\n\nThanks you so much for stream! I am really enjoy on Amelia POV!", "32:55 The Smile we most Protect", "Hello Amelia! This video stream helped me for being entertained despite during this day where I was sick. Thank you and the Hololive members, and keep up the good work!", "1:03:09 poor calli lmao", "No hiccups in this stream\nBut it was really fun to watch as always.", "The Ame, polka, and Nene fiasco was a true display of lu- detective skills.", "Solid gold, loving this.", "“I just wanna do my tasks” meme was there", "最近ずっとみてしまう", "The blondes being the last 3 was top", "34:02 That was some high note singing from a clown.", "lmao, polka was tryna pull the blonde squad strat, but they all blonde, also \"nene torasuto\" got me. Y'all gotta do something big like this again, maybe Halo with Botan on the side with 4 people so it's not completely unfair.", "Nice deduction and learning how to play ability for first timer Ame!\n\nAlso your pipipip and blubblub (or gluglug?) fake task sound is cute!!", "The detective is actually the best killer\n\nWhat a twist! ", "I’m so happy that you guys get to play together despite the language barrier which is amazing!", "You know I wasn’t feeling that well yesterday but I think watching these girls get to play among us cured my cold today. Glad I was able to see what all the fuss was about this game!! Tea mates o7", "Lol, the visible confusion at 59:43, followed by realisation by Gura and Kiara that they fked up lol.", " big brain ame!", "Watching these girls learn the game is hilarious!", "1:13:55 polkas sad noise made me laugh so hard for no reason", "Despite the language barrier and being new to the game, Amelia played amazingly. Good work Watson.", "27:36 so cute lol", "Start of stream\nMe:ima turn up my volume to hear everyone\n\n0:19", "Yooooo thats a v cool way to show who is talking ", "33 secs in and my heart is filled with warmth", "It's a shame this collab was only an hour long.\nBut, it's also a good thing it's so short, because I'm gonna have to rewatch this about 4 more times.", "As expected of the Ultimate Detective...", "The perfect definition of a chaotic discord call", "8:01 the madman", "30:25 if u watch Polka She Toxic in Game chat", "I love how it was up to Ame to decide who was the imposter between Nene and Polka at 30:24", "55:25\nたこ焼き", "That gremlin laugh is music to my ears lol love it", "31:20 YESSSSSS. NICE AME-CHAN.", "🌸🌿💍🌿🌸 Te amo Amelia Watson 😔", "32:10/55:26 Good decisions. 57:19 Lol, she was muted the whole time and somehow didn't get voted out.", "I can’t believe I missed this ;-;", "Amelia the Ripper confirmed", "Really enjoyed this video / stream. I hope we get more holo amoung us 🙂", "It's Hard to watch this from multiple perspectives but it's 2x funnier each perspective.", "Alternate title: noobs die to oxygen", "At 45:50 you can start to hear Polka say Ame and Ame just starts giggling. Wonderful crossover i definitely want more of", "Had to rewatch this because of how fun it was, this is the new Minecraft Death game of the times. Loved it!", "The great detective indeed", "Amelia your discord set up was really cool, howd you do it?", "Ame staying quiet during most arguments while she was the imposter was pretty smart tbh. Don't interrupt your opponent when they're making a mistake.", "46:40 honk honk followed by UeuWuEuWueW", "Ame in the center of her harem.", "I yet again could not miss watching any single one of you girls, so I played all of your streams on separate devices. Love you all!!!", "Wow! I don't have many devices, so I played it all on one laptop, and it was chaos! 😂", "@XenoKnightAlpha I am the exact opposite. I have 2 devices and siblings with phones and a device, but no computer. Although, I prefer it this way, because the idea of 9 streams coming from one audio output sounds pretty unpleasant. (Like hearing it from 9 outputs is much greater lol)", "@Pixeluchiha Your setup definitely sounds better. yeah mine was a jumbled mess. My internet and laptop could barely handle it even though I set all the streams to 144p. Lots of buffering, so my backup was to use my phone and headphones 🎧 to listen on a single stream. I wanted to change it but my laptop was locking up, but I it worked out 😆", "@XenoKnightAlpha Yeah, I definitely recommend multiple, but most people aren't as fortunate(?) to have multiple siblings to 'borrow' from, so as long as you put in effort, you get 100% in my book!", "Lovely stream. Thank you! ", "You destroyed the game with your beastly detective skills", "I ENJOYED MY STAY", "So from my investigations, Amelia and Gura had similar ping. For some reason Ina also had similar ping to them. Calli had slightly higher ping than Kiara. So I assume Gura/Ame and Ina live in america or maybe Ina just has pog internet.", "Poor Watson wanted to be detective, but she got stuck as the imposter. Oh well it's like Dexter. Using the law to carry out serial killing.", "Ame is really a natural.", "God I wish I could speak/understand Japanese fluently", "Can't wait to see future video with all Pov!", "She just newbie\nAnd she is bad to be imposter but good to be crewmate", "Really thought Amelia will meme detective, boy I was wrong. What a great gameplay!", "it was SO MUCH FUN\nSeeing polka and ame teams \nThey look very a like", "Its like the universe but instead of stars its waifus and at the center of it all....\n\nThe WatSUN!", "Watson...is really a detective...woah", "My Saturday night has been sorted", "Ame did really well for a beginner player, well done Watson!", "27:48 the dead has spoken", "I hope aloe is feeling okay watching this", "1:13:38\ndon't mind me", "AmePol strong pair, need more of this couple in the future. 😍", "i wish i could use these lightings for christmas", "WTF!?: 8:00\n\n<sigh> What could have been...", "Kiara was the ideal first target, without her it's absolute chaos.", "23:00 lmao", "Gura; my Japanese is limited, but I will eat you all,... predator vibe.", "Road to 500k subs🎉", "gotta nerf that shark :))", "Watson being the impostor is so ironic", "I guess Amelia and Gura can’t speak Japanese? I thought to just be in hololive you’d have to be fluent in Japanese, even the EN girls", "Kiara and Gura really made their own narrative for Nene being sus when Ame was the impostor. This game might be alright.", "Good Work Amelia, You are a Great Detective.", "Yooo the voice set up is so well made", "Ame: Gura safe.\nGura: Omae wa mou shindeiru!", "Basically the stream: *Cute creature noises", "That was fun", "ya cant give imposter to defective brain after all ye?", "Kiara could play 3rd impostor so hard by intentionally mis-translating stuff if she had the chance.\n\nEdit: Polka doing a Calli song reference to the Reaper Rapper herself because she died early had me dying right out the bat. Laughed way too hard.", "in the first round, death dies first . ironic", "AMELIA MVP!!! BEST DETECTIVE AND ALIEN IMPOSTER!!!!!", "I'm sad that she's not here anymore, this stream supposed to be HoloMyth collab with HoloFive.", "Everyone's still a bit sad.", "46:31 nene x ina", "Kiara helped Ame win as impostor more than Polka and Ina combined.", "Anyone else just sitting there in the beginning having no idea what anyone is saying bc you can't understand Japanese or just me", "She isn’t a defective detective after all...", "12:26 What does \"F\" mean?", "Press F to pay respects. It's a meme.", "@*Jumping Peppers!* \nThanks niki", "That last round was inapossible", "Sorry, but you seem to have made a typo in your sentence. I believe you meant to say \"impossible\" but you wrote \"inapossible\". Considering that it's more likely that you're on mobile, autocorrect should have taken care of this. Make sure it's working properly. Next time, make sure you double check what you wrote so mistakes like this don't occur again. Thanks for reading and have a good evening.", "I also forgot to mention that there is a grammatical error in your sentence. At the end of a sentence, you're supposed to put a period. Please make sure you end your sentences correctly or you might type a run-on sentence. Once again, thanks for reading and have a good evening.", "@Steaki tako bout a long read", "We got a second a", "BOTAN SUS! Ame picks her lol that was great.", "53:04 Watson could've kill off gura and in turn save polka from suspicious but then again polka could've vented.", "They're fairly new after all, I can't blame them.", "Secrecy", "48:16", "Forget Batman, Ame-chan is right now the world's greatest detective!", "Group discusses who is Sus\nIna: Humu humu!", "Play Poker with Gura - win every time", "Oo ame near to 500k sub ...  Congratz ame...", "30:41  Polka-> AME DA NE, AME YO, AME AME YO, ANTA GA, WE ARE BLONDES, NENE IS SUS", "41:09  (POV AME)\nAme: Gura safe \n*Punch and shoot *\nAme:gwrahh! She's not safe!!", "She jinxed herself once again. 🤣🤣", "Game starts at 10:44", "3 blondes were left in 2nd round  lol", "Gura is (not) safe.", "Sasuga detective", "TRUST! ames proceeds to not trust", "Ghost Gura: OooooOOOooo do your tasks ooOOOOooo", "Hard proof we need more hololive EN streamers", "What language are you speaking?", "Poor amelia cant show off her detective skills", "Ame is the real Dr. Sus", "Suitable for #1detective gg ame", "1:05:07 oya oya", "Gura was so quiet ;-;", "2:37", "cute as f**k", "Ame kill by SHAAAARK\n18:16\n41:08 GURA IS SAFE", "the detective brain is indeed not defective", "ame looks innocent so all of them do not sus", "1:00 A-capella", "Moriarty Ame lol", "Why didn’t calliope stream", "Technical difficulties.", "@TheGoldstriker damn that sucks", "1:03:00 lmaooo", "Gura's ghost 30:20 1:11:39", "She's more like a murderer than a ace detective.", "She can be both at the same time. 🤣🤣", "POLMAO", "20:30.", "I feel bad for Calli, man. Not only was she not imposter a single time, but she was also one of the first to die every single round pretty much. Poor reaper gorl", "calliope really retained her title as dead beat the entire game.", "Calli is the Corpse of this group", "GAMER AME IS TOO STRONG", "Scary how hololives #1 detective is also the best murderer..", "See this is why I warn the chat she is going to be a murderer ..yet no body seems to notice that most detective character is always being the best murderer", "It looks like a disaster. The language barrier is really embarrassing", "12:00", "Nene is indeed deado", "poor cali", "Lamy is so innocent that she can't even be a good imposter & Amelia is as sharp as Batman.", "She isn’t inacent, she’s inapinch", "47:09", "48:18 ,  48:29 and  48:46  . All Pi pi pi", "(s file) 55:34 lwd", "56:52", "1:07:44", "ina is too pure, she cant even lie good lol", "❤️", "48:17 pipipipiipipipipipipipipipipiiiiiii", "Polka is always sus", "lol the detective is the best killer", "Lmaooooo", "Amelia is like me in Spanish class", "Ame did good in this one though...\nImagine being a beginner in a game and there's a language barrier with the other players.", "Meitantei Ame-chan!", "Mhh Inacen't", "Ame + assassin = Amessin", "fard", "★★★", "Remember, guys, it's definitely not Ame. \n\nProps for actual detective work and a fun impostor run. Best detective gremlin.", "Amelia \"Big brain detective\" Watson on the case", "Poor ina getting bullied while being an imposter lol\nInacent\nInaposter\nInaugh", "Amelia is now Tantei", "Amelia has some skills for not sounding sus.🧐", "If you can, I dare you to play Mega Man X6 on Xtreme mode.", "ALWAYS MAKE THE ROOM PRIVATE\nMAKE SURE THE CODE IS HIDDEN IN EVERY STREAM\nplease up vote or sc next stream.", "Tfw no surprise appearance of Aloe...", "There were 9 out of 10 people.\nYou know who wasn't there?", "What happened with Aloe Im new to Hololive", "@City Of Figs Search In YouTube For More Info.\nBut Basically She Got Doxxed By Antis and decided to retire from Hololive", "@Avempestad2 oh man that's really sad. Why do people ruin things", "this kinda hurt to watch cuz of language barrier, they can't even give thier full report when discussing and it's kinda lacks something, but nonetheless it's fine, they should go with Coco, Hachama and Moona for 8 players next time"]