["Thanks for another great stream!\nAnd I'm really happy you used my art for the thumbnail~!  ❤️❤️❤️", "Oh that's yours ? Nice man.", "@Kirby Otaku congrats you did a great job!!", "Am I crazy or did you do a Game Grumps animated also?\n\nEdit: nvm, I checked, you did. Good work all around.", "The starsub saga continues, in the vtuber rabbit hole.\n\nCongrats and wonderful art kirbyotaku!😊", "I would have never guessed to see you  here", "Jood gob", "It's great art!", "Nice c:", "That thumbnail is like 😔👌 perfect", "KirbyOtaku art for thumbnail was very pleasantly surprising", "No problem", "Proud of ya!", "Way to go Kirb! I gasped when I saw your art in the thumbnail. So cool :D", "Glad to see you in the rabbit hole too", "NOICE!! ❤❤❤❤", "KIRBY!!!", "Very nice artwork, well done!", "I thought I recognized the style! Long time fan of your GG animations <3", "A R M P I T S", "Can you draw doujinshi???\nFor experimental purposes. I would like to investigate some stuff", "You're art is fantastic! I want to suffocate in those armpits", "K.O. love your stuff 😁", "Nice", "Nice work keep it up\nNot enough words xd", "I really really like this image.", "Talent", "Ame: “I’m going to be nice to you guys.”\n\nAlso Ame: “the water looks nasty? So did your mom last night!”", "Best part is how the music stopped immediately after she said that", "Ame: They drew FIRST BLOOD.", "I've noticed that whenever Ame says: Yeah well, someone's about to get roasted harder than a turkey on thanksgiving", "Everybody talking about that ara ara, but nobody talking about how she obliterated this guy: 1:05:44", "She killed him", "She even hestitated a bit", "25:40 amelia is hilarious", "I can feel the hesitation which made it funnier.", "@The Potato she tried to hold herself back but the opportunity was too good", "Gamer moment like this is the main reason we're here", "i think she insulted our mom twice in this stream, but i couldn't find the other clip can y'all help please", "1:46:55 nvm found it", "this makes 12:50 even better", "12:50 insulting ame", "\"You f*ckin w-\" -Amelia watson (probably)", "I started watching Vtubers a little more than a week ago. Amelia has been consistently entertaining throughout those days through and through!❤\n\nSidr Note: I am proud to have witnessed my first Ara Ara live~✊😤", "Welcome to Hololive! Be sure to check out Amelia's four companions at Hololive EN, as well as all the wonderful talents in the Japanese branch. They all produce wonderful content regularly!", "I also witnessed it POGCHAMP", "Don't forget to also check out Hololive Indonesia, Holostars and some available Hololive CN like Artia and Civia. They're also great.", "Nijisanji is also worth a watch", "@Tim Tim Yeahh I've been watching them lately too! Shigure Ui and Machita Chima are the ones I like the most so far :)", "@Aster Yeah! I checked them out too, they're all great!❤", "Welcome to the hololive Rabbithole please enjoy your stay", "@Liam Sante I probably won't be leaving anytime soon🤣, I love it here.", "@Itsme pnamir flee as long as you can. Before you know it you'll lose all your fingers and add \"peko\" at the end of every sentence peko", "Dont forget to read the rules too, so we can avoid toxicity in the streamers' chat", "@Otaku  Ey thanks for reminding the new people falling in this rabbit hole dude", "@Miggy Nyx not anymore, the CN branch of hololive got disbanded.", "Alternative Title:\nDetective Watson and her Backseat Boys.\n\nRemember ladies and gents, the secret to life is eating eggs, staying hydrated...and learning how to trick yourself. Amazing Ara Ara.", "Weird Weird Carl", "who is said \"Carl\"?", "@Carl Aguila Some dude who made a superchat telling the other people in stream to stay positive and not hit rock bottom like he has. F.", "What if I'm allergic to eggs?", "@jorge wyles Trick yourself that you aren't ;)", "What happened to the live chat? Has it not processed yet? It kinda seems like that. Well then, I guess I just answered myself lol\n\nEdit: we also have wakapai in the thumbnail. Glorious", "14:40\nI was watching at work and I let out the ugliest laugh when I realized what she was pulling here LOL\nWell played, detective, very well played.", "I wish chat would say it looks fine so she would have to play the whole game like that, reverse the bully!", "Chat was too slow on the uptake.", "@ZeWorld No she hid the gameplay, so we would be listening to her playing minecraft with no gameplay. She could just change the contrast in the background and we wouldn't know anything lol", "We finally got an ARA ARA after such a long time LADS GET IN 3:20:31\n\n12:50 KEKW", "Lol, she knows Girls' Last Tour :OOO This anime is so beautiful.", "She knows it from the manga first tho", "Is her favorite anime, too", "We got an ara ara at 3:20:31, and carl is the mvp in this stream today", "What did carl do, I missed the stream", "@Jo jo he donated a lot lol", "carl is the man", "@no But..but his wife though ?", "@Yukihirou de Ghania She ground pounded his wife", "@Trix Fix So You're saying Carl is paying Amelia ransom to get his wife back, I like this narrative.", "This is what happened to Carl lmao https://youtu.be/0BwAAnA0pwQ", "gg", "Hiccup seen: 48:07,1:03:41,1:14:48,1:21:40,1:27:40,1:40:10,2:18:05", "and 40:43", "@Akiardi Thanks", "Waiting for hiccup 10 hour or more", "", "There's actually 19 hiccups this stream:\n1. 22:46\n2. 29:02\n3. 40:40", "@Camilo Gatica Dam i miss a lot. Thanks", "@Beginning Beginner no problem fellow Teamate. Lets rejoice in the sound of our dear detectives' hiccups!", "@Camilo Gatica you're so dedicated, lol.", "@Windra Nandhitya You bet! It brings happiness to me and others.", "@Camilo Gatica you're not the hero we deserve, but the one we need", "I cannot thank you enough.", "@レアコイル  you are welcome", "2:05:06 rip our moms", "\"ARA ARA\"", "Our moms received a lot of abuse this stream out of nowhere lol\n\nAME MAKING UP TO US WITH THE RARE ARA ARA THO ", "When and what", "@big mac 3:20:31", "I kinda want that face in the corner as an emote. It'd be perfect", "3:09:20 Ame life lesson #34: When life gives you lemons, eat eggs", "Can we just talk about bread boys watching the stream? Seems the son fell down the vtuber hole probably\nEdit: His first message was around 9:44\nSecond was around 12:50 \nThird was around 14:45", "I saw that too and nearly died of shock", "Timestamps?", "Timestamps?", "@Adriel I’ll edit the time stamps", "they are really such a weeb lol", "2:50:19 ame stretch break and yoshi death", "SHE SAID THE THING", "Ara ara", "3:20:31 for the ARA ARA.", "This time our favourite chaotic neutral detective started a new project, insulted us and our moms as usual, gave us life lessons and, more importantly, gift us with an 'Ara Ara' at the end. What more can you ask for. Thanks Ame for the great stream!!!", "This was my first time ever watching one of these girls' streams live. After being recommended their videos a ton over the last week and a half I finally took the time to start watching their stuff over the last 2 days cause I am stuck in bed from hurting my ankle.\nAlso had been the first time in a long time that I watched a really famous streamer. Had the same reaction that I had any other time I watched a really famous person. Was too intimidated by how fast the chat was moving and how many people were all also watching the stream to use the chat at all.", "A lot of us mostly lurk, so don't feel too pressured about it. I hope you had fun and we can have you back in some other stream. Hope the ankle heals soon too!", "Get well soon!", "Your though on the Ara ara at the end of the stream ?\nAlso, Welcome to the rabbit hole.", "Nice to have you aboard! Get well soon soldier.", "Even if your comment goes unnoticed live, people clip highlights all the time.  There's a chance someone will notice the comment then.", "Welcome abroad mate, I hope you enjoy your first stream\n\nOh.. GWS to your ankle", "At first, I was like you, but I learned that my chat will be drowned quickly anyway so it's like my chats are never there at all lol.", "Welcome! Remember to read the rules in the description too owo )b enjoy this rabbithole with us", "I hope you enjoyed it! Chat is like that most of the time (especially for Minecraft streams) unfortunately, but a lot of us learned to just roll with it over time. Remember to check out the rules in the description if you haven't already. Get well soon", "Personally the fast chat makes me feel like I can be pretty open about what I say since the noise will drown out what I say although I get your angle too. I'm pretty introverted as well.", "Welcome aboard mate. And don't worry if chat is going too fast. You can just hide it since the streamer interacts with chat quite frequently so you won't be missing out.", "Hope the ankle recovers soon! \n\nAlso, leave comments in the chat, everyone welcomes them as long as you stick to the chat etiquette.", "I can feel myself becoming closer to being a masochist as i watch more of ame's stream.", "Somebody in waiting room said is his firts time watching a vtuber, I hope he enjoyed like we always do", "I’m sure they did", "That's wholesome as heck. I hope they come back.", "Someone in the chat also said \"My mom is watching with me, can you explain to her what you just said?\" when she made that initial mom joke near the stairs.", "Snow colored sculptures are pretty cool... Icy pose", "No, bad. No puns.", "B R U H", "Ina please", "3:20:30 this is by far the best post credits scene I've  seen in years", "She used to do this almost everystream in the start. until she said we were too spoiled ", "@Brezals he needs to see the ara-sike", "I'm not even playing with yall  I just went on the stream and all I hear is \"ara ara\" and then stream ends. I was like 3 hours late and when I got on to watch, it ends :/", "Same", "On the bright side, you can watch the VOD from the beginning. I hate joining a stream near the end bc YouTube doesn't let me scroll back to the beginning anymore.", "I almost did that but I was like 27 seconds to late", "@Juan Cruz same. I also i prefer the archive cuz i like sleep", "ずっと可愛いな", "3:20:28 is why i was born for, to listen to this angelic phrase with an angelic voice", "yeah it's the reward at 3:20:31 for me ;-;", "20:20 is that what Gura trying to build in her last stream? Is she abandoning the project, it looks like a mess", "Yes XD\nAmazing Ame was just like \"nope I'm not going anywhere near\" lol\n\nShe's gonna finish it next time she plays", "Yeah that's what guras building, she's not finished with it just yet though. It looks like that bc She tried hiding what it was from the other members lol", "It's the tower of friendship, it's an interesting tower definitely worth checking out once it's done.", "@aeaee aoiauea \nYeah! But don't go yet bc dentist approach, paperwork, CUCUMBERS", "@Cory Ellis  Yeah, don't go yet, cauliflower and lima beans are afoot. CUCUMBERS", "@Cory Ellis when you see a building like that its better not to go near it. LOL\n\nCant wait to see what it will look like when Gura finished it.", "So many dummies in chat spamming that the torches have to be ON the spawner.. it doesn't matter, it only depends on light level 2:31:30", "Do any dedicated investigators volunteer to look for and timestamp Carl’s supas? I need this ", "It’s anywhere between 3:00:00 and 3:20:34 most likely", "I might be remembering wrong, but I think there were some scattered throughout the stream", "Wasn't this guy in Gura's too?", "@Leave MeAlone I dropped in and out of the stream for personal reasons and when I got back I didn’t really pay attention to chat until the sc time.", "@Nazgrel Wolfsong Yes, he seems to appear in all the girls' streams.", "I don't get why people think it's funny, just seems like a poor attempt a seeking attention. His story isn't even consistent, the first time it was his girlfriend leaving him was because he himself admitted he cheated on her. Next he was asking why his wife left him. Only good thing about it is that he's giving money away to the girls.", "@Kleimeen A it's a reference to aqua teen hunger force", "2:07:42 ive never heard a person make that sound before", "\"Why does it look like we're in a huge dome?\"\nAme flat earther confirmed", "27:02 I might just be an Investigator if it means having a Rocky Watch-Along with Ame 🏛🏃‍♂️", "NUKOOOOOO!!!!!!! ah I l oh bed girls last tour the ending to the manga made me cry my self to sleep hell I'm tearing up thinking about it but a show that can bring out that emotion is a crazy one in my book", "Stroke", "\"THIS WAS A HORRIBLE IDEA\"\n\"YEAH? SO WERE YOU.\"", "We got a surprise at the end guys!!!!! 3:20:31", "Amelia says \"I would treat you better I won't insult you.\"\n\nMe: no please don't stop", "she was just flexing her elgato capture card at the beginning lmao", "This channel is great!\nShe's kawaii and famous, her HIC is also kawaii\nand she teaches me English and a little Japanese", "I am happy to see Ame (and the other girls) continuing to build and improve the EN server. It reminds me of watching the senpai and kohai build up the JP server.", "I didn't saw that coming. wwww\nchoked by that. 25:40", "25:40 yes", "30:32 if she wants to cheat, she could just give us the name of the seed and the viewers will find about everything there is about the world", "someone has already done cracking it", "46:27 I'm flashbacking to the moment where she mentioned that she cut the tip of one of her fingers off.", " for all that I've missed and thank you for the wonderful stream Amelia.", "36:30 Amelia's noises\n\nwait for \"OHAYOO\"", "LMAO i love how savage she gets", "\"I never said I eat them you f***-- Nevermind, you guys are great, thank you\"", "Thank you Ame Watson for the Ara Ara and also your Kindness sometimes <3", "Ame: I'm not addicted\nAlso Ame : Minecraft streams go BrrRrrrRRrrRrr", "5:00 carefull, there is jumpscare", "Chat should've said it looks fine when she trolled them about the brightness, so she will have to play the whole game like that.", "Ame: so chat, where do I find dirt?\nChat: right beneath you\nAme: but why?", "Thanks for the Amezing stream Ame! And thanks for the \"Little treat\" (Ara ara)! And thanks for your kindness too!", "Thank you very much for the stream Ame, i hope you are doing well, Take care~", "When she talking about nail,I really agree with her. lol", "These backseat gamer dude..", "The Carl lore keeps getting more complex. His story will become the next ARG", "Gonna eat an egg RIGHT NOW", "She knows GTL ? Amazing !!", "Dunno why but the way she says Okay is adorable... Goddammit I'm simping for the whole group at this point", "I've seen Ame go to the nether so much and not take a single piece of glowstone. I think that would look amazing if you replace the torches with them.", "That shader pack is looking fire though.", "I fell in love with your hiccups 😍", "Ha most ppl are sleeping now", "watson, try making the vanossgaming tree house, just be mindful of the potential tnt pranks >.>", "Egg statue: I am a monument to all your sins", "1:13:30 Bamboozled!!!!!!!!!!", "The paddock was actually built to keep the zombie pigmen away from The deadly amelia", "Those 2 clocks at the beginning of the stream show different times, I'm guessing for 2 different time zones ?", "Most likely PST and JST timezones", "The girls last tour shrine huh?\nSasuga amelia sama", "Wooooo!! That ARA ARA~ tho", "Well that was a lot of progress that Ame made like building that tower and surviving all that stuff that could've killed her. Also, there was an Ara ara on a normal stream. That's something but also blessed.  And....the backseating is bearable but the end there with shift click part, sheesh. Thanks for the stream.", "that thumbnail, nice", "is shift click not a thing in vanilla? cause omg i would go crazy if i had to drag everything into chests lol", "Liked for the \"your mom\" joke.", "Are you wining detective? Xd", "2:07:57 it starts here...\n\n\nLook at the live chat", "It would be crazy if someone put timestamps every time \"hicaxe\" was mentioned", "Susped It would be even crazier if some put a time stamp for every time someone said “hic”", "@Julian Benali yes it would...", "- A random toxic: insults\n- Amelia: Reads the insult\n...\n- Me: Oh... Nothing happened", "1:56:39 cute ame noise", "Blessed stream", "Looking forward to watching Ame build the triumphal  arch at the top of the stairs", "I would be down for a 6 hour stream of gura and watson!!!", "ARA ARA........ARA ARA now that’s a name I haven’t heard in a long time, long time.", "Ame is very mature until she isn't.\n\nWhat a gem.", "Girls' Last Tour is indeed good taste.", "you should consider making exit signs with directions", "32:53 Tran- 33:19 -sition", "You have made a lot of efforts.\nI have faith in you", "1:47:00", "who know the shader that Ame use. that have in Windows 10 version?", "Probably SEUS shader", "Mumbo keeps on losing his mustache first Grian and now Amelia", "Carl will pass to history as the greatest man of our time.", "2:07:40 cute squeak", "Wait you played Stanley Parable?\n\nBut have you played The Beginners Guide? It's made by the same guy who made Stanley Parable.", "Loving that little Nuko there", "Looks like The Son has fallen once again", "That mom joke at 1:47:00", "If you want to build something Always carry a chest, bed and a crafting table", "Still to dark \nMy girl it's pitched black", "I missed it :((((((", "Ah Amelia, my favorite Minecraft streamer", "I’m sure someone already made this joke but... she solved the stair case", "Finally not ara ara superchat ", "Im just happy she likes Girls last tour. Excellent anime.", "Very sassy live chat with Watson lol", "Anybody know what resource pack she uses?", "anyone know what shader is it ? it looks great", "YOOOOOOOO LET'S GOOOOOOOOOOOOO 3:20:30 !!!!!!!", "Watson only has good ideas.  Just temporarily insufficient execution.", "Ah yes, enchanting stone and gold tools, a great idea indeed", "Troll Ame is strong in this stream", "Don’t just ask for directions. Go explore with gura. She needs all the guidance she can get with her short attention span and memory.", "What shaders is she using ? It seems pretty cool!", "Yes I do eat my nails", "Just wanted to say one thing. \n\nI love Ame and this community. ", "Ame's community has the same toxicity as her... Yep... The community does take after what they are watching lol", "is that nuko on your pic?\nfrom girls last tour", "THAT ARA ARA THO", "Lol the Gura Progress Door", "i missed jt", "The thumbnail is not boing boing", "what shaders are they using?", "12:49 ", "Can someone explain the Carl meme to me and give me the time stamps please?", "I don't have timestamps but a guy named carl keeps donating money to Amelia in an attempt to get his wife back after he cheated on her. He was doing it in the AmexGura collab the other day too.", "@Shane Morris This is some deep fucking lore", "its a dumb aqua teen hungerforce joke. Tbh I know a lot of people encourage him but I really don't like it. It derails the chat and completely disregards rule #3.", "@Rocky Raccoon Yeah, it interrupts the stream hard.", "Did she ground pound our mom again?", "all that sock sculpture needs is just a yellow beak", "Why is she building the meat worm?", "why does she hic", "Does anyone know what shaders Amelia uses?", "Antichamber is going to break her...", "I guess I’ll say if no one does", "Nai tum jake dream 11 pe team banao ye hum karlege", "CARL IS A LEGEND", "i wonder what Ame's shaders are.", "i think it may be sildurs vibrant shaders\nsorry if im wrong", "2:07:41 hic", "ARA ARA~", "Make the bubble blower joke instead of tennis racket", "💙", "1:47:00  👁👄👁👍🏻", "At least she's not trying to get wither roses", "What shaders is she using?", "Why is live chat is so cringe", "2:42:00\n2:50:00", "HARTA \nTAHTA\nAMELIAAAAA", "I feel like some of the peeps in chat  are intentionally provoking ame to get her to be toxic and it'll end up getting her in trouble, she almost slipped up at 12:55-56 ish but she quickly recovered. I really hope im wrong tho", "22:46\n 29:02\n 40:40\n48:06", "Amelia is so incredibly stubborn and set in her ways. No matter the advice, she'll question everything and most likely do the opposite. It's pretty impressive how headstrong she is.\n\nEnchanting stone tools isn't the best investment of your levels and lapis! Prepare better for your adventures! Mark your way with torches! Make better tools! Gold tools have less durability than wooden ones!", "I know a game that should fit you really well. It's called \"the sexy brutale\" (name sounds worse than it is) a groundhog day murder mystery with time shenanigans. You basically repeat the same day in a casino mansion called the sexy brutale and try to save people without directly interacting with them.", "Oh, so you wanna go spelunking? Maybe try Spelunky in a future stream.", "3:20:30 ara ara", "I love watching Amelia but\nI hate amelia chat.", "Nuko", "hic", "Ame Ame Ame Ame", "", "holy christ please get some better tools", "no", "*sees thumbnail  *\n tat lewd, but approved 😍👍", "You will never know what was originally said in this comment before I edited.", "No...I wont...", "Alright, keep yer secrets.", "Hint: I was first but it was a 4 letter word", "9o", "There is a website you can use to find stuff in your seed. You can use it to find the coral reef.", "\"shaders look horrible\" \n\nYou look horrible. I can't believe people like that exist. Shaders look amazing. And i stg if anyone forces them to stop using shaders, were gonna have a problem", "GURA IS MAKING A DEATH MACHINE AND WE ALL KNOW KIARA WILL FALL FOR IT FIRST SO DONT TELL KIARA", "YOU'RE SUPPOSED TO BE SWORN TO SECRECY DELETE THIS", "@Cory Ellis NEVER", "@Cory Ellis it’s only so kiara finds out", "@Cory Ellis trust me it will work, I’m built different", "@Obi-fridge kenobi \nI honestly hopped onto Kiara's minecraft stream earlier just to check if she had checked out the tower lol\nI also feel like the Phoenix will fall for it first", "@Cory Ellis dad knows it, I know it, and America knows it", "What shader did she use??? Someone answer me please😔😔", "seus shader I think", "@The Potato thankyou very much ⊂((・▽・))⊃", "@The Potato can i use it on bedrock??", "@Subaru Big Duck I'm not sure", "1:05:00 she says she is using SEUS shaders", "@GredyStar okay thankyou very much ♡(> ਊ <)♡", "WHAT IF AMELIA IS CARL’S EX..?\n\n\n/s", "Amelia was Mary all along and her boyfriend is Josh!!!", ".To the 1 person that’ll read this: you’re an amazing and adorable person! stay safe and have a wonderful day! 💫☁️."]