["Since it's not archived, I've gotta say here: Ameila became my favorite after she sang a fucking streetlight manifesto song on the celebration/karaoke stream.", "Loved it too! She really enjoyed it", "Has no one clipped it yet??", "Link?", "@SnowyGT Just search \"Amelia Watson Would you be Impressed\" on Youtube. There are many uploads currently.", "1:30:34 she raged so hard that the stream went offline for a brief moment. The rage is strong with this one.", "How long did she stay out?", "Amelia Saltson", "The Ojou-sama laugh at the end got me lol", "Idk what the laugh is but it got me too", "are u sure its a laugh?", "Appreciate it and then google the reference the laugh that the comment phrased.", "@SteamPoweredTwit thanks for being polite mate <3 was worried for a sec", "@Fernando Fernangomez No. Searching the references will lead you to a blessed road.", "Stream start!: 2:43\nHiccup count:\n1. 4:05\n2. 8:08", "We shall watch your career with great interest.", "Not all heros ignore the gameplay and focus on hiccups", "A god among us.. why does she hiccup so much?", "Chad", "Wow legend", "@Joshua Park She is actually burping from all the gamer drinks she had, she just genetically modified her body to hiccup instead of burp because of the waitress job she had before.", "40:08 The Ameliambulance", "Lol", "Car brake sound 1:46:37\nMachine gun sound 1:46:47\nOur Mom Last night 1:47:31 + 1:47:42\nEnjoy Fellas!", "LMAO", "This is all I could ask from an Idol\n\nI wonder how is this being translated to japanese", "2:00:54 Ame Ojousama got me", "Ohhhhhh hohohohohoho~!!!!", "looks like she's sad to me :(", "@Fernando Fernangomez wdym shes not sad", "3:02 and 38:58 for Amelias face reactions. My belly hurts from laughing so hard.", "Amelia just outperforms herself in being adorable today <3", "1:30:38 \"King Crimson! Aside from me, all time is erased from the world!\"", "What happened?", "@Tactical Noobher ethernet cable came loose? Not sure but nothing bad happened.", "@Aaron Milan stream went offline for a second", "@Tactical Noob She probably smashed something that knocked out her internet in her rage lol", "10:25 Real talk. Ame is giving terrible financial advice here. A far better strategy to build credit is to take out a loan from a bank and pay that off slowly. This means you don’t have to deal with the insanely high interest rate of a credit card.", "You can tell her financial advisor really did her dirty.\nIf you follow Ame's advice, you might as well just gift your bank your paycheck.\nPaying off a car or student loan is enough to improve credit score to a point where you can easily get a mortgage.", "Captain BaseBallBat-Boy I managed to get a $1000 loan from my bank to pay off over a year. The interest totaled just $50.", "You should tell this to amelia in twitter", "Luca I don’t have a twitter account, nor do I want one. You can do it. Also, tell your friends to tell her. And their friends. I’m about to post on reddit.", "Id just leave it at that and not bring it up again, the topic will just get messy imo", "CupOfWhiskey it did.", "@Chris Jackson did it? I know people were talking about it and whatnot but I don't think it became a huge deal", "CupOfWhiskey it wasn’t a huge deal. But it was messy considering I’m a literal nobody on reddit. People claimed that I was wrong, then proceeded to downvote instead of doing any kind of basic research.", "@Chris Jackson can you link me to it?", "Master Dungeon https://www.reddit.com/r/Hololive/comments/jkku92/amelia_is_being_scammed/", "You can use a credit card for all your purchases to build credit without having any interest though. As long as you always pay back full and on time, you won't have to pay any interest. Surely this is the easiest way to build credit?", "KeepYourselfSafe you need some credit to get a credit card. But essentially yes.", "Lol, I heard this live and was  laughing my ass off. Guess she doesn't have to worry about money since she makes a fortune doing YT.", "@KeepYourselfSafe Basically, yeah.  There's a fairly wide mix of factors and they vary between the bureaus, but the big ones are payment history, credit utilization, length of credit history, new accounts, and types of credits.  Roughly 80% alone comes from your payment history, your credit utilization, and the length of your credit history.    ", "@Chris Jackson thanks bro", "@Bandam yeah....or her financial advisor is doing her bad", "This is good", "Huh, the comments ain't that bad (in my view) and there are some valid talks there\nOr maybe it's just that I don't understand Reddit", "Master Dungeon it’s improved. The main issue was the guy saying we should “let her live her life.” It’s true but it misses the mark. It isn’t about the money, because Ame will be just fine. It’s about the scam. Also, at one point, I had something like -20 karma in total for some of my comments. The ones telling someone that they didn’t know how cards worked. Also, when I said it had gotten messy, that was over 12 hours ago.", "@Chris Jackson \"let her live her life\"\nOh gosh, that dude, left me a bad taste after reading", "Master Dungeon exactly. I agree with the basic idea, but I don’t think it applies when theft is concerned. It frustrates me that it has about the same amount of karma as my post.", "@Chris Jackson well, at least most of the current comments are rational and constructive\nAmelia is a moderator in the Subreddit so one can hope she has been brought to attention your post for herself.", "@Chris Jackson  but other than that, I don't agree totally with the whole basic idea since but yeah, that point was totally irrelevant in regards to, as you say, the issue of scamming", "Master Dungeon possibly although I should note that her account has no activity. She has a single karma from a post that was presumably deleted. If I had to guess why, r/hololive’s auto mod removed her post since her account doesn’t have enough karma. She also has never commented on anything in the subreddit, which makes me think that she generally isn’t very active on reddit. It is unlikely that she has or will see my post. I made it in the hope that someone with more notoriety would see it and they would say something.", "@Chris Jackson >going on reddit\n>ever\nThat was your first mistake.", "On Today's Apex Stream..\n\nChat gets blocked  06:57\nAmelia stalks the chat 38:57", "Lol stalking is an interesting word to describe what that was.", "That's what she said, I was there!", "How did u get those emojis?", "@#EditingForLife those emotes are only for members.", "I was in the chat getting blocked lol", "Ruthless", "\"Urgh! You're so needy Bubba!\"\n\nGod I'm so jealous of that dog", "That ojou sama laugh totally jumpscared me", "52:52 keepin this timestamp for myself lol", "mouth noises", "This was a fun stream I really enjoyed o7", "What do you call a bullet proof Irish man? Rick O'Shea.", "bu dum, pshhhh", "Really nice stream! Is it just me or was she a bit more energetic today? She was really cute and bubbly I loved it", "6:55\nShe rejected a shishiro botan...", "Good chill stream, in a way. Kinda mixed in with baits , idol meetings and that Gerry one hooo boy. Good progress.Nice ojou sama impression. The puzzle for the day is Ina's head and Ame's cap.\nThanks for the stream.", "1:58:37 \nThe mad lad did it...", "She ain’t console gang. That is all.", "disclaimer i haven't watched the entire stream regarding credit cards . PAY OFF YOUR BALANCES in FULL whenever possible. your score is a combination of length of...\n Credit history(the average age of your active accounts), \nYour payment history(1 missed payment hurt you for years), ", "Basically it is much better to pay your balances as quickly as possible?", "@BoyMadeEvil if you can afford to do so then yes( don't drain your savings or emergency fund). interest can add up quickly if you are carrying a balance. you can build credit by simply having your phone bill linked to a credit card and paying it off every month. i recommend credit shifu and ask shelby for a more detailed break downs and credit karma is a useful tool for tracking TRENDS in your scores. the numbers themselves are off by a few digits", "@Rasen yeah definitely pay your card off but make sure to use it. Same principle without the added interest accumulating. I used to do what ame did and it just took longer to build up and I didn't realize interest added up. Been at 750 for a while and I think that's pretty decent at my age", "regardless of different country system etc the basic works the same, pay off all in FULL if possible, that established you as a constant good paymaster.", "Wow ok, thanks for the reply will keep that in mind", "Here's your daily update on those numbers in the description, so far we have: 23,-1,5, and 13.\nDoes anybody know what these numbers mean yet?", "23-1=22, 22+5=27, 27+13=40", "@Arc lieutenant Jesse But what kind of significance does the number 40 have? Maybe we don't have enough numbers yet.", "@Blooper {Reloaded} Probably. What about other channels?", "Hold up, now we have another 13 in the description. But that could be there because she doesn't want us to miss the last number as the last number given was during the karaoke stream", "@Gacha took the kids No, Ame is the only channel with numbers hidden in the description. I've checked", "@Blooper {Reloaded} does it have anything to do with how many videos Amelia has uploaded or how many days it’s been since her debut?", "@Arc lieutenant Jesse Not too sure, it could be a cipher for all we know.", "It's too complicated lol, we need more clue and number", "is she giving us an iq test? lol", "@HalfAssedHero 😂", "Guys! I found in reddit that may be the clue for this numbers! They use +2 to all the numbers and converted them to letter (e.g 1=A)\n23+2=25 > Y\n-1+2=1 > A", "@Kyoro Kazoyori maybe is a sentence or maybe it's just yagoo", "@Vizer Yeah, but who knows there will be something", "@Kyoro Kazoyori We will just have to wait and see if there are more numbers then I guess.", "For some reason when you did the cat impressions my cat ran to my screen and meowed back", "That laugh at the end made my day  ", "Ame ojou-sama ( ͡° ͜ʖ ͡°)", "41:59  She said number eleven !!\nSomeone has to make a clip with that hahahah", "No fair Ame, just when you got me addicted to your first BGM you changed it! 😩💦", "With the release of the new season 7 features, I wonder if Amelia is going to set up a club in Apex, or maybe not since it might not be worth the effort to maintain.", "That ojousama laugh got me good 😂😂😂", "Thank you for the stream! We got baited for many times, you did many impression (including our moms lol) and a bank problem lmao. But we really enjoyed that! (Ame's rage make the stream scared for a bit lol)\nP.S: Ame-ojou!!!", "Cilantro is my favorite herb. I always feel for the people that say it taste like soap. Mexican/Latino foods would not hit the same. As a college student only herb I actually buy fresh.", "2:00:55 Evil Laugh", "2:00:55 ho", "poor ame when she said they were stream sniping <\\3 sounded so hurt", "Please give oujo sama outfit as her second custom ame papa !!!", "The cleanest shots hits pt 7?\n6:51 26 kill game\n17:01  volt dropped\n19:10 re 45  dropped", "2:00:50\n\nFound it", "thanks for the stream, amelia~ ^^", "Amelia never give up the high ground.", "1:58:25 best answer.", "So no one is going to talk about the blender impersonation?", "I love the new BGM, Watson", "thanks for the stream amelia~", "I think you tried the Alt-F4 trick to try to fix the lag issue. \nUnfortunately it's a bit unreliable and can cause connection problems.", "1:46:12 candy", "I want fanart of amelia taking a petting break for her puppy", "Ello <3", "cilantro is just grass w/ attitude", "Mini maps are already distracting enuf. >_<", "Good luck sachiowo and Rebecca :)", "So.... no one heard the OHOHOHO part ?", "No candy was harmed during this stream", "Ame likes eating Soap?!!??!", "muito foda", "somebody please tell me why people are donating 500 dollars to a prson they have never seen\nlike i dont understand", "support, that's it. supporting something that makes them happy", "what is so hard to understand? people just support whatever content they enjoy.", "YAGOO?", "Poor bubba doesn't get to sit on the desk:(", "Hi", "meow :)\n1:50:02", "งง", "ง", "nice", "I wonder what if there’s a connection between tasting smells, and seeing sounds?", "Synesthesia", "@Ryan A I learned that from Persona 5 Royal.", "@Blooper {Reloaded} I did a study on the differing types for higher education. I believe our paper was called \"Inducing secondary forms of synesthesia and primary forms in non-synesthetes", "@Ryan A Ah, I see.", "I feel like chat is getting better", "So is Amelia, like damn i didnt expect that Ojousama laugh", "งง", "งง 555", "@7 ด.ช.ธัชสิษฐ์ รุ่งเมฆารัตน์ amad3001 555", "ง.งู?", "งงเหมือนกัน =_=", "The FitnessGram™ Pacer Test is a multistage aerobic capacity test that progressively gets more difficult as it continues. The 20 meter pacer test will begin in 30 seconds. Line up at the start. The running speed starts slowly, but gets faster each minute after you hear this signal. [beep] A single lap should be completed each time you hear this sound. [ding] Remember to run in a straight line, and run as long as possible. The second time you fail to complete a lap before the sound, your test is over. The test will begin on the word start. On your mark, get ready, start.", "I'm sorry, Amelia but with all due respect, but if I do as you advised in regards to the financial stuff...yeah, it's might as well that I send my whole paidcheck to the bank\nOther than that, awesome content as alwaysssss"]