["Big papaya energy this stream", "Yes", "Indeed", "Agreed", "I haven’t catch the stream, can you tell me what’s papaya?", "@Not Janny pp", "Big papaga energy", "@Not Janny it’s what shriek says in that one movie", "Every time Amelia disappears down behind her desk I imagine she sits in the space under the desk and plays with toy cars for a few minutes. Just my brain wandering off.", "The iced tea is removing all our hics, how can we remove that beverage", "BLASPHEMOUS", "I thought she was having tea because her throat was sore lol", "@Sigma.シグマ k", "It should be destroyed", "It must cease", "Still, we got 34 hics this stream. We need further analysis.", "The Boston tea party", "She likes to queue solo instead of with a squad because she doesn’t get to insult them without feeling bad. Very interesting Detective Toxson.", "Meanwhile in the kiara kart stream...", "Lol", "Once I shot a man with a paintball gun just to watch him dye.", "Lol every time in every video I see you with these jokes/puns. There good though", "@Arc lieutenant Jesse 👍", "That's one of the worst joke I've ever heard....", "@My name ain't valstrax many more😁", "This guy's FUCKED", "OK, stop pun-ishing us. We did nothing wrong!", "You guys went too far , I'll have to start administering some pun-itive measure", "@Chaos Chris I don´t hold back any Pun-ches", "@My name ain't valstrax Bring on these measures I don´t care as a Pun-k.", "Bu dum, psh", "Epic conversation", "@Casual Filth Modern day pun-ditry is out of control!", "@Chaos Chris Nevermind that, other than jokes its importance is pun-y to me =)", "Amelia secretly enjoys lewd content and jokes about her", "\"secretly\"", "openly", "She made lewd vids in her past life...", "@Uh Oh this isnt the place to talk about past lifes.", "@Uh Oh Wait how do you know?", "@Uh Oh Wait, what?", "@Uh Oh how did you know this?", "@Uh Oh wait what? i know of her past life but i never knew of her lewding herself", "Wait Amelia was lewd?\nAmelia: Always has been", "well she has a harem so of course she likes it.", "@Darkvoltinx since when did Amelia have a harem xD", "@Jed Gian Paulo Rosario i have no idea how the joke or whatever started but all of  hololiveEN is amelia's harem. so i am just going along with it.", "@Darkvoltinx just follow the flow of the river haha", "@Diza - \n*activates time machine\nAmelia : VrtrHhrrrRrrnnRrnnhhh", "@Jed Gian Paulo Rosario i like the joke. so i will continue it. also there has been some cute flirting between Ina, Gura, and Amelia.", "Amelia has said that all of holomyth are her girlfriends. That’s where the joke came from", "1:07:02 - 1:07:40 ah, the innocence", "Please stop stream sniping her, let her play her matches properly", "they wont listen sadly.", "@Darkvoltinx why not (attempt to make her rage quit until stream end)", "She was rocking the bikini for roughly 3 hours today wow!!!", "3:04:44 if you want to unlock a new fetish: EYELID ASMR", "Wonder what’s next", "Sounds like spider in minecraft", "thats the most fucked thing ive heard all week", "Tis a blessing ASMR ", "🙏", "remember when we thought Ina was the lovecraftian monster?", "Honestly, the chats reaction was hilarious lmao", "I'm so proud of this community", "I-", "That sound made me want to gag", "\"im not lewd\"\nthe top left image at the screen:\nwhat is my purpose then?", "If she actually watches John wick it will be a blessed stream", "38:34 Consequence is free \"ara ara\" at the end of stream.\n\n1:36:15 Amelia denies the truth", "That piano BGM is catchy as hell, especially when Amelia sings along. I need the sheet music so I can teach myself to play it.", "Thanks for the awesome time! I was really looking forward to this stream since it was the only FPS you had on schedule this week. You ended on a good round", "Opening OBS as administrator may help with lag and dropped frames, I mean if that is what you are using.", "Warning...", "man that minimap sure is distracting", "What moment is when she say \"GG is not being toxic\"?", "Congratulations for the win\n3:59:50", "I dont know about you Amelia but starting and ending a YouTube live stream is lewd", "2:18:48 While I haven't smoothed out all the rough edges yet, I did teach myself to play \"One Summer's Day\" on piano. That song is beautiful, calming, and deceptively difficult, for me at least, to learn to play. Keep at it Amelia. You'll learn the whole song with time and practice.", "Video time: 3:59:58\n\nMission failed, you'll get 'em next time. Also, grats on the win!", "Ok im late again :)", "Amelia, I really love your FPS game streams despite not being a fan of them myself. I found out about you only a few days ago and I'm now going through them all. You're so chill to watch and it makes me want to try them out myself! Thank you for being the person you are as it's helping me out quite a bit during these times. Amelia op shooter!", "Her yawns are kinda like Matsuri’s", "I can't wait for the next bit of ASMR.", "Ight its confirmed this is the most cursed hololive en member.", "NOO! ME LO PERDII!!! 😥", "Ame will one day will awake me from something i Dont Know i had\nAnd BOI im ready for it", "The level of her self awareness is comparable to the mountains of Maldives. And toxicity to Chernobyl", "I love her humming throughout the game", "Fanfare ch going to clip that \"papaya\"", "Chat needs to educate themselves.\n\n\"Jingle Bells\" is public domain, has been for a long, long time. It's perfectly safe.", "Nothing is safe with these greedy companies", "Amelia : Jovial, It's a good word but who uses that word ?\nPokemon players : :'(", "apex with Amelia and Calli. that sounds like fun", "Ame reads fanfics who knew...", "THIS IS MY DREAMMMM OMG I LOVE APEX SO MUCH AND I LOVE YOU AND GURAS VIDEOS AGHHHHHH", "That is one sexy map", "Ngl, the thumbnail is neat, but imagine amelia got her gamer girl costume in the future", "She is so good in that game", "3:37:26 Yahallo button", "Oregairu refrence", "neuron activation", "excellent game very good way to play you really play very well I congratulate you, keep it up and thanks for all your effort 👏", "S tier stream", "After watching her since her debut stream I’ve come up with a conclusion : Amelia is xQc but anime girl.", "Papaya song!", "Genius...", "i luv u", "Oh man the amount of ads at the beginning of the video", "Yep, YouTube is a fuckhead.", "It is kinda nuts.", "Thank you for the wonderful stream!\nAbsolutely adore your gunslinging hijinks.  You bring so many TeaMates a genuine smile to their face.\n\n3:04:39", "What level are you ?", "31:52 I’m sorry Ame did you say SALT?!?!! Why is no one talking about this ?!?", "It enhances the flavor of bitter drinks", "This game is fantastic and so cool", "pls buff mozambique", "Mozambique with Hammerpoint is pretty much a one shot already", "btw you play much better when you are relaxed", "totemo kawaii", "Bloodhorny?", "... do you mean bloodlust?", "Thank you for stream amelia was fun, even if i was there half stream", "ame: my tea is strong\nme: strong enough to kill corona? if yes give me if no give me it to", "why is she cracked bro", "13:34 - 13:44", "Wow she's actually REALLY good at apex", "She seems decent at shooters in general.", "You're badass", "PAPAYA IS A FRUIT", "", "Amelia playing apex she could play with zylbrad", "SHE IS LEGAL", "wait a minute.... if she's been breathing for 18 years...... LEGALLLLLLLLLLLLLLLL xP", "Hi", "hi", "hi", "Brring", "Hi Sherlock or Watson wannabe girl", "Is Amelia British?\nAlso my onii chan likes you amelia\nWould you care to like him too? \nLol", "American.", "I'm a girl with the same throat conditions as Amelia's  and it got me harassed for three years instead of constant love and simping, so simps are WRONG", "Are you saying you want to be simped for now?", "Ah, so you want to be simped then.\n\nSeriously, hiccups are a thing and the people that harassed you for that are just dumb.", "No I'm saying that women aren't worshiped for everything they do, it got so bad that I had to call the police because they wanted to take creepshots of me in person", "@BEHAM Yotoi Ah, I see your point.\n\nWtf? Are the people you encountered just pure asshole?", "@Robert Kristian Zambrano I know Chrischan gets spammed on the internet but he's the best example of internet harassment. They planned to do something to me  is all just like they did to him", "@BEHAM Yotoi I will truly never know what drives people to be an asshole towards the most stupidest of things.", "@BEHAM Yotoi that's rough", "@boymahina123 I know.. the simps are wrong sometimes", "@BEHAM Yotoi I mean, i wouldn't take advice from people that throw disposable income into zero personality \"tiddy streamers\" (VTubers are better streamers for the most part)", "", "can i get a superchat????? :D", "Notice me please Amelia-senpai!", "ahh the old \"DON'T STREAM SNIPE HER\" comments. \nWorks every time, right?", "it was me say at some translate video to snipe her until stream end", "DUDE you look so great in that detective outfit!!!!! my friend loves watching you!!!! you should like totally stream with him! POGCHAMP", "What are you talking about? Are you new here?", "hi awesome video nice", "This woman has better at aiming than me", "Im stream sniping her\nEdit: jk m8 chill", "I hope she finds your comment and shadowbans you from her channel*. Stream snipers can be fun but it's one of the reasons why she only played Apex once this week.", "Why don't you just not do that", "Hope she drops Apex altogether. It's such a terrible game.", "Can you not please. Your ruining the stream and thats why she never streams other fps games anymore", "All we need to know is that she can do what she wants and that ur a shitty person nothing more nothing less", "@Sigma.シグマ impossible, she might be playing apex offline though, she just loves apex too much", "@Mad Tech Yeah, I know she's playing on her own time but I like watching her play lol", "@Sigma.シグマ its a joke chill", "don't tell you snipe her here (tell on some cut clip is better as she not check those much)"]