["Watson carrying for the first half: “Pro”\n\nEnma joins: “Let me introduce myself”", "Is it enma as a short for\nhololive ENMAnager ?", "@Kudo Shinichi \nYes. En as in English. Ma as in Manager.", "@Kudo Shinichi they're the monarch of yokai, that's just their name", "Uh, scuse me, I'm sorry - but Amelia was still first in practically every category.  And she was playing with messed up internet, the ping was awful, her controller was unplugged, Bubba was distracting her, the game is buggy and broken, and... and...", "@Uncle Biff cringe", "@KaitoTehMeme This is satire, sir.", "@KaitoTehMeme cringe", "@Uncle Biff Simp", "@Kimberley Jaime simp? Do you mean shrimp?", "The girls: Literally dying on the ground\nEnma with the lowest hp on the red:\nSurvives and manages to heal Ina and the others", "She the real MVP", "Enma literally melee’d down a tank with 1 hp", "Manager is a girl??", "@Nadeko nya yep", "@分かっているよ For real?", "@Kesk56 Just watch the stream yourself. Ame herself said it multiple times", "@Redan Dinata NOICE, I’ll start simping right now", "@Kesk56 We all do now", "Woman or man I’d still simp for Enma", "Enma?\nAme: kinda sounds like something else\n( ͡° ͜ʖ ͡°)", "Chad indeed https://www.youtube.com/watch?v=DFfutMHp7io", "@Eh enema?", "She OP", "ame not understanding jokes and inadvertently killing her friends inside is just peak comedy\n1:30:12\n1:33:55", "It’s like the chat trying to make jokes and Pikamee not understanding it because she’s like 95% fluent in English. So that other 5% makes it impossible to understand dumb dad jokes.", "Oh no, she definitely understands them. She's just bullying the shark for bad jokes.", "Enma-san’s back must hurt so hard right now", "Tank, healer, and DPS. Serious chad energy. I wonder how many hours Enma-san has put into the series? Probably over a thousand combined, at the very least.", "She carried harder than Atlas.", "@Yourson Isold Impossible.", "Enma-san is legit MVP. Not only did she top the leaderboards, but she also maximized the health kits by falling at least once and losing most of the temporary health. It's a way to play at higher difficulties!", "Indeed, it's a pro strat for multiple reasons. First, you just don't get that much health and second, and most importantly, it keeps the director in check. If you do too well on the higher difficulties, the director will massacre you.", "So she's playing actual l4d strats, might be a veteran at this, i didn't even know that", "@Tenchou yep, pretty sure she is.  Intentionally taking damage and wasting health kits forces the director to slow down.  We use to do this for L4D extreme realism clears.  It can help cheese some mechanics and stages.  Enma-san also knew where spawns were to for items, weapons, and enemies.  She def played PVP at least to, by her movements and play.", "The amount of time Enma-san survived with low hp is legendary.\n\nI expect some Enma-san Fanart on twitter thanks to her god tier performance.", "Yup\nhttps://twitter.com/pomp_maker1/status/1322094179804065792", "I think Amelia and Gura aren’t toxic they just let  their inner goblins out at times lmao", "Their inner goblins are toxic af, and we love them for it", "As someone who regularly play games on SEA server, their (ame and gura) toxicity is as harmful as just eating candies. Meanwhile, the SEA's toxic is like eating legit poison lmao.", "@Godut Everest ikr. After playing with SEA playerbase, Ame/Gura seem kinda sweet even", "I think Ame is starting to find a better balance but people still call her toxic at the slighty display of competitiveness...", "@Real Hime tbh “toxic” is just another way of saying someone is jerk-ish in games past that it’s a meaningless buzzword", "At least imo that is", "ARE THEY GOBLINS?", "gura gremlins", "@incognito sweet? I think I could rule them as nice", "@Godut Everest SEA server is always toxic not just in L4D. Ranked dota probably the wrost I've ever seen", "@An Asian From Asia Yeah literally in every online game lol", "I still feel she’s finding her balance, she’s just saying the kool things  to Attracts ppl, I don’t judge on her toxic because i think we can all be toxic its just we don’t have 10+ ppl watching just my thoughts", "Inner? They ARE the goblins. xD", "They are toxic and that's fine.", "@Danny D. \nToxic is a cover-all for being negative, offensive or mean spirited. Basically poisoning the experience of other players.   \nJerk-ish is just another way of saying someone is an asshole, past that it's a meaningless buzzword.\nAsshole is just another way of saying someone is a prick, past that it's just a meaningless buzzword.", "@Godut Everest true even specially if u know the game ml", "@Real Hime thats the point of the joke", "Enma-san, the breakout hit, the legend. Hopefully one day she'll get an avatar too and be a recurring side character for EN. If the girls play L4D2 again, someone has to be there to carry them and rush the tanks.", "So..... Enma 2d avatar when? We need it!", "https://youtu.be/0gmQjWi53Rg", "I don’t need it, I don’t need it, I don’t need it, I don’t need it.........................................I NEED IT!!!!!", "@Kawaii Ina I’m sorry sir it’s time for you to leave.", "@Kawaii Ina her mic sucks", "@Kawaii Ina I see. So bread cheeks is your alt account", "@Arc lieutenant Jesse Thank you Temuera Morrison", "@Anthony Milligan its a he", "Indeed we do", "@Positivitea I’m just a simple man trying to make his way in the universe.", "@Kawaii Ina cringe", "I feel a little bad for them; their solution was to just let the manager reserve the slot so no random ruins their 3 girl collab and originally she was just meant to afk to not distract attention away from who we're here to see... and what do you know, all the comments on all their channels and chat are now about \"Enma-san\".", "Enma carrying the whole game\n\nRESPECTS", "carry hard,makes me wonder if she’s a pro at L4D", "https://youtu.be/0gmQjWi53Rg", "Whole", "@City Of Figs Thank you", "2:44:22\n\n\nEnma-san just debuted and Amelia's already bullying her :o", "https://mobile.twitter.com/Moe_Baku/status/1321983986931884032", "The girls: Having some difficulties with the stream and in the game\n\nManager-san: Say no more", "https://youtu.be/0gmQjWi53Rg", "@Kawaii Ina can you not?", "@Kawaii Ina no mediocre knockoffs here please", "@Nicholas Nguyen mark as spam and ignore.", "@Kawaii Ina you like your own comment? Disgusting", "1:19:06\nIna: powder form bacon\nAme: And you snort it \nIna & Gura : ...... WhAt!?!?", "This is the defining moment of Enma-san's chad glory. 1:59:07", "“I had the most team kills”\n“It was the controller”\nah yes,Amelia being toxic even in L4D", "I am going to be honest guys Enma stole the show, i think i fall in love for her lol.", "https://youtu.be/0gmQjWi53Rg", "Starting today I shall shrimp enma chan", "How do we know exactly she isn't a \"him\"", "@nano-peko because Ame calls Enma a she multiple times in the video, also iirc, Kiara has also mentioned their manager is female and called them a she in one of her videos, cant remember which one though", "@MEE6 yeah. Just watched that part lol\n\nMissed the stream cause fucking school", "nano-peko wish I could go to fucking school", "@MEE6 That would conflict with what Marine has said, she met with a male hololive en manager https://youtu.be/DFfutMHp7io\nMaybe they have 2? One based in JP and another in NA?", "@Misa Tai im sorry, but its even stated in the description that the translator didn’t know the gender of the Manager, and Japanese mostly use gender-neutral pronouns", "@MEE6 ahh, that makes sense. No need to be sorry. i get EnMa is girl after this stream, just thought there might have been two managers, or some other staff that marine met.", "@Kawaii Ina I'm starting to think Bread stick is your alt account", "@Kawaii Ina don't bother Bread\n\nJust don't", "@Misa Tai Well they did call her a she in this stream.", "ENMa (EN's Manager-san): joins the game\n\nThe Infected: \"Why do I hear boss music?\"", "lol i never noticed that", "Enma(Manager-san): *Joins stream\n\nTeaMates: ", "\"I must simp but she has no channel...\"", "Maybe she'll get one like A-chan", "A-chan doesn’t actually have her own channel. She just has an avatar. Every time she appears on stream it’s through a collab on one of the actual members channel’s.", "Enma avatar debut when?\n\nShe deserves to be HoloEn's A-chan.", "Watson : Manager will just AFK\n\nThe Manager : Saving everyone and fight Tank with a Samurai sword", "HololiveEN: 3 girl halloween collab! People will love seeing us play together! Lets not let a random ruin this!\n\nChat: THEIR MANAGER!?? POGGG! ENMA DEBUT WHEN, ENMA MVP ENMA ENMAAAAHH ENMA BEST GIRL", "So, conclusion of today's collab stream,\nAme: Our favourite epic FPS gamer grill/detective\nGura: The lovable smol shark who knows how to kill bigass tanks somehow\nIna: The clueless octopus who occasionally destroys zombies", "Ame: Ex Faze member who got outplayed by CPU and her own manager", "@Jordyn Smith was Ame a Faze member?", "@forgivedawn I guess she was in YoR", "the more damage enma san takes the more powerful she gets", "Ah, so she's a Lucario player.", "\" You can't just punch a hole into the body of a tank. \" \n\nSamuel Hayden Yagoo, probably.", "\"The Salt perverts the Bacon\"-  Amelia Watson.  Big thanks Manager-san Enma for helping out / Who's Denmark's greatest Zombie actor? Rigor Mortissen", "Dude. The day i dont see ya with your puns is the day i will legit worry.  Cheers man.", "@Phoos Phofilite haha till now I had amazing luck with my schedule, but even if I can´t make it on time there still will be a comment even if it is buried down there! Thanks for pre- worrying =)", "And then you snort it.  Explains a lot about Ame", "Ame: trying to heal Enma\nEnma: healing is for the weak", "We would not have gotten this great content had Watson not ask chat if Enma-san could play with them. Thanks Watson, and to you too Teamates", "Let's hope for many future appearances of Enma-san, the absolute GIGAchad.", "everybody gangsta until Enma-san starts charging at the Tank with a katana", "2:01:14 \n\"what does this do?\"\nloud explosion\n\"interesting!\"", "The fact that it's all off-screen yet we hear all of it perfectly made that funnier than it should have been", "EnMa-chan = Phantom 6th Player, carrying the generation of Miracles", "I just realized: Enma-chan is the girl from Jigoku Shoujo. No wonder she's adept at slaying.", "Someone:\nSo, who's best girl among the HoloEn?\n\nMe:", "Yagoo giving enma a raise as we speak", "every holoen member: no one left behind \nMe: flash back\nOkayu: bye bye~!!!!!!\nBotan: She is fine!!!!!!", "The polka let me in clips 😭", "2:37:30 \"He can't get up here hehe\" famous last word", "Nah gura said he can't climb she jinxed it", "@notkiller56 :p gura always jinxed herself", "1:31:08\n\n\nChat makes the best decision and a legend is born!", "I can’t believe she actually asked as if we wouldn’t all say yes", "democracy", "Enma-san refusing to heal most of the time but still tanking is amazing", "Well you should only use medpack after you downed two times (Screen turns Black & White) or before a major Rush so that you don't slow down the team\nOtherwise you better use painkiller or adrenaline to heal\nEnma-san is definitely a L4D2 experienced player", "@Hanley ah,I wouldn’t really know asI either melee to get out of tight spots and rush or stay away from fights", "2:28:33\nEnMa-chan: YOU SHAALL NOT PASS!!", "Enma-Chan is so hardcore...\nShe should be known as Punished M-San", "Holomyth  is actually a backstory for Enma's character.", "Enma probably used to play this game, she only healed when she got B&W", "Commenting so i can prove to my future children, that today, i saw a legend being born", "I’ll join you", "I'll join you too", "1:29:49 - Gura cracks a chuck norris and dies inside trying to explain it to the both of them lol", "2:21:19 That enma clutch tho", "moog", "2:06:40 \nTHE ABSOLUTE CHAD meleeing a tank!!!", "So is EnMa basically just English A-chan?", "No, A-chan is just a staff that is also Sora's friend, not the manager", "EnMa is english Yagoo", "Enma is a being too powerful to be compared to A-chan. She is EN's secret weapon, the ace up their collective sleeves.", "Everyone in chat going nuts over Enma-san, and I'm still in shock that Ame admitted to a morbid fascination/thrill with the thought of dying in a roller coaster accident...", "Don't people always think of dying?", "@Rawr Dino Yeah, but Amelia expressed a bizarre form of excitement for it.", "@Uncle Biff I do that alot thats not normal?", "@Rawr Dino Eh. I'm the last person try to decide what is and isn't normal.  I give money to anime girls playing video games on the internet.", "Watson’s battle cry 27:48", "2:31:35 her laugh is precious 🥺", "That a straight villainess laugh, when Ame successfully ground pound our moms.", "lul she purposely threw the game, lal what a troll. www at Goora:\"Are you kiddin me\"", "Also that Gura \"Are you kidding me\" was perfect.", "Enma-san has cemented herself as the de-facto MVP.", "2:31:34 oh god Amelia hold your laughter poor Gura is getting mauled and you're laughing!!", ">tfw you excepted someone else to do the hiccup count, yet its 3AM and here you are doing it yourself\nYou better drop a nice comment, Teamates.\nStream start!: 3:30\nHiccup count:", "who is this chad", "Thank you for your service sir", "The hero we need and deserve.", "1:35:33 Manager-san\n1:46:17 Gura chainsaw perfect timing\n1:47:23 \"we need to jump off the balcony\"", "Ame: I MELEEEED!\nGura: Lasersight\nIna: What?\nEnma: PURE CHAD (MELEES TANK WITH RED HEALTH)", "1:56:33 \"Watson, is that you?\"", "She crazy lol", "When Mori Calliope ruled the WORLD and finally got rid of Kiara.\nLeaving Gura, Watson and Ina to survive on their own.", "Naaaaa Kiara and Calliope are totally running the show together", "Incredible stream, also EnMa steal the show in the second half of the campaign.\nWorth stay up late this time.\n\nNew legend is born?", "\"The Only Thing They Fear Is Enma-San\"", "And thus the legend of Enma-san was born", "All the gameplay from Enma makes me wish we somehow had her perspective as well because damn she kicked ass lol", "1:36:21 Is Gura tall enough to die?\n1:41:29 \"Ah yes, if this isn't the consequences of my own action.\"\n1:47:23 Jump off the balcony \n1:51:48 Ame missing 4 headshots in a row on the same zombie ", "I like how literally half of these are just Enma's chad moments", "31:10 \n~horde of over 20 zombies + a charger swarming ame~\n\nAme: “I’m alright”", "Petition to make EnMa-san Fanarts", "what Yagoo wanted: A group like akb48\nwhat Yagoo got: 3:01:58", "Can ENMA appear more often? I'd be okay with that. :o\n\nEdit: For the curious, Advanced and Expert mode up the AI difficulty and special zombie reaction time and stuff, not just the damage you take. :x", "1:17:23 Ame makes Ina and Gura double-take three times in a normal conversation about bacon", "EnMa-san carrying with low health", "Start 3:31", "This sounds like a joke\nA shark, an octopus and a detective walk into a bar", "they should do a lfd2 versus stream, like one gen plays zombie another plays humans, each side on different comms", "Lol, nobody tell manager san that she can use \"take a break\" option to take the slot without playing at all", "We would've missed those great content if she did.", "Actually Amelia put that vote to the chat. No one was disappointed.", "Amelia: warns the girls about shooting the cars\nAlso amelia: shoots the cars", "Enma entering lobby:\nmenacing background noises", "1:30:11 for Chuck Norris fact", "“Was that a joke?”", "We need Enma 2d avatar now", "Tfw Enma means the god of death", "Enma-san MVP!", "2:56:56 She said what a lot of us were thinking but didn't want to say lol", "Wait I couldnt even hear what Ame said clearly. Can you type it for me?", "@Caffatigued Owl \nShe said \" kinda sounds like something else \"", "@Touch Meたちみ oh my god wtf lmao", "Enlighten me", "@Titan Dweller probably thought it was enema", "@Kaloy lmao 😂", "The scope on Watson's gun:\nAm I a joke to you?!", "Truly, a game that does not age, providing entertainment throughout all those years. Also, loved The Thing reference!", "Ame: breaths\n\nChat: \"TOXIC\"", "What if Enma-san and Yagoo are actually siblings. Yagoo is GOD at tetris and manager san is MVP at l4d", "I was very happy when manager san \nAfter ame finally managed to hack nasa and asked us that beautiful question \nI dropped a tear", "Enma-chan the vtuber we need but we don't deserve", "9:26 FUN FACT: most japanesse co-op arcade games in the 80s-90s have an AI controlling playable characters to fill in the empty player slot, these AI are called CPU\n\nso, a time traveling detective confirmed?", "So glad they got to play this game. I grew up with this game and I found out about hololive and streamers like ameila not too long ago. Such a great mix of nostalgia and fresh, truly a great stream. Reminds me when I was a little kid an I used to play this game.", "Manager MVP Carry ", "In a way, we can thank the awful stream sniper for indirectly being responsible for bringing Enma-san, the woman, the myth, the legend, to us.\nWhat a wild ride.", "Lord have mercy when EnMa is at full hp", "This was so fun to watch! It was great to see Enma-san playing too! They really were the MVP and if what Amelia said about them being excited to play then thats great! When I think of all the work the managers must do behind the scenes it makes me happy if they get to join in on the fun! Hope we see more of Enma-san and other managers in the future!", "Enma MVP ", "Enma's 3D debut with an AK47 concert.", "Any streamer that references King of the Hill (best anime) is a friend of mine.", "This was such a fun stream, well worth staying up till 3am", "i like how gura refused to give up her laser sight. LMAO", "Enma is the almighty diety, god of heals", "Ame snipen' zombies? I bet she'd love Zombie Army.", "I really like the name Enma-san lol. It is also the Japanese name for Yama, the God of underworld in Buddhism. Resonating with the Hololive EN/Myth theme. \nAnd of course Enma has to come out and take the undead back to where they belong lol, it's all according to keikaku", "1:01:54 you could feel that fear", "Yall ever eat sand?", "Enma true mvp!!!", "The thing is, I want the group to play the full campaign, starting from Dead Center: Apartment to The Parish: Bridge.", "But Dead Center sucks. It's the only part of the campaign that's legit bad.", "@Captain BaseBallBat-Boy I mean, no harm in playing all campaigns. Kinda like playing Left 4 Dead 2: Story Mode.", "This stream was such a joy to watch. There were a lot of golden moments that i would need to make a list to point all of them. Looking forward to the next L4D2 collab!", "took me a while to realise it wasn't Emma-san, but Enma-san", "Enma taking HoloEN by storm", "Everyone Gangsta Until ame SNORT THE BEACON", "These girls have eaten every kind of snack between then", "Ah yes, Enma is doing the drug addict pro strat. My favorite strat", "Enma saved the day WTF, GODLIKE POWER", "I’m surprised nobody mentioned 1:41:44 lol. I was laughing so hard.", "L4D2 is always a great time, would love to see more streams like this. Also Manager-san is a legend.", "Kudos to EnMa-san going down from the rescue chopper to save the girls below and cover their escape.", "Enma hard carry", "EnMa-san debut when?", "Enma, the newest member of the Hololive 2\n\nWith Kurokami, Coco Kaine and A-chan", "I play this and my points were sometimes good so I want to play it but I can’t", "Who whould watch Enma Left 4 dead 2 streams? I definitely would!", "Don't apologize for your own efforts. I am so sorry for your efforts!ヾ(￣▽￣)Bye~Bye~", "Enma-cha was such an MVP for this I swear", "Its so loud I can't see -Gwar", "Thanks for the collab! It was really fun, Enma-san is too OP, need some nerf lol (We shrimp for Enma-san too? Say no more lmao)\n\n\nP.S: There's no secret ending, move on", "Her no scope game is on point.", "2:31:36 lmao gura limping towards the hoard and ame laughing. Best moment", "manager-san is bad ass katanaing tank with 1 hp   XD", "ENMA 2d debut when? .", "All the comments: Chad manager", "1:00:02 talk about white knight simping. Let me just hack into the game so nobody hacks into the game like I just did and hasn’t been otherwise happening.", "I m watching this to see enma-chan", "Same", "At 35:25 Ina and gura said Watson at the same time is the cutest thing I heard", "Enma only appears in legend", "imagine for a second, either one of those 3 go do trick or treating without any costume but in what you see here, they end up getting a good amount of candy, and the people that gave them it will look at this now and think \"wait, what in the world!!! they didn't even dress up in a costume!?!\" XD", "enma mvp", "the food talk killed me.. good thing I survived that. that would be my tragic end..", "Enma-san the true master", "thank you for the fun L4D stream amelia~! it was fun watching you all play together o7", "I love how most of the comments is simping Enma and here i am simping for my one and only Gremlin", "1:52:27\n\nYou can hear the Tank croaking...", "So is Enma the HoloEN equivalent of A-Chan?", "can we just say that somebody invaded the hololive stream? TWICE?", "This is completely random but i was playing around with speed and did 0.25x and watsons bgm sounds really creepy very bioshock, also they sound highxD", "That moment when ina charged to witch with a frying pan\n35:30", "I saw Enma trying to jump over the bus in the start lol. nice try", "Boomer Boomer!\n\nSenchou senchouuuu", "come make a left 4 dead mod where all of you are the models of the survivor hahahaha what a miss opportunity", "1:49:44\nJust saving for my own", "1:47:22 for Amelia Whatson moment", "I'm watching this L4D with eating KFC.\nanyone here??\na little tastes like eating zombie flesh", "3:30 START", "The rise of Manager-san.", "27:48 ame being ame", "SPEEDRUN! LEAVE EVERYONE BEHIND!! WAAAAGHH!!! CHARGE UNTIL THERE IS NOTHING LEFT TO CHARGE!!", "More Enma Collab streams soon??", "Enma-san MVP", "Enma the true mvp", "Ame coke addict confrimed", "the amount of times they run in front of the line of fire and still not shoot each other is amazing", "Stream starts at 3:28", "Enma-san and Yagoo collab when?", "Went out to get mackers and stream ended lol", "Incredible stream!! :3", "Even in l4d2 Gura stays in character", "En-ma is just like yuujin-a or yagoo, should just be a support character, but end up stealing the show", "Does the FBI know about this?", "They can't play phasmophobia because it's a 4 player game.", "That random who join ruin the game. Everyone hate you now Speederclaw", "Ngl but majority of us really want enma vtube avatar now.", "We need a Enma avatar", "I haven't played L4D2 in awhile, and them playing it made me want to", "1:19:04 wat\n1:29:00 Gura\n1:30:13 at least you tried", "Enma name meaning: ENglish MAma?", "EnMa for HololiveEn 2nd Generation", "HoloEn and tech issue\n\nName more iconic duo", "Manager says ez", "EN-MANAGER MVP", "Wonder if there is other gamer managers in hololive.", "Yeah okay but asmr stream?", "Also im quite early", "This game is nostalgic", "You do know that this cover was not used in the UK because it displays a rude hand gesture in UK culture right?", "Incredible information my estimated, sadly, we lack the interest and the action of asking your person about this fact, and we pledge you decide to keep it to your person the next time.", "Except its not considered rude here because the fingers are all bent up", "I want a HoloLive EN podcast so bad lol", "the stream is great and all but", "Hololive EN manager", "The fcking legend carry", "HoloEN-MAnager", "God of death", "↖️\n ↖️\n    ↖️\n       ↖️", "Don't L4D2 games get to be PW-protecc'd like CS and other Source games?", "One thing i hate at this map is the witches", "It was mentioned it wasn’t really “EnMa” playing, it was her account and all but it was a male staff member playing for her.", "It wouldn't be the first time a male was the one behind a female vtuber(?", "Timestamp?", "@Leandro Goslean Enma is the manager not a vtuber", "So someone got into their game and that caused the 40 mins of technical problems?", "Yeah. People keep joining so Ame stop the game and try to make it private but she can't do it, then they ask Enma-san (En Manager) to join so the fourth slot would be filled and no one could join.", "@Meikoo R I see, I was only paying half attention and only saw them on the standby screen and Gura saying something about Phasmaphobia, thought they were changing games and left to watch Kiara suffer in Sunshine", "I dont play the game so I cant say for sure but I read that the way the multiplayer works is that once you start the game, the game is put into a server pool that anyone can join so anyone searching for matchmaking on the same map might join their game with there being no sniper at all.", "@Ducilios one of them was def sniping cause he was saying \"leave me here so i can afk\" and stuff", "The one that kept joining was a brony, go figure.\nHe got bullied immensely on the less reputable part of the internet for his cancerous behavior, at least.", "@Captain BaseBallBat-Boy lel really? got a link?", "Manager-san too PRO.\nTHATS IT!", "Amelia x serpias", "I like ya cut G", "", "proplayer manager", "Enma really truely is best Nick", "", "", "Guys, please don’t stream snipe.", "I know Calli is on break this week but why wasn’t Kiara in this stream?? :( :( :(", "Because she was and still is streamimg lmao", "kiara doesn’t like fps games", "And cross sea server lag", "@UsernameSystem yea but if she got invited during the planning phase of this collab, she could've cleared her schedule to join in. She missed such a great opportunity for exposure smh.", "I’m watching her stream Mario rn I think she’s more entertaining on this than she would have been on a game like L4D2", "Different timezones. These 3 live in NA so it's easier for them to schedule a collab with each other.", "@うみさん I thought Gura and Kiara were both Japanese time zone", "@City Of Figs Calli, not gura", "#ripSpeederclaw", "A-chan a shotcaon\nE-chan gamer goddess", "I was bothered with chat, having joined the stream late. It was only „Enma carry“ and sometimes Watson toxic. I joined to watch Watson not to read in chat how much better some other person is", "EnMa is the holoEN manager who joined in to help them and she started carrying", "@King Mufasa I know. That doesn't chage a thing", "We are all sleeping on the real legend that is Speederclaw. lol", "Guys I vote to rename them to Enima just so we avoid any unfortunate mispronunciations.", "Is this an elaborate troll to make her sound like enema?", "@Captain BaseBallBat-Boy I think it's just unlucky. It stands for en-manager.", "“I have like 200 hours, not that much”\nDamn you must not have had a life then", "Typical gamer stuff", "@Kimberley Jaime This game is from 2009, that's older than most of our pubes. I've clocked in 1280 hours on this game over the span of 6 years of playing. Most of them are on holidays and overnight gaming sessions. What's your point lol", "@Wrekt You’re a gamer mate", "@Kimberley Jaime is that your attempt at an insult?", "@Kimberley Jaime Man the game came out in 2009. Having 200 hours in 2020 means you dont even play the game often.", "@Wrekt No it’s a statement and an answer, you asked me what I meant.", "toxic ame at it again kicking players out of the games -_-", "cringe"]