["That thumbnail is what the food in the microwave sees", "MMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMMM ding", "yes", "POV you're Bubba when Amelia looks straight at you", "@Marckus Andrei Narvasa https://youtu.be/Q6GUbgwsN8U", "https://youtu.be/jzuPT8Uk7aQ kiara singg", "@joviebear94 my doggo is also a Bubba... Das pretty pog (mine is a British bulldog, she is fat n very ROUND :P)", "Which death number did you have to wait for until you died at  the microwave diavololi", "@Marckus Andrei Narvasa haha true", "Why would I watch John Wick? I’m just gonna listen to Ame talk for the next two hours straight without any context.", "Sounds like a plan to me", "Yes", "Thats what im doing", "because Keanu is as wholesome as any vtuber.\n\nEven if he is portraying super-murder and ultra-death-killing.", "Keanu Reeves is much better to watch and, you know, it's not a 2D model.", "When you've already watched it so you know what's happening", "@MrCarGuy \nOk, Reddit.", "@Giraffinator DOOG slayer.", "The John wick movies are my favorite especially the third one", "@I am spoopy AHO I probably have an unpopular opinion but I didn't like the third one as much as the two first. It just felt like it didn't progress the story very much. I might remember it wrong though", "poor gang rise up", "*Plays amelia bgm anthem in background", "You called", "Nah bro I'm floor gang so I dont leave the floor", "Real men watched the stream raw without anything else", "Hopefully this is archived for my TeaMate brothers who can't afford Membership", "Oh brother do I have some news for you!", "It was and bless you", "Indeed it was", "o7", "o7", "Nice", "Thank you for thinking about us poor people", "Take 3. I see you had some issues lol", "It's here now, but really who's gonna watch a watch-along when it isn't live? Still, better late than never.", "Well well well.", "@Quiz Kitty I don't mind seeing A watch along vod. I want to see Amelias  reaction to certain scenes & I like the John Wick movies.", "@Quiz Kitty me tonight", "@NinePointEight fair enough. :D", "https://youtu.be/jzuPT8Uk7aQ kiara singg", "TeaTee moment", "@Quiz Kitty ehhh it doesn't really make any difference whether or not it's live. it's not like there's any interaction", "o7", "Bless you kind stranger", "What happened to Amelianaires?", "@uskan she settled on Teamates as the final name", "@Quiz Kitty i dont like the live stuff since you cant pause and i dont have a clear few hours to dedicate to a stream.", "o7", "@Roy Fuentes aww I liked holmies 😂", "YT donos doesn't even available in my country. What a joke.", "I’ve actually never watched John wick, this was a great watchalong.", "First time for me too", "Yeah and now i'm hyped for the whole trilogy!", "Bruh", "If I can ask, does she put the movie in the watch along?", "@Take22 no only the timer to watch-along with her. Must find movie for yourself", "@Sanji Shōn oh. Well in that case, any way we can request movies/shows? Because I really want her to see Taxi, the tv show.", "@Take22 yeah you should ask her when she’s live-streaming, on twitter, or community tab(here). I wish you luck", "@Sanji Shōn thank you", "man u been sleeping then bro", "@slightly amused black kid from the suburbstrue I don’t really watch movies", "couldnt watch it live, but watched as soon as i got home. great movie and commentary! ill definitely try to be here live for john wick 2", "https://youtu.be/jzuPT8Uk7aQ kiara singg", "@Bread Cheeks dude please stop spamming", "Holy jesus the ad", "Im so confused I see no john wick scene there's only amelia on the vod", "@The CourierSix6 She doesn’t have the movie in the video because it’ll get taken down", "I love how ame released these members only stremes. Helps the poor like me", "This is how the rich can subsidise the common people in practice.", ">Ame: asks question\n>Chat: answers\n>Ame: \"Don't spoil!\"", "Ame out here giving us the full gf experience", "Ame is somehow both that person who constantly asks questions during a movie, but also clever enough to then draw her own (mostly correct) conclusions. It's a rare combination, but pretty fun", "This is a test lol as a teammates we have to deduce which one is \"rhetorical question\" or just \"actual question\"", "Shes so TOXIC", "59:40 Jesus Christ... lamo", "The reason why I love ame", "She's so toxic i love it", "Lamo", "John Wick 2 let's go! Your commentary was good Ame, you seemed engaged with the movie and your >rhetorical< questions kept the chat on their feet.\n I also tried to do a drinking game where I took a sip of bourbon every time John Wick kills someone and I ended up stopping pretty early in...", "That'd total 77 shots of whisky, or a grand total of 52  ounces. That would be 20.8oz of pure alcohol if we were to assume a regular 80 proof bourbon. I think that'd be well beyond the lethal dosis when consumed within 90 minutes.\nSo good job stopping yourself.", "Bon clay the 🐐", "@Captain BaseBallBat-Boy challenge. accepted.", "@Sea-Jong Park gud luck", "@Sea-Jong Park Godspeed to you.", "That thumbnail is perfect what are you talking about", "Wait I thought it was a member only? A blessing indeed", "Members got to watch it live, it's posted for everyone else after.", "If anyone's wondering, take 3 is not John Wick 3. She had to re-create the stream twice to get the stream delay settings right.", "11/10 thumbnail", "Ame I love you", "She loves us too", "@Marckus Andrei Narvasa Scientist have yet to prove that theory", "@Marckus Andrei Narvasa She definitely also hates us", "\"Not available in your zone\" Gang Rise up!!", "When the day I will be  alone comes\n I know that Watson will be watching John Wick with me.", "For being the first watch along of you, Ame, it was great!!! Hopefully we can watch the sequels.\nAnd don't worry about your commentaries, they complement the experience and dont distract us, even if it was the first time watching the movie.", "Missed it again ", "", "I just realized that watching this while watching the movie is like going to the cinema with that one person who always has to be loud during the movie... and I have no problem with that considering who it is. Ame's not very puntable when she's loud, uk? 😂", "So happy that you made it public", "Nothing beats watch-a-long & chill with our Amelia-tan~!", "I missed the watch-along since I fell asleep, thanks for the upload and that thumbnail though LMAO", "4:37 she starts", "Very much appreciated", "Got membership specifically for this watchalong. Worth it", "The John Wick series is truly a modern action masterpiece. Can’t wait for John Wick 4!", "I'm happy that it's archived, I'm going to watch John Wick for the 4th time, but this one is special since it will be with Ame", "I really appreciate you making stuff available to non members after a while. As someone currently our of work I don't have Carl money to throw around so thanks!", "Nice, John Wick is one of my favorite trilogy 👏🏼👏🏼👏🏼", "Thank you Ame, very cool!", "The thumbnail reminds me of accidentally turn on my selfie camera", "I really hope we get to 3 because it's one of the greatest action movies ever made", "3:55 Amelia be watching movies that spans days\n5:22 :flushed:", "Man, this was such a \"F*ck It, We'll Do It Live\n\" stream.", "I wish I had a membership so I could've watched this live. Oh well, still can't think a better way to spend an afternoon than watching John Wick while listening to Amelia react to it.", "It doesn't matter. Her reaction is just as  funny", "Good Lord. So many ads at the start.", "How could I have missed this? I love this movie and Watson and yet I had no idea this happened. I'll make sure to turn notifications on for the sequel.", "Don't change the thumbnail. It's perfect as it is 😂", "i would like to watch the stream but im still on low budget\n\nEdit:I can watch the movie while ame is talking \nme:\"😏😏Big Brain\"", "This was my first watch along and I have to thank you for making it such a fun experience! ", "This was a bit strange, but really cool! [H I C] / 10", "Oof I don't know that this stream is open for non members as well XD Would have joined if I knew.", "Thank you for the archive, Amelia 🔍🔎♥️", "John Wick: aka Keanu Grieves", "Started the stream . This should be a meme", "Real talk here. When we gonna have a enola holmes watch along", "I didnt thought I would randomly re-watch John Wick today but ok, we are doing this now.\n1/10 because I cant hug amelia when the dog is killed, but 10/10 without counting that", "I hope you release the 2nd episode for everyone too after some time. the thanks peko.", "Wait, was this for members only? Ame is being nice i see... thanks a lot!", "Ah yes, the stream I couldn't find because of YouTube nonsense lol", "Wow its like I have a girlfriend!", "Ooohhhh Ame is releasing member streams for us :0", "This without context is hilarious background noise", "YOU CAN USE ME AS THE LIKE BUTTON WHO DIDN'T CAME FROM TIK-TOK", "Sadly, I am late but at least this will be the fists time that I won’t watch a movie while feeling lonely.", "Ame's right the dynamic range, at least of the Amazon version of this movie, is insanely large. Dialogue is super, super quiet. Luckily I have some loudness equalization stuff that helps a lot.\nAlso, the choreographers of the John Wick series take high pride in doing accurate ammo counts. Each individual magazine is always reloaded accurately to the amount of bullets they should have. That's why you see John Wick always reloading.", "is it just me that doesn't understand how it works?", "Never watch John Wick but I already watched Gura Wick when Stinky attack her horse and Kiara Wick when zombie attack her chicken", "This was fun! Though dunno why though, but I had to keep on pausing the movie every now and then for several seconds as it seemed it kept desyncronizing.\n\nMaybe due to different region framerates between the versions (NTSC 29.97fps, PAL 24/25 fps) and the movie speed therefor being slightly different? ", "29.97 and 25 are just for TV. Movies are shot at 24 fps. It would be the same for any region.", "The thumbnail is perfect", "I had no idea these would be available to all at some point but I've been meaning to watch John wick so this would be a great opportunity", "It seems to me that Member's only things are just timed exclusives. Because so far (if my math is correct) every member's only stream that was archived was also released to us poor-mates a week after. I ain't complaining, it means I can also watch the streams as well, but I just find it odd, other streamers don't do that.", "That's what I've noticed, the members only streams are almost always released to everyone at a later date. Probably depends on the creator as I know Calli released a batch of members only streams from the previous month.", "This was so much fun! Thank you amelia! Rewatching john wick has never been this much fun", "lel I both watched John wick 1 2 3 hahaha I will repeat this John wick 1 again. :)", "This was fun watching it for the first time with Ame", "Lol, I love the thumbnail", "Wait I thought it just started brrruuuuhhhh 😂", "Thank you so much for the archive amelia I will definitely watch the movie with this on the background :))))", "For a second I thought this was the next watch along stream instead of the public release", "she's a queen for this", "Hmmm the thumbnail E", "I'm gonna watch it now. Thank you Ame", "Blessed Archive :O\nYATTA!", "Best thumbnail for member only streams", "My first time watching John wick Ngl it was pretty good ", "Thank you Ame for making the stream available for everyone!", "You should keep the thumbnail. It really sets the scene for the rest of the video.", "Haha so funny Amelia.. Wait, you're watching John Wick? I thought we were just saying random things", "Love u Ame, love the cinema date(?", "Let's GOOOOOOO", "Thnx Ame and TeaMates for archiving this for us none members ♥️👌", "Whoa. I completely didnt see this. I'm so glad it's not members only too. I'm gonna watch this with the movie when I get home from work. Damn. Thanks for the after work content Amelia. Really coming in clutch.", "That thumbnail looks like a nightmare is coming", "Broke GANG!!!", "LETS GOOOOOO!", "Hell yeahhh", "What in the actual hell is that thumbnail Ame", "Someone killed Bubba?", "amelia, why did you make that the thumbnail", "1:06:22 / 1:11:07 Cute Hicc <3", "Who missed it and is just watching this with no context", "Before you ask it, members got this video early", "The thumbnail tho", "the thumbnail is fiiiine 🌝", "Thanks for the watchalong! It was fun.", "This movie is a classic glad she did a watch along of this", "Voy a tomarlo\nPero me ofende muchísimo", "Great stream. Is it staying archived?", "Maybe but there's really no point since the audio is muted.\nPlus you got to have a way to watch the movie yourself to actually make any use of it.", "No audio/video so can't be Copystriked", "@Adriel doesn't change the fact that it's pointless to archive it.", "@Chains of Scarlet I mean, we got some out of context ame tho", "@Chains of Scarlet  Things like this will be archived. People who watch vod can sync their time later with her timer.", "@slowchamp agree", "@Chains of Scarlet Uh, it has exactly as much of a point now from the archive, as it had when it was live.\nYes, the point is to find a place you can watch the movie and start it at the same time so you can watch it with her reaction. Same practice whether you're checking it live or from archive. It never had movie audio.", "all right let me clarify one thing. Archiving it temporarily for the people that missed the stream is fine but, if you go out and buy a movie after the stream to watch it with a recording of a girl watching it is sad in my honest opinion.", "@Chains of Scarlet \"all right let me clarify one thing. Archiving it temporarily for the people that missed the stream is fine but, if you go out and buy a movie after the stream to watch it with a recording of a girl watching it is sad in my honest opinion.\"\n\nDidn't buy it. Rewatched as I felt like rewatching and seeing how she reacts. People watch reactions all the time. (How does it differ from live or archive, I have no idea) Doubling down to be judgmental when you failed to make sense is sad in my honest opinion, but good thing we don't need to care about what some stranger thinks online. ", "@Sarcasm I guess some people will never see eye to eye.", "Anyone on the stream who says there are too many bullets in the magazine underestimate how small the bullets are, or have never heard of Glocks, double-stacks or any concept of gunsmiths being capable of using a brain.\n\nPlus I can't wait for those same peeps to be pissed at John Wick 2 and 3.", "Wait what Member’s only stream but I’m not a member (not yet tho) but I’m still confused", "omg friend simulator 2020!", "such a weird stream lol", "Wasn't notified. When I arrived, movie was over. Am sad. ", "Same, guess I'll catch the next one", "That's alot of ads", "ur thumnail is hilarious .", "What it this  xd", "The thumbnail though", "Hiccup count:\n1. 4:24\n2. 58:37\n3. 1:06:20", "There's a few ads in your video", "I missed it bc of work 😔 Anyone able to tell me how locked out I'd feel trying to watch the sequels w/o having seen this? I'd feel weird trying to watch this now and would probably just have to watch it on my own time.", "I watched the third one without knowledge of the prior films on a whim with some buddies while it was in theaters. Was pretty easy to pick up, but I'm sure I missed a bunch of information. Just went through with the VOD of this watchalong as my first watch of the original.", "Thank you for answering my question 🙏 honestly I think the problem for me is i'm not huge into movies to begin with, so I'd feel weird watching the movie and vod by myself just to see what Amelia thinks of it. I think I'll wait and see if I can make the sequel streams and if I can maybe either watch it the first movie myself or just look up what happened on Wikipedia or tvtropes or something.", "\"Everyone keeps asking me if I am back, yes I am back\"", "*im thinking I’m back", "thumbnail www\nKawaii", "Please be archived, im late for the streaming", "はじめましょう", "どうぞよろしく", "Woah members only stream", "Amelia Watson is a woman of focus, commitment, sheer will.", "For the first half of the steam all I see is a yellow bar instead of red.", "Nice autolike.", "Too bad i couldnt watch it live cuz i dont have enough to afford membership but ill still watch this even if it wasnt live", "Hello my toxic gamer :)", "broo eating Amelia is so adorable", "wasn't this members only", "Ame has a scary bloodlust face.", "Nice Thumbnail, POG", "Interesting thumbnail", "Don't change the thumbnail ame", "beautiful thumbnail", "Can somebody explain me how this watch along works?", "well,it was a member only, but you start the movie at the timer time, and you watch with your waifu", "wait a minute", "You can cast the movie on your tv and it will feel like ame is watching the movie with you", "I trough this was member only, why is amelia being kind with us?", "nice thumbnail btw", "Poor Non-Members gang rise up", "The movie was good. Im not really a movie person but I like these watchalongs.", "This is members only right?", "Never seen it", "damn it", "Psh i cant afford Membership and the movie", "Really glad this was archived for all those who missed it or are not able to join membership! Thanks Ame :)", "Who here wanted to watch the movie with Ame but doesn't have a membership? \n.\n.\n.", "LETS GOOOO", "Hello there", "General Kenobi", "I dont understand how these watch-alongs work. I thought she would play the movie on the screen and we would... watch along.\nIs there a link to the movie or something?", "Mhmm? You know netflix, amazon prime video, hbo now, go whatever, hulu, showtime, disney+ etc etc? She count down and you ''watchalong'', she cant play the movie on the screen, you know copyrights exists right? Is this your first time on the internet?", "No don't change the thumbnail, we'll make it what Wick sees inside the bag.", "I read the title as watchaschlong", "I like John Wick", "Hello~Hello~Hello~", "sniff\n\nsniff", "How do I watch this", "With two phones?", "Tf is that thumbnail", "John Wick is 10 outta 10 in my opinion!\nFite me!!!\n:V", "Poor gang walking in", "No ara ara...maybe she forgot ", "Post the minecraft stream", "wait... is this ok", "How do you watch a watchalong? Is it like starting the movie exactly when she starts it for her reactions?", "Yep.", "[InsertChannelNameHere] Aight cools thanks for letting me know haha", "Does anyone know any software that can play two videos side-by-side and in-sync?", "Wait is this allowed\nIsn't this just for members?", "If Ame says it's okay then it shall be okay", "Why \"take 3\"?", "no", "i cant join membership but iam still fun", "I would like you to see Batman Begins", "Didn't get my notification and i was even checking to see if it had gone up =/ If you could put the stream reservation up  a day in advance it would be really helpful so i could have the tab open prior to it starting.", "She had problems with the stream at first, we had to remake it multiple times.", "She even posts the schedule on youtube nowadays. There is no excuse for relying on youtube's broken notification system.", "@Captain BaseBallBat-Boy eh I checked at the scheduled time , multiple times before passing out for 2 hours before Mori's stream. Others are saying apparently she had issues getting it running so I probably had the bad timing of checking when they went down.", "I just got the notification, three days later", "Era solo para miembros", "because this was a members only stream. I think calli has also released a few member only streams.", "@rubble Makes sense", "Wait is this ok? Is she going to release some member-only streams after some time?", "Hope not bc we don’t deserve it (no hate btw to you guys)", "Nice thumbnail", "Johnathan Wickenson great movie", "49:22", "Vibing Ame", "Bruh ... Wut in Saint Patrick's name is going on with YouTube? It says right here that it was posted literally 1 minute ago, but all of the comments here except mine are from three days ago? \n\nLike, bruv, are you takin' or somethin'?", "it's, it's an old membership watchalong 3 days ago, it's just been release to public... as in the title. lol", "I don’t get it", "how this live worked? where is the film?", "You're supposed to put the film playing at the same time as the timer. That way it'll be like watching it with her", "Yes", "Free gang", "Wow", "Nice thumbnail bruh", "Poor Gang Poor Gang", "Hello", "What do I press to become a member I’m confused", "You pay", "Goodfellas is god tier", "First Calli now Ame? I swear no one else does this except HoloEN and i love them for it", "watson", "Where's the movie? :/", "For copyright reasons you can't stream or upload movies. You have to get the movie elsewhere and just sync it with the timer", "You sound tired get rest", "is this the first John wick? I cant tell she said take 3", "@Joshua Garcia not sure", "nice", "1:48 she says \"pipi\" which in my country means urine lmao", "Can i ask where they were watching all im seeing is a timer", "Im trying to figure it out to", "you have to get the movie yourself, they arent allowed to put the movie on the screen cause of copyright", "John Wick is a pretty silly movie that I wouldn't have seen twice. But thanks, Amelia.", "uh.. is this member only or???????", "Yes. I think a few of EN are doing movie watchalongs as a member perk.", "Wait, I don't understand, she's watching movies with members but now removed it, right?", "Just member content that got released for everyone. Not actually streaming the movie, but just a watch along with chat. Timer is for syncing your movie to hers.", "", "", "", "", "Understandable, have a nice day!", "Amelia is the only vtuber to let people watch members only stream.Really appreciate it Amelia", "Calli also releases her members only streams after some time.", "what's this? lol", "Why is it only Members in the comments... this is the only comments section where I feel uncomfortable"]