["Amelia: \"It's hard for me to get into minecraft.\"\n\nAlso Amelia:", "She was legit about to just grab some food and get back to playing “5hours isn’t that long” I’m super hyped for an Ame marathon stream.", "6 hours later", "There's something about Minecraft that makes you wanna play more even if you're not into it. Over time you'll get addicted to it and say \"I love Minecraft!\"", "Also, she played off-stream for the whole 3 hours of Kiara's stream as well. Maybe before Kiara started, too.", "Its a lot more fun when doing stuff for and with friends in minecraft", "Minecraft has simple controls and gameplay, and you can have clear goals on what you want to do rather than a game giving you orders", "yes", "@Faramik2000 And they have their own Lobby, you can make incredible things and show off. Once the new update comes out its going to be hype.", "at the rate she's going she might get burnt out and never touch it again.", "in pewds' words, \"there's always something to do in minecraft.\"", "Hahaha I will never forget her saying that! Its hilarious that she's probably ended up playing the most out of everyone lol It's nice though that shes ended up enjoying it instead of finding it a slog to play. It's a good game, it has something for everyone I think.", "when did she say that? I might've missed something..", "That's just how Minecraft be.", "first 6 hr stream and longest of holoen is of a game she claimed she couldn't get into", "that's jokes xD", "as a Minecraft veteran who has played since 2011 (near the end of the beta days, before a \"finished product V1.0\" was put out) i can safely say that this game has an effect on people, different people get different effects on them, to some Minecraft is an addiction, to others it is fun to play once in a while and others who dislike it start to like it more as it goes on", "@Stevonnie Jenkins in short nobody dislikes minecraft. They just don't like it yet.", "@Stevonnie Jenkins played minecraft since 1.8 beta, while I will say that those are my personal favourite years of the game and I don't like the new changes. Im glad younger people are loving it", "I can't play this for 6 hrs.  how strong spirit...", "wait she said she couldn't get into it? crazy. minecraft is just special man", "@Shelly that's fair, i accept most of the changes but i like classic too, i would have to start a new thing in the launch menu going all the way back for a comparison", "@Luis Elu lol, nice way of putting it", "@Shelly cave update cave update", "@Luis Elu yeah", "Tbh it's hard to get into if you don't know what to do especially as a new player.  You walk around kill some stuff, get bored and exit.  She was determined to make a railway to Gura's house which literally made time fly as she was working towards it.", "Wait until she plays a game she can get into", "Tbh I didn't like minecraft vanilla until I tried it on pc cause I usually play mods or servers but after seeing dream smp vods i kinda wanted to try vanilla and now im here with 10 mending books cause i grinded sticks for like an hour or so", "I really enjoyed watching this stream, even with chat being a toxic clown fiesta performing a gonk show on a dumpster fire", "literal circus", "Ah the trouble with success. I’m glad so many new people are experiencing hololive but ... there’s also a ton of new people experiencing hololive. Hopefully these new viewers start reading rules and while I appreciate their sentiments it does get chaotic. Especially when you’ve got just as many people typing “READ THE RULES” as there are typing “RAID” gonna be interesting seeing how things go in the future now that everyone is getting so popular.", "@Aqua Freesh I do hope so since I just saw one guy being rude in Gura's stream just because she didnt read his superchat. Like seriously", "What did chat do? I missed stream", "Missed it as well. Please give us the context.", "I don't usually display the chat at streams, I guess I lucked out haven't i", "For those asking what chat was doing wrong: backseat gaming and breaking rule 4. When Gura also started streaming Minecraft tonight, Amelia had some people in chat saying \"I'm going to Gura's stream bye\" which is just rude and breaks rule 4. Not only that, it probably hurt Ame's feelings to see those messages in chat.", "@Aqua Freesh I would say it's not just Hololive, it's fucking common courtesy. You don't type \"my favorite streamer is online now, bye\" in ANY stream. Honestly disgusting. I hope Gura can realize the issue and educate her viewers. She's no longer a solo content creator, she's working with colleagues. It's her responsibility. Especially when you consider that Ame has been telling this to her viewers since her very first solo stream.", "@pbo1929 Chat basically broke some of the rules.\n\nThey constantly talked about Gura even when she wasn’t in the context of what Ame’s doing. Some people were even counting down to Gura’s stream and announcing in chat that they were leaving for Gura’s stream, while having the audacity to come back and spam “GURA RAID” once Gura finished. And in return, others tried to stop these people, but it only added to more unnecessary spamming.", "@GreatPhail Also chat police spamming the rules in chat. Don't forget about them.\n\nSeriously, rule 2 clearly states to report, block and ignore spam or trolls. Why do you guys want to counter them by spamming the rules in chat? You guys are fighting fire with fire. If you want chat to read the rules, just let one or two of them say so in chat every few minutes.", "@TaroYubi Honestly the girls need to talk about rules every now and then to remind chat. \n\nThis is still between Hololive members, imagine if those kind of people get exposed to more vtubers outside Hololive but still carries the toxic behavior. ", "man that is sad... En bros need to learn discipline from other bros. \n\nI agree they need to educate their fans. Some may say something without bad intention but still it will be considered sensitive to other fans and spark conflict with others.", "@Someone with no life when did he say that?", "@Someone with no life Damn he be like that huh. Anyway I really hope in the future there will be moderators in the chat to monitor it.", "Twitch refugees smh", "at one moment Moona from Holoid even mad at chat and start discipline the viewer", "@Axcel TSX here's the thing i can't report 300+ people at once, and there are tons who spam gura raid. So the only option I have was to say pls don't spam gura raid and report some comments", "@RaveOn Nah, even Twitch streamers ban you outright for that type of behavior.", "@UrPrism, KFP Ads Management I saw that, it was so damn embarrassing. I swear Ame, the veteran EN bros aren't like this 😭", "@TaroYubi ikr, like even if there's no rule, it's common sense not to do that", "Maybe if Hololive understood the importance of  active moderators during livestreams this wouldn't happen.", "@Watson's Concoction We've been bombarding Cover with that don't worry.", "@Someone with no life I know right. You should donate to show the streamer support, not to get your damn name read out.", "@Watson's Concoction I think if people can read and have common sense this would bot happened :/ it's just straight up rude to spam \"gura raid\" or \"bye I'mma watch gura stream\" if you use ur common sense also the rule is written in the description", "@J P I think he just wanted to be noticed. Don't attack him for that.", "@Robert Kristian Zambrano Yeah can't believe they don't have Moderators yet, even Toemad has Moderators.", "@I'm not a Weeb Maybe Yes. But the reality is people don't. That's why an active moderator is needed.", "@Waddles They're currently hiring people to moderate both on the livestreams and in the subreddit(oddly enough the subreddit is less cancerous and accepting of criticism).\n\nIt's been a slow process but Lyger is Matsuri's mod and Ancient One is a mod for Ina. Along with HoloID's plentyful mods lol.", "@Watson's Concoction and people complained why I gatekeep :/", "The girls should probably pin a ”Don’t forget to read the rules!” message in the live chat. \nI’ve seen it done before in one of the ID’s stream once.", "@ERUKII It should be mandatory, or have one in the waiting screens so no one has an excuse of missing it.", "I also did broke rule 4 once when i was a newbie but i educated myself to follow all the rules because i realized that its rude and disrespectful to the streamer i hope some of them already learned their lesson not to break rules. Even without reading rules they should respect the streamer its a common ethic.", "@Yagoo Bestgirl It should be common sense to any live entertainment you're watching. Whether it be live action or streaming.", "@Robert Kristian Zambrano As the wise saying goes \"common sense is not common\"", "@ERUKII Moona did the pin message to read rules when viewers opened their live chat tab", "@Robert Kristian Zambrano Ancient One is her own manager, right?", "I've only ever watch Gura's stream but hearing people mention how they say they moving over and yada yada yada, really hurts because its just pure disrespect. :(", "............no words can describe how disappointed I am with the people that said left because guras streaming now.", "@Axcel TSX See, this is why there are rules to backup other rules. If you see rule 4 has been broken, all you have to do is follow rule 2. That's why rule 2 are there, to prevent people from going all out war because some guy broke rule 4 and someone think it's alright to remind them when they themself broke rule 2.", "@Robert Kristian Zambrano yes it is. I broke rule 4 one time when i was new and after that i thought that i became too rude in breaking that rule but i realized that rule doesnt even matter if you respect the one streaming.", "@Tough Doggo i also noyiced that  rules backs up other rules", "@AYAME'S GIGGLE VIRUS No confirmation other than they are a moderator.", "I'll be honest, where are the rules written? If someone new to hololive joins the stream it's expected that they'd not know all of the rules.", "@AKFin Video description", "Gura’s chat having way more people wasn’t as toxic as Amelias last night I was so upset people were acting like clowns", "This will keep happening unless Gura talks about it in the stream. Most of the toxic chat was definitely a Gura only sub that doesn't even know what Hololive or vtuber is...", "@Akemisan - Yep, hopefully she addresses it on her next stream.\n\nOtherwise the 4 other girls during their 5 way livestream collab is gonna be a lot of gura spam.", "This\n\nIf you go to Gura's video there's not a single comment talking about how disrespectful the chat was towards Amelia's stream... And they will do it again.", "Glad to know I’m a good boy I don’t interact in chat except for the occasional pog", "@Akemisan - It's casual watchers and non anime watchers that are her main viewers right now.\n\n\nShe didn't fit a niche so that's why her chat is unruly.", "A big part of Gura's fanbase is coming from her past youtube and it was a shitpost channel so people think this is the same (she's the one who did Belle Delphine's \"I'm back\" song). She's working for a company and they have rules to follow. Don't get me wrong, I'm glad this girls are getting a lot of attention but they need to enforce the rules more before the newcomers start ruining other people's streams...", "@Waddles I understand that but it's not an excuse to be rude", "@Akemisan - She probably didn't expect her past account's drunk habits would catch up.", "@Robert Kristian Zambrano yep for all the girls Gura's the only who  shitposted on youtube/twitch. Ina was (is) a popular artist, Calli was (is) making songs on youtube. Kiara cosplayer/idol and Ame was on twitch. So it was pretty easy for past Gura fans to move out... And it shows.", "And if we add the \"unintentional\" (sike) Pewdiepie references Gura makes in Minecraft it doesn't help either. Pewds fan base is really really toxic and annoying.", "@Akemisan - Seriously, all it takes is to observe the surroundings for the newcomers to get acclimated but no, they do whatever instead of listening to the people with experience.", "@Robert Kristian Zambrano I'm really annoyed because I don't usually read comments or even watch yt but I really enjoy interacting in these streams with everyone. The core vtuber community is super wholesome and cooperative but this newcomers are getting on my nerves pretty fast.", "@Akemisan -  @Akemisan -  yep gura really need to talk about this on her stream, i just finished watching korone stream and the chat interaction really wholesome eventough have 35k people watching, \n\nthen i come here", "@Akemisan - Actually, theres plenty of people talking about the chat being toxic on Gura's stream", "@TaroYubiTBH I don't think it's really entirely Gura's responsibility. They all really need mods. There's only so much she can do with such a large and rapidly growing fanbase, and someone who's inconsiderate enough to say that they're leaving a stream to watch someone else is probably not going to listen to anyone. They just need to be banned.\n I only remember Amelia saying something about the rules in her second Superliminal stream, not her first stream (otherwise the Haachama raid could have been avoided, and people wouldn't have accused Ame of not knowing the rules herself). And I don't think it occurred to any of the other girls that this could happen again without them unintentionally encouraging it, like Amelia did by telling people to watch Haachama, and even then, several of them have talked about watching other girl's streams without anything like that happening. I can't really blame Gura for not realizing her fans would suddenly get out of control.", "@Akemisan - how How do you know the past of each member? They are only a month old and already know their whole life", "@Julius Zeppeli They were popular on the internet already... Check it out it helps to open our eyes and don't simp like crazy.", "The chat was more toxic than Ame. What I hated the most was the backseating. Even she had to stop them multiple times. Ame (and even Kiara in her stream) seemed like puppets by the chat giving orders without stopping. They didn't stop spamming \"eat\" even when she didn't have food or just didn't want to eat. we're just spectators, this is not Twitch Plays", "@Julius Zeppeli The line between helping and backseating is scary", "I think the solution is that at the start of the stream, the girls speak about this behaveur and remember the rules. It could also help what korone does. She puts a picture over her avatar indicating the comments she wants in the chat. For example, to support her with compliments (when she doesn't want spoilers, backseat or she is in a complicated level) and when she needs help she puts a picture indicating it. You can see it in the Banjo-Kazooie stream", "@Akemisan - now you're talking pure bullshit.", "@Nicholas H. [Nexakrull] are you ok buddy", "@Julius Zeppeli \"Check it out it helps open our eyes and don't simp like crazy\"\nI repeat, pure bullshit.", "@Nicholas H. [Nexakrull] Some people think they're God or something just saying. It's great to support them but there's a limit you know. Why you got mad lol", "sounds to me she needs multiple moderators to police the chat", "@Akemisan - Some people get mad at the word \"simp\" for no reason \n\nIf you are a fan of something, you should not care what other people say ", "@Rule sx ah thx for explaining", "This reminded me why i almost never read chat in a stream where i'm familiar with the language that is being used", "@UrPrism, KFP Ads Management she was mad at Ameilas chat? When?", "@One Punch Fish  she not mad at amelia. she mad at her viewer because not follow the rules", "@Akemisan - senzawa? She's senzawaa?", "@Aqua Freesh Yet another reason to make chat members-only.", "@TaroYubi More than Gura, it's Hololive's responsibility to encourage an environment for their employees that isn't hot garbage.", "Imagine donating $500 to the girls and their bf use it to buy a next gen console lmao", "@Axcel TSX It's \"Monkey see, monkey do\" quite widely on both sides. One side starts mimicking what others are doing and the other starts mimicking what \"their side\" is doing and there we have it, a clusterfuck of endless spam. Then anyone reasonable to get their decent comments through would also have to spam it to be noticed at all... which equals to either decent people being quiet entirely or joining the spam.", "Reading chat gave me a migraine. Literally filled with a bunch of middle school degenerate social outcasts who don’t know how to communicate.", "@Akemisan - that’s not fair, I was a previous Senzawa fan and most of the previous fans on her subreddit have all agreed to not bring up her past during her livestreams and be respectful", "@Jaws1391 I never said names... Your comment does...", "@Akemisan - bruh stop mentioning past lives. It's a big no in here. Even if you don't mention names, it's wrong.", "@Lubella Lmao", "@Akemisan - talk about it on 4chan or Discord but it's disrespectful as fuck to do it on the performers channels. You're literally complaining about newbies in one comment but then doing something that every knowledgeable member of this community looks down on.", "@Lubella Are you mad lol", "Gura: starts streaming\nChat betas: \"ima head out\"\nMe, a man of all the culture: \"Alright monitor 2, your time has come\"", "The Madlass actually did it... a 6 hour stream...\n\nBut on another note, wtf is up with the chat, seriously? We get that Gura is streaming at the same time Amelia was but do you really have to spam chat to tell that you’re leaving for Gura’s stream?", "LmaO chill there buddy", "It's a lot of new blood that only watches Gura.\n\nProbably also don't know about Hololive.", "@Robert Kristian Zambrano lol...?", "@Mr. Yami Creampai What? I merely pointed out what was happening in chat.\n\n\nIt's literally what happened. New people joining and only watching Gura to then spamming in the other members streams.", "@Robert Kristian Zambrano bruH chill it just took me some time to understand lol", "@Mr. Yami Creampai Don't worry, I'm not flaming lol.\n\nOtherwise I'd be cursing like a sailor in my replies lmao", "@Robert Kristian Zambrano lmaO", "@confused af and people wonder why we gatekeep lmfao", "@kiell borja awkward chat spamming and gatekeeping both are equally cringey. \n    When anything becomes popular online some awkward teens will squeeze through the gate as well. \n  We all /Ya'll just have to bear with the cringe.", "Damn normies don't know that the veterans actually watch 4-5 streams at once and didn't read the stream rule", "@confused af I fucking hate the live chat in this stream", "@Robert Kristian Zambrano Hololive vets be like: we don't really care what happens in the chat anymore. We just watch and send sc once in awhile.", "@Jus Astroknot I just lurked in Ame's chat instead.\n\nI didn't even bother anymore.", "@Mr. Yami Creampai you new here !?", "@Robert Kristian Zambrano same bruh", "@Zamfy bruh", "@Zamfy i think so, mans created his account the 8th of this month lol", "It's partly the twitch chat culture. Twitch is a fucking zoo tbh, also just way too many young teenagers who can't read.", "WTF?  People really did that???\nThat's absolutely disgusting.\nIs Watson ok about it?  I hope she didn't let it bother her", "@LittleCart nah man this is alt cause in my main I used that for study lol", "@Uh Oh wdym lol", "Gura promises Atlantis. And watch u get?only a door in her house. Lol", "It's just a lot of noobs being disrespectful and juvenile.", "@b'tch, i am a medstudent no one has to bear with anything. Gatekeeping is a necessity to maintain certain environs", "@無常 \nEveryone has to bear with everything. \n And how do u intend/plan on gatekeeping hmm ?", "I think they did it because they wanted Ame to rant about it. The chat seemed to enjoy it when she lectured them.", "@R3 I think some of them are \"m\" lol", "@Cromsax She's doin' her best dude", "@kiell borja How about instead of that, politely tell people that are being disrespectful, to not be.", "Bruh why is everyone like this, chat was spamming near the end because they were coming from guras stream to ame's it went up like 5k people it was a good thing you noobs.", "Dr. Respect There’s nothing cringe about gatekeeping when the people in question are obnoxious, inconsiderate and only hurting the experience for everyone else. It’s incredibly easy to not be gatekept, simply act like an adult.", "@meh \nThey just didn't understand the rules yet dude, chill\nGatekeeping still cringe", "Gabriel Costa You don’t need to understand the rules to understand basic decency. Feeling the need to announce that you’re leaving to go and watch someone else is an asshole thing to do", "@シアン化物 leaving a stream saying \"ok gonna watch x streamer now bye\" or raiding a stream spamming \"x streamer raid\" is pretty disrespectful. just don't break the rules and don't make the streamer feel uncomfortable, man. it's sad that people have to talk about why this stuff is bad, it should be common courtesy", "Guys, please read the rules. I know this isn't Gura's fault. But, after her stream there was a sh*t ton of people spamming \"GURA RAID\"  on Ame's stream. It's just so disrespectful for both Gura and Amelia. Remember, youre not on twitch. They might be HOLOEN but theyre still following Hololive's rules. Please, be respectful while also supporting them.", "Yea, it irritates me a lot", "part of it was hers as she said ‘to watson’", "People do raiding on Youtube all the same, but mostly among people they know since there's no convenient way to check who's streaming unless you're subscribed. It's just Hololive that does not do raiding and people do not expect that to be against the rules since people do it everywhere else.", "I was very confused when that happened", "If you really want to support them, prepare more mobile phones or computers.Only in this way can we support them at the same time", "@Freeman319 dude is someone watches your stream and said \"bye I'mma watch X stream\" it's just straight up rude, even if it's not written u can ise ur common sense.", "@I'm not a Weeb Maybe Yes... that one specific thing is rude, but in general mentioning somebody else is not. But even if chat mentions that somebody else (the streamer) knows is also streaming or doing something, I've never seen anybody get offended by it. Not the chat or the streamer. Not until I read these YouTube comment sections and see all the butthurt. Stream herself just fine but chat was offended and day is all ruined.", "@Freeman319 It literally says in the description not to do that. The streamer being okay with it doesnt make it any less disrespectful.", "@Freeman319 dude, the rules are in the damn description! You might think the streamer is ok with \"x raid\" or etc but who knows what's behind the scenes looked like.", "@reister david \"The streamer being okay with it doesnt make it any less disrespectful.\" Let me rephrase that... what it disrespects is the rule and you who want to enforce the rule to the letter. You guys are making a mountain out of every tiny molehill. Yes it's against rules and shouldn't be done, but freaking out about it only makes it worse.", "@I'm not a Weeb Maybe Never said anything about raiding, that's different from merely mentioning another streamer.", "@Freeman319 are fucking kidding me, raiding is ok but mentioning that ur raiding from x stream is a big no no, it broke rule 4", "@Freeman319 First of all, I'm not freaking out about it. Yeah, in the live chat there were alot of people spamming \"Rule 4\" and that added fuel to the fire. And raiding isnt wrong or disrespectful. Shouting about raiding in the chat is disrespectful. You can enter a livestream without being all like \"oH, LoOK at me I cAmE from anotheR StrEam\".", "@reister david That I can agree with.", "@Freeman319 Dude, listen to yourself, your reasoning is the same as to anyone who spams and shouts raiding. We are enforcing this rule because it is the streamer's rules.", "@The Newcomer Yet I did neither. Went to sleep as soon as Gura's stream for few more hours. Just trying to be a little more reasonable here. Long story short they won't know there's a such a rule if they don't know there is such rule since nobody expects there to be such a rule.", "@Freeman319 Oh boy, something tells me that you aren't here long enough. There is a rule, IN THE DESCRIPTION.", "@The Newcomer Read the rules on day of debut.", "@linkoo linkoln I guess that's why they don't really have moderators. Japan bros follow the rules well, and thus the problem takes care of itself since they self moderate and don't bring attention to it if someone steps out of line.", "@linkoo linkoln Well, yeah that too. I never spammed it i just think that adds fuel to the flame and actually makes it worse", "@linkoo linkoln Oh okay, I'm sorry for misunderstanding. That was my bad, fellow investigator.", "@linkoo linkoln I hope next stream we all just chill and have fun. Amelia is my very first membership subscription because i legitimately find her streams very entertaining and fun.", "@yoruzuya trio she probably meant to say check out Amelia stream, but did not expect a flooded chat of “GURA RAID”", "Hololive has had a huge growth spike in the last month probably bringing hundreds of thousands of new people into this community. This kind of thing always happens when you grow too fast.\n\nIt's going to be a lingering problem for a while, but hopefully they address the problem in more than just a random spot in the video. I think people only raid because they think it is acceptable, because everything they have ever known about streamers tells them so, and to them, hololive is just another streamer. Once they know it is not acceptable, they won't do it anymore, but if it's just buried in a multi-hours video, most of them will never know.", "Anyway im losing faith in humanity again", "@linkoo linkoln whoops spelled it wrong", "@Freeman319 These dudes are freaks forget about em lmao", "She'll be a Redstone engineer by a couple of months", "It would be neat if she made an automated food machine", "The rise of Ame construction? I dig it", "Amenology", "@Shiroi ameism", "@KumaPaws376 of course, she is KFP's head chef afterall", "She'll get into a technical modpack industrializing the world", "Yea, first we have Pekora. Then Moona from ID and hopefully Ame.\n\nLike I am genuinely fawned over Moona's hidden stairs/tunnel gimmick near the end of her recent stream. That is so cool!", "@Boom - Game Dev! would love to see that in her streams", "Soon, Ame's going to be a combo of aqua and pekora when it comes to building at this rate", "I’d give it 2 weeks max", "She'll build 420 FTL in no time!", "I wish she would try and do a redstone music player for her BGM that she always hymns along with", "@nazrin992 lmao she sure made Pekora jelly with her high tech from the future", "2:08:28\n\nAme: heh I can hear her saying “What is this?”", "Funny enough.. that is EXACTLY what she did", "And...\nAme: \"Did you do this?\"\nGura: \"Did you write this?\"", "Because shes also watching gura's stream for a while.", "whats the timestamp on Gura's stream?", "i think someone should upload some highlights with both of their perspective stream synced", "Amelia is joseph joestar", "@Theodore Abelardo Weluz NANI!?!?!?!", "boymahina123 timestamp is 14:00 in gura’s stream! :)", "It’s only a matter of time until we get the 30 hour Watson stream.", "stream-colab-offline gaming-stream. Let's gooooooo", "Yes", "Korone : FINALLY A WORTHY OPPONENT, OUR BATTLE WILL BE LEGENDARY", "It's gonna be as long as korone stream", "People saying this like it's a joke not realizing Ame is a timetraveller and can actually do this.", "when you get the inside joke :]]]", "i think we need some moderators soon.", "Yeah fuck chat dawg", "all exist moderators are hololive member (but all not do moderating action)", "Can y'all fill me in, I missed the stream. \n\nWhat happened?", "@95% Oxygen Raiders and people basically saying “haha leaving for Gura”, like come on, I miss when things were nice and slow, and twitch behavior wasn’t a thing that was practiced here that was just straight up rude.", "@Nursery Rhyme Oh, thanks man.", "@Nursery Rhyme I love how you insult Twitch for no reason", "@Generic Chaurus Where else would you say this attitude comes from?", "@Nursery Rhyme nobody want to see this behavior even on twitch. It's something you don't want to see", "@Nursery Rhyme at one point they were comparing Amelia to Gura and saying that Amelia was much better than Gura\n\nWtf is wrong with The chat", "@Rule sx they are children", "Generic Chaurus this behavior seems alright in twitch but it’s not something done on youtube a lot", "@Bobibobibob The raiding stuff is pretty common on Twitch, it's just treated differently over there. Everything else probably wouldn't be tolerated though, but any chats with 10k+ people is basically impossible for a person to moderate all of the nonsense. It's just chaos constantly even with slow mode.", "I'm wondering about the use of Nightbot, like ShinmenTakezo used in his stream, how does Nightbot works anyway", "@Solace It can detect certain words, so it can filter and delete comments that mention certain things, like swears or streamer names for example. It's a little heavy handed but it should work, although it would have to be disabled for collab streams naturally.", "@SoosUnknown That's definitely better than nothing and they can still use NightBot even after they got human mods", "@Solace I agree, with that and hopefully gura/ame reminding people of the rules then chat will probably chill out. I am also annoyed with people who kept talking about the rule breakers, because it was just as annoying as the kiddish spammers talking about gura.", "@SoosUnknown lmao you need to pick a side. If you are on the fence then, it is either those uneducated spammers eventually flooded the whole chat or you will have people genuinely try to remind the new fan and educatinf them.\n\nYou can't choosw both.", "@Emily I actually agree we should educate, however remember that one of the other rules is to not engage with spammers and the like. The best example I can give is how gura was being spammed, so people spammed “stop talking about gura”, now the entire chat when Amelia looks at it is literally all just full of gura talk, even if one side is just trying to stop it. ", "HoloEN seriously need some moderators soon. I hope what happened to rushia is not going to happening here. \n\nThis kind of behavior is not acceptable here. Hololive have rule. This fans have to obey the rule.", "@Ibnu Muhid What happened with rushia?", "@knucklejoe some bastard trying to stop rushia stream by saying \"stop the stream,your junior from holoEN is debuting\" when holoEN first debut.", "@Ibnu Muhid CORRECTION , it never happened, that was a misunderstanding caused by mistranslation of translator with poor japanese skills.", "@Nicholas H. [Nexakrull] thats new for me,thank for the correction.", "@Ibnu Muhid I'm mean, there was some bastard but it didn't caused damage.", "we need woohoolad to talk about this so he can help like a LOT.", "Not soon NOW", "@Nursery Rhyme the thing is in hololive jp. mostly people were heavy weebs and respected the streamers, but in hololive en. many twitch people came to check the waters, and gura is meme material, people dont get this is a company not individual people and have some standards, not saying to gate keep, but just to hold up the small set of rules they set out just to maintain peace and have fun with everyone, dont like those dumbasses who think this is a twitch stream and can scream GURA RAID, not fault of gura, but those normies who think its okay to backseat others :(, amelia sounded so sad then", "I would like that the company hire a pair of mods for every member of Hololive", "@Generic Chaurus he’s not wrong", "Hi there.\n\nSo as some of you probably know, there was a little war going on in the comments regarding Rule 4 during this stream. What is Rule 4? \"Don’t bring up other streamers or streams unless I mention them.\" Seems simple enough, right? However, I would like to highlight that the rule is more complex than it might first seem.", "These twitch kiddies are the drawback of Gura's meteoric rise. She has become so powerful she attracts absolutely everybody, even those who should rather stay away.\nI'll give them a month before the novelty wears off and a shiny new thing catches their attention.", "Alternatively, making chat members only might be a solution, if that's possible.", "@Captain BaseBallBat-Boy \nThat’s quite an extreme case of gate keeping though, I’d only resort to that in the absolute worst case scenario. And while it’s true that some Twitch people may find Hololive to be a fad, there’s nothing wrong with setting the ground rules for those who want to stay, and to inform those new to the Hololive rabbit hole. Just because they’ll leave in a month doesn’t mean we just forget the month they are here, there are rules and they have to be addressed in some form or another.", "unfortunately many spammer also a member", "@Freyja Wion To that I say: so? Does being a member give you some higher status? Why? If I donate $100.00 every month while someone is a member paying $5.00 every month, then shouldn’t I have priority to do as I please and spam? No, because at the end of the day, we’re ALL fans, and we’re all equal to each other. I don’t care if you donate one dollar or one million dollars, etiquette is etiquette, and it should be common sense to be polite. ", "@Captain BaseBallBat-Boy have you seen that red superchat spams", "@Captain BaseBallBat-Boy What's up with the Twitch hate on Youtube? It's the biggest game streaming site on the web, of course it'll set the norms for it. I've been on Youtube since its inception and the comments section is notoriously toxic, by and large. Let's not pretend Youtube is some high brow website for mature adults :)", "The fact that we can even have arguments over the rules implies there's a problem here with how the rules are being communicated and/or presented, and it's not entirely clear who's even at fault here. Most people when they view Youtube videos don't actually, I think, look at the extended video description unless something in the video points them there. The same probably applies to streams (and that makes it harder to draw attention since people can drop into the stream at any time). I wouldn't be surprised if a very significant proportion of the viewers of these streams weren't aware of specific rules for Hololive (that is, beyond what would be covered under Youtube's general platform rules). On top of that, the rules lack nuance or reason so even those who read the rules won't understand the spirit of the laws, and may very well misinterpret them, how strict or lenient they're supposed to be, and whatnot without actually reading some kind of explanation as to why these rules are the way they are. And I suspect there's no feature on Youtube streaming to put up, forefront in the chat window, a notice that can draw attention to the rules in the first place.", "If you haven’t watched a cute anime girl play Minecraft for 6 hours straight, you haven’t lived 💁‍♀️", "Double the time it took 5 of those anime girls digging out a 1000+ tunnel for 3 hours lol ❤️", "I guess both of my parents are dead, which is accurate", "I also watch almost all Watame's Minecraft 6-7 hours streams, sometimes Haachama and now Amelia... so yes", "Watching people playing Minecraft is kinda relaxing to me. It's fun to watch and chill along.", "i watched a certain fox digging into the void, does that count?", "A cute doggo did a 24h stream :)\n\nCough Korone cough", "@I'm not a Weeb Maybe She didn't do a Minecraft stream? I can't recall that.\nI know about the Kirby No Damage All Bosses Speedrun, one of the latest AC streams and her multiple endurance streams, but I don't think she plays that much Minecraft.", "@フェルナンドFernando KuroV I did not said minecraft 24h stream, just a 24h stream 😂", "A normal anime with 12 episodes is equivalent to about 3 hours. This is the same as watching a 24 episode anime. Easy.", "I kinda fell asleep at the 4 hour mark", "Oh shoot so im ded", "now this is why I'm a member", "I mean I'm stuck at home without a job so... Playing games and watching cute anime girls streams it is.", "i have watch 9 hours vod, took almost a week", "I find her voice cuter than her avatar", "Just like Ame said, stop backseating her.....\nShe knows what is she doing, she don't need any of us to lecture her. This is not a f**king Twitch.\nSeriously guys, pls behave. Only help her if she asked for one. Otherwise just enjoy her having fun.", "twitch is not as bad at this", "@Luchador Parrudo If you ever sit in a decently sized Twitch stream, you will definitely see backseating all the time. Even if the streamer has stuff like 'blind playthrough' 'no backseating' etc in the title, morons come out of the woodworks and do it anyways. It's not a platform issue, it's an intelligence issue lmao", "@Goomy not if that twitch stream you watching have mods", "Nah, don't help her if she asks. She can learn the basics, such as not to spamclick, herself and otherwise look it up on a wiki. She doesn't trust chat with anything anyways", "I don't watch Twitch anymore at all, I don't want Youtube Live-streaming to be ruined for me aswell..\nI used to be a mod for a 2 big streamers so I know what I am talking about!", "1:39:25 1:43:04 2:34:06\nAmelia's reflexes and quick decision making make her so resilient in this game I love it\n\nFor someone who's new to minecraft, she picks up on things very quickly. Those situations would've spelled death for any of the other members kusa", "Gamer reflexes", "lol yeah, it's kind of nice to see people like her online.", "its cause shes a zoomer", "She is faster than me when i was new in minecraft, well its faster even like actual me lol", "holy 200 iq fast plays", "I loved how she was kind of calm through those moments", "Ame's got that zoomer speed on deck", "Before\nGura:Professional Minecraft gamer\n\nAfter ", "I just love how after almost dying from lava, she immediately gets distracted by redstone lmao", "That what time travelling do seem like pro gamer moves to us non users", "she's not new to minecraft. In this stream, she mentioned that she used to play it in the past, and had built lots of things, but get bored.\nOnly after she joined Hololive, and have friends to play with, she finds it exciting again to play.", "@Jerry Gilbert Oh yes, but you can tell she barely tried it at all\nShe didn't know how water sources or even how combat worked. She doesn't even know what enchanting is\nMaybe she just did a bit of creative mode. She was learning very basic things throughout the stream", "ame is afterall an fps gamer", "Poor Gura", "thats a gamer alright", "Years of Apex training just for this very moment!", "She's a gammerr groll", "that \"kusa\" at the end. kusa", "How did she know there was a creeper there?", "@123457474869 - You can hear the creeper taking fall damage as she is mining the redstone ore.", "I love the little “AH” she gives after confirming her suspicions in the first clip", "I’m really disappointed with chat, I understand that they are a fresh batch of subs and haven’t read the rule and probably never will because brain too smol. Hope they remind the viewers about this situation more frequently due to the rapid popularity that they are getting.", "Why are you reading chat? Are you into self-harm?", "@tuukka aro I think it is not that, it is because Amelia is also reading the chat as well. She even scolded the chat about backseat gaming. Props to her. Also, chat will be shown in the screen sooner or later", "Common sense is the least common of the senses.", "@DyaMetR Agree", "@tuukka aro Thats the thing with live streaming tho, the streamer can interact with the chat and vice versa. Also unlike some other platform streamer, hololive's chat or vtuber in general isnt like that (toxic/discussing something else like other streamer/back seating/etc) or never meant to be like that, so reading chat is never a self-harm.", "Write this on Gura's video", "Based on my observation on this stream's chat, I have concluded that apparently people can't read rules.....", "Yeah, half of chat was breaking rule 4 while the other have was breaking rule 2 in response. It was chaos", "What happened", "Were there trolls spamming or somethin’?", "Some dude actually superchatted Gura's previous life.\n\nI swear, attracting the twitch crowd was the worst thing that could have happened to us", "@Fakubu Ch. Wait what?", "@Weapon X props to the one that desperately try to stop the one spamming tho", "@Not Janny \nit doesn’t really help because they turned into a spam as well, might as well just ignore and report🤦‍♂️", "@Not Janny yeah no. We are not mods. Spamming stop breaking the rules just ads to spam. This is why you just report, block and ignore.", "Yeah it is really bothersome but i just turn chat off. I know alot of the spammers are doing it intentionally just to troll like the one dude whowas spamming “everyone say call Gura on discord” after that i pretty much just couldnt take it anymore.\nAlso the “lewd” and “deeper” comments but like i said i just turn chat off cuz i know there is no stopping it until she speaks up about it.", "@Fakubu Ch. did ame read that superchat?", "@L des Ame usually reads superchats in her head and then responds to them, so probably not. Not out loud anyway.", "Even without considering the rules.. saying \"gotta leave now.. gura's streaming\" is just rude. I mean.. I get that a lot of people really like gura and I do too.. but spamming toxic comments like that is too much", "It got worse when Gura ended her stream, there were so many people spamming \"Gura Raid\" in the chat. It was unbearable. Tbh Gura needs to tell her viewers to behave.", "@Ian Guieb damn did someone really said that?", "Christ alive was it really that bad? I dipped a portion of the way through to fix some mods but holy fuck man, the hell's wrong with people? This ain't twitch", "@Doge You may not be aware of this, but raids are normally considered a good thing...", "i had to turn chat off. it was really annoying.", "Just to add a bit more to this, thank god there's no live chat replay rn", "@ihave2cows Twitch and Youtube streaming cultures are different.", "When you have a public chat. You'll need mods. If this keeps up. They will need to address the problem quickly. Warning ban or temp youtube suspension will discipline the kids.", "@Fakubu Ch. Hololive should hire moderators...", "@Not Janny i saw like.. 5 people saying that", "@Ian Guieb uh do you remember the timestamp ?", "i don't remember.. but i think it was about 2 hrs after the stream started", "@ihave2cows  @ihave2cows I'm aware that raid is considered a good thing on twitch, one of them is to promote smaller channels. Twitch has its own culture, so does Hololive. Amelia already addressed this before, follow the rules and don't spam \"raid\" on other hololive girls stream, not just on HoloEN.", "@ihave2cows You may not be aware of this, but there are rules in the description of every stream.", "@ihave2cows This is Youtube, not Twitch. Hololive (and vtubers in general) have always abided by a different set of rules and etiquette.", "@ihave2cows I think you're the one whose not aware bud", "@Kanade Tachibana yeah some are a bit different but most are the same. I'm sure people just dont check the description. But even then its common sense to not say that.", "@ihave2cows YOU may not be aware of it but most people here know what raids are and they aren't considered good etiquette in these streams over here, this isn't the same as twitch", "@ihave2cows go back to twitch m8", "@ihave2cows You may not be aware of this but as mod on 2 channels of Twitch i can say raids aren't that good as people think. Chat turns in a mess, some streamers are fine with their usual viewers because they respect the chat, doesn't matter if the streamer is nice when the mostly of the viewers can't read the rules or just ignore them.", "@Doge  At one point the Chat was buying Amelia with Gura and saying that Amelia was much better \n\nWtf is wrong with chat.", "@Alaric Williamson Yeah, it happened on Gura's channel. Thankfully she doesn't usually do SC reading.", "@L des It was on Gura's channel and thankfully she doesnt usually read SC as far as i know.", "What a garbage chat.", "You're right", "We can only hope that given time they will find a new haunt to sh*t up.", "Ame: Charts down multiple mines and nearly completes an underground railway system that connects everyone's house to Atlantis.\n\nGura: Dies countless times, gets lost, and places down a door.", "Epic", "Perfectly balanced.", "I honestly can't believe the Chiken accomplished more than Gura", "she really went out of her way to stream 6 whole hours for us, what an absolute queen ❤️❤️❤️", "nah, I doubt she went out of her to stream that long for us, I think she's addicted to it. Nothing wrong with that, MC is fun! If I remember correctly, she was playing when Kiara was streaming, while she herself wasn't. The 6 hour stream was just Amelia smartly killing 2 birds with 1 stone, lol.", "@captsomeguy1 nope she did it for us", "6 hours isn't that long for a full time streamer", "6 hours ago?!..  She was just streaming a little while. I thought something was wrong with my feed time... turn out it was a 6 hours stream.", "Maybe more than 6 hours, she started in the game in the morning with Kiara.", "5hrs actually. The remaining hour she was reading SC", "Chat was being a retard today but other than that, it was a really great stream! Also, o7 gang rise up!\n\nCongrats on the 400k subs ame!", "Just chat being chat unfortunately", "I love amelia, but god damm it the FRICKING CHAT IS MAKING ME CRAZY", "you guys are reading chat? I just closed it when I notice people saying them what to do or how to play?", "some vtuber comes with very annoying audience. Just turn it off if you find it disturbing.", "@Biton Charles what does that mean?", "@Biton Charles It's especially annoying when one of them swears and the chat gets their panties in a bunch over it. I didn't see that SC you are referring to, I'm pretty sure most people already know who Gura was before anyway, but it's still pretty disrespectful to post that info in chat regardless.", "@lcdude just out of curiosity did gura’s past alias did something wrong? I’m not familiar with gura’s past", "@Jared Lim No, she made pretty great quality content.", "@Jared Lim No its just disrespectful and  rule to not  reveal  the hololive talent past lives. I forget if it's a rule or and unspoken one but it is heavy discourage by the holive community", "@lcdude did gura ever respond to SC or did she just IGNORE it?", "@lcdude yea might just delete  my comment because it might make people more curious", "@Biton Charles Damn what are they trying to accomplish there. Stirring up chaos?", "@Exzo Bree I heard of Gura's past and I refuse to believe it. I don't want people to experience what I did so I pray people don't find out and even if its true I hope its fake 🙏🙏", "@Exzo Bree Some people will invade others  privacy just to satisfy their own curiosity", "@Biton Charles aaaah,i see..thank you for that info", "@toryusen郑 but still feels bad for the streamer that read all those chat.", "@theEchannel only been 4 days i started watching our hologirls, already spiralled down the rabbit hole enough to be familiar with gura, korone ,okayu's past projects. But i am clueless about what u r referring to.  \nAlso should u be commenting something like this ?\nIt will only make the fans just more anxious/unhealthily curious.", "@b'tch, i am a medstudent Ik it would make them curious, but I was too. I am just saying this really for their own good and I wish someone said this to me as well. And the fact you don't know what I'm talking about is just for the better", "@theEchannel people are capable of imagining worst events than reality and they will make assumption that are worse than the truth(if there is any),\n so u r just making that person look bad/weak  & while giving contradicting messages. \n--", "@b'tch, i am a medstudent Ik what you mean but we gotta accept the fact there's people out there who wouldn't care and straight up say it. In the event that happens I think it's fair someone is warned in advance.", "@b'tch, i am a medstudent seems like he is doing it on purpose. There is nothing really important.", "@Jared Lim she was shitposter. Actually made good content", "@theEchannel her past was glorious but I respect her decision for a fresh start, both personas are charming.", "Idk why, but you gave me PTSD as if I was watching RE: Zero all over again.", "That’s my problem with minecraft streams, the game is so popular that it attracts a lot people unused to hololive. I usually don’t turn off chat, but I had to do it this time. Well, at least it looks like ame still had fun with the game and watching was fun too.", "The chat was pretty rude and the eat spam once her food went a bit down was so annoying. I get that people wanna help her but im sure this will eventually die down.", "i could feel Ame got pressured at some times.", "Yeah and once she called out on it everyone just spammed Toxic. In her few first streams it was all fun and games but now its just getting annoying", "next time blame them for every stream activate membership only allow chat mode", "A good idea would be to 1) pin a comment about the rules. \n2)Make a 2-4 mins video in every channel talking about the rules.", "Let's just report all of them for spamming, so they get banned.", "I really hope she didn’t see the chats saying “bye I’m going to Gura’s stream”, if I saw that I would feel crushed. Like I was just some side show before the main attraction...  AME IS NOT A SIDE SHOW DAMMIT AND GURA NEEDS TO ADDRESS THAT!!!", "@Backpacker Furret I wouldn't blame Gura at all, but she did address in the beginning of her stream earlier today", "@Backpacker Furret Agree!", "@Israel Gura fans are mostly annoying kids, which is also why she is so low on super chats with almost 900k subs.", "@Ka Ne Damn man... I didn't know people were gonna start having turf wars so soon...", "@UnseatedName dude a bit down? He went to like her last 3 bars before she noticed.... Everyone was spamming because they didn't wanted her to die... Now when the chat started spamming gura that was really annoying... Hope ame missed most of the chat at that time.. I wouldn't want her to read that", "@KFP Mei Mesaki It's not war. Gura has too much power which she can't control. Her fans, mostly kids and kids, don't like to listen to the rules; they love to do whatever they want. The only way to fight kids is to ban them. There are kids which understand, but most won't especially not on youtube.", "@Ka Ne I don't know where you are basing this \"mostly kids\" from but maybe you know something I don't...", "Chat: I'm OuTtA o' HeRe.\nMe, a VOD fan: This is why everyone is OK with Ame dating yo mam.", "Bro they haven't know that veterans watch 4-6 streams at once 😂 ppffft", "Chat was disgusting during this stream. I get that Gura would be brought up since they're playing at the same time and sometimes talk to each other, but is it really necessary to spam every little thing Gura is doing on Ame's stream? It's incredibly disrespectful to the streamer to keep detracting from her stream to talk about someone else. Not to mention all the backseating. Help is nice, but people seemed more hostile than ever before with their suggestions, and Ame really sounded like she just wanted to do her own thing.", "Facts", "I was watching both of their streams too and did notice Watson’s stream was more toxic. Ame did a very good job handling it though but it sucked to see.", "I watched Gura's stream and they also do backseat like telling her to eat even tho she had no food. But it's definitely brain-dead level in Ame stream. She didnt deserve that tbh. Cant imagine how these people treat people irl.", "@Royyan Adiwijaya They can't, because they're quarantined so they forgot how to be a decent human being nor how to properly make a conversation like me lol.", "If you want to sync up Gura & Amelias stream, 14:24 in Guras [TIME TO ENCHANT] & 2:08:50 in Amelias [RailwayResearch]", "Thanks", "Thanks! Will use this later!", "Thank you!", "BLESS YOU SO MUCH", "PSA: Read the rules in the description! Please do not spam other streamers in Ame's chat without mention! Report the spam.\n\nAmelia to every JP super chat: こちら こそ! ありがとう！\n5:57:05 Creeper? Aww man", "Yup, In simple words:\nDon't be a rude dumbass and use common sense", "@b'tch, i am a medstudent Well not exactly... anywhere else and it's not considered rude. It's a rule imported from another non western streaming platform. It's far from common sense which is why it keeps getting broken.", "@Freeman319 Well I hope they still follow it. Rules are still meant to be followed in respect. If there's a problem with the rules, then it should be 'amended' but if there is no problem with it, don't break it. It's still considered rude when the rules are laid out there bare in the open in in the description. We are blessed by such wonderful vtubers, so it'd be pretty best that we follow the certain protocols.", "@Freeman319 If anyone bother to read the description under the stream they would know. This is why I don't want Hololive to go too mainstream, ppl is too custom to spamming Twitch culture", "@Ez Plasma Usually there's nothing important in the description so nobody bothers to read it unless the person tells that there's something worth reading. It's usually only used for fair use notice and links ect. Nobody expects there to be rules other than no spamming, advertising ect. It's like terms of service. Hardly anybody reads it since it usually do not affect you in any way, but then get surprised when it finally does.", "@Freeman319 well yes , but actually yes as well 😂.\n  It is all fun and chill to mention smol shark or any other streamer.\n\nBut most ppl are pissed cuz they were being dumb rude,", "@b'tch, i am a medstudent Agreed.", "@Freeman319 It is considered rude everywhere. Try going to any Twitch stream and mention you are going to watch another streamer, and see how quickly you get banned.", "@Rijul Ganguly Dude that is not the same thing...", "@Freeman319 how is it not the same thing? “I’m going to x streamer bye” “x streamer is better than you, bye” will get you banned", "@SoosUnknown What I mean is that simply mentioning another person is not same as \"I'm leaving your stream for another streamer\". It's like saying greeting somebody is rude because saying \"Hello motherfucker\" is rude thing to say.", "@Freeman319 I get what you mean, its fine to talk about other streamers in some contexts, I just think during ameila's stream it went a little overboard (same thing as those who were trying to 'police' the chat). Hopefully it improves as the new members learn when to mention streamers and when not to.", "This PSA should be in Gura's video", "Good point. I wonder if my target audience will even see it though.", "@rubbermarble888 I think gura will address it so i think the target audience will get the message hopefully, I think these kids don't mean harm but they dont seem to realize how it is annoying other communities.  Hololive JP was similar when they started to blow up with subs and viewers, now it is not as bad. Part of the issue as well is that it's minecraft, in other games gura's chat is not that bad, minecraft seems to bring out a lot of kids that have no idea what hololive even is lol", "@SoosUnknown Yeah, I was expecting this to happen once I saw the Minecraft collab happen. I saw people comment \"who is the blonde girl\", let alone not recognising Sora. It is inevitable.", "\"Gura's chest too small\"\n1:52:44 Amelewd - 2020", "A smol price to pay so she can swim fast.", "Rushia:FINALLY A WORTHY OPPONENT! OUR BATTLE WILL BE LEGENDARY!", "@Slushys Uwu theres quite a difference between smol and fla-", "Ame: \"Gura is better at this game than me, she's probably out doing something very dangerous and that's why she's dying a lot\"\n\nI wonder what Gura's reaction will be when she watches this? Is there a tomato shark? A shark whose face is red as a tomato? That would be a treat to see.", "First 30 minutes of stream: Let's experiment on how mine cart works.\nLast 30 minutes of Minecraft gameplay: I am the IRON GOD of these lands.", "Gura at the start of her stream: I'm gonna rescue you Amelia\nGura a couple of hours later: stranded at the ocean at night while it's raining, with half a heart left, hungry, lost, and only holding a single flower and a block of dirt\nGura at the start of her stream: I'm gonna create enchanting table and a diamond pickaxe", "@Kent S i cant tell if this is a hate comment for those ppl ssying they r leaving for gura's stream or js sarcasm", "@RestrictedPomegranete Procures Juice prolly just a joke poking fun at gura", "@knucklejoe thx", "@RestrictedPomegranete Procures Juice We tease our scatterbrained shark because we love her", "Out of all of the HoloEN members, Amelia was the most explicit about Minecraft being too slow for her and that she could do it as a collab but not any other way. Now she's among the first to jump right in and play solo.", "She got way better as the stream went along so I’m very proud of her I’m pretty sure it won’t be to much of a problem for her!", "She's playing solo, yes, but her plan is for her to do this to implement it into something she's working with her friends on.\n\nIf she was only playing singleplayer then I think what she said still applies.", "Minecraft isnt a slow game really it depends on what the players do that can make it fast or slow", "I think she's kinda like me where if I don't have a goal in Minecraft I'll get bored and stop playing, the other times she's played she probably just started a game and didnt really have something she wanted to build", "\"It's too slow\" is what I said. I always thought of buying it, but I only finally bought it a couple of weeks ago. I decided, I know I'm 9 years late to the party, but what the hell I'll give it a try. Maybe play it for like an hour or two every once in a while.\n\nI'm playing it like 6 hours a day, in survival mode, mostly building stuff. I'm purposely not doing it in creative, because doing it in survival feels more like an accomplishment, I guess. I underestimated this game. It's very satisfying to create stuff. Amelia is probably similar.", "@flamingrubys11 or the seed", "03:56 START\n04:24 PEAK\n04:42 LAWN(HI\n04:48 ICE ASMR?", "38:53 a little lost\n39:38 cough \n40:28 kill it!\n40:57 cough", "1:08:30 HIC\n1:09:13 BGM/stretched/second mine?\n1:10:03 the end of world?\n1:10:42 I don't want to fight ijust want to mine~", "What a madlad", "1:48:25 HIC\n1:49:25 WEEEEEEEEE\n1:49:34 Guraaaaa\n1:49:50  Arrow tail(lol", "3:39:50 WEEEEEEEE\n3:54:50 HIC\n3:58:28 nice!\n4:01:14 Gura!", "====(chat mode)=======\n5:08:09 SC TIME\n5:13:22 400K  CELEBRATION!?\n5:24:37 Have some water", "such speed, must have been taking notes while the stream is on", "Wow fast", "Thanks hero!", "Stellar work!", "Thank you ありがとう", "HERO", "@Mad Tech he’s taking notes on every god damn stream, such a fucking god", "Much appreciated!", "57:07\nStop backseat gaming. I know what I'm doing, okay?\nI mean, it does help, actually when you guys backseat game a little bit, but y'know, for EVERY LITTLE THING? C'mon. I don't want to play exactly as you play, I play my own way. The reason why you guys play the way you play is prolly because you have experience, and like, doing those things through experience, forming those habits, you can't expect a new player to automatically form those too, because obviously, you do them because it's more efficient, but as you keep playing and you gain more experience in the game, you become more efficient and that's how you guys know, and that's how you guys learn, and that's how players should learn, okay!? STOP! SHUT UP! I'M FINE!", "At this point, Ame's gonna become English Korone...", "How so?", "@Skelyos I’m guessing he’s talking about the long streams?", "@Skelyos i think he's talking about the woof woof she does lol", "Amelia: stream for 6 hours\nKorone: \"No sleep. Stay awake\"", "..its 6 hours..", "よしリスニングの練習はこれでバッチリだ😎😎let's study English🥳🥳", "Pls guys, READ THE DAMN STREAM RULES. The damn live chat irritates me with backsitting and raid spam. Tip: DON'T DO IT!!!", "Sadly, welcome to Youtube, where 90% of the userbase isn't even aware of the \"show more\" option under the description.  And also America, where rules are at best treated like suggestions and at worst treated like some kind of evil control to be avoided.", "@Tahanok2 this is why I gatekeep, to keep idiots out from here 😂", "@Tahanok2 Probably because most of them are probably a bunch of teens/kids that like to spam chat mindlessly.", "This stream was hella fun since it's a 6 hour minecraft stream and i enjoyed every second of it but..\n\nAme's toxic chat made of 12 year olds made the experience almost unbearable, thank god she didn't mind too much of it, there was just way too many people backseating, spamming gura raids, breaking rules and being extremely disrespectul to the streamer, yikes guys hope you change for the better, seriously i had to minimize chat in some moments of the stream...", "I just wish there was a mod who will ban this kind of people", "@kiell borja yeah same, unfortunately youtube mods aren't as powerful as twitch mods, so it's not enough for moderating 20-30K viewers...", "I hope they aren't here to stay. I'll expect most of the toxic kiddies to leave within a month. We're in it for the long haul, the ADHD kiddies ain't", "@Captain BaseBallBat-Boy i mean they can stay cause that's good for ame's viewership, but their attitude needs to change or adapt for the better i guess, cause i think most of the new ones came from twitch streams or something", "@Tenchou I do hope they \"do\" change but many will not unfortunately. Was watching the stream and cannot even enjoy even with chat minimized. Really ruined the experience due to the volume of toxicity.\n\nWhat's way worse are the backseat gamers since they brag about their gaming experience like they are \"entitled\" to \"impose\" what Ame must do and not do without even answering her questions why she must do it.", "@Tenchou I don't think you expect that many people to suddenly change their behavior on a dime. \nAll of twitch is extremely cancerous, and it's not like we got a chemo therapy just lying around here. \nBut hololive's the meme du jour and it will probably all blow over soon.\nThat is the drawback of such incredible growth in such a short amount of time. What matters is those that stick around.", "Honestly, you turned out to be one of my new absolute favorite streamers. You're funny, smart and super relatable. Love your content, you absolute madlass!", "And don't forget her awesome voice and cute pets\n\nEdit: and the yo mama jokes", "I can really appreciate how Amelia’s first priority was establishing a travel network for the group. They got a communal area where they can develop and add to the land, but in case someone wants to do any (presumably) big projects like Gura’s Atlantis, it’ll inevitably take up quite a bit of space and while there’s some satisfaction in building it and showing it off to us viewers, being able to have one another take a personal look up close is a nice relationship-building activity. I hope to see everyone unleash their creative juices on the server.", "Yeah, I really like it cause it's the same sort of thing I always tend to do, reminds me of when I was in a geopolitical Minecraft server (i.e. the map is a scale model of earth and everyone joins/creates countries and stuff), and I was the first person to propose the construction of a large scale railway project, (started out as simply a Trans-alpine tunnel, eventually evolved into a pan-germanic railway network (the nation of germania at the time included the territory of the German empire, France, and the low countries, at one point it held north Italy too, but it was sold (that was when my Trans-alpine tunnel simply became a pan-germanic railway)) eventually the British players took notice and pledged to help turn it into a pan-european railway.", "The chat is very disappointing. For the new peeps in the community please read the rules.", "Most don't know that YouTube has a description box.", "@Robert Kristian Zambrano How!?", "@Starku I don't know honestly.", "@Robert Kristian Zambrano thats a lame excuse honestly, even without those rules, people need to use their common sense, mentioning or worse, keep discussing about other streamer is just rude and disrespectful. (Also reading the rules at something new is one example of the common sense that some people need).", "@NiKiGo It's either they don't know or chose to ignore it despite reading it.", "@NiKiGo to be fair, it happens all the time in all of hololive streamers. I was expecting the en audience to be policing so much since they can understand now what the chat is saying. Stay long enough in hololive and you'll get used to it to the point where you don't care what happens in the chat anymore. You guys are fighting and policing for pointless reasons tbh. Just let it be and enjoy the show.", "What else you can expect of people who laugh at dumb pointless 15sec videos and repeat any joke, that 1mil of another bollocks will repeat too.", "@Wonder Wander My man, you just attacked 80% of the internet.\n\n\nLmao.", "@Robert Kristian Zambrano or 90. But i it's fine, because it's hard to say that they are people, they more like a mindless herd.", "@NiKiGo For someone new entirely to streams, it's not exactly common sense. Plus, even for those who are aware of a description box, clicking on \"Show More\" (on PC) is liable to be a step few take. I wasn't even aware that these streams HAD chat rules until I stumbled across the extended description. (Also, on mobile, you don't even get to see a preview of the description without showing the whole thing.)", "@NiKiGo I didn't even know that the rules were there but hey, those rules are like the most common sense rules ever. Not that hard to do.", "2:33:16 she's so immersed in playing she ducked in real life to peek in the game lmaoo", "AME Heavy Industries, Ltd.", "Put a Corporation after Industries and we got AME HIC, Ltd.", "@novice 101 base it in Cupertino, California and we'll have AME HIC Cup. Ltd.", "@JoeXLee This is good official name for this lol", "can she fight USADA Construction and AKUKIN Construction, we'll see", "@Demonbane those 2 are just fronts for the biggest black company of them all: NenePro", "\"I don't really like minecraft\"\n\n6 hours later...", "Day 1: Digging a hole.\n\nDay 561: TNT powered fully-automated cobblestone farm.", "Notice how Amelia streamed Minecraft for over 6 hours when she said she couldn't get into it. I hope she tried out Terraria next", "Notice how she played for the entirety of Kiara's stream today too", "In Kiara's mc stream, Amelia was mining\nIn Gura's stream, Amelia's mining\nAt the end of Amelia's 6 hour stream when she's supposed to go sleep, she's still mining", "she played terraria first than minecraft but only last for 2 hrs and since terraria is just a 2D minecraft, she concluded that she might not like the minecraft", "@Bread I think she was playing before Kiara streamed, and she said she slept 4hours. So if she kept on playing for that entire time except that 4 hours............ Gsus Ame get 2 or 3 day off to rest", "@Mad Tech Where/When did she say this?", "Amelia so far has the fastest reflexes in this game\nDefinitely a pro gamer!", "I love how Amelia said 3 days ago that she wasn’t that into Minecraft and now we’ve just gotten out of a 6 hour stream. Glad she’s having fun with it 😊", "Detective do you know how the railroads got so fast? Train-ing.", "lol", "Bu dum, psh", "You should tell Ina to add this to her jokes vocab/arsenal so she can tell them lol", "It's nice to see that Amelia is enjoying Minecraft now contrary to what she said before (I mean, she streamed for around 5 hours!). Hopefully we see more Minecraft streams in the future and we see the HoloEN server become a great server.", "And I hope the others will visit the server", "Do gura fans really have to make it a point to spam everything she does in Amelia’s chat?", "Those kids are bunch of pigeons", "Honestly impressed she went the whole stream without dying once despite multiple near death encounters.", "saw a chat said \"U called me a backseat gamer?  I have 200 enderdragon confirm kills lol\"\nsuch a Minecraft master, and no one really cares abt ur pro achievement actually 😉", "I saw that one too. So cringe.", "4:23:20 Blissful ignorance", "3:08:38 \"a\"", "2:08:23\nGura discovers her backdoor", "Amelia \"I can't really get into Minecraft because it makes me sleepy\" Watson", "Really enjoyed the stream despite the chat being chaotic and all smh\nI'm glad Amelia is having fun and making great progress on the railways there, really fun to watch❤", "Amelia is:\n\n>British\n>Likes railways", "Amelia is the same one who said she doesn’t like Minecraft,look at her now.", "Just like with armpits", "say sike right now", "kiara said that too and look at her", "Remember guys Rule # 4. Please refrain yourself. And Amelia is amazing for trying to learn a lot here tehee", "Watching all the girls playing Minecraft like this makes me kind of miss playing it for the first time and manually going out to gather everything. Nowadays if I wanted to make a rail system, I’d just end up going down the rabbit hole of: “Well, I need iron, so I guess I’ll make an iron farm... oh I guess I’ll also need gold, so I’ll make a gold farm too... wood as well, so I should make a tree farm... I’ll also need redstone so I guess I can either make a witch farm or get some beacons to mine with... which means I’ll need a wither skeleton farm... so I’ll need a wither rose farm as well and I guess since I’ll be in the End, I can also get the enderman farm started...” and so on and so on.", "Very Chill Stream, nice to see Ame having fun as she builds the railway step by step. \n\nAlthough it makes me wonder what war zone Gura was going through while Ame was playing Indiana Jones XD", "Was wandering the whole stream since she said that, what exactly does o7 mean? I've only been following her for a few weeks so I might not get the reference", "@Rahadian Arkananta it's supposed to be a salute. The o is the head and the 7 is the arm.", "@Rahadian Arkananta o7 = Means you giving a salute to Ame or fellow Tea Mates. As far as I know, it first appeared in one of Ame's tweets and now has become part of Tea Mate culture for greetings and farewells during streams. It's also associated with the 150 gang. o7", "@Eston Oh my I just saw it now. I'm such a big dummy. Thanks for explaining", "@Ace Ellasos mind also explaining what 150 gang means? Looks like I have lotta stuff to catch up lol.", "@Rahadian Arkananta There was a stream back at Sept. 27 (28 in some countries) where Ame was supposed to start playing LIMBO for the first time. During the start of this stream, Ame started to have technical difficulties and went off for a bit to fix it. During this blank period, the number of viewers started going down. From thousands of watchers down to 150 (although some say it was closer 200). These dedicated tea mates waited patiently as she fixed her streaming problem. Keeping the chat alive and \"Holding the line\" for the stream. Pure dedication.", "@Ace Ellasos such a wholesome community. Love to be a part of this", "I love how she spent 6hrs on a game she said she doesn't really enjoy much just so she can improve her friend's quality of life inside the game she knows they enjoy. What a great pal to have.", "I predicted the future? Or did I.\n\nWhen I went out to a certain place ( to work ) I thought of Amelia and how fun it was to watch her content ever since her debut stream. Ever since Kiara’s announcement at hololiveEN’s ASMR snack collab I felt concerned. Scared of the unknown. The unpredictable future awaiting for her. ", "Who is this xQc guy and why does people watch/like him?", "@Haziq Danial xQc is one of the most, if not the most popular streamer on Twitch with probably an average of about 25k to 50k+ viewers every single stream. For old watchers he was known as a toxic streamer who would smash his keyboard, slam his desk, destroy his mouse and more whilst playing video games ( his toxicity can be mostly found during the time he played overwatch ). But despite that he is actually a grandmaster ( the best rank anybody could get in overwatch ) and he was actually in quite a lot of esports teams back in the days and participated in many tournaments.", "@Haziq Danial \nIs this an honest question? If so I’ll answer to the best of my abilities. \n\nxQc is a VERY well known [Twitch] streamer (Twitch being a VERY well known streaming platform)", "4:50:37 Gura being the true apex predator of the sea 😂", "Ca5ch then she literally dies LMAOOOO", "6:00:34\nTHE MINING MUSIC (a Minecraft parody of the song Drowning) AT THE END AFHSHAHSHSG [cool livestream as well, Amelia] 👍", "Where there were once 150, in today's post-stream chat, there were 739 brave souls holding the line!!! Thanks for the long stream today, Ame, get some sleep so you can be prepped for your upcoming collabs and streams~!!!", "People calling amelia toxic and me a mw and bo2 veteran sitting here like: wow she's really nice", "New bloods, stop treating Hololive and Vtubers in general with Twitch culture and spamming Raids. Read the rules and adapt to these rules. Thank you.", "I'm really happy I found this channel. I have a night job, so on the days I'm not working, I'm just up alone at night. There's something very peaceful about watching Amelia play the game with the Minecraft music in the background", "I love how cautious Ame is, some girls don't take the precautions she does xD", "I feel that Minecraft, unlike most other games, largely benefits from sources outside the game to understand and learn.\n\nMinecraft is extremely unintuitive, and provides almost no indication on not just what to do, but what you CAN do. It relies on you either knowing someone who already knows how to play and you learning from them, or you researching for yourself. ", "Agreed.", "PREACH! Finally!\n\nPersonally, it’s why I think tutorials can be so useful and popular. Good ones are ones that tell you how to do a certain task while also taking the time to throughly explaining it, so then you are able to take from it and apply it in your own wacky experiments.", "More people need to see this.", "@Haziq Danial I'm glad you think so! I may post a nearly identical comment on her next Minecraft stream if I feel this applies there and could still be helpful. I'm not too sure it's a good idea but I'm still curious what others think about this.", "Golden comment. To be perfectly honest I was one of those peeps who kept saying “do this” without knowing the meaning behind what I was doing. And also as someone whose played Minecraft since 2012, I shall heed the advice from this and carry it onward into future MC streams.", "I think it's different from other games each action has a set progression for Minecraft goals is be made by the person", "Mate, when you have 30,000 people spamming chat at 10 posts a second, Ame doesn't have time to read the reason behind why things happen. The maximum length sentence you can conceivably read in the fraction of a second that the chat is visible is like 7 words or something. Although I agree with your post, the reality is that it's just not possible with the sheer volume of posts flooding chat every second.", "@123457474869 I completely agree! In general chat is not a good way to learn how to play, especially when it comes to Redstone. But a conscious effort to avoid spamming out of context orders and instead a focus on pointing out the root of what Amelia's current problem is would still be helpful. ", "Minecraft stream gets 2 times more viewers but also 2 times more toxicity in the chat", "I was during that whole thing thinking, \"Why is nobody in chat explaining that you put a block behind the track start, so you can put a track on the overhead block and force the powered rail to be sloped, that way when you push the button the unpowered track (which stops it from rolling downhill) becomes powered, and gravity kicks its forward motion off?\"", "Is it just me or her chat is not really on the same maturity level of her content? The chat was big time cring.", "Yep, don't worry, they will die down eventually.", "In other streams it was better. It's probably because It's Minecraft, I guess", "Unofficial collabs are the best kinds \n\nBut, guys we need to be kinder to the streamer", "holy macaroni, 6 hours, i was there 5 hours i thought she done and then there's extra 1 hour?!", "wow.. this whole 6 hours stream along with minecraft ost is really relaxing...\nalso love to see a non direct collab with Gura", "Ame: \"Not a Minecraft fan because it's not fast-paced\"", "It didnt help that i was also playing Minecraft on a server and the walking noises always scared me thinking my friends hopped on and started chasing me. Regards, it was a banger stream.", "Some rude chat spamming:\"leaving for another hololive member's stream\"\n\nME:\"watch two stream with two device\"", "Disappointing chat. No class whatsoever. Still glad that Ame managed to enjoy the game. Hoping for more.", "I'm actually surprised that she got the efficient power rail number randomly. I guess she did max her luck.", "Hope people stop with the backseat gaming and just let them fcking play on their own unless they asked for help. Also spamming gura this gura that in the chat is pretty rude. Same with the people spamming gura raid like wth this isn't twitch", "When Gura isn't on screen, people need to be asking, Where's Gura?", "I hope she plays more chill games like this, im afraid she will burns out if she keeps playing ragequiting die-a-lot games like mario oddysey and stuff", "I'm looking forward to the future where Amelia has mastered redstone enough to create an entire railway system with automated stops", "I see, so that's why she was watching Netflix's \"The Witcher\" while playing Minecraft last night (in Kiara stream, Ame was afk and she said she was watching \"The Witcher\").", "I don't like getting annoyed by people in the chat so now that chat replay is up i can finally block lots of people. Nothing personal", "Same here. Was watching her stream but didn't really enjoyed it too much because chat was being annoying with false information, spamming and bringing backseat gamer mentality...", "@Ham Star why have it open in general then? I don't get leaving it open as the viewer especially if it takes away from the stream for you? I literally watched a few hours of both girls streams live tonight and never even knew chat was being a problem until people complaining in the comments post live. so idk just only have it open if you want to donate or say something.", "@President Digs I hate you but I'm going to do the same thing", "either you're a Filipino or you just love Duterte", "2:08:20\nFor people looking for Gura's backdoor ;)", "2:44:19 lmao Gura", "5:10 - man, her BGM really is fire since she always enjoys humming it every single time hehe XD", "29:40 is it just me or does it sound like she said Indian music", "I must say, Amelia, watching and listening to your mind at work is beautiful, along with that little gremlin laugh of yours and the loads of salt you have on you! I'm excited to watch you grow and evolve as you learn more about redstone, minecraft, and life in general! I got a funny feeling that you could be an awesome mod creator if you wanted! You are AMAZING, both with your crew and apart!", "You got addicted to Minecraft, Ame! Great stream as always!\n(Today's chat is really wacky, some chat is M, some chat didn't read the rules or just some trolls, and some chat is normal and wholesome but it's still fun lol)", "i really love how Ame is actually enjoying this game and I WATCHED THE ENTIRE 6 HOURS OF IT. \n\ni dont even play Minecraft ffs D:", "For those interested in playing back both streams synced up (Gura's is at https://www.youtube.com/watch?v=3_mDtToNWLQ )...\n\nWatson's stream time is 1:54:26 ahead of Gura's, so if you start Watson's stream at 0:00 and Gura's at 1:54:26, things should be approximately synced. I based this on when Watson said \":D\" in the chat at 16:06 (Gura) and 2:10:33 (Watson).", "Oh God, just like we've fallen into the Vtuber Hell Hole, Ame has fallen into the Minecraft Addiction...\nGood luck getting out, I've been here since 2012 and still haven't been able to stop", "Wow this is actually relaxing", "The backseat gaming was really bad this stream. Kinda reminds me of Aqua's Skyrim stream in ways, cept with her there was a language barrier and she didn't say anything about it probably because she is too nice.", "1:43:03 Holy dang was that impressive 😳 She has the knowledge of a rookie, but reacted like a pro\n\nSee also 1:44:16", "5:57:00 So we back in the mine!", "6 Hours of Blessed ,sign me right up", "長時間配信お疲れ様でした〜！途中ぐらちゃんと一緒に遊んでいて、ほっこりしました！レーンを数えてるところも可愛かった！次回も楽しみにしてます〜", "You're really getting into minecraft now that you've got goals in mind! Great work, detective, that was a great stream! Get some well-deserved rest!", "Amelia stream: Seeing Watson construction Inc. efficient railway & underground construction.\n\nGura stream: Build a door!\n(It is not much, but it's a honest work!)", "me: Sir there's not enough time to finish the projects!!!\n\nalso me watching Ame stream for 6 hours straight:", "Some random kid: Amelia will you mary me!\nAmelia: Naa bro.\nThe kid: why?\nAmelia: I’m already married to your mom!", "whenever she pops out from behind the desk like that, it reminds me of Jazzpunk xD", "Man chat was the whole circus for this stream. Made it hard to watch ame at times when she had to scold chat.", "Gold is abundant on nether, she should probably go there.", "Gotta say\nI can't wait to see future HoloMyth generations looking at the work Amelia and her group of chaotic dump girls has done in just a short time on the EN server", "Watson gets lost building an underground Shinkansen, while the Shork battles zombies and dies repeatedly.", "This game has some kind of magical power that transferred all of the salt directly out of Amelia and into the chat.", "Thanks for the 6 hr stream despite the chat being chat and a few deaths. At least you made a lot of progress that's what matters. I enjoyed it.\nBut y'know despite not into minecraft, you ended up getting addicted by it. That's what minecraft does to you I guess.", "BARK BARK\n\"Hold on.\" ame slides off screen\n\ni'm scared", "Watson: I fight for my friends!\n\nGura: a", "Geez, I had lunch AND dinner during this stream. Thank you detective, but please get plenty of rest!", "Gura starts her mining at 2.04.00 in this video. (11 minutes into guras video). So you can watch both of their videos at the same time. This will be useful later on. :P", "Her interactions with Gura were cute", "man, the chat was more toxic than Ame, they didn't let play her way with the backseat. Anyways, was a good stream", "Ame: railroad halfway done in 6 hrs Progress.\nGura: puts down a door I'm done. quits", "6 hours? Hola... Literally started when I went to sleep and ended when I woke up", "3:24:00 there is a spawner :3", "great episode to watch from both perspectives", "Ahhh stream didn't pop for me, but had feeling one was going", "I had to sleep right at when the stream was 4 hours long at it was midnight, but that also means the stream went from 8 PM to 2 AM EST\n\nIf you want to see this weekly \"skedual\" then go to 7:04.  Also \"skedual\" was me mispelling, i dont know how to pronounce it but you know what i mean right?", "me: I will catch every minute of the HoloEN server streams\nAmelia: Is that a challenge?", "Yo, so Im new to this HoloLive stuff, just want to know the best way to watch the colab stuff. Is there someplace I should start off or do I just jump in??  Also, who is your favorite En Holo?", "All these new people and people who go back and forth between streams need to be respectful of each streamer. Just because they are playing in same game doesn't mean they gonna do collab. Let em play as they like, if they need help they'll ask. As part of chat we need to do our own part to create a fun atmosphere for everyone. We should not bully streamers to do or play like we play. Everyone has their own pace and approach to games. Let's sit back and enjoy the content and try to maintain good interaction.", "Amelia now has become that old meme comic \"oh, it's just a cute game, i will give it a try... \" And 6 hours later \"Cubes........\" Kk Nice", "Ame so cute~~~", "Her dogs really wanna be in the stream.", "Her dogs really wanna be in the stream.", "Dude chat on this stream was so cringe and toxic, smh", "I’m freaking impressed by the amount of time this stream lasted, normally people would tire out from doing an hour.", "was late for the stream so i rewatched the whole 6 hours. twas wholesome all the way.", "This was a chill stream to watch. \nI’m still worried about her swords though. She’ll learn eventually... right?", "Oh my god, what a long stream. Good job, Amelia!!!", "Chat has lost its Helping Privileges", "6 hours? can't wait to start this one, when i get back from work tonight.", "I never played Minecraft in my entire life, but watching Ame figuring things out and creating railways, mining shafts, and continually making better QoL for other members is satisfying.", "Stream ends\nYoutube: 7 HoUrS AgO", "I swear she's playing too much Minecraft right now that she'll one day be able to build a British Spitfire using redstone engineering", "Can I see MC taking over HoloEN. Not\nComplaining love MC can’t wait for more streams from everyone!", "57:06 Damn the detective is giving statements", "korone: oh your approaching me", "I'm just looking for the time stamp guy on this stream", "Amelia here's a Minecraft tip, taken from the wiki: \n\nWhen you are falling (for example, a jump) you can do more damage than simply clicking the button to do a normal attack.", "Amelia: its finee \nYo: its kawaiiiiii\nAmelia aprovecha el bug", "Who's willing to bet Amelia starts a prank war at this rate?", "I would LOVE to see that! Only good-hearted fun, though!", "I remember her saying that minecraft makes her sleepy in another stream\n\nshe ended up playing for 6 hours", "All of chat after half way:\n\nY O U M U S T C O N S U M E T H E F L E S H", "watching their streams side-by-side is so funny. c:", "I went to bed when the stream started. Wtf, 6 hours? O_O", "Very fun stream Ame 6 hours of pure gold moment with Gura-chan i really enjoy it. \nCongrats for 400k !!!!! YAYYYYYYY!!!", "#49 On Trending for Gaming.\nI can't believe it.", " I saw this from the beginning till the end", "at this point i just want the minecraft stream chat to be members-only chat", "I'm not a member But i have to agree, it was annoying af", "I just use chat to say “LOL” or “LMAO” during a funny moment, I’m one of the many people who are here to enjoy the stream", "@ShoGuN same here, but i like to see the chat reaction in some moments, the jokes and memes that are created there, the community is part of the magic in hololive, and then when something like that happens is really annoying (sorry if i made any mistakes I'm not soo good at english yet)", "Im too broke for membership, but if chat keep thiw toxicity please make it only member only chat", "The music is sooo nice~\nCan’t get enough of it", "Lol, my ad for this video was some detective show 😂", "10:30 Ohhh I would love if we keep the weekly HoloMyth collabs! ♥", "She made a lot more progress than Gura  ❤️", "Great stream Ame! We had fun watching you build your rails lol hope to see more minecraft gameplays from you", "Keep on searching Ame, I'm sure you'll find Mr Pocket eventually.", "What I do to not get lost in caves is putting the torch on the right side of the tunnel. That way I know that if I see the torche on my left side, I'm going out of the cave.", "I unfortunately fell asleep mid stream but it was really good to come back and finish the vod, it's great that you're having fun with the game.", "Man I can't believe Ame was our dad all along, can't wait for you to build Ame's wild ride papa 150 gang checking out o7", "I didnt check into the stream cus I got the notification 5 hours ago I thought it would be done.... missed opportunity", "Ame-zing stream as always!", "thank you for the chill 6 hour stream. it's really nice to watch while multitasking. im glad you're getting more into minecraft now too!", "375 Irons, 150 gold, and 250 redstone dust. Doable!", "Enough said about the chat fiasco, but mad respect for Ame not let this affect her doing her own things... she might have missed the chats (i doubt it cuz of how frequent it was), she probably have ignored it, regardless, if she did see, she remained focus on her own stream and not feed reaction to the disrespectfullness.", "They're going to stop the collabs? They're so much fun, though. I really hope they do decide to do more in the future, especially of minecraft.", "There was one today and another coming up on Saturday I think", "Kinda wish i was on so i could of told the best rail effciency 3 powered rails at the start then a poered rail every 35 normal rails or round about that", "The stream did not feel this long, damn", "Anyone know why I don't get phone notifications when Ame goes live? Would've loved to watch this live. :(\n\nI have the bell set to \"All\" and everything", "You could manually set an alert when the stream premiere box appears several hour prior itself, that worked for me.", "Great stream amelia! Had it up on the side, since it brought me and my close friend (room-mate) into wanting to do our own server again. Thanks for the entertainment of building the holorail.", "Oh my god six hours of digging holes.\n\nYeah that sounds normal.", "Massive respect for streaming .25 of a day. Hope you have a great nap!", "Good luck on our Hic highlights creators if they didnt watched this stream or watched midway 😂", "I reported like 100-150 people for spamming \"Gura Raid.\"", "Doing gods work o7", "Does youtube actually cares to even sort out these reports tho?", "@With clarity i think the reports go the  Channel owner? So he/she can take action, but i might be wrong", "watching amelia mine gives me anxiety on how many times she felt into lava, put water inside lava, mine near lava, jump a block away of lava, jump into lava & a cross", "I just got here one minute after the stream ended", "She seems so mature. I like that.", "She understood the meaning of \"mine\"craft xD 6h of mining", "I love Ame but I can't follow this crazy rhythm, she basically went bananas with the time of the stream", "well chat is annoying.\nalso people. she is new EXPLAIN what things do when you suggest something.", "i had an exam this morning and when i finished she was still streaming lol", "Cant wait for her to find out how Pistons work. and maybe explore redstone engineering.", "Ame the gamer powering through her builds. Good thing it's her as well, as she's probably the one capable of animal breeding/food farms (ethicly speaking lol) and mob farms (technically speaking).", "next research : make and ice block railway, then use a boat...", "Being ignored is great 😆😆\n6:00:34 she is singing", "2:44:10 \"MISSION FAILED\"", "@5:10:05 Had to leave after the first 20 minutes for work but was nice to catch up. Glad you got my message.", "Ame : your next line is \"did you do this?\"\nGura : did you do thi- NANIII???!!!", "at the end tho\n“I’m mining,I’m mining”\ntriggered some nostalgia in me,especially since the stream had sweden on.", "Glad she’s getting into the game really like watching vtubers play this for some weird reason", "Chat being really bad at explaining redstone mechanics", "Holorail can be a good pun of hololive, especially if you read hololive as it is read in japanese - hororaibu would become hororairu.", "Amelia you are the best thank you very much for having been with us your work is appreciated: D\n\ngura had a bad streak", "1:49:47\nGura: \"What?  Oh would ya look at that\"", "She is learning redstone...\nLast time a wild bunny discover redstone. A family of pillagers have to suffer.", "2:08:29 and it basically is what Gura said.", "1:40:24 that part literally scared me holy", "Thank you for enlightening me with these 6 hours", "Amelia te saltastes un diamante en el minuto 6:00:40", "Ame railways company making lots of progress. good job 👍\n\nunfortunately in the chat\"Gura fanboy\"isn't mine-ful with our hardworking girl here.", "That \"fack you\" at 4:50:05 is great.", "Congrats on 400k Amelia\nWell time to watch 6 hours of content", "ok now it's time to rewatch the stream", "Congrats on 400k Ame!", "1:58:32 to 1:58:40 is a very good sequence of sounds.", "4:34:23 🥾👈🏽⁉️", "Swag", "Swag", "Swag", "Swag", "she should of been a bat girl because those hiccups sound like bats echolocation", "We need mods. Like 200 of them.", "Do hacked clients and Baritone bots count?", "Don't you just love these guys in chat who tell amelia to enchant her tools or even better build mid-end game tier farms despite the fact that she's clearly a beginner.", "3:54 start / 開始", "A fun 6 hours of ame in the background as I tried to clean my apartment but ended up just sitting down and watching instead", "it's pretty cool how deep into the witcher amelia is getting. reeeeally looking forward to her witcher 3 playthru", "SIX HOURS!?\nNO WONDER SHE WAS BROKEN IN GAWR'S STREAM", "RIP the missed Zombie Dungeon at 3:24:00", "3:50 start Yei", "Next week she'll be making Redstone computers to automate train management", "Omg.... Six hours. You have the stamina of a Minecraft pro. Bless you. Keep up the good work!", "I was never big on Minecraft cause it felt so aimless to me but these streams are gonna make me act up", "if anyone wants to sync up Gura's and Ame's stream\nGura 12:30\nAme 2:06:55", "May I know what happened to the live chat stream? I was off work when she streamed this.", "Honestly?  If you're familiar with Amelia's streams, chat was the same ole same ole.\n\nGura streamed at the same time, so it was funny watching both streams from different povs.", "Yea, Ame streams always fun to watch, but I saw comments saying the live chat was breaking the rule or being disrespect, but I just dont know why.", "@Su Su Minecraft has become one of her most viewed videos.  So we be gettin' some non TeaMates.\n\nPersonally, I think a lot of people unfamilar with Ame's usual chat appeared, so they were aghast when they saw lewd, toxhic, and pre-recorded spam.", "peoples keep mentioning Gura this ,Gura that,go to Gura,call Gura , I'm going to Gura stream and etc.that's the most disrespectful part.\nthe chaos part when other people start spamming stream rules and the live chat only filled with those comments", "@Freyja Wion \n\nWatched about 4 hours of Amelia's Minecraft stream.  I have no idea what you're talking about.", "I will actually open 2 tabs if possible, they are both is too wholesome to watch", "The new Cornelius Vanderbilt", "Can anyone gives me timestamp when she said what gura accomplished in her stream today?", "that weeeee though", "Ame you should watch the movie Memento for a watch along good mystery movie", "14:32 el mejor momento del stream", "Listening to Amelia's voice with the Minecraft soundtrack on the background is such a pleasant background music.", "I like this stream a lot \nIt was a rollercoaster of emotions", "2:34:00  Pog save!", "Hm I wonder what personality I’m gonna see today", "a hardworking and empathetic detective 7u7", "6 hours......6 hours?!!,!,! Alright. Time to watch.", "Yo Imagine Actually leaving a dislike? That's pretty cringe bro.", "You country ez to live?\nJPN hard to live.\nSupporting From JPN.", "Excellent stream master watson, it was very fun! 💕", "Thank you for a fun stream Amelia, You doing good on minecraft at for more adventures ", "Youtube chat is becomingl like Twitch chat. Disgusting", "In Minecraft there are 3 gods being Viniccius13, Forever player and Davi. Viniccius13 is definitely the god of redstone, forever player is the god of the land he has already destroyed a mountain the size of a continent, David is the god of water he has already dried up the OCEAN. All are Brazilian Youtubers if you want any tips on redstone Viniccius13 would be the best to help you with that.", "ameila is tring to make the tree of life Ydrasil to travel back and fort trought time", "Omg 6 hours", "Chat needs to  ch i l l", "6 hours )))", "The stream actually gets better if you ignore the chat at times and that is just sad.", "Amelia is the one to protect, she really puts her all in this", "2:45:12 This is how it all started", "For her house to be so good and shes a \"beginner\"? I m embarassed at myself :/", "6 hours? Okay Amelia you need to sleep you know", "2:08:25 for Amelia's side on Gura's backdoor", "Omg 6 hours archived video. I wonder how many Yo mama jokes in it", "Wait what happened with chat? I couldn't watch it live", "cancer", "A lot of backseat gaming and people not reading the rules, just ignore them and they stop eventually", "People acting like kids\n/kids being kids i dunno.\nI m new in this community yet it was somewhat annoying af", "I cam see now her MAXED OUT LUCK STATS. LOL", "4:50:09 you wont regret", "Fun Stream Amelia i love your gameplays , see you soon :3.", "Chat was awful, and was made worse by people trying to white knight ame. Just block and report, discussing it makes the problem worse", "Ame is really growing on me. 🤫", "i wish they could use full bright just so viewers could see better. idk, maybe darkness is part of the minecraft experience", "24:50 that rhymed", "SIX. HOUR. STREAM.", "Fun stream! ! ", "okay im late but im gonna watch anyway", "what is o7 o had missed the stream", "It's a little man doing a salute o7", "＿|￣| ⍨⃝\n\nok Ame I get it, i Am kneeling!", "4:36:20\ngoodluck lmao", "Wow six hours!\n\nPutting in them real gamer hours!", "Is there a way I can go to her map in minecraft?!", "Great stream ame", "14:31 LOL", "Amazing", "She really did a 6 hour stream,,,what a queen I respect that tbh", "Thks for your hardwork ame😣\n\n\n..", "she only slept 2 hours before her collab with Kiara.  +6 hours more off stream of minecraft.  Our detective is working hard.", "6 freaking hours???\n\nthis woman is crazy.", "I’ve noticed chats kinda been a dumpfire recently tbh. Good stream Amelia", "4:41:04 sleep", "1:52:37 Ice Cold Amelia\n3:20:02 Gold Digger Amelia\n4:50:09 Outplayed Amelia", "Ill be real, gura-minecraft is a bit frustrating to watch since she can be sooooo scatter brained. amelia is like total opposite, soo productive and always learning. big brains", "Congratulations on 400k Amelia!!!!!!", "Her outro sounds like an apple alarm", "Rail expert", "6 hour stream", "I missed this stream sadly.\n\nWhat did chat do?", "We did very bad stuff, I wasn’t really paying that much attention but I saw some people say there were a lot of people breaking rule 4", "Breakin rules all over the place fam.", "Having child like manners who have disposed because of their stupidity", "Maybe you can try streaming The Witcher III", "Everytime another member logs into Minecraft, it just evolves and most of it is Amelia's doing. She takes \"Amelia is everywhere\" to a whole nother level once again.", "犬になりたいって？俺もさ", "57:12 her ranting xdxd", "Someone clip that, it is a good reminder.", "Chat Never Fails To Amuse Me", "Why would you leave one livestream to go watch another, why not watch both?", "Long stream", "R5 3600... Look like holoEN really like Ryzen...", "oh no she might become the pekora of the group", "Give Ame another week of minecraft experience and she'll build a redstone super computer", "It's really fun to see someone learning to something new like she did\nShe learn a little by little about Minecraft, made a progress...", "Chat, next time only backseat game when she asks and after the task is achieved stop. And no \"raid\" nonsense - This isn't twitch.", "The chat is unbearable \nToxicity is almost comparable in twitch\nI hope this not last long", "Well, this will die down eventually. Hope these Twitch viewers can distinguish that their culture cannot be applied here. If they cannot follow a simple rule like that, then I hope they leave.", "Yeah I hope too, twitch herd came to ruin really good stream with their toxicity.", "@Beefstew This is not gatekeeping by the way, it is just simple rule following", "Amelia you're so cute. Do you like girls?", "Gura coming in for the pincer attack  4:50:34", "She plays with music on.", "It's as heartwarming as it is stressful to watch someone in 2020 learn Minecraft from scratch... Our Amelia has so much to learn. She'll make all the mistakes we made and learn from them, since she stubbornly refuses to listen to everything chat shouts at her.", "Wait does she play on Java or Bedrock?", "Did we ever get a mein mine?", "yikes 6 hours lol", "1:45:46 was a cute huuh", "One thing I am not use to the hololive EN is that no one makes the start timestamp", "Does she speak English natively?", "Is she aware that the witcher 3 has very ecchi content?", "You should use blue ice instead and use boats, it's much faster", "6 hour lol", "Wait until she figured out how to make a nether portal by just using lava bucket and water.", "wonder wat will be the ideal mod for each of the girls", "RULE 4", "I don't know about you guys, but even if Amelia is unpopular and only has like 5 subscribers, \nI would probably still watch all of her streams.", "She is hooked \nFo sure", "Korone: FINALLY, A WORTHY OPPONENT", "Read bitchin kitchen i thought it be a collab with Haacha", "14:33", "Amelia accomplishes more in a minute than Gawr manages in an hour", "Fun stream ", "Damn.. the spam is cancerous. too much backseat.", "Amelia about to pull a pekora and prank everyone", "Gura salt at 4:25:56", "If u on pc, press 9 in video and watch", "amelia is tsundere lmao", "I think Amelia would enjoy modpacks like tekkit a lot.", "it would be better if you guys taught her how to build a portal system its more efficient. It would also solve her gold deficiency.", "4:56:33", "Amelia and Gura are Yin/Yang. Order and Chaos. PB and Jelly.", "Anyone else think Amelia sounds like Dakooters?", "Amelia Musk", "I'm not sure if this is the case for you but, I know of a few streamers who have mentioned that when they stream minecraft, it actually appears darker on the viewers' screens than on yours as you play. You might want to go back in this vod and check out the moments when you were mining in the dark (there are parts where it is actually pitch black)", "o7 to the 725 people at the end keeping the chain going", "2:06:57", "Ame : streams for 6 hrs\nKorone : rookie number", "Wow 6 horas jugando Minecraft?\nYo nunca habia estado tanto tiempo owo", "I swear to God I hate the vtuber community sometimes", "LOOL u guys think that the view count being so high is because the stream is so long that people fall asleep and then youtube's algorithm sees how \"engaging\" the video is since the average watch time would be so high and recommends it to more people?", "That's only a small bit of it. The rest of them are people who put it on in the background, like me!", "They should have gone with ice boat strat  since it’s faster and getting a silk touch pick is not that hard.", "They just started so they have absolutely no idea what any of that means lol", "“Getting a silk touch pick is not that hard” as Gura attempts to craft an enchanting table.\nAnd it seem Amelia would rather build a subway either way.", "efficiency doesn't necessarily mean fun.", "3:06:35, 3:08:13, and 3:14:18 ", "1:52:28", "1 2 3 4 5 6 7 8 🎶", "Amelia RailCons.", "Bruh 6 hours", "WTF 6 Hours just playing Minecraft? Or What", "waiting on that link kek", "same", "backseat gaming should not be allowed man lmao. her chats so annoying", "Ame: thank you! Wibbly wobbly...(5:56:37 )\nmy mind instantly: time-y wimey\n \n ", "Mood", "She is smart, will she join those who handle technical Minecraft? e.e", "You mean those who developing heavy weaponry and conducting human experimentation, peko?", "This is highly possible, and i fear the madness theyre bound to create and other hololive’s girls to sacrifice", "@Ray Marbella bruh..", "@LI4 peko~", "Gold digger Ame... actually Prospector Amelia sounds better", "The chat telling gura and ame what theyre both doing was kinda annoying tbh, wheres the fun in that?", "Chat was spamming salutes lmao i love it! o7", "was late in viewing the stream by 5 hrs, what does the o7 mean mason?", "@Mad Tech it's a salute. The \"o\" is the head and the \"7\" is the arm. o7", "@Mad Tech Salute.(o=the head 7=the arm thus o7)", "@Zen and  @Insignius  \ni see thanks", "uuuuuuuuuuhi for 6hrs!\nNICE", "chat is full of morons smfh", "I love watching you stream Amelia <3 but something needs to be addressed about a portion of Gura's fans being dinguses :/", "Amelia railson", "Para la gente de habla hispana ... por favor respeten las reglas del chat o les voy a hacer picadillo con mi ganado y las plagas. \n\nMi pueblo y yo te amamos Amelia.", "🥳", "Trust me amelia the witcher is fooken fantastic", "Ame I still like you and your stream even though there many people Spam, harassing, or bullying you on your stream. don't take it to your heart, keep streaming keep strong and keep smile. You are a good person. I know there will be many people support you. Thanks for great streaming I really really enjoy it ! :)", "👍", "Just small tips\n\nIf hit the monster try hit it while jump, it will deal moar damage \nIn short deal critical damage", "Hit when falling.\nNot when jumping", "", "people when gura joined: rule 4 goes brr\ngura: 1:36:04", "Ame does have a point, can people stop being a backseat gamer to the point  they drive a streamer  crazy  and you call it \"toxic\" .\nI think this is why they \"become toxic\" because you are forcing \"your point\" onto the person,\nwhile they just try and learn and find their own way into a game.\nRemember your behaviour resonates to  anyone on one point JUST chill out.", "The thing is that this game really needs some backseating sometimes. She still didn't figured out how the battle system works, for example, and the game will never explain that unless people spam about it.", "@Jefferson Sombra it is actually so sad that you have to backseat people while they are streaming, you are not the only people enjoying the stream, and remember this is not twitch ffs, just respect the streamers by letting them figure things out by themselves or at least don't have like 10 or more people spamming instructions, just let one or two do the thing.", "k", "I'm really starting to think chat's more toxic than Amelia herself. Besides the points given by other comments, it really bothered me how people just spammed toxic when she started scolding chat.", "First stream for me, are toxic and salt a common term in Amelia’s streams? Do other stream audience still say those? Lol.", "@Gekie Xerion Amelia tends to deflect blame whenever something goes wrong in what she plays, from \"my team didn't do very well\" to \"a kitkat bar (she has a lot of those apparently) snagged the mouse wire\". The former can be described as toxic, and she does act salty, so the chat tends to spam toxic and/or salty when that stuff happens. But recently they've been taking it too far, as I said in the og comment, they spammed toxic when she tried berating them, which isn't the first time its happened. I feel like Ame needs mods to manage chat, or to have a serious statement on the matter, but that's in her hands to do, if it truly bothers her.", "I really enjoyed watching this stream.  Ame lovingly bullied us, and cute toxic chat doin' their rounds.\n\nAmelia did so well too... Lava Expert.  Look out Sand Blocks; she'll dominate you too.  ❤️", "uwu", "Someone needs to convey to Ame that Minecraft's gamma is totally off kilter and the setting in the options is set to the lowest amount (moody) by default. It needs to be cranked up if one wants to see anything when a torch isn't directly behind you, no matter how eye-burningly bright one's monitor is! That won't mess with much for Ame, it'll just improve visibility, and the stream will stop complaining.", "Pls, Yagoo. For the love of God hire some mods for these girls.", "It's a very relaxing stream if you close the chat", "Ame -The redstone engineer \nGura -The adventurer\nIna -The builder\nKiara -The farmer", "o7", "1:36:04 when Gura joined", "Consider the things that keep happening in your chat, I hope you would consider to put moderator, Ame. The stream was nice as usual. Always love your personality. Some people at the start was very bad but glad it didn't ruin your experience with minecraft.", "excellent excavation in the mines very fun, little by little you will dominate the redstone, the redstone mechanisms are very good, thanks for this magnificent stream it was a lot of fun, have a good day or night.  very good underground exploration 👌", "o7", "good grief, chat", "Lol all y’all need to chill with this “chat this chat that.” Chat will be annoying, that’s what happens when you get 20,000+ viewers. I’m sure she just ignores it half the time.", "please play with hololive id or hololive japan.", "FAQ-ing spammers", "I loved the stream but i kinda hate humanity some times", "Ok just asking does she have some kind of terminal ill because she hiccups a lot", "There is some good video summarizing the circumstances, try checking them out.", "@With clarity can u give me the link", "https://youtu.be/lf349SyH5kg\nNot so much of a thorough explanation, but this comes from amelia herself", "Friendly reminder that they can also be Hurt by what you say. Dont be rude.", "Read the rules guys!, don't be idiots", "Yall weebs need jesus.\nThis is the internet.  It's full of people you will never meet whom don't care what ya think. If you don't like raids and mean words, this might not be the right world wide web for you", "People just overbearing about rule 4. \nFor me it just add more fun to the stream. \n\nIf streamer herself doesn't bother, who are you anyway.", "It's annoying and disrespectful to have the chat filled with comments about what Gura is doing.", "rule is made for a purpose.not just an accessory and get ignored.\nbut spamming rules also considered as spam", "There should at least be a balance either way, there’s a few times when Amelia say she doesn’t want bother Gura. Gura herself say so too.", "Too bad Amelia’s chat is hot garbage"]