["she isn't a detective anymore, she's an architect", "https://www.youtube.com/watch?v=HtG_yzs-Rj0", "Architective", "Why not both", "I am starting to believe she is everything except a detective.", "@Denver Arnold smart", "Damn seth rollins became a vtuber.", "plot twist: Everyone who plays minecraft, becomes an architect", "Detectitect", "Architect with OCD   °_°", "Grian's cousin confirmed?", "Mosby boys are on the case", "Amelia is evolving beyond human comprehension", "Nah she's the CEO of Watson's railway since 1865", "@srqs srqs Nah she's a detective. How else is she gonna find our moms?", "Expectations: 50% Office, 50% Rails\nReality: 80% Waterfall, 10% Office, 10% Rails\nEnjoyment: 100%", "https://www.youtube.com/watch?v=HtG_yzs-Rj0", "Working with water in mincraft can be incredibly infuriating. Made a underground enchantment room in one game that had a waterfall that encompassed the room. Every time I miss clicked a brick in the room the room would flood and I'd spend several minutes getting the water back into place.", "@Sean A 4 4454454544545454844545468R4s4454544444445454544545454545464644454844444454444544545454454545444544445454544454444454467645", "@Sean A 4 4454454544545454844545468R4s44545444444454545445454545454646444548444444544445445454544545454445444454545444544444544676454544", "@Sean A 4 4454454544545454844545468R4s44545444444454545445454545454646444548444444544445445454544545454445444454545444544444544676454544", "@Sean A 4 4454454544545454844545468R4s445454444444545454454545454546464445484444445444454454545445454544454444545454445444445446764545444", "A 4454544445454454444545454445454545454845454645454545454544544444545454545444454545455445454545454454545445464545444545r54544544", "A 4454544445454454444545454445454545454845454645454545454544544444545454545444454545455445454545454454545445464545444545r5454454445", "A 4454544445454454444545454445454545454845454645454545454544544444545454545444454545455445454545454454545445464545444545r5454454445R846", "A 4454544445454454444545454445454545454845454645454545454544544444545454545444454545455445454545454454545445464545444545r5454454445R846454545", "I feel we need to give advice in statements instead of context less tips. Like instead of \"Hold Shift\" it should be \"Holding shift prevents you from falling off ledges.\" and \"14 × 17 wall including a corner\". I know chat genuinely wants to help but if we aren't clean it's just going to muddy up and nothing of meaning will get through.", "i agree. explain what things do. how hard is that?", "Facts vs commands, unless of course specifically asked. We should advise through the statements of facts.", "@Darkvoltinx The issue is that providing both the problem and the solution to said problem in a single comment will usually end up being too long. Additionally, in a game with as much freedom as Minecraft there are multiple solutions to the same problem. ", "Upvoting this so that it get more visibility.\n\nAlso, Ame actually quite good at handling it by asking \"why?\" or \"what do you mean?\" whenever chats gives unclear suggestion.", "That's just common logic.", "There is problem with chat speed. Long answer would be buried in sea of other comments", "agree", "@Nick Name I see, comment length is a issue, but my hopes are at least for more people to post the same or similar comments with context in to help with clarity. Not everyone is going to do it but the more that do, the better. Again this has the downside of being spam oriented so I see your suggestion as being another probably better method to help.", "@MoeSanation Right, true. But maybe (unfortunately it can be spammy) more people posting snip bits of tips with context it wouldn't take so long to see it. We don't need everyone but just more to do it or be wary of it.", "Imagine watching someone repeatedly tell you to stop backseat gaming and being like \"we should do this more.\"", "Or just, you know, let her play.", "That's to long chat moves to fast", "@shingshongshamalama People that saying \"Stop backseat gaming.\" in chat are almost as spammy as the backseat gamers. But we should as a community consider a better way to handle this situation, obviously best to not comment and let her just game, but people can't be stopped. So then next best course of action to suggest more useful spam.", "The thing is that a lot of people were doing exactly that. Chat goes just too fast to read. She could just scroll up honestly.", "@VINCENTNATTI That's why I don't say it in chat.", "Shorter comments, are easier to read. ALL CAPS also stand out more, assuming no one else is doing all caps. \nIf a comment is too long, it won't be seen. I know even after I type my own comment, I don't even see it scroll by if it's too long. \n\nIt needs to be able to get read within 2 seconds, before it scrolls off the screen.", "@R3 Yeah, big downside and more time consuming long detailed comments. Unfortunately she also doesn't like CAPS comments because she see it as shouting at her. Today Ameila had just updated her chat rules so for now, we should probably let superchat give advice or not give any at all until she asks.", "Until Amelia herself makes a big deal out of her chat being \"toxic\" we shouldn't label it as such, because so far she has shown she can handle idiots and toxic backseaters in chat. If it becomes known that it affects her happiness and mental health and that she can no longer stay on top of it is when it should be a big deal, but for now, Amelia is showing her professionalism as a gaming streamer by controlling her chat and still making her content entertaining and fun. Please don't make a mountain out of a molehill, until the molehill actually becomes a mountain.", "I'm glad you're able to put it better in words than I could. I think sometimes people take the banter between amelia and chat too seriously. The only time I think it got too bad was the Gura spam, and this was nowhere near as bad as that.", "@Neidhardt I don't know the Vtubers' history, but as far as I know, Gura is not accustomed to toxicity in chat, and by the looks of it, she probably isn't (or maybe is now) used to being watched by lots of people, and that makes it more dangerous when her chat is being toxic or pestering her. It should also be noted that she is the one with the most popularity of the Hololive EN branch (and even nearing the highest sub counts of all of Hololive), but hopefully the number of kind chumbuds outnumbers anyone who might possibly hate her or give her trouble. It seems Amelia (luckily enough) is the only one getting any sort of aggressive chat messages, unless you want to count Kiara's chat calling her bottom left, but that's absolutely a meme and I hope she knows it's just good banter. ", "@interminableMyriad everything you said in both comments was spot on!!", "As much as some people want to deny it, Ame is toxic (more so salty) and lewd which is why chat often spams them when she exudes those behaviors. I swear some whiteknight is gonna sc her saying that she's not toxic nor lewd and that she should just ignore the assholes saying them and its gonna be akward when she's gonna have to explain that that's the joke like what happened to Rushia some time ago. Allthough I do agree that sometimes some guy in chat types lewd or toxic out of context,  don't police chat saying \"don't say she's toxic\" or \"stop saying lewd!\" because most of the time, that is more off-topic than the toxic and lewd spams.", "@interminableMyriad Yea, I was mostly referring to when gura and amelia were playing MC at the same time, and people were spamming Amelia's chat talking about gura, or announcing how they were leaving to gura's stream. Gura already addressed this to her viewers though, and I totally understand that she has a lot of subscribers who are new to hololive so it's not her fault.", "@Cye_Rye \n\nWell said.\nPersonally, I think Minecraft attracted a lot of \"out of the loop\" fans back to Amelia, so they're aghast and confused to chat's demeanor.  ", "@interminableMyriad I think the only thing that troubles gura is the fact that shes soon going to be the most subbed hololive and that brings expectations but im pretty sure shes well capable of toxicity and being watched by a lot of people (possibly) with her background but amelia is definitely better at handling toxicity simply due to her being an fps gamer(ground zero exposure lul) and is just as capable of being toxic", "@blackoutgenez Exactly, the rising expectations can be a huge source of stress, but Gura is really chill and can probably handle it. She 100% deserves the attention too! \n\nAlso, Amelia is quite the gamer lol, she's perfect for her chat.", "I agree that Amelia is good at handling it, and can make jokes about it but calling out toxic behaviour before it becomes too big is the only way to deal with it in my opinion :/\n\nBy ignoring it now it kinda gives the message “well no one said anything before so it’s fine to carry on” until it does become a mountain with new subscribers joining and seeing the way chat acts, thinking it’s okay to be toxic and backseat etc etc", "@f chan It's understandable to think that way, and in a good amount of situations, that might be the case, but here I think it's safe to trust Amelia's personality to handle this behavior, and it might become a problem later on, but by calling it out and stopping it now, it ruins the joke and will probably shift the mood of her streams as a whole completely, because if her chat isn't toxic, then she herself can't be as toxic, which to a lot of people is part of her appeal. I don't disagree with you that your method of dealing with it is a good way, or maybe even the only way, but I believe that ASAP is not always the best time to deal with things like this.", "@f chan \n\nI saw someone yell at chat because \"spaghetti\" is toxic.", "This is exactly correct. Ame also has experience so that makes it easier for her to deal with these types of stuff.", "@interminableMyriad that’s kinda crazy how they are about a month and a half in and there sub counts are up there with hololive jp", "@interminableMyriad like the fact that Gura is in the top 3 most subbed hololivers means a lot. so we’ll probably get more hololive en streamers hopefully like a 2nd gen or something like that", "@Cye_Rye She dishes it out and takes it.  That's why I love watching Amelia.  Her previous life as a streamer probably lets her know how to rib chat and we laugh at her as well.  It's a two way street where it's mutual.", "I am late to the party, just getting into these streams, just wanted to know what are the toxic comments? I see people referring to it but what toxic things are being said?", "To be honest, i think spamming toxic, hic or lewd is like spamming kusa or pettan in Rushia channel, it's just character joke. The only time chat is being toxic is the Gura raid spam. Anything beside that I think Ame can handle that.", "@Christopher Johnson second generation for Hololive EN can probably be expected. I think that was the plan.", "@StateOfVoid the toxicity in question is barebones and at most is people telling Amelia how to play Minecraft in the most efficient way possible (which is both sometimes wrong and irrelevant because she is not playing competitively), and others who are policing chat telling others what to do and what not to do which isn't their job. It isn't so big a problem right now but someone in this thread is worried it will grow out of hand, which personally I don't think will happen. Amelia can handle her chat like she has been handling it for a month now, and she's shown no signs of it getting to her. I will say though that these offenders are annoying and might deter some people from watching her live streams.", "The answer to all of this is just read rule 2 its that simple. If ya dont like a certain comment just block and report.", "@Rakha N.R I agree, it's the simplest solution, but you're preaching to the choir.", "@interminableMyriad I agree with that sentiment. But I want chat to improve as a whole, so we can try here in the comment section versus chat (which is not helping and making things worse by filling up live chat). \n\nI think we can give the community here suggestions and remind them how to behave here. And making them follow their own medicine, we shouldn't be toxic to \"toxic chat\" either.", "Hololive Japan breaks characters after some time has passed\n\nHololive EN just straight up changes profession", "multitalent Ame", "Renaissance woman lol", "Ame roasting people in the chat gives me life", "\"Organize inventory? Organize your life!\" Damn I felt that...", "@Neidhardt She's got a point, if you have nag someone unprovoked to do something as inconsequential as organizing such a dynamic inventory then you really should sort yourself out first", "@Phosgene Meme It's just banter, I wouldn't think too deeply about it.", "@Phosgene Meme Too deep", "That one roast about organizing was unexpected but cute in a wholesome toxic way. 2:28:59", "And she sounded nonchalant about it too. Cold blooded murder", "@Tentacult Scouting Division reminds me of the “You wanna buy some death sticks” scene from Star Wars.", "That guy '''SHE NOTICED ME THANK YOU'' HAHAHAHA fucking legend", "@Yuneir Atzura lol", "\"So what else can I do with this redstone powder?\" Who knows, this might lead to something good.", "Watson's Construction will be real in 58", "Nvm she said Watson's industries", "a week later she prolly would reached the level of mumbo", "Imagine ame turning into the en server pekora\n\nOr moona", "@TerraMerc 73 I want that", "@Laxaka it could be at most moona level of redstone", "we gunna see minecraft pekora 2.0", "@Kah Hei Leong more like 3.0 because moona is already pekora 2.0", "When Ame said organize your life, I felt that", "organize your life, or no balls", "That was a critical hit for us", "2:28:59", "ame is just so amazing. everything about her and her streams are just really relaxing and entertaining. i am really thankful that i am here to experience holoMyth.", "this also goes for hololive. i'm just so glad that i am able to have so much fun.", "TIME STAMPS\n\n02:50 start\n03:50 making a tweet", "Excuse me Sir, I think you should go up!", "@Hariz Haru how did you know?", "You fast legend!!!", "ayo how tf do people get timestamps this quick", "@chadmaverick In stream and probably took notes.", "Thanks,  I fell asleep in the middle so this was great to find my place.", "dude u are the legend!!!", "I never knew I needed you in my life.", "Chat really needs to quit backseating as much", "MC time stamps are easy, you don't have to note many stuff. After the stream end you just have to see how many seconds you are off. It takes 15 minutes more or less", "24 hiccups? Wow", "@Holo TheWise Wolf MADLAD", "Thank you for the hiccup timestamps.\n\nThey're important.", "Thank you, the times different really bothering sometimes", "planning to make highlights of this stream, the timestamps helps, thank you sir", "What is hic and why it cute af?", "@Tru Null Assuming you haven't clicked the hic timestamps, I urge you to do. 🐢", "@Nazgrel Wolfsong I did and my very muscular manly heart has melted. What is that noise though? Is that like a tic or does she have indigestion or something?", "@Tru Null She says she has the habit of swallowing too much air.", "@Nazgrel Wolfsong ah okay. Glad to hear it ain't anything to be worried about.", "My dude. Thank you so much for the hic timestamps. I didn't had time to do them myself. Bless your soul", "I know she has chronic hiccups but do you really need to timestamp it?? Lmao", "Honestly we need to congratulate the pillars of the community even more, Translators (interpreters) both live and clippers, clippers, artists, and timestampers.", "Thank you for the time stamp o kind person", "@VINCENTNATTI Yeah. It really isn't easy to do all those. I used to think it's easy until I actually tried it myself and burnt a whole day just for a 15 minutes clip lol", "@xLeidenFrost Oh dang, I'm going to watch that clip after bork in 6 hours. Looks like you even added both POV's together (most clips of the collab were from Gura's). Must have put a lot of effort into that.", "@VINCENTNATTI Yeah it was quite tiring. Was planning to do more of that kind of edits but with school starting, I don't think I'll have the time to do it", "You are amazing dude", "She’s genuinely an amazing person, I’m so thankful she exists", "I think so too", "I'm glad I'm not the only one who sees it, but most if not all the Hololive girls (and Holostar boys) are genuinely great people, so I'm just thankful the entire company exists.", "She's truly addicted at this point.", "I agree.\n\nAND WE ALL LOVE IT 😏", "I just hope she doesn't get burned out.", "Amelia Watson: detective, architect, engineer, miner, conductor, warrior, diver, time traveller, captain, guide, and waifu material", "Puddingu and 2.5 percent gay", "Don't forget drug dealer", "Chat: Organize your inventory\nAme: ORGANIZE YOUR LIFE!!!", "When a detective commits a murder", "That.. hits hard. But if I did I would not be here", "@ZeroSteel45 for real chat needs to cut down the toxicity though", "2:28:59 sassy Ame is best Ame", "You do realise that she managed to kill 28k people with those words. It was a massacre.", "@Shishir Raut it was utter annihilation, mass genocide", "because MAYBEEEEEEEEEE YOU'RE GONNA BE THE ONE THAT SAVES MEEEEEEEEE. CAUSE AFTERALL, YOU'RE MY WATERWALL~", "Gold", "Amelia: \"Organize your life!\"\n\n\nMe: CASUALTY! MAN DOWN! WE GOT A MAN DOWN!", "Man. Water really is annoying to craft with in this game, but when it flows just right, my God is it ever a delight. That waterwall is GORGEOUS.", "Would love to see her try \"Oxygen Not Included\"", "Amelia vs Water: The Fight of the Century", "Great progess on your detective office and the rails. The office does kinda stick out. I swear you are getting too addicted with this game, not that I mind though, I enjoyed it. Although, the chat is starting to annoy me but not as much as last time. Thanks for the stream.", "Though it's mostly waterfall, less on the office and rails, It's still nice to watch.", "A thief  took my Microsoft Office license key. I'll  get you thief! You have my Word. / Amelia´s office really took shape.", "That was incredibly bad.... good job!", "I am Japanese.\n I became your fan.\n I will do my best to study English to understand your broadcast.\n私は日本人です。", "1:26:00 LOL", "\"Carpet? Why?\"\nYou know, it really ties the room together", "Everybody: doesn't timestamp Amelia saying she might do it in the back\n\nI am so proud of this community,", "11:49 Watson's backdoor :flushed:\n\nI want Ame to design my life.", "I keep missing the girls’ streams due to online school 😭", "As a person who've been on the Twitch platform and seen many Twitch streamers I can say that Ame's chat doesn't affect me one bit and it simply feels \"natural\". In fact, it feels quite unnatural to see a lot of people complain about things like this it gives me mixed feelings. ", "even if ame's chat is better than most twitch chats, i think the problem here is that not only is this not Twitch, with a different community and whatnot, but as a part of Hololive, a company they work under, there are specific rules set and have been stated by the streamers. As viewers we should be respecting these rules and the streamer themselves.", "@dancingcats Yeah. It will take time for people to adjust.", "@dancingcats Unless Ame directly states that people are breaking rules, it shouldn't be up to us to police and mod the community. People are trying way too hard to do that for her.", "I'm just gonna say it. Both sides of this argument act like a complete circus. If you want the chat, deal with spam. If you don't, then turn it off. I feel like we are starting to take away from Ame's streams by always bringing this up.", "@KIRA VIRUS is festive it became a circus ever since polka made it one, but personally, i just avoid the issue all together by not reading chat or not commenting on chat", "@KIRA VIRUS is festive I agree with you but then there are people who demand for things because that’s how it works. Sometimes doing something about something can be better than doing nothing about something. It’s completely fine to be a don’t give a fucker but we need for and against people to exist to bring change.", "As somebody that's watched Twitch consistently for at least 5 years, I'm constantly revolted by YouTube vtuber chat (especially ENG chat in JP streams [It's not cute to tell somebody to go to sleep]).  If anybody thought chat was problematic.. IDK I was mind-numbingly frustrated at certain points.  People were ABSOLUTELY using restraint out of respect.", "@KIRA VIRUS is festive The spam should absolutely be reduce though..", "I really enjoy the ”Twitch Lite™” state of her chat.", "@red kamekaze I also think it should be reduced, but constantly talking about it isn't going to stop them. It's Ame's stream, if she wants to stop it she can. These comments have become war zones of backseaters and white knights, we all just need to chill.", "Sounds like you've followed twitch streamers with poor moderation and communities. Most definitely are full of obnoxious people, I know, but there's also plenty whose chats are decent.\n\nWhen it comes to the community in that chat, it is not great. It's nothing short of disrespectful that when the streamer says \"You don't need to all caps me, I can read normal text fine\" ( ", "@Sarcasm Just remember, alot of people are still very new to this. Give them time and they'll understand. If you think this is bad, you should see what's happening to a bunch of non-hololive en streamers. I was watching one the other day and they kept saying \"you're not as funny as gura\" or \"hololive is starting soon, I'm leaving\". This is pretty tame compared to others.", "@Sarcasm Yes, this shouldn't be normalized. I encourage a change - for there to be less idiots but I pretty much already gave in to the horrors of Minecraft. Minecraft is just.. Minecraft. And for some reason people are bound to tell new people what to do in Minecraft. This happens EVERY TIME. People made Minecraft seem so \"general\" like how new generations say \"bruh, you don't know how to use a computer?\" to boomers. ", "2:29:00 brutal shutdown \n2:36:17 \"Da Viki\" energy \n2:38:53 T_T \n2:39:56 \"Polished Dorito\"", "Just felt the need to vent a bit: I love Ame and her streams, but damn does chat make it difficult sometimes. Even when I don't pay attention to it, seeing the backseating, toxicity, and idiocy annoying Ame and throwing her off is upsetting. Those of us who try to give genuine commentary or advice when appropriate are constantly drowned out by the bullies and morons. I don't blame her at all for misunderstanding and distrusting chat most of the time. Amelia may be used to this kind of audience, but I hope she remembers that there are still decent folk amongst the rabble.", "Fr, I was hoping that this would stop but it seems chat is still at it with the backseating, and not only that but the amount of toxicity when any girk dies or doesn't play as the \"experts\" on the chat want, for example, the whole chess situation is toxic af, with everyone saying how they \"lost\" braincells", "i think its getting worse.", "The people spamming back at the backseaters are also definitely part of the problem and need to chill.\nEverybody just needs to take a deep breath here.", "I feel like people are giving this more attention than it deserves to the point calling chat toxic feels like an exaggeration. There's 30k watching, you're not gonna get a chat filled with slow and detailed  discussion. And when chat tries to police behavior it just brings more spam. If it ever gets bad enohgh amelia will handle it.", "@Neidhardt it's not an exaggeration, chat is becoming quite toxic, just take a look at Japanese streams, they don't backseat, they don't say bad things, but sadly it's not the same in western chat.", "@Brian \nBeing toxic towards backseaters is always a good thing.\n\nAlso its Ame's fault for reading chat anyway.", "I try to answer questions that she asks, but it's hard to get it noticed, especially when it's a rather long answer because it's a complicated scenario.", "@IDKmyBFFJill There's never an excuse for toxic behavior. EVER.", "@Jose Manuel \"They don't backseat or say bad things\" Do you...understand Japanese? There's been plenty of times antis have been in chats of the other members. Didn't Matsuri have a problem with backseaters at one point? This isn't an english exclusive problem. Plenty of japanese streams get spam or trolling. Please don't try to make claims that aren't true.", "This is standard \"popular twitch streamer\" fare. Ultimately if Ame is fine in that environment, so be it. If she's not, she'll have to be vocal about it and hopefully it will change. Toxic is a relative term as people who are used to \"popular twitch streamer\" style chatrooms won't be easily offended at all and will recognize irony, whereas those who aren't used to those environments will see insult and offense around every corner. Whatever the case may be, I promise you spamming chat trying to be the morality police is only going to add to the chaos and won't solve anything.", "@Brian \nYes there is. Don't be a pussy.", "@IDKmyBFFJill I'm sad that you feel this way, and I hope that you can one day confront whatever happened or is happening in your life that caused you to act this way and get better from it.", "Just turn it off dude, chats on all livestreams are awful", "@Jose Manuel I’m sure that they do, it’s just in a language that you don’t understand and speak.", "@2IC actually, alot of chats are really fun. Ina and Kiara have a really nice chat where people just make jokes and react. I've noticed that it's specifically Minecraft when the chat turns into a hellhole.", "Oopsie, sorry guys for letting a rough week get the best of me. Original comment edited with some afterthoughts now that I had a couple hours to step back.", "@Cyaneus Ensis you're fine. Backseaters just need to chill, even though it's not that bad. We all just need to be respectful to Ame and to each other.", "@Brian \nSee, now you're being extremely toxic. I only pointed out that humans need both positive and negative reinforcement sometime. And you turn into a toxic passive-aggressive troglodyte. ", "I wonder where this will go. I don’t really care but I personally want a chat better than xQc and that is final.", "@Josh Riley they have to read chat to have communication wihh it, she is in a company so she can't turn it off and being a spamming back seater is not a good thing...", "@Miyijura Mx True.", "2:46:41 That \"Pane peko\" in the chat! lol", "Ame: who has inside window? that's weird......\nme: uhhh me.......... and yes my house is kinda weird.....", "This should have been titled “OCD vs Waterfall Wall”", "I Have failed and disgraced my detective company, by missing this stream. 😭", "now i dont watch alot of amelia's gaming stream besides minecraft, but i do have a question, is the chat always like that in all ame's gaming stream? because i have a feeling that it's only in her minecraft streams, minecraft community itself have ppl who are veteran at it, and majority of them gonna have this feeling of \"dude its that ez how do you not know\" kinda thing to a new player when they just started. (this applied to every game too but i feel like somewhat minecraft is very different)", "Backseat gamerz are always there but for minecraft it's like 10x more than usual", "I think it's only for Minecraft. All the recent cases of \"toxicity\" in the chats happen to be in Minecraft streams. For other games there are also backseat gamers, but much much fewer than these streams.", "@Víctor Daniel Echeverría Sú It’s because she better than a majority of the viewers in other games hence less back seating. It’s like saying a driving instructor is toxic cause he’s literally backseating.  I get the feeling that Ame doesn’t dislike the seating but rather it’s the connotation of a noob player needing help. She seems quite strong and independent so it would make sense that she doesn’t like people looking down at her. (Even tho they aren’t necessarily looking down at her)", "@R3B0X Yah she can handle it. True, she's probably (or truly) better than me at FPS haha, so people can't question her or give her advice.", "@R3B0X inded she can handle it, but without it, i bet the chat would be more enjoable to be part of if it wasnt just backseat spam", "Backseats have been there even before Minecraft exist, but yes, Minecraft streaming normally got worst backseating than other games and that is on MC fans\n\nif ask specially as for HoloEN streams, MC streams is by far got worse backseating chat, but understandable... less mature mind viewers, ten of thousand people in chats, not enough mods to enforce the rules, etc.", "Why does everything need to be a Community?  The game is almost 20 years old... it's almost weird not to be familiar with its mechanics.  Especially if you game on PC and like to play more than one type of game with friends.", "@Jonathan Williamson it's less truth nowadays, as gaming culture reach wider than before to the point now it kinda obsoleted to consider every gamer must  have a high game literacy\n\nplayers with low game literacy is largers than you might think, even in PC gaming folks", "I've been following Ame's streams since the debut and yeah I agree that the current HoloEN Minecraft streams have the worst backseating and toxic chat. It didn't happen that much during the other games like APEX, Valorant, Mario Odyssey, CSGO, Puzzle games, etc. It's understandable since Minecraft doesn't explain well enough what thing does inside the game, Ame is still fairly new to the game and her Minecraft stream has more viewers compared to other games she played on stream. Yeah, props to Ame that she can handle the chat very well and keep her content very entertaining.", "Indeed. It’s just Minecraft. This always happens.", "i noticed that as well. her other streams are pretty chill, and they dont really backseat game until she asks for tips. (and only say \"lewd!\" when game characters HOLD HANDS OMG) and only call her toxic when shes dissing teammates or trashing npcs. It really does look like its the minecraft community here.", "This is the main reason I don't tend to talk in the MC streams... I was late to the whole \"Minecraft party\" but I still have a good 4 or 5 years of experience with it... I'll probably be having the archived video playing in the background until they enter the late game... ", "This is strange, i cant find this on her channel nor in the hololive schedule site :/", "Still tho, minecraft needs to fix the water physics just a lil bit\nI felt the pain when she tried to build them waterfalls", "If it was me, I would never put the redstone under the tracks, just to troll all the people who are bothered by it.", "As a Metro/Underground systems enthusiast, this pleases me.", "I can now be proud to say that my dad works as a constructor, love you watson <3", "I love how Moona is backseating in your stream 😂😂 also the waterwall looks so cool", "You did your best, Watson. The water-physics are really tricky for some reason. :)", "I feel at some point at development they said that they considered making water physics more realistic, but they decided against it because players were so used to how it worked and would ruin a lot of water based contraptions.", "I’m so glad that there are so many terraria enthusiasts here!!", "Detective office builded from dirts xD", "OOOHHHH MY HEART   >:3 5:43 <3  Maincaft   <3", "they should start a timelapse camera in their world, so they can see the change over the months. Also when are they gonna give a holojp member a tour of the world.", "id imagien theyd give a tour out when theres something to actually look at. Right now all they really have are 2-3 decent houses and a tunnel system.", "1:00:27 \nHandholding BANNED", "I enjoy watching her making some of her rails and office 🤗😍, I love her 💕", "Omg, I'd love it if Holo En played No Man's Sky", "YAGOO: How much infraestructure you want have in minecraft?!\n\nAmelia: How about YES!", "I never know that the \"Building Rails\" Minecraft series is so good 10/10 would watch more", "Amelia, you should look into detector rails for the railway, to activate the powered rails. In the long run it's quite useful.", "I dare you to play Mega Man X6 without using Rookie Hunter Mode in any part of the gameplay. I bet, it would make you slam your fist into your desk even harder!", "So Dr. Watson was famously known for being a writer, physician, army surgeon, a detective, a war vet and now Amelia can add architect/landscaper to that list?", "Imagine ame figuring out redstone engineering", "Java version fans: Water in Bedrock is bugged and doesn't work as intended\nWater in Java Edition: 1:38:15 1:36:26", "5:43 Minecraft fail. That was too adorable", "I love that Amelia just wanted to build her office interior out of  raw concrete dust.", "I used your waterfall wall as an inspiration for a build on my own server. I like the way it looks.", "TITLE \"Exploring water physics in minecraft\"", "Should we add architect to her degree?", "1:39:35 HIC 힉 ヒク", "2:21:17 instant life lesson\n   Hey at least she learned", "Hey, Railson!", "That waterfall went from 'please kill me' to 'i am legend' real quick. Nice work Detective!", "2x speed is definetly a QoL improvement for this stream", "Play LA NOIRE please the NYPD need your detective skills!", "\"STALKER?\" -Nicolas Molina @ 33:53\n\n Damn! someone really suggested STALKER?", "We all need an iron golem tower lol", "Gotta say, Ame did deserve that long sleep\n\nShe was getting more and more into the unkown realm if she continued to have no sleep for almost a week", "Amelia if you want to have a consistent way of making \"vortex\" is to place an area of  3x3 blocks(in the water ofc), then mine the center of it first, then clear all the blocks, works most of the time.", "Sure seems like a lot of people trying to back seat game.\n\nSuppose that's the problem with being new to Minecraft, everyone wants to tell you about every little detail about how to play the game.", "HOW MANY COMMENTS", "you know what when she walked out of the tunnel the house with the two waterfalls beside it looks good I think it would look more nice if there's light on the waterfall but damn you'd think Amelia is failing at making it look nice bc everyone says she's a noob but she's pretty good ngl", "You HAVE to try ark. ITS SO GOOD!!!", "Has Amelia watched Soul Eater?  Her focus on having her base even reminds me of Death.  I bet she and Calliope would have funu watching it.", "God, I miss it", "何か違和感があったけど", "Good job getting caught up on sleep Amelia. I wish I could say the same, lately it feels like I'm getting deeper and deeper into sleep debt.", "I was asleep when this came out. Sadge", "I slept and couldn't see", "58:43 lmao", "Thanks for the constant Minecraft stream Ame! ♥", "3:02:49 Counting numbers with amelia\n1 2 3 4 5 6 7 8", "Make an iron farm for unlimited iron", "3:24:29 reminds me of uncle roger", "1:06:54 Amelewd, what kind of shape are you building there", "When watching ame for me it just have feel like i watch towa/ korone vibes with pekora chat hahaha", "52:08 You can just shoot arrow in the TNT, then it will explode.", "Can someone explain to me what about her toxic chat? I just fell into this rabbit hole still new", "There was so much progress this stream! Thanks to the roasts, I feel chat is also getting steadily better at giving useful advice when she asks for help. Some things took experimentation, but having fun, trying new things, and getting better over time is one of Minecraft’s greatest pleasures!", "in the end it  would take up less time with the dynamite", "44:06 same", "I like how peoples trying to connect with streamers by asking/telling her to eat and she just brush them off with smack talks.. she's not even a big youtuber yet but already cocky.  simps coming to defend her.", "She was getting back seated for 3 hours straight, she was tired from getting orders from chat", "@Miyijura Mx all her stream she always act the same..try again simp", "It's called a bit", "Play Dayz. The eye tracking dont lie Amelia about to pop off to dreamland 3:16:09 - 3:16:34", "1:26:00 epic comeback", "1:26:06  that’s what we said TO YOUR mom", "Someone needs to make timestamps of the roast", "instead of pekora construction we have AME CONSTRUCTION!! YAY", "The tumbail kinda cute", "Amelia just designed Atlantis", "So many people in chat know rune factory...chat is cultured", "1:07:00 why did she laugh?", "Wth 3 hearts of the sea??????????", "in the description it says thumnail", "Why...\nWhy has she not have posted the john wick thing yet.\nIs it members only?", "I think the John wick stream hasn't started", "It was members only", "No one:\n\nGirl cosplaying Spongebob:\n4:44", "In 7:00 see the donation men condolence to your mom take care men", "lol don't worry about getting the wrong book. You don't need to read them first, you can just read them later to enhance the experience if you want to know more about the world. Blood of elves is the first book of the main saga while the other 2 books (released later) are short stories.", "Ame should pin the rules on the live chat like ID girls do.", "Miner goblin\n\nKinda sad i missed this stream\nBecause 3 am", "1:00:00 don't worry ame, the water physics are pretty bad in the game.", "The office looks great", "That water is a bit bugy", "1:07:01 pp water pp water", "I wonder if you will see this Ame. I found the discussion around potential games pretty interesting but I was surprised a certain game wasn't mentioned, especially since you brought up Don't Starve.\nPlease give Oxygen Not Included a look. I think you'll find it interesting, I certainly do. And it would be something that I would be interested in watching you play on lazy, chill streams when you just want to relax. :)", "Dam I missed the stream", "Yeah idk what to say, Hi Amelia", "Since you like survival games, how about trying Terraria?", "Tommorow I can't watch anymore I will leave reality and enter a new reality", "Hope you do it would be a shame otherwise", "@sydaske sh*t my laziness eat my will so I won't enter it", "I think Watson is gonna be a great architect detective.", "She loves to play Astroneer? Wow, great taste. No wonder she likes Minecraft. Maybe she'll like Slime Rancher too. I wonder.", "2:21:17", "If you can't make it look natural..make it look unnatural af as u can..heck..let's make another waterfall on the side...looks weird? We passed that along time", "I was laaateee camoooon maaan ended 15 mins ago cmon ita just 3am for me : D", "Watsondam a big watson gundam to rival pekoras mech creation", "I am the no man.", "2:29:00", "I must go it was not meant to be.", "Local detective is mystified by water physics for 2 hours", "suggest her to play Undertale", "Is this the same world that moona and pekora have?", "No. This holo EN server.", "@Neosman thank you", "Engineering skills at it's finest", "2:54:00", "Watson Construction XD", "there is a fine line between something be a joke and being toxic.\nthe backseat gaming is annoying and toxic,\nif you want to give suggestions or advice explain things.", "So kawaiiiiiiiiii", "Ah im late,it's really hard to catch the stream with gmt +8 ", "Same", "Damn i just missed it!!!!! Nuoooooooooooo", "I hate how difficult it is for chat to inform Ame correctly. It's a combination of her reading disparate messages and chat being idiots. Spreads distrust from Ame and makes it  so that she does things wrong.", "The key to building a waterfall is just don't.", "or just don't do everything wrong", "Thanks for the stream Ame I had a lot of Fun!!", "BOOBA!", "YOU ARE MY QUEEEEEEEEN KYAAAAAAAAAAA❤❤❤❤❤❤❤❤", "Great and all but can watson beat Grian doe", "Amelia roasting chat is slowly becoming a feature in a stream, and it is increasingly entertaining", "Why the water fall?", "\"It looks horrible ame\"\n\"well you know what else is HORRIBLE YOUR FACE! HEHEHEHE\"\nten seconds later: IM NOT TOXIC THEY ARE THEY STARTED IT (classic toxic and)", "lol jesus christ the chat highkey annoying af", "No one.\n\nAmelia: making our day a billion times better!🥰", "This stream should be considered a lethal dosage for people who have OCD", "She’s getting better at the game every stream so even if her chat doesn’t stop being annoying eventually they won’t have anything to back seat game", "🙄 what do you want chat to do \nTalk about irrelevant topic's while she is asking chat questions about the game.", "28:48 im just speculating here does this mean if there's silverfish, there's a stronghold nearby", "nah it's because she was at extreme hill biome. Stone monster egg can spawn in extreme hill", "oh im no minecraft veteran unlike gura so yeah", "Watson white knights are not considered human. Don't talk to white knights, don't response to white knight posts.", "who?", "2:29:30 yawning\n3:26:19 Ame thanks us in super speed mode \nOhh man she is streaming too early", "Is Mori playing at all?", "Wtf how did I missed this??", "Chat getting her upset over the backseating. It's gonna get to the point where she'll just flat out disable chat.\n\nAnd I know you guys don't want that to happen, so please.....stfu and let her learn/discover things on her own ", "Please don't exaggerate things. She didn't even seem close to upset as you're portraying her to be. Definitely not to where chat is gonna be disabled.", "Looking forward to chat being disabled. Streamers looking at chats always make the streams worse.", "@IDKmyBFFJill Defeats the entire point of it being a stream at that point. MIght as well just upload an edited video.", "@Bee Puncher lol true", "@Bee Puncher \nIf chat is 'the entire point of it' for you then you should probably go outside instead of watching streams. Its not healthy to only socialize through the internet.", "@IDKmyBFFJill For channels with a personality as the focus, interacting with the chat is the point of streaming and not just my opinion. If a person doesn't want to have chat, just upload an edited video so it's not full of dead air. What was the point of assuming my social life? Do you not have a cell phone or tablet to multitask?", "@Bee Puncher\nI hope you grow out of this mentality you have. Your reply is extremely strange.", "@IDKmyBFFJill What mentality exactly?", "The chat really need to stop backseating, I feel as if she had to argue about this almost all the time", "Where do u stream amelia?", "Why does she have so many hiccups? Lmao", "Not even trolling at the end!? Just a heartfelt message? I'm disappointed.", "Idk if Ame's chat micromanages her gameplay more than other streamers, or if she just acknowledges it more. some of yall need to chill.", "Comfy day\nComfy stream", "Missed the stream. Cool waterfall tho", "someone please tell her that she can just use the powered rails as a wire for the torches so she can just put 2 powered rails in a row at the foot + incline and put a torch at the foot of the stairs", "oh okay", "Idk why I think she should have been British not America :/ dissapointt", "Ame ame ame", "I find people complaining about chat more annoying than the chat itself.", "She should use the Minecraft Wiki if she has inquiries about Minecraft from now on.\n\nWhile there ARE some people in the chat who give good advice, there is just as equal an amount of trolls. Not to mention that some of the advice may be personal preference.", "Why didn't chat tell her that she can turn the wood slabs back into planks by putting them on top of each other and then axing out the block? Combining plank slabs to make a single block turns it back into a wood plank block.", "the comments are empty", "ok", "It's so strange to know that Minecraft has been around for something like a decade and there's still people who are completely new to the game and just don't understand it yet. It's nothing against Watson, but it's probably the fact that I'm too used to watching people who are already supremely skilled at the game, such as Dream and his 1,000 IQ plays, or the Hermitcraft crew and their excellence as architects and/or redstone engineers.", "Wow, its like some people are new to a game and don't base their entire career around it.", "Wow, its so strange that there's people who complain about new players for not knowing how to play Minecraft right off the bat. It's nothing against you though, but it's probably the fact that it's totally normal for people new to the game when theres so much features and updates after many years and it can be really overwhelming", "\"dream and his 1000iq plays\" this what comes through my mind when i read this comment https://youtu.be/dWjQcpUS-gA"]