["A little help with understanding hereditary [spoilers]", "you mean the main character's brother hanged himself i believe", "Also the demons/possession plotline can also be interpereted as a metaphor for hereditary mental illness. Kinda like babadook where the monster is a physical manifestation of a real life experience.", "Milly Shapiro, the actor who played the daughter, also wanted to keep her severed head prop they made, but I don't think they let her.", "The movies were suprisingly deep, intricate, and had so many layers. Just like my man shrek from shrek the musical.", "I which is what we should watch", "Onions too have many layers\nShrek used to love them", "Two messed up movies in one sitting. Good job hanging in there, detective.", "Ok let's be honest the stream was great but the movies are traumatizing", "Yeah, the moment I saw Hereditary on the watch list I noped out of the stream. Saw that one in a theater. A few screams and a lot of people taking bathroom breaks in the middle of the film. Not doing that one again.", "@Seashore Seashells is it actually that scary?I missed the stream and I wanna watch it", "@Poofy  If you like horror, go for it. It's uncomfortable. Although, I'm also a bit of a coward when it comes to horror movies. I prefer watching them on a small screen with the lights on. My brother dragged me into watching this one.", "@Poofy It's uncomfortable in ways that hit people more directly than normal horror. I wouldnt even call it \"scary\" per se. Just... really gets under the skin.", "Man people these days.  Is it just me or can people really not tolerate anything anymore.  Its just props!", "@MKP2W these days? Horror movies have already existed back then bro.. let people enjoy them, don't think you're cooler just cause you know they're props, we all know they're props.. smh.", "@Maicha Latté nice job missing my point.  I was talking about people who specifically can't tolerate a movie of even this level.  Thats not \"enjoying\" a horror movie, thats justing being overly disturbed by a movie, which IS just a production.  Hereditary isn't even that disturbing compared to horror movies of the past.", "@MKP2W I mean phobia, PTSD, mental issues, and emotional factors exist, and it's completely fine to find something disturbing and not tolerate these kind of movies even it's literally just props.. not everyone is as logical or as rational as you, bro.", "@MKP2W Welcome to humanity! Where people have different level of scares and tastes! Amazing, right? Can't believe that this was scary to some. Wow! So amazing!", "@JagBone The ratio of people who find this \"too disturbing\" has increased.  Pretty soon movies like Hereditary and The vvitch will be replaced with Monster House.  People have become soft and avoiding of conflict or fear.  Its not a good trend.", "MKP2W you sound like you're boutta recommend some heavy psychologically damaging piece of entertainment", "@MKP2W You are overthinking. Stop overanalyzing things. Let people have their fun. There's no need to be a doomsayer.", "@Poofy its not the same kind of horror movie, amelia didn't pick jumpscare galore, more like, fucked up horror.", "@MKP2W If people are disturbed by Hereditary, that means the director ans the studio did a good job, and I doubt the past movies can match that, they're just too tame", "@Ryan Gg Its not studios doing a good or bad job or movies changing.  Its people changing.  Even the old classic \"The Exorcist\" movie is more graphic than Hereditary.  The movie had a young possessed girl stabbing her genitals with scissors.  Compare that to your goofy floating people of Hereditary, then think about people saying HEREDITARY was too disturbing.", "@MKP2W I'm pretty sure some people find the exorcist scary as all hell too doesn't mean anything... It's a horror movie if it scares the viewer it's done its job how scared a person gets is entirely subjective, I'm sure some people don't find hereditary scary. Nothing wrong with either", "@MKP2W hereditary did good on the box office and got good enough reviews, I mean if people found it too scary they wouldn't be so many watching it would they?", "I thought Hereditary was so scary because it reminded a lot of people of their own shitty families.\nIt's not really scary, more like really depressing.", "two heartwarming coming-of-age stories about teenage girls and their families~! ", "This feels more than a stream a comfy movie day with your friends i love it.", "So uh... fair warning, I will never be the same after watching these movies, be prepared for that and never sleeping again...", "Ames \"Movies watched\" to \"Dogs killed\" ratio is currently at 3 - 3", "*4/4  Both memberships movies and this two also.", "Thanks for the watch along Ame! I'm now traumatized by Hereditary!", "That Hereditary ending was weird af", "If you watched Hereditary, I think 2:28:56 is probably the reaction you looking for", "Nice", "Yes, thanks.", "Thanks! This isn't a movie you see too many times.", "I don't need sleep, I need shrek!!!", "Spoiler:", "I was actually rocking back and forth like a crazy person when THAT scene and the following scenes came along in Hereditary. Only other movie that made me like that was... The Witch, when I saw it for the first time a couple years ago.\nAlso, Toni Collete and the kid who played Charlie were incredible.\nReal gud movies.", "If you like those two, watch Midsommar like some of chat suggested. It’s made by the same writer/director of hereditary.", "@Google Poodle Midsommar is fantastic. Idk if it has the same effect watching on a home screen, but after seeing it in theaters I left feeling like I'd been drugged.", "@Doctor Worm Similar of course I just watched it right after this stream for the first time lol", "What is 'that' scene? I watched it for the first time with everyone and I can't recall what you might be talking about.", "@B Ghost Let's just say it's easy to lose one's head over that particular scene.", "@Doctor Worm Ah, gotcha. Guess I'm just desensitized at this point...", "Now weebs know who the Real Paimon is 😂", "I knew this Paimon before the weeb one so I was lol'ing at how this daemon from the Ars Goetia got turned into a cute best gril 🤣", "Okay so I am not yet watched the movie, but does that one represent Paimon more correctly I guess?", "@Dott Winial well..here's paimon in the  Ars Goetia. https://upload.wikimedia.org/wikipedia/commons/thumb/8/84/Paimon.jpg/220px-Paimon.jpg\n You'd summon him for his knowledge of everything, incl \"Secret Things,\" and he could also grant familiars or answer all questions asked of him.  ", "@Erich  I already read goetia bunch of times don’t need to worry about that part. I just did not watch hereditary.", "@Dott Winial I'd say it's a lot more accurate, but honestly that isn't hard a bar to cross lol. Though with hereditary I'd say the portrayal is perhaps more \"evil \" than it's been portrayed in texts because I know ars doesn't have the method of summoning including the sacrifice of a grief-stricken family. But from the sound of it you'd have a better sense than I. I've read the Ars Goetia only once  and that was a few years back.", "Im not used to these type of movies, so watching both movies was an experience... Thanks Amelia and the chat for the great watchalong, it was worth it!!! o7", "Didn't know Amelia is the A24 art film type of person", "Ha!", "Someone probably should have warned her, lol", "Now thinking about it, shrek could be a really scary horror movie", "I'm honestly upset I missed the stream and the chance to interact with everyone live... regardless, I hope everyone had fun in it!   o7", "I've been meaning to watch Hereditary one of these days, thanks for giving me an excuse to do so", "The VVitch is a great horror flick. Rather than going for cheap jump scares and gore, it does its best to deeply unsettle you. It sounds like it did its job!", "I absolutely loved it! Really need to just watch all the A24 Horror films. Every single one I have seen has been amazing.", "People in the livestream chat saying \"lol this more like a comedy\" : shawty do you notice me? Do you notice me?", "That’s a good description, Heredity is more depressing than horror. Although the ending are the most terrifying moments ever.", "As someone who has already seen the film chat spoiling hereditary for people who haven't seen it kinda pissed me off ngl", "So, I tuned out to an archived stream, and it starts with \"Hey, there's a witch inside my house, wanna come see it?\" Uhmm...", "1:08:18 spooky sound", "2:28:55 for that scene", "What I was looking for, thanks 👍", "Ame freaking out watching these movies becoming really nervous about the explicit material and how they're less traditional horror was pretty funny. Hopefully, it wasn't an issue for the enjoyment of the movies. If anything it will make for a good in-joke for recurring movie watchalongs :)\nI don't think there's anything to worry about. I saw Korone stream Midsommer (I don't speak Japanese but the video is still up and the mood I got was she seemed fairly relaxed about the whole thing).", "I didn’t even watch the movies(was at work) but hearing Ame’s reaction was worth listening to the 4 hours lol", "It's really bummer that i can't watch it, but because Ame and chat's reaction, i can imagine it lol. Thanks for the double spoopy watchalong stream! (We got more candy and number! Excited!)", "Ame's Face throughout the 2 traumatizing movies:\n\n:D", "Samuel Dantis those eyes she make spoke of both life and death\n.....and neither of them", "Ame: 😬", "Surprised Ame Face", "Thanks for the fun stream ame + chat, was nice to watch two of my new favourite horror films with some other peeps.\n\nAlso if anybody liked the VVitch (wasn't many, but I think a couple were into it) please check out The Lighthouse (2019) it's from the same director.", "I loved the VVitch when I first saw it, just blown away by it. The Lighthouse was weird as fuck and I didn't understand a lot of it. There's a lot of strange sexual stuff in it. Still really liked it. Hereditary I liked a lot and Midsommer was weird as fuck and I didn't understand a lot of it. Still it stuck with me. Seems like a trend with these two directors. But I'm just glad people are making more mindfucky, atmospheric horror movies.", "Did Ame like The VVitch? It's one of my favourite horror movies, but I understand it's far from traditional. I don't have time to go through the VOD sadly.", "@AnimeAjay from what she said she liked the atmosphere of it, and liked the time period - how accurate it everything like the costumes were.\nBut she said there was too much death in it, and just was generally weirded out by it.", "liked it a lot, might check out the lighthouse next", "I prefer the witch to hereditary, but when it comes to recent years horrors my favourite is midsommar, i loved it\n\nOh and yeah the lighthouse is a great movie as well", "The Lighthouse isn't comedic bruh", "HARK! HARK!", "@無常 It is. The comedy is pitch black, but it is there.", "@Obscene Vegetable Matter WHY'D YE SPILL YER BEANS", "Pretty much everything from A24 is a home run of you're looking for slow-burning, high-tension stuff.  It Comes at Night, Green Room, Midsommar, and The Lighthouse.  The Lighthouse is an especially good recommendation, though.  There's not much quite like it.", "Does this watch along technically count as a date? Jokes aside was fun to watch.", "YES", "I’m also going to say yes. That’s what I told my friends.", "We take those", "It was really fun watching two masterclass horror movies with Ame! The reactions were great", "My head hurts after this and I don't regret it one bit", "The Shrek movie is happening later (few hrs)  for those that missed the livestream\n\nUpdate: next week, shoot.", "Thanks for the double trouble movie watchalong was really fun with everyone and happy Halloween to all🎃🎃🎃! / What's the problem with twin witches? You never know which witch is which.", "1st movie was \"Colonial era religious nuts get a pet satan\" and sadly I couldnt see the second movie", "the hiccups counts WHERE ARE THEY", "I was only able to watch The Witch, and it was w i l d.", "Ahh, yes. Two of my favorite modern horror movies.", "I really wanna watch along but I'm really bad with horror films. When I was young, I got traumatized by Edward scissorshand, that's how bad it was for me and it's not even a horror film 😂", "Harry Potter run - please, make it happen, Ame. Can't imagine how much I'll enjoy it if I enjoyed watching these movies with you (pretty much never watch scary stuff). Thanks, it was very lovely <3", "Thanks for watching movies with us Ame. It was fun to rewatch Hereditary and see your reactions. Hope to see more soon :)", "I want to watch with her so badly, BUT ITS starts 4AM.. 😭😭 but Ame youre cool to be able to watch 2 kinda of sicko movie in one sitting 👏👏👏", "So she watched these two movies back to back? \nThe thing with these two movies is their scares are of the creepy, sticks in the back of your mind kind of fear.", "2:55 START\n3:27 RESTART", "Hereditary is weird. I like it.", "I haven't seen The VVitch, and I listened to the commentary without the movie... no idea what the plot was, but Amelia freaking out was hilarious.\nCan't wait to re-watch Hereditary with this later.", "Since i don't have the 🎥...i can only just hear ame voices to satisfied my need", "Thanks for bringing these amazing movies to your audience Ame!", "Cute anime girl watching cute movies 😌", "Bro she should watch se7en. One of the most suspenseful movies I've ever seen. It also has detectives trying to find a serial killer so even better", "It's actually fun to watch those movies specaially it's night in here and my parents are not here  all lights close, my room's door are open and me surrounding myself with a blanky hahaha", "That was amazing. Both films are very good as horror and it's a rare experience. And watching this with Amelia makes it thousand times better. In my side its 4 a. m. and sleep is gone. That's how excited I am. Huge thank you Amelia for this very fun time!", "wtf how does a hololive character have such good taste", "you thought i can't watch stream with ame i have big brain i watched while listening to ame archived stream", "Thanks for the stream, although the two movies  I watched for the first time are well...uniquely strange but entertaining just to put it lightly. Kinda horror but yabai in its own way. Hype for the shrek movie and concoction stream.", "We should do an anime watch along sometime", "Hereditary, the time before paimon become emergency food on genshin impact", "It was 4 am in my country and I was sick af so I missed the stream T.T", "Oh shoot, I Missed the Movie !!", "Pour one out for the lads who took their date to see The Witch in the theater. \nPoor bastards.", "Yay, watching movie with amelia!", "ill be watching the archive cause stream is like 5am for me, too bad", "So sad I missed this but I'm glad to watch the VOD", "Regarding your own life, neither you nor I are readers, but authors. At least in the end, you can still have the final say.ヾ(￣▽￣)Bye~Bye~", "Dang, I left to do homework and by the time I get back, the stream is done 🤦‍♂️", "Heard you were hesitant during this watchalong but for the record, I really enjoyed it, even though I've seen Hereditary but I still enjoyed the rewatch anyway. The Witch is... an experience to say the very least, a very yabai one. My friend liked it so I wondered what it was all about, that was weird as heck. There are still things that I like about it, but I definitely prefer Hereditary over it as well. \nIf you're worried about people seeing (yabai) things they're not suppose to, maybe have a warning or text layout to make people aware of it.", "If it's a members only stream, there should be no problem doing R-Rated watchalongs.  If any kids managed to become members, that's on their parents.  But for normal streams, you might want to avoid R movies.  Youtube can be very weird like that.  This does remind me of the time Ina streamed Color Out of Space without researching, although in that movies case, it was more about the intensity of the film than the presence of naked crones.", "I think it’s fine, the kid would need to jump through additional hoops to get the movie as well.", "didn't watch it, did ame get scared?", "mhhh i wonder~ Ame? will you ever make a watson concotion session again?", "Watch Knives Out", "Hey Watson!!! Just wanted to let you know I’m a big fan of these watch a longsssss sooo keep em coming! And thanks for streaming!", "I missed it :(", "Darn, couldn't make the stream as it was a little late for me, might as well watch along with the vod then.", "Ame I'm spooked please send help!!!", ".", "You are very cute ❤️", "I was in live but I dont see any movies I only see Emma avatar help me pls what was the issue", "i dont get it, how do you watch it?", "you find the movie via some other means, renting/streaming service/blu-ray/etc, and just sync up the start times", "Bro where can I watch these movies? I couldnt find them on netflix", "Amazon prime video you can find these and midsummer which is also good and similar to these.", "I already watch the vvitch but second movie im not watching before", "plz give me milk a lot of milk", "", "VVitch and Hereditary: Horror at the first half, comedy on the rest.", "🐕⛅🙏", "What interesting movies", "40-57", "Watson ameliaaaa", "Both movies are amazingly directed and written however I'm just not into slow paced movies. Also these two just dont disturb me or scare me at all. Am I the only one?", "jajajajajajajajajajajajajajajajajajajajajaja", "Ah, it’s always good when an anime person watches horrible twisted horror movies. Just another day on the couch for me.", "This is a date I'm not taking no for an answer", "thanks for the horror movie stream, Amelia~! uwu and thanks for being there with us watching it 'till the end even seeing how uhhh cursed the first movie was lmao. i didnt expect that creepiness too lol o7\n\nHereditary was nice tho. payoff was okie. better than the vvitch~", "How did you guys even watch it? There's only a timer so was there a movie alongside it somehow which isn't showing in the vod or what?", "Se can't play the movie on screen, nor she can let us hear the audio....\n\nI don't know how to do it on pc but i just used my tablet for the movie and phone for ame's stream, i then had to sync the movie's time on my tablet with ame's", "You watch it on your own devices, by your own means, along with Ame", "Ah alright thanks guys. Guess I have to download a movie to watch it along.", "stream on one monitor, movie on other", "The timer is where she is at during the movie. So you sync up during the beginning, but if you’ve seen it before you can also sync up at certain points", "I feel like I was a horrible audience member in this watchalong, sorry Ame.", "Nice", "I didn't watch the first movie, but Hereditary was pretty spooky till they revealed it was a nudist cult all along.  It was kind of silly after that.", "they are naked because in a lot of cults clothing is believed to impede the flow of magical energies through the body, naked is our purest form, its how we are born, its not a sexual or pervy thing", "I wish I enjoyed these movies more but they didn't really do anything for me. Nothing super traumatizing and if anything I found Hereditary really funny by the end with the bad cgi and story. They both just seem like there trying to be more then they actually are while just kinda trying to be rather depressing.", "The Witch is really more of a commentary on patriarchy in old Puritan societies than a horror movie tbh. Hereditary I thought was great.\n\nDirector of The Witch is Robert Eggers, his latest film \"The Lighthouse\" I found more exciting.", "Oh well you're just such a bad ass. Go watch some liveleak Cartel executions if movies are too soft for you.", "I thought VVitch was okay. But I agree with this sentiment with Hereditary. I love movies that have a bit of a slow burn to them but in Hereditary's case, the slow burn became detrimental to its spook factor.\n\nYou are put in a scene of suspense but it happens for such a while that the suspense eventually whittles down. And when it surprises you with some disturbintg imagery, rather than being perturbed by it, my reaction was pretty much: \"lmao what\"", "Do you want marry me amelia", "Calvin Sastradipura I want to build a snowman"]