["Today Aqua:\n- helped show them around \n- gave them free TNT\n- was the one who pushed Moona's dog back on the minecart", "Poor Aqua", "Poor poor Aqua.", "Await the clip", "Aqua is pain", "Best onion maid.", "ahhh man why you have to bring that up....ok i'll go sell my house to simp Aqua...", "Don't worry Aqua, we still love you!", "I know of only one Aqua goddess, and that one proved totally useless.", "Poor aqua... \n\nBtw was she streaming at the time??", "@The One Called Nick she didnt but log in to say hi to holo en", "@Lishtenbird This Aqua isn't useless, however she's not...the brightest of the bunch.", "@The One Called Nick I think she's prepping for an upcoming Minecraft stream. That's why she's getting stuffs from their Resource Server.", "Being aqua is suffering", "Aqua didn’t just give them free TNT, she gave them blessed TNT that they used to imbue the first EN monument on the server.", "When the greet her in the begining you can see Aqua’s reaction to them logging on in the chat history", "timestamp plz", "24:06\nJust pause on chat and at very top", "She is M so it's okay", "It's Always Sunny In Hololive", "thats why she started hololive resistance", "the killing wasn't intentional at least?\n\nAnd also partially her own fault.", "i really wished they would show more of Aqua's house instead they just skimmed trhough it", "@juldor93 ye", "@juldor93 They would still be streaming this if they looked at everything with a lot of detail. It's a very well developed server. I'm sure they will come back on it from time to time, and get more familiar with it.", "Well Aqua was supposed to sing at an international esports event that day, and it’s all get ruined.", "@Tingyu Tao really? Now I feel really bad.", "I really want to see them collab more,\nto the point where they can make houses & creations on each other's servers", "also wish I could've saw Sora's stalking POV xD", "Dreaming is free. Maybe in a blessing timeline or with much support and luck we can make this happen someday. Same!", "@Kariyu sadly she was not streaming at the time :(", "Yeah they could make “vacation homes” on each other’s servers.", "Absolutely agree with that Idea", "The best option would be to connect the servers with portals like how they have connected the resource server with the main jp/in server", "@Sin nombre I've also wondered about that. But the jp servers hadn't been updated to the latest Minecraft version. And I don't know why...", "....and prank each other.", "@Gerardo Reyes N yeah, they would need to update first", "That's probably not gonna happen unless fans do a petition or something 😂", "Minecraft is the best game for them to get introduced to each other since they can bump into anyone at any point and both the EN and JP girls are capable of communicating through the chat as they both know basic English and Japanese at least.", "I hope they make JPxEN embassies on their servers. Or a server portal thing between them.", "agree now i want 5 of them to go in the jp server for fun lol", "Amelia: uhhh, should we go somewhere special to end the stream?\nMoona: ...? you want to fight me?\nAmelia: ...", "2:14:35 \"...to say goodbye?\"\n\"What? Take a fight?!\"", "@Lishtenbird that escalated quickly", "@Pierre Wuran πr I wonder how many wars started exactly like this...", "@Lishtenbird Considering how quick people are to get mad at each other, and also factoring in that war that started over a bucket, I’d say at least 10% of all wars in human history.", "@Christian Cinnabars Tell me more about this bucket please", "Christian Cinnabars yes tell us more about this bucket please", "Moona seems to have taken a liking since she got a taste of duel when she locked Miko in her basement. She even asked for a duel again with Miko last night (for me it's \"last night\", GMT+8 time).", "@ret kret I have found the bucket https://en.m.wikipedia.org/wiki/War_of_the_Bucket", "It's nice to see Ame and Gura getting along with Moona! Hopefully we can see more collabs with Hololive ID in the future!", "I went to moona stream to watch it and it was all positive vibes. def would like more ID collabs.", "@Professor Penne Moona's streams are chill af. They're mostly in English too (95% of the time).", "imagine a holo ID x Holo EN among us collab", "All of Hololive ID are the best.", "yeah yoy really should, You would understand them. all of the Holo ID actually speaks more english beside the Indonesia language itself", "@Professor Penne iu", "@Professor Penne ooo", "Moona: Oh Your Approaching me?\nAmelia: HIC", "Where?", "@HERMIEkid 2:15:20 Is around where Moona say \"OHHH so you're approaching me huh?!\".", "@PenguinMasterKnight Thank you missed it the first time", "When moona misunderstood \"...say goodbye\" to \"take a fight\"\nMoona: BLOOD FOR THE MOON!", "Ngl, thought she said wanna fight too", "I heard its was fight", "Funny seeing Ame punch Moona and in return Moona sets her on fire", "Blood for the Bloodmoon!", "@Zafran Orbian period", "BLOOD FOR THE BLOOD GOD", "I see heresy in these comments! [Grabs flamer] FOR THE EMPRAH!", "BLOOD FOR THE BLOOD MOON GODDESS", "Time stamp", "she has Hoshi in her veins, of course she will seek blood", "In this tour Ame learned so many things, so we probably may see some huge technological advancements in the EN server.", "Sadly gura didn't go to the underwater houses in jp server, might help on her atlantis", "Or maybe she'll have Moona over to teach her some tech!", "i can already see them automated farms on a gigantic scale.", "With how against backseating she was, I'm afraid she might've spoiled too much of the discovery for herself in the process :(", "@Lishtenbird learning redstone on your own is really really hard. A lot of the mechanics are very finicky. At least she knows what things are possible to be done with it, so she can play around building stuff.", "Adavanced Engineering has been Learned", "Well\nShe has the mustache of mumbo,\nSo it would advance and brighter world", "\"So guys, I did a little change\"", "\"So guys, I did a little change\"", "\"So guys, I did a little change\"", "@holo life yes. having a cool mustache is essential for becoming a good redstone engineer", "Sora in her free time lurking behind them likely since she logged in is adorable ^ _ ^   \nWatson hiding behind Aqua too.\nGreat crossovers been wanting to see.\nBlessed Stream :)", "was she discovered??", "Mickey Lotoc 1:29:45", "Can we appreciate how cute sora chan stalks those tourist even she's already busted?", "Aye, she even ninjas away when the girls' attentions were on Hachamma's auto-wool machine.", "Implying Sora-chan hasn't  always being cute", "@Mauricio Aguilar forgive me for i have sinned. Dont regret it though", "@Yagoo Bestgirl Don't worry fellow apue follower for your sins has been pardoned for that's the generosity of the perfect goddess.", "@Mauricio Aguilar yet our goddess just wants to be friended by everyone", "@Yagoo Bestgirl Now Spread the word! spread the word of the savior little one and you will receive your eternal reward in the Holo-Heaven.", "@Yagoo Bestgirl sora wants hugs.\n\nBecause hugs are good and also friendship.", "Did anyone else get worried when Ame was walking around with TNT in hand next to a bunch of pressure plates?", "Nope lmao", "1:29:46 Stalker Sora spotted", "Sora doing what she does best", "LOL you are right  xD", "Sora in ninja mode lol", "Knew she was stalking but that totally caught me off guard.", "Sora Senpai wa Asobitai", "The original idol stalks her kōhais", "*Timestamp for USADA Construction Facility visit*\n51:35 Tenkuu (Sky) Trap Tower\n1:19:22 PekoMaze - TheSorrow\n1:25:10 PEKODAM & Iron Generator", "Rashomon", "I'm pretty sure TTT is Tenkuu (天空) Trap Tower, and the \"PIG FALL IN LOVE\" farm is called Rashoumon (羅生門).", "I need Sora stalking time stamps.", "1:29:48", "Also 1:47:26", "@Heru Kurniawan  @Anzu Bralor wait. did she spend half an hour stalking them? that so sweet in its own way lol.", "@GredyStar aye, it seems that it's her favorite past time on Minecraft. There's a clip on YouTube that shows her stalking Mio. \n\nAnd the last time I saw her on a Minecraft stream, she appears to be stalking Pekora while she builds her Pekodam (Peko Gundam). But Moona showed up with her legion of newly tamed dogs and Sora, a dog lover, ran out to pet them and blew her own cover. wwww", "@GredyStar also stalked flare for a good 20 minutes before she was discovered", "@Outdated Leon No one can not pet a dog. It's the law.", "@GredyStar you're new to sora senpai right? Don't worry she stalks them until she gets found out.", "26:48 And here we have Gura getting so excited from seeing a Senpai, that her Apex Predator Instincts kicked in.", "this is the one that got clipped the most", "Gura: \"what does TTT stands for?\"\nMoona: \"... The Trap Thingy \"", "Watson Industries on JP server: Write that down! WRITE THAT DOWN!", "1:29:20 Moona should have just told them \"PIG FALL GOLD GET\"", "lol no, she should told them \"PIG FALL IN LOVE\" just like her CEO told her", "PIG FALL IN LOVE", "Lmao", "Moona should rest, babysitting Gura and Ame seems tough", "Lol, she needs a lot of rest. Amelia and Gura was really hyper as heck. I don't know what's the source of energy they got, but I bet it'll be even more amusing when Among Us happens.\nIt'll be more chaotic as fuck when they can't fully understand Japanese members.", "Yeah, Ame and Gura's hyper energy reminds me of Tanaka Hime on HimeHina Channel. Always hyperactive. XD", "she's already used to it when streaming with pekora tho hahahhahaa", "@陰茎Emperor its probably because its still prety early in the morning where moona lives, lol.", "@loaduscoolclipz it was like 9-10am here, i even woke up late to the stream lol, i live in id too btw\n\nEdit: more like 8-9am sorryy", "Imagine if Kiara was included in the server visit I'm sure she will fangirl so hard in pekora's creations", "Haha, Kiara mentioned how one of her dreams is for Pekora herself to give her the tour", "@Lord Bimble Her dream will definitely come true :D one day lol", "@Lord Bimble and there will be a lot of traps and KABOOOOM", "@Dat Lam Pekora still needs a bit more socializing training arc tbh, Kiara is basically subaru lol", "and try to make calli marry her in the chapel.", "aqua  L I V E S  on the jp minecraft server....\n\n\nliterally.", "Well I guess Ame has found a companion", "Aqua is prepping for her upcoming minecraft stream i think. She has one scheduled on 10/24 1am est", "What", "She dies there too lmao.", "@MrSaywutnow Beat me to it.", "Did she take over shions house??", "@Eduard the old one? yeah pretty much.\nits now a front to one of the many many many dozen of hidden entrances into the aqua railroad network.", "Gura literally act like a kid here.\nAnd im pretty sure Sora wanted to welcome them but probably shy to talk to them that's why she ends up stalking them. Btw Sora doesn't want to be called a Goddess probably because she wants us to treat her as equally as the other girls. So please don't call her like that when she's streaming. She wants us to call her Sora chan so let's just respect that.", "Ame: sees a horse IS THIS A COW?", "The best detective", "You can never be wrong if you make it a question.", "ame being ame\n1:52:01\n1:59:40", "Amelia simping for gura i cannot belive that :D", "Ame's best when flirting with girls", "Lmao Gura's tone when she said \"Shut up\" is such an old couple thing to say. Lll", "Gura being a tsundere", "JP server full of landmarks and traps as far as the eye can see. \n\nEN server\nGura: I made a door", "Ame when she saw the JP server and all the advanced technology : “Uga uga” primitive man sound", "Just like the first time I traveled to Japan IRL.", "28:55 42:45 Aqua recruiting them with TNT and seaweed\nIts so cute", "Poor girl was trying so hard to treat them her favourite food - seaweeds, and they didn't give these lil treasures so much as a glance. wwww", "moona : I just play minecraft for a month\nalso moona : bachelor of redstone system", "Stream Start!: 2:20\n\nHiccup count:\n1. 5:13", "i think the last one was a gura squek", "@Angelo_ 265 Ah, now that I pay attention to Gura's model, yes!. You're right. I'll edit it right now.", "1:14:21\n AmeGura leaning their heads against one another was cute.", "clippable moment at 12:25", "It supposed to launch them to sky. But Detective have quick thinking lol", "I hope Miko gets to watch this part. She would probably get some laughs out of it. XD", "Ah yes, the vietnam flashback.", "Welcome to the Holo JP server where everything tries to kill you.", "I love how Amelia got distracted be rails every single time she saw one", "Poor Moona. It was like she was trying to wrangle two curious cats that loved to wander away the whole time lol", "Fun collab with Moona and some cameos from a couple of their JP senpais. Can’t wait for them to visit the EN server in the future and return the chaos.", "JP Server citizens: hellloooo\n\nGura: So you've chosen death", "2:21:14 Perfect Anime Ending where Amelia died XD\nWatson took a lot of note for her INVESTIGATION\nAmelia is so sweet, she wants to keep the Blessing of Aqua TNT ❤️", "Timestamp for Aqua giving them TNT?", "@Tallon Around 42:55", "Moona reminded me of a \"parent volunteer\" that's guiding the kids through the zoo/aquarium/field trip.  Ahaha.\n\nStill, it was so fun to watch!  Like Willy Wonka's Factory tour!!!", "No matter where she goes Gura will always show her dominance even if that means killing her own senpai or friend", "The upcoming Among Us JP/EN collab is going to be insane.", "@MrSaywutnow yes definitely a must watch", "And she did fucking both.", "31:52 \n\nAqua leading the group with seaweed is so adorable!", "1:04:14 ANXIETY", "knowing her, she probably did that on purpose.", "@_s who are we talking here?", "@Sev7en17∅ ame holding the tnt", "1:52:00\nAmelia: Nice view from here.\nGura: Shut up!", "Its like they were walking down history lane. Like when Love Live Sunshine Aqours visits the old school where Muse went to. That kinda feeling", "Sora is such a cutie, Ames was being so nice to her I teared up", "1:46:36 Sneak peak of Ame’s “Fukkireta”", "Oo cant wait for the HoloEN version!", "@Romulo Climaco can't wait Calli singing Fukkireta😂", "Gura, who killed a person on her first time on the server:\n\"Don't steal, we just got here!\"", "As someone who never play Minecraft and only saw the EN server, this blows my mind from start to finish, very entertaining!\nAt first I think Moona is a bit overwhelmed due to nervousness or something else but she picked it up at the end, being a great tour guide even though she only played for a month. Definitely looking forward to more collabs in the future. ", "From what I know, Moona is a bit shy and needs time to open up to people (in a way quite similar to Pekora). That probably contributed to the anxiety she had in the beginning. \n\nAnd there were new constructions going on all the time and some senpais' houses are a little difficult to find; Korone's tunnel house, for example, is a new addition to the JP server lol.", "English is like moona 3rd language", "@Outdated Leon Indeed, I really felt her shyness, and sometimes I can tell that she can't follow up Amelia and Gura. Her ways of pronouncing is also unique so it's quite hard for Amelia and Gura to comprehend what Moona is saying. Though, Gura seems to understand Moona even though she pronounces the words differently. \nOverall this stream was fun, but got nervous for Moona because Amelia and Gura was really hyper asf, lol.", "@陰茎Emperor I don't think her way of pronouncing that difficult to understand tbh (except that one time she said beer instead of bear), or maybe it's just the Indonesian accent. We Indonesians usually talk like that if forced and don't have time to construct a correct sentence as we translate them word by word instead of the whole sentence. She already did really good though as expected from a hololive member, I could never do a verbal conversation with a native English speaker lol.", "@Outdated Leon where was it located? I've been trying to map out each holomember's property/homes but there's always new constructions going on everywhere haha", "@Mickey Lotoc its the prison looking tunnel under the building made of ice.", "I hope development on the EN bunker complex continues even in the face of access to the main HL server.", "@Type Here it will definitely be improved, you can bet on Watson Industries", "One full month is enough time to train a total noob into a Minecraft geek, if aided by some good wiki-like reference website with some movie clips, and a supportive forum.", "@KWJ Moona is a good example of that. She is about a month in on Minecraft, and is building things that impress the other members who have been doing that for a quite some time.", "Yah, Moona is an introvert and takes some time before she can find her footing with new people. Her technical issues at the start of the stream didn't help that either. I think it was when she finally got them back into her house to show her secret stairs that she started to get her footing.", "moona was like a nervous mom with two rambunctous kids in an antique store", "It's nice to see ID girl collab with EN girl, with this collab i hope ID girl will get more recognition", "AmeGura scenes:\n\n45:20 treehouse\n1:10:49 UFO fall", "I'd also included this\n\n1:14:30", "Jokes aside though - I hope that Ame didn't get discouraged from the visit. It's such a colossal time and work investment, so immesurable, I can absolutely see how that would feel overwhelming and \"opressive\" for a new server with just a few fresh players...\n\nBut! For newer (read - international) viewers, it really is so much more exciting to learn and grow along with the team, from its very start. That's how you get to truly care and to cherish the experience. I, for one, got really impressed by Ame's cold thinking and sharp reactions in the early Minecraft streams, and now I'm honestly excited to see what twist the EN server will take under the vision of Watson Industries and Co. So, again, just in case - this totally doesn't ", "I feel like she wasn't discouraged. If anything, I feel like she's took alot of inspiration to bring back to the EN server.", "@KIRA VIRUS is festive I feel like she oscillated. Quite excited at first, overwhelmed in the middle (thus that \"opressive\") when the tour kept going on and on, and kinda accepted it closer to the end and played it off cool. Maybe I'm just projecting - as a creative person, I know that feel when you face something so immense that you understand you'll never be able to (creatively) compete. Those were familiar tones, I think, but I'd only be happy to turn out wrong. In any case though, I'm sure that this random little encourangement won't hurt :3", "@Lishtenbird I guess that's just creative difference. I enjoy making music, and when I hear something better it makes me want to improve and do better. I guess it could go either way.", "@KIRA VIRUS is festive Yup, sure can! It's hard not to get inspired after experiencing something cool, yet at some point you might cross the threshold and start feeling that you won't ever be able to create something as cool no matter how you try, and that's depressing. But at what point exactly definitely depends on the person, would make sense if for some it just never becomes an issue whatsoever :)", "Knowing Amelia's intoxicating competitiveness, she won't back down lmao.", "Watson after seeing the JP server firsthand: NOW I'M MOTIVATED", "I'm sure that this is a Usada Construction LTD advertisement-slash-recruitment programme", "She was holding that TNT for so long lmao\nChat was freaking OUT", "timestamp?", "@Liravin 1:04:01\nShe’s touring Moona’s house while casually holding dynamite lmao", "@AllTheRiches thanks :)", "2:14:38\nsudden PVP war start ", "Watson's Minecraft addiction intensifies", "Now that we had Watson´s 3d debut. Let me ask:  4D debut, Yagoo collab & Joe Momma ASMR When? / What is a cow's least favorite part of being a detective? The steak-out.", "Wait she had a 3d debut?", "@TheNoobiestNoob  1:46:40 =)", "@Casual Filth oh lmao", "“Nice view”\n1:06:40\n1:52:05", "The moment Ame realized Minecraft is not about railways. Mineson! 🔎", "Actually I think she might end the rail works era and start some machine revolution", "It's like she's experiencing an Era Shift in a Civilization playthrough, aye? wwwww", "@Outdated Leon exactly xd", "Well, we all know how rapid adoption of foreign technology ended for Japan, so maybe take it slower this time...", "With how she was fascinated by the automation of production line. It is guaranteed that HOLO EN server will experience an industrial Revolution soon", "1:26:38 \"How do we catch a villager\"\n\nPewds: GET IN THE BOAT", "I wasn't expecting a collab with HoloID so soon, but I'm glad it happened.\n\nI just had to drop my dog over at the animal hospital so they can work on draining fluid from his lungs. I miss him and I'm worried, but this stream helped me to calm my nerves. Thx, Ame and co.", "Hopefully this will take more people to HoloID. Hope your dog gets better.", "Hope your dog gets better man.", "Thx folks 🙃", "42:40\nWatson: SAVE ME!!!!!!\nAqua: (gives TNT)", "Inspiration in minecraft can take you a long way, and Ame just experienced a whoooole lot of it \n\nLookin forward to new projects you guys'll think up!", "Idk why but it feels so unreal seeing Aqua, Gura, Ame, and Moona in the same stream interacting with each other. I just couldn't stop smiling the entire time.", "AME, NO TOUCH", "1:29:47 STALKING 100", "JP server tour just fed Ame's addiction for more MC.", "That was a most wonderful, memorable Minecraft collab! We thank you dearly for the stream, Amelia! We would also like to thank Gura for coming as well as Moona, Aqua and Sora for their hospitality! Additional appreciation goes to the new Investigators for joining, the donors for their generosity and everyone who came by to tune in to your POV!", "1:14:50 for the basement trap", "1:44:53\nIs it sad that I immediately recognized this room from that time Matsuri and Aqua slept together?", "Bananas > Beans \n\nfor all those who understand.", "and bananas > grapes > beans", "1 banana", "26:46探偵の目の前で事件は起きた・・・\n血に飢えた獰猛なサメがTNTを持ったメイドの先輩に襲い掛かる。\n日本サーバに初めてきて30分以内に先輩を手に掛けるとは、やはりあめとぐらは面白いな", "That was a fun stream and I'm glad to see Moona getting along with the HoloEN members!", "When the guide turns out to be the final boss:\nTop 10 anime betrayals", "2:08:00 \"what was that spooky sound?\"\nInstant flashback to a Zombie brutally slaughtering Korone and Shion in a cave there", "Watson is taking notes so that she can increase the size of the Watson company even further", "The title of the video should be renamed children cause trouble in the Hololive JP minecraft server", "Ame brave AF hitting buttons outside of Pekora's house", "Imagine if Hololive MC servers are actually not seperate servers but islands thousands of leagues away from.each other.", "yoo i forgot that you had to carve pumpkins now. i remember them always being carved", "1:52:00 gives me life", "Ame: I can't plant it I don't have a hoe\nGura: giggles", "Railway:\n\nWatson: 👀", "", "Holo JP server Investigation\nMission: Undercover Holo JP secrets in minecraft construction. \nWarning: Possible assassins  undercover as guest, suspected of being a shark \n2:20:43 Status: Mission Failed Abort! Undercover agent killed with archer land shark.", "Thanks for the tour! Holoserver is so huge I saw some things for the first time and they haven't even seen them all!\n\nWaiting for part 2 with more senpai interactions ", "Yeah same, i only mainly saw the center of the server and haven't seen a lot of the things farther from it like Flare's house and haachama's other house in TTT server, that was amazing", "Sad to see that HoloEN had to use there own server instead of just using the JP one. The spontaneous colabs that come form the JP server is my favorite and both the JPs and ENs would better there second language.", "40:55 \"MY DOG!\"", "I just love how..Gura and Ame didnot correct Moona..when she said \"Ge\"nerator..and just stayed quite avoiding making her feel bad or smthg 1:25:40", "1:29:45 1:47:26 Stalker Daisenpai Sora got found out and spammed with carrots\n26:48 yab\n28:51 Aqua 360 seaweed skills\n34:36 RIP YAGOO", "1:38:45 Shark soup from Ame's POV", "26:20 Wild AQUA\nAppeared!", "12:36 monkaS", "So many amazing events have taken place in this sever, so many creations and monuments made. It legit feels like we’re in a museum watching from their pov for example the launcher used to fly Pekora to the moon", "Idk why but now that I watched HoloJP server from Ame/Gura's perspective, I just realized that HoloEN server current house(s) are surrounded by mountain ranges. On the other hand, HoloJP has lots of flat land and plains.\n\nI hope Ame and Gura can draw some inspiration from today's visit to implement into their own server.", "I swear the TNT was Aqua's way of getting them into the Hololive Resistance.\n\nTop 10 Anime Betrayals, Gura's Arrow on Ame XD So you have chosen war, Shark.", "I do hope Ame does some stream exploring the server at her own pace, taking detective notes and researching on Moona's, Aqua's and Pekora's Minecraft designs. XD", "The ending is the true definition of perfection", "33:35探偵の目の前で事件は起きた・・・\n案内役をかってくれた大学生が塔の上から転落をしたのだ。\n33:58には同行していた仲良しのサメがすぐ傍を落ちていった・・・\n「手抜き工事の疑いがある。」そう探偵は直感したのだ。", "It's amazing  how they spend over 2 hours watching stuff and still haven't seen everything the Server has to offer, either because Moona didn't know about it either or them not wanting to enter houses without permission of the owner. xD", "All I was thinking of this stream is that two naughty kiddos going around being somewhat guided by their mama. \nI guess this was indeed a Bizarre Adventure.\nIt was funny how they ignored Sora at their final meeting and so on. \nActually  a lot of funny things happened. Hopefully it will get clipped.", "I really love how Amelia is paying attention to all this. I hope we really will see a new construction company :D", "Yeah it’s gonna be awesome!!!!!", "What a wholesome beautiful stream!! It made me smile the whole time, I hope we see more collabs like this. Also, the variety of constructions and ideas in the JP server blew my mind! I want to be more creative with my minecraft server, but I'm so bad at coming up with ideas :P", "\"I am eating Kiara\" 👀", "I've only just started watching the vid, and I already have social anxiety.\nI really like the way Ame stayed by Gura's side while she had technical probs.\nI'm getting that \"first day at a new school\" vibe.", "As amazing as JP server is, I feel that EN has more interesting characteristics. Gura's water cave, Amelia's whirlpool traps, Cali's home being an ominous cave etc.\nHope that EN don't lose their unique characteristics as their technology advances.", "I like them.  It's kind of funny \"Let's do an introduction\" 17 minutes in after everyone knows who everyone is already lol", "The absolute chaotic mess that is the hollow live jp server has the same aesthetic and vibe of a 100gecs fan bedroom.", "1:29:46 A wild Sora appears !\n\nI see she is continuing to look after her kouhais. In secret... Silently... Far away\nYeah no she is just stalking", "I knew ame and moona would collab pretty soon, also ame and gura best duo hands down, very natural and fun always teasing each other at every moment lol", "lmao when 'to say goodbye' became 'take a fight' that was hilarious", "1:05:57 Thanks for the build 👍🏻 I appreciate it ❤️❤️ I'm Indonesian btw... :v", "I'm glad that Ame really did her investigation. \nBecause of her now I know how TTT works.", "This tour was so fun. Thanks for the stream Amelia! \nHope to see more interactions with the HoloServer in the future q(≧▽≦q)\n\nPS: Stlaker Sora was so cute ❤!!", "20:10\nIntroduction and a wink from Amelia\nALSO\nexcitement and a partnered wink from Gura!!", "Watson Construction Ltd. is now going to commence new projects because the CEO Watson got a whole lot of inspiration.", "1:59:40 The Gura ice cream has some \"bite\" to it. ;)", "Don't mind me, just going to put a Personal Timestamp: 1:18:35", "2:23 START", "24:53 I DON'T KNOW WHY BUT I'M CLIPPING THIS :3", "Thanks for the collab! With extra Aqua and Sora, it's really fun! Poor Aqua got killed by Gura and being abandoned while Sora just be a stalker lol", "Ah, right.\nThe JP server still has the old nether. I wonder if they can and will ever reset that one to get the stuff from the new one, that was only added this year..", "This was adorable! Also good job on trying to read the signs Ame!", "The thing I was waiting for is \"hey moona\"", "Anyone getting flashbacks of shennangins for every key location they visit or is it just me?\n\nTo my amusement all I hear are their screams of frustration, happiness, anger, drama and down right tilts.", "Button/switch exists :\nAme: click click", "1:39:20 Gura would beg to differ on the tastiness of a detective? hmmmmm, ameguro...", "1:41:10 WHAT?! how?! How did they do that?!", "it’s like a datapack to connect the main world to a resource world I think", "I think that it's impossible in Vanilla, but very easy in a special type of server. You only need a client like Buckkit/Spigot and a plugin like Multiverse and run a command", "They should do the same to connect the EN and JP servers together.", "Have you not seen the JP live streams?", "@セジャギオ no? Bruh do you really think I can keep up with all these people? Aren't there 50 hololive members?", "@Jo jo I mean, you can just watch one lmfao", "@Jo jo its not that hard lol", "most of us who live in rabbit hole already used to watch 3 stream at once 👀", "@Freyja Wion I got things to do man. Plus I don't even think the  ones I watched even played on the server. Or I just didn't watch the minecraft ones", "@Jo jo actually, there's around 30 of them (for HoloLive JP) iirc, but yeah, I agree, not all of them plays on the MC JP server as much as the EN guys do", "I remember there were some discussion going on in the one of the JP Minecraft streams. The most popular speculation of how it's done is via a mod plugin which enable a certain architectural design (like a certain kind of gate) to link to a different world. ", "@- Kyrel - what's the resource server for?", "@Camilo Gonzalez from what I know,it’s to collect resources so the main server doesn’t look so damaged", "@Camilo Gonzalez what Kyrel said. That's why whenever you see the girls needed a huge amount of materials, they don't usually go digging or chopping in their own existing world. And Resource World would frequently reset (I think once per month?), so they don't run out of resources.", "29:58 STONE COLD KILLER OUR GURA ^_^\n1:59:46 Gura killing people over a bad pun XD haha", "Thats some Achievement Hunter levels of technical difficulty", "Forgive me yubis but I still can't see the \"dog\" in Korone's art/house... I need help.", "When Ame was putting together the monument I truly thought for a moment that she was gonna build an upside down T", "Can you explain upside down T?", "@Chandelier G   it’s one of the oldest jokes in the Minecraft community(at least as far as I have seen), people would build “upside down T’s” (typically out of pink wool) but since the Minecraft community is largely made up of children people called them upside down T’s rather than the male sexual organ.", "Two cavemen tour the future colorized and animated", "I like Moona’s voice in English. It’s refreshing to hear it.", "1:22:03\n\nPekora's trap made the smol shark cry.", "Do they not know about the single player sleep data pack or do they want to keep it vanilla gameplay ?", "1:22:00 lol ofc Gura fell for it", "The goddess really likes to greet new members whenever they visit the server for the first time.", "Thank you moona for being an amazing tour guide, here's to more Holo EN x ID collab in the future", "Welcome to the JP server\nWe have bombs\nBombs\nBombs", "Thanks for the stream Ameila I haven't seen the Hololive JP server in 9 months and I'm shocked it grew the way it did and got to see Sora stalking you 3 and Aqua along with Roboco Senpais house", "あめちゃんのな可愛さに気づいちゃった( ⸝⸝⸝ʚ̴̶̷̆ωʚ̴̶̷̆⸝⸝)", "When it comes to directions,Gura is like Dory from Finding Nemo...just keep swimming.", "Amelia in jp server: Wow rails!", "OMG the place is awesome, what a dedication. Huge ideas, this inspires everyone ", "Watson 94% of the time: aah", "Elytras would blow their mind, flying with rockets when they walked all the time", "Feels like the real takeaway Amelia got from this server was to throw items at other members when you come across them.", "HoloLiveJP + HoloLiveID + HoloLiveEN = Perfect Wholesome.", "Man I cant wait to see what ame can do now she has seen the jp stuff", "Thank you for the stream!", "Moona is adorable and probably one of the few who can actively communicate with the less Japanese inclined members of HoloEN, but I really wish someone with more knowledge of the server were leading them around! I recognise so many of these places, remembering why stuff was built and what happened there, but Moona likely hasn't consumed as much Hololive as I.", "I want to see Mori and Kiara reaction of Japan Minecraft server xD", "58:05 was cute", "I love ame <3", "Amelia's really gun-ho when it comes to railways.", "I am curious, Will they join the hololive jp server ? Or can't they join for some reason?", "I think there's a few reasons, but the main one i can think of is that they wanted to play minecraft together before they were allowed to collab with any of the other hololive girls, so they had to use their own server. Also both Gura and Amelia are in North America and they would cause some decent lag on the JP server, you can see that during this stream at a few moments", "Watson is such a mom, \ncute", "I hope the HoloJP members will also do a GLORIOUS welcome stream to the HoloEN on their next Minecraft collab, just like what they did to the minecraft debut of the 5th Gen to the server\n(and yes, BLOW UP A YAGOO in front of the EN girls)", "2:15:05 Ame I will Distract Him Take Him From Behind 😂", "We got a lot of bananas", "1269 bananas", "Eiy man, wanna join da banana discord server? My discord id is TamagoDew#8785", "@Tamagodew Ok i'll add you", "Alright how many bananas did we get to in the pre stream chat", "AAAAAAAAAAAAHHHHHHHH\n\nThat is all.", "Shoutout to those that were counting bananas in the prechat", "I missed the stream from Moona so i have to watch it after stream from Amelia here", "Damn I missed this", "Their heights are like perfects stair steps.", "Seems that Watson Industries has taken interest with the technology that Usada Construction possesed in this business trip to VP Moona mansion, although Akukin Construction seems to also has taken some interest with Watson Industries railway engineering.", "What a fun collab! You all was having so much fun & I saw so many happy people in the chat. As u all might know iofi senpai should've join too today. Sadly, she got the flu.. so moona end up guiding the tour alone. Moona was nervous but end up doing a good job 😄..  Would love to see more wonderful collabs in the future.. thanks ame, gura and moona~ 💛💙💜", "1:24:00 ここすき", "00:26:46 Gura killed Aqua Senpai.", "Watson Industries and Usada Construction collab is looking pretty great!", "57:56 Pekora's Atlantis", "I can imagine Peko saying Hey Guraaa", "12:36 TNT moment", "LMAO AQUA DIED", "It was so much fun, I hope they do it again", "I had a dream about this wtf?", "Nobody :\nAbsolutely nobody :\nAme : RAILS..!!!", "Great Live !", "Ame and gura teetee 1:14:33", "lmao aqua is recruiting them to hololive resistance by TNT as a gift (it's like a business card).", "All you need in life: 31:10", "*moona speak\name & gura: wuuuu. waaah", "HoloEN server will undergo industrial revolution after watson get back", "Watson Industries and Usada Construction when?", "1:14:34 Adorable...", "It makes me sad that Sora is just hiding in the corner instead of joining into them. it feels like she wants to make friends to 3 of them", "Ame the whole time: oooooo, oooooOOOOOOh ooooooo Oooooh OOOOOooooooO", "Would love more Moona collabs", "Aqua showing Shion's old house like it was her own lol", "Today’s banana counting got to 1269 bananas. We will continue from 1269 in da next pre-stream chat. o7", "i almost cant say how many simps there are  thesse 237,616 are simping >:(", "gulag miner went to disneyland, colorized", "Man they did 🅱️aqua dirty lol", "The senpai are good senpai.", "Ame is like the Grian of the Hololive Server. If she sees a button or lever, she must push it, immediately.", "The shark ate the onion :0", "this was really fun stream, i'm glad i didn't miss any single second of it\nreally worthy of 3 hours\nsome notable moments\n- three of em trapped in pekora's maze", "i hope all these gets clipped xd", ">notable moments\n>no timestamps\n\nedit: actually if you could just link the redstone timestamp that would be nice", "Around 1:20:00 For Pekora Dungeon", "Not a whole lotta hijinks, but that's for later on.\nWhat a chill stream.", "1:52:01\nMira nomás que pinche vista", "With EN being able to join the JP server,Pekora will surely be crafting up trouble.", "What timestamp did Sora log on?", "Gura hucha'd Aqua into the next life.", "1:59:40 watson gura pun", "Hololive JP server needs to add a portal to the Hololive EN server", "hololive en boutta go through the industrial revolution", "utter chaos. amazing", "2:22 start\n19:00 collab start", "Hey moona!!!", "HEY MOONA!", "Watson 3D debut in Minecraft", "2:56", "A", "Ame got stream sniped.", "yes, literally hahaha", "Onion is the first prey", "Yoo someone tell ame to increase her fov a bit", "I hope the girls do an Asacoco someday.", "1:29:57 Gura LOL", "It's not hololive EN without technical difficulties at the start", "HEY MOONA!!!!!!!!", " cultured stream", "105th", "12:35 PANIK", "Still cute Ame", "they didnt see kiryu coco's house", "Moona was our HololiveEN before HololiveEN even existed.", "1:51:59 lewd", "Usada construction project TTT is very well built and it has built in copyright protection on the core section", "First Blood", "EN is finally joining the JP MC server?", "no. they were only visiting the server.", "@Savira Larasati can't they play in JP server?", "@Louie Chinayo only visiting. they have their own server. maybe it is arranged that way from the management because eventually, hololiveEN will get bigger and if they are playing in JP server, it will be overcrowded.", "@Savira Larasati I see...for the future EN gens", "34:00 sharkyonara", "Am I the only one who kind of feels sorry for Aqua?", "Amelia Zoom", "I love how they mocking pekora with all this \" hey moona\", \"moona ok\", \"moona yes\" etc", "What's the story behind it?", "@Lishtenbird just go watch moona and pekora streams and you will get it", "@Lishtenbird search \"Moona Pekora\" and you'll find lots of gold clips of them interacting", "HEY MOONA", "1:52:02", "Finally the apex  predator kill ame", "Big big ouh ough", "Ame Milk", "hollycrap jp server so much cheat machine lol", "2:14:37", "I think Ame is going spend a lot of time building in the Minecraft server more than ever now. She mention about wanting to flatten the mountains around but Moona mention mountains could be nice. I hope they use them instead too like building a Astronomical observatory on the top, build the Tower of Sauron, or create a mountain village or town like in Pyrenees Mountains but with a railway system that snakes around the mountain.", "\"HEY MOONA! MOONA MOONA MOONA! AH ⬇️HA⬆️HA↘️HA⬅️HA↖️HA➡️HA⬆️\"", "2:22 start", "Did the JP girls build all these in survival? or did they spawn in items?", "mostly in survival, thats why they have a resource server in the first place", "Almost everything here was built in survival. Only one person among them has admin access, I believe it is Miko. And she never uses it.", "Hi😊😊", "Baqua as always", "hey moona", "It's so sad that they don't have any plan to merge HoloEN server to HoloJP, i think it would be a lot of fun if they did. But i think they wouldn't, because HoloEN members are enough to make one server crowded, they are complete (5 members) and it seems like Cover gonna make another HoloEN gen, because of its big success (especially Gawr Gura, the first HoloMember who gets 1 milion subscribers), so they don't have any reason to merge their server.", "HEY MOONA!! (In excited Pekora voice).", "💓💓💓", "👍👍👍", "...", "Iron generator > Iron golem geocide machine", "ze chaotic trio", "", ""]