["\"Just draw it on one layer it will be fine\" If you listen closely you can hear Ina getting a heart attack somewhere in the distance", "Her heart attack was subdued, whereas mine was the clanking of several industrial machines so you didn't have to listen closely for it.", "You could even say, a 『Sheer Heart Attack』", "@Ryōsuke too soon", "I was hearing a train wreck quite close by and I was watching the aftermath of exploding chemical containers with huge fireballs and flying debris", "Satan: I just wanna say. I'm a big fan", "Is it really that important i dont know much about drawing", "@Bruh Bruh when you're drawing in depth it's really important to getting your angles and such right. watch one of ina's streams and you'll see what the drawing in layers is all about", "the drawings went fromT-posing to holding hands and singing kumbaya to rowing boats. we must never underestimate Ame’s imagination", "found u", "@Left Testicle yes o7", "those needles are probably the things that fuel her imagination. I need some of those.", "Or underestimate her laziness", "basically Ame: So guys remember when we all got naked and decided to row a boat together? Good times.", "You're not true friends until you get naked and row a boat together", "Ame: Remember when I was bald?", "Must have been one of those weird bizzaro timelines she accidentally stumbled upon.", "@Hipliss Truth!", "Ame: Closes the stream....then proceeds to open Minecraf...", "she's literally addicted lol", "Oh God dont let her discover mods", "@Chuito12PR Shaders mods", "@Chuito12PR or breeding villager and creating whole town \nor creating exploit farm from every possible material", "@Carrots She will become Pekora of HoloEn server lol", "it will become (Ame industries)", "@imagine being a mouse i wonder what well happen if ame plays genshin impact", "@legendary cuber They can't exactly play that on stream because of the recent incident, so that is probably never going to happen. But at least she can play it in her free time I guess.", "@Blooper {Reloaded} What recent incident?", "@craigboy442 I mean Coco's name is literally banned on Genshin chats so that's that.", "@Blooper {Reloaded} Hololive CN can still play it, so I don’t think the game is banned. Or if it is, I don’t think the ban reaches out of the JP branch.", "@Christian Cinnabars Surprise! There's no HololiveCN anymore! :(", "she is very skilled with the copy and paste function", "lmao", "Arent we all?", "lol", "she was drawing some boobliens apparently", "46:25  \n\nThis picture made me a little teary.  Amelia dreamt she wouldn't fit in the Hololive boat.  The boat left her...", "“Make sure you flip your canvas” \n-Professional backseat drawers \n \n“Make sure you get 8 hours of sleep” ", "Fun fact: 8 hours of sleep a night makes you die younger. You should get exactly 6-7 hours. So more like backseat killers.", "Honestly at this point I don't know if chat is legitimately backseating or they're just doing it for the meme lul", "It's porbbaly just for attention now and not actual backseating", "2:32:18 Well chat is Backseat Boys", "@Doge lol omg please don't let us get retagged to the backseat boys from teamates...", "it will probably happen though", "The sleep wqs more out of concern really. She legit sounded like she was half there from the moment the stream started lol.", "Lmao! If they keep this up, eventually one day it will be members only chat.", "2:37:44\nDid she just say Gega Senesis again without realizing it? o.o", "The embarrassment of E3 is repeating", "Kortal Mombat was an amazing game on the Gega Senesis.", "pretty sure that was on purpose haha", "@Lord Turnip if that's the case then she definitely fooled me but she seems so out of it at that point so idk", "I just realized that lmao xD", "Someone in the chat said \"Gega Senesis\" very early on so maybe it was just an accidental slip", "You know, typical jokes aside, I don't think she did a bad job. I mean they were really adorable and I'm actually looking forward to seeing it done. I'm hoping she keeps the boat though, the idea of them all just in one boat is cute AF.\n\nWaaaay better than what I can do. I cannot draw people at all.", "She took nearly 3 HOURS, but it's probably harder to do it electronically idk.", "@Chrispy_Salt \nsome people find it hard, and Amelia is no exception, all she need to do is to practice more and she be cookin.", "@SoulGen Yeah i guess ur right", "I need to ask drawing tips from her", "@Chrispy_Salt It took only a bit over 2 hours(about 30 minutes per person) with constant ctrl Zing and distraction from the chat. And she came into the stream not expecting anything from herself(moral is a major variable on progress). \nFor the circumstances, I’d say she did really well.", "50:48 Amelia: \"Nya~\" Neko Detective Amelia\n2:03:37 Amelia is Getting Over It\n2:05:25 now everyone is Getting Over It\n2:07:30 Censor Bar", "Your doing God work friend...", "Makasih cokk", "@Ariq Syauqi indo ada ternyata\nSimp yuk", "@I will make Justin Y speechless sesama simp kumpul disini", "dasar para shrimp", "If you can't draw a body, just draw a boat instead or something covered the body. Because, f*ck it\nI'll just draw stickman body instead\nNice", "Nice", "Ame just giving up and drawing a boat is such a mood", "2:08:15 \"this is too lewd!\" 🤣\nInto \"I don't wanna draw cloooothes aaagh!!\"\nInto boat\nBeautiful ame", "The live chat are Big M’s confirmed.\n\nThey want to be scolded by Ame.", "Aren't we all ?", "MASOCHAT🙃", "Here rests Amelia. She was a good girl, she tilted in everything and loved to eat dirt and sand!", "2:42:22 daddy amelia", "53:07 - Amelia being toxic towards Gura. Love it.", "shes never gonna change the thumbnail is she", "\"ill change thumbnail when its done\"", "waiting until 2021 for her to post the finished drawing.", "Ame is best rapper when she was announcing all the super chats", "54:28 gura derp face\n2:08:23 Censored bars...too lewd\n2:10:27 bath scene ", "2:32:18 Chat is Backseat Boys", "Good progress on the artwork. The art style looks . Looking forward for you to finish it. Hope you rest well and get better soon. Although, backseating on a drawing stream. Wow just  chill chatroom. She is trying her best . Thanks as usual.", "1:35:56 This cursed image just reminds me of that one episode of Jimmy Neutron where Jimmy makes Sheen really smart,  but then eventually his brain gets so big and he gets so smart he like gets  psychic powers and almost destoys the town.", "lol how tired is she? the thumbnail is still the stream reservation one. I hope she's resting and not in minecraft right now", "Have a good rest, detective! And if you have to push other streams back in order to get better, that's totally understandable. Don't feel like you're obligated to stream sick because of us, we can wait!", "Barrel would've been better. \nDon't change my mind.", "I made a quick drawing of a dark alleyway yesterday. It is a very sketchy place. It is almost as sketchy as Amelia arguing that she isn´t addicted to Minecraft.", "well,such a sketchy place must be erased from our memories", "Of course it's sketchy... what else would a sketch be?", "Every artist: 1:12:20", "I really cannot judge how Ame draws but I can say that the point of this video was achieved in a straight line", "2:08:24 Yabai", "TFW you joined at literally the last minute", "150 gang", "Amelia when she read superchat:\nCallie: finally, a worthy opponent", "51:21 nya-", " DRAWINGS", "i don't know what i want to say, so i want to say :", "She improved while in the process of drawing, good job. :D", "I love how br00tal Ame can be towards us. Stirs up the masochist deep within me.", "I've seen Luna draw with Marine in a few streams... This is pretty superb compared to some other Hololive members' skill levels! Don't be so down on yourself, Ame. Enjoyment of drawing aside, you did a good job.", "Didn't expect that boat lolll 😂😂😂", "Tbh Ame is good at drawing, she just needs more time to perfect it. Looking forward to see this work be completed. ", "How does anyone thing her art is bad? It's freaking adorable. I love it.", "Hmm yes stream reservation", "53:08\nDo I really need to explain", "Wait a second, this isn't the Drawfee channel.", "50:50 Nyah~\n51:07 *Hicc*\n51:21 NYAH~", "53:08 lol", "2:20:55 Ame suffering because of success.", " and thank you for the wonderful drawing stream Amelia. Sorry I couldn't watch it to full, passed out a bit further than halfway.", "'Hol on you didn't finish it? I'll be sure to catch the continuation stream.", "YEAH ANIMAL SHELTER STREAM\nWAY TO GO AMELIA, though make sure to get PLENTY of rest before that twenty-four hour stream. Sleep about a whole day with little radiation and minecraft in preparation for it.", "ame i'm sorry about how mean the chat is i promise we love you!!", "Uhmm the thumbnail supposed to be that?", "のりで笑うw", "basically streamed herself doing homework", "Who would’ve thought that Ame would be a lewd artist. I guess it makes sense.", "is she one of em zenra cult(the more you know)", "Gura’s arms can’t reach the ors so they made her captain", "2:51:21 Interesting 🧐", "lol", "2:08:43 WHAT HHJUGTDHG\nalso 53:07 is funny af", "Leonardo Da Vinci's \"Last Supper\", 2020, lines on white canvas.", "2:09:00 you're welcome", "I am honestly in love with this woman.", "1:35:25 Her mocking chat is always adorable", "Drawtective, what is this drawfee", "amelia and drawfee collab on drawtectives would be epic", "I had a lot of fun with this stream. I really should go practice drawing again.\nAlso, I can't help worrying about her; it's just part of who I am that I worry about people a lot.\nSweet dreams, Ame.", "That's a good quality to have, means you're a good person, and I'm in the same boat as you, I worry about Ame's health, she can't just brush it off and say everything is fine.", "Why everyone is so smug", "speedwagon", "Draw defective", "This is why getting enough sleep is important", "whats the song in the background called?", "サムネがvery cute", "53:05 thx me later", "End of stream chat went down to 193 then back up to 300 lol", "https://discord.gg/WQcxAn here", "That thing always happens, don’t know why, but whenever numbers rise up, it means the chat will be closed at any moment. Or maybe it’s just a coincidence... been so many times in end stream chat, that you start to realize some weird patron", "@Kesk56 Oh, I didn't realize till now. YouTube view numbers have always been weird. That's what led to the 150 gang in the first place lol", "@Weapon X oh, a fellow 150 bro.", "@Prussian Boi o7", "Her BGM sounds like the Nintendo Land lobby music.", "ehHEueAaaaEiaaahhh stressfulllllllllll", "Amelia-san what drawing software are you using?", "Damn I was too late", "What program is she using for the drawing?", "Amelia might not have confidence in her drawing, but it's way better than most people. Legit adorable drawing.", "Feel better soon ame. You never let us down. Thanks for the fun streams 🙏", "Girl please dont get sick!!!", "You know what's funny? She didn't change the thumbnail", "Jaja buen final, te faltó firmarlo nomás.", "53:08", "2:07:59 Boing Boing Sizes. Poor Ina.", "Amelia is my spirit animal", "Ame one layer veteran", "15:55 #Amelewd", "4 days in", "44:22\n01:02:39 Very happy 💞❤️", "she finally went to rest?", "I wonder how much Minecraft happened afterwards ", "I'm new your subscriber", "You know, typical jokes aside, I don't think she did a bad job. I mean they were really adorable and I'm actually looking forward to seeing it done. I'm hoping she keeps the boat though, the idea of them all just in one boat is cute AF.\n\nWaaaay better than what I can do. I cannot draw people at all.", "My internet was so bad that I couldn't watch this...", "F", "Lil bruh", "lol she's really addicted to minecraft now isn't she hahahaha", "2:49:08 I've been searching this BGM for days but still no luck :( Anyone knows the sauce?", "Give me an hour until I'm done with the hiccup count and I'll search it. I'm sure I have the link somewhere", "https://youtu.be/FvkRsJkvuEU?list=UUq15_9MvmxT1r2-LLjtkokg Found it!", "@Camilo Gatica holy sht thanks! You dropped this king 👑", "3:01:36 🤔", "NICE BOAT", "Nice art skills 🖼", "Blursed", "Boldson.", "Kiara never got a real face or hair...", "Hahahahahaha", "She's are nude?", "B O A T", "CENSOR BARS", "B O A T", "BARRELS", "Nice boat", "1:35:04\n\n\nYou're welcome", "love ya", "I really hope Ame gets a good rest", "wow much sugoi", "N", "She didn't change the thumbnail.", "baldwatson", "o7", "https://discord.gg/WQcxAn", "Stream was chill and amelia have a charm that I cant describe but I love it", "while I was watching this train wreck unfold I didn't even care because I still love ame-chan. just need that live chat to hold off on being back seaters ALL THE TIME", "The only solution is to hide chat at this point for me", "Yeah, she needs to set the rules and make chat abide to them or it can get worse, this was twitch chat levels of awfulness", "I still keep saying that these girls need mods, if Ina has a mod, then the others can have a mod too, its that simple. We can't just let this problem fester.", "We have Ina, then there's ame", "nice", "Wasn’t she supposed to be streaming the witcher 3 right now?", "she pushed it back to next week", "3:01:21", "She should play Detroit become human"]