["Scottish 21:22\nSouthern Texan Scottish 29:06\nbonus ghost hiccup 33:44\nAustralian Scottish 37:00", "\"wait, its all Scottish!\"\n\n\"Always has been\"", "This is the comment I’ve been looking for \n\nYou’re a chad lad", "I wasn't there to ask her to try Wales accent", "Texan Irish the heck is that ??", "@Adrian Fahreza Yeah that would have been fun...", "Every accent is just a variation of scottish.", "You are not wrong tho", "always has been", "-FACTS", "And on the 7th day, God said there would be Scotts across the land.", "SCOTLAND FOREVER", "@DerMann This meme has been beaten to death more than Kiara has died", "Yes?", "Stream Start!: 5:42 (10Q @Urugu2351)\n\nHiccup count:\n1. 14:58", "Finally, the most important timestamp list of them all.", "In 1:20:26 she literally sounds like a dog toy, I love it", "Doing God's work", "She always has hiccups 😂", "@WATAME VIRUS [Happy Halloween!]Ferocious", "コックニー訛りはもう少しオエオエ鳴咽っぽくやって欲しかった。anyway sounds lewd =^)", "Number 9 is very cute", "those are just the air bubbles popping out of her head", "I feel like she started off pretty good but everything slowly warped into a full Scottish/10 as things progressed… She’s Amelia Scottson indeed!\n\nScottish Japanese was something I didn't know I needed. 1:02:52 and 1:21:09", "I feel like I commited a sin for asking her to say ara ara in scottish lmao", "@brute- Sometimes the hardest choices require the strongest wills. You did well, this is just the beginning.", "@brute- I owe you my life comrade", "@brute- you're doing god's work", "arigAto", "As a Scottish man, this does put a smile on my face", "Perfectly balanced as all things should be.", "It was fun. She should’ve listened to actual Scottish people though, that would be hilarious.", "Does somebody don't know how to flush the toilet after they've had their ****?", "other holomyth: japanese study\namelia: 【Accent Practice】", "At this point she stopped bothering about her Japanese I think :)", "Japanese is hard to learn especially when you hit the Kanji wall.", "Gura, Ina, and Kiara are Japanese and Callie knows enough Japanese to make a conversation. Ame’s gonna have a rough time learning Japanese.", "@I Have A Hand I think Gura can speak Japanese as good as Ame lol.", "@Юрий Кашкабаш Gura is factually Japanese. She's very fluent. She just doesnt speak it much since there's not much of a reason to.", "One day she’s just gonna stream and it’s all gonna be in the Scottish Accent", "I am all for it", "I wish that'd happen :D", "Just like a wise man says \"SCOOOTLAAAAND FOREEEEVAAAAAAAA", "@Albertus Andrew BAGPIPES INTENSIFY", "Wait Amelia is Australian? Says she’s British. Sounds American. Confused:maybe", "Definitely confused", "Haachama Chama?", "Did she say she was Aussie lol?", "Im pretty sure its in the context that  her accent goes back to Australian.", "Hotel? Trivago.", "@nazrin992 We know a thing or two, because we’ve seen a thing or two.", "The actress is 100% american, the character... Nobody knows", "1:21:07\n\nWhat have I done...? forgive me fellow tea-mates for I have sinned ", "Japanese with scottish accent sound blursed, need more \"sample\" to have a definite idea", "Every accent is scottish, it always has been.", "SCOTLAND FOREVER", "[ Starts playing bagpipes ]", "i dont think they saw that one comin", "Of course ame used the wrong flag, she's a time traveler. She was born in England 200 years ago, she's not used to the modern flag.\n\nEdit: also this guy's Scottish accent is wrong, he sounds like he was born in Liverpool. Sounds more like a Beatles member than Count Dankula.", "Or it could be the future where scotland left the UK", "@Raphael Raymundo flag shown is a mix between the st andrews flag (scottish) and st georges flag (english) while missing out st patricks cross (irish)", "*220 years... 200 years ago the flag already has it right??? Since the union is at 1801...", "I really hope someone sent this video to Count Dankula.\n\n\"IS THIS YOUR LONG LOST DAUGHTER?\"", "@Keirnoth be the change you want to see in the world", "@ddddirge somewhat pedantic but you are right", "\"We´ll start with the british accent which is of course my natural accent but the harddrive got corrupted, so i´m stuck with my current accent\"\n\nSo Amelia is a time travelling detective Robot?", "Amelia is just Roboco from the future", "Cybernetic organism.", "She's actually a defective robot, but her defective reading module read it as \"detective\"", "She is an AI program!", "@McDucky this is fucking amazing. top 1 comments I’ve ever read", "@Ruthless Edgeboy \nliving tissue over metal endoskeleton", "Whatever she is she has a blowhole", "I see Ame attended the Colin Mochrie School of Accents", "Legendary comment", "Everyone > Why do you have Two Australian Flags?\n\nNew Zealand > I will bring down hell upon you and all you hold dear!", "Kiwi here, where do I sign up?", "Ame I remember you said one of your goals was to make a Hololive game I have an idea for you. \n\nHOLOLIVE DATING SIMULATOR", "YESSSSSSSSSSSSSS", "@Arc lieutenant Jesse I second this!", "Yes please!  Maybe make it for Steam and Switch?", "Ah yes, using the flag of the Kingdom of Great Britain which stopped being used 200 years ago when the United Kingdom of Great Britain and Ireland was created. I see that Amelia is a fellow patriot of the British Empire.", "35:01\n\"The Australian accent developed from people in the South East of England that went to live in Australia\"\n...\"Went to live in\" being a polite way of saying \"sent to a penal colony.\"", "See the problem with the NZ/Kiwi accent is that its mostly expressed through slang and swearing ninety percent of the time so thats generally the fastest way to sound like us", "One of the best nights of my life was drinking with a group of aussies and NZs. They were in Las Vegas during a big (game where they hug each other a lot) tournament. Never been called a cunt in a nicer manner.", "@t polutts for most Aussies or Kiwi's cunt is used as an endearing term", "@Callum R Yeah, it was just weird for me at the time. Took me a minute to realize cunt was a friendly title instead of an im about to punch you word.", "So it's Scottish. Got it.", "Agreed", "\"Fucking sponge cake!?\"", "Aw yeah nah its all good g", "@Tomskyrun chur brudda", "“Beer can” in a british accent kind of sounds like “bacon” in jamaican accent.", "Huh. Yeah I guess it does. Jamaican accent has a lot of that.", "Nobody in jamaica says beer can", "@Echratus what about  Bacon", "@Casual Filth yh we saw bacon", "Would you be so kind and toss the “bacon” in the trash?", "@Dragon Loli .......stop", "@Dragon Loli they either would think you are crazy  or think it is because of your Religion =)", "Makin' bacon in Jamaican", "@Casual Filth i don't understand", "@AryaZaky Iman Fauzy try saying these words aloud in what you think the accent would sound like ;D", "With every language stream Amelia british accent grows stronger.\nIm looking for one day she can do a full  british undercover mission.", "You and me both!", "After all she still have a mission to complete with Holomyth girls", "Australia is a subsidiary of The British corporation.", "YOU ARE SCOTTISH NOW, AME!(jk). Thanks for the accent stream! As a \"English is not my native language\" person, i'm really enjoying this stream!\n\n(That Scottish \"Ara ara\" is blursed lol)", "Where is that??", "@Pun Amornvivat You mean Scottish \"Ara ara\"? I'm sure is in 1:21:07-ish", "Starts 5:42", "Streamed 5 minutes ago\n\nInfinite sadness...", "I feel the pain and suffering", "I missed it by 6 minutes", "She calls herself British and didn't know what the Scotland flag looked like.\nFake brit confirmed.\n\nAlso someone spamming no that's just the simps", "It's pretty in line with the English not to know anything about the Scotts.", "@Yourson Isold I'm English and all my friends know the flag we are small little place, after all, we are the Uk in school we learnt this its common knowledge", "@KorewaSaber Apparently you spent so much time learning about flags that you forgot to learn how to get a sense of humor. lol", "Lol I never knew wales was part of the uk and I’m a Brit and the scots flag", "Scotland was too powerful in the end.", "Never thought gonna hear Ara Ara with Scottish accent", "let's take a moment of silence for those who missed the stream (as me)", "there there. missed it 2", "Bring it in. Missed it 3", "Missed 4", "I missed a lot", "What we learned today kids?\nWith a bit of practice every english accent is Scottish.\n\nI'm not english native speaker but that was incredible fun, 1h+ passed like nothing thank you Amelia", "This was just adorable", "Id love to see her do an Edinburgh accent.", "Jesus Christ that’s an actual place", "@Belac81 ... you made this really tough to figure out... is this sarcasm?", "@Belac81 I know right. It's not like it's the capital or anything.", "Scoortash", "@InExpert no I actually had no clue that there was a place called Edinburgh", "@InExpert I am big dum ok\n\nI have no clue that was a place", "@Belac81 aye and any money you pronounce it wrong too lol", "@Skode Dickinson I bet I will pronounce it wrong \nHell I will probably not even know what country it’s from", "How about Glaswegian lol", "@Belac81 bro, its the Capital of Scotland", "@InExpert I learned something new today \n\nThank you for this somewhat useful information", "@Belac81 years from now, this knowledge will save your life", "@Belac81 US Education", "@ewwfgt asddfe ew skool is not kool mate get out of here", "YEEE HAAAW, another day, another hold of the line o7", "Just went through like 75 comments and nobody was talking about her new giant bean bag. I am disappointed. She is a toxic 90s kid personified. Rage. Toxic FPS. Minecraft slow burn addiction. Interesting hygiene choices. GIANT BEAN BAG.", "Yeah. She definitely sounds like a 90s kid or 30 year-old boomer.", "Ame: Wait. It's all Scottish?\nMe, a Scot: Always has been.", "Remember folks, all roads lead back to being Scottish.", "I’m dying Irish was just Scottish 😆", "With this stream we witness the birth of Amelia Scottson!!! Great stream!!!", "1:06:54 Leaving this for myself.\n\nLoved all the accents Ame!", "Amelia: \"YEEEEEEEEHAAAAAAAAAW\"\n\nMe: \"HELL YEAH BROTHER, THIS BE THE AMELIA WATSON LIVESTREAM\"", "Ends stream* Amelia: “heavy Spanish accent”", "That was an interesting stream. Also your cheerful personality, helps a lot.", "Ame: lemme do different accents\n\nAme: LEMME SOUND LIKE SCOTTISH", "Being Australian... i'm pretty sure Western Australian's don't sound like this... Over East seem to be the only ones who have an accent. because i am sure i don't sound like that.", "I feel like only Watson could make a 1hour+ video of her just practicing accents so extremely fun to watch :D", "Ahh i missed it", "Same lol", "Same", "Same:(", "same", "same xD", "Same", "Bruh. I missed it by 30 seconds.", "\"Hi I'm Amelia Watson from 1st gen Hololive Scotland.\"", "heres a pritty random comment\n\ni learned accents from Tf2", "man I miss it", "Same man  I just came back from work", "Darn, same here, just woke up", "Thank you for the Scottish Accent Practice stream Amelia!", "27:53  LMAO. Man, I'll tell you hwhat. :)", "Just do the TF2 voices, lol. Best reference point for a gamer", "58:56, Finally I can watch this happily. She speaks my accent.", "Amelia: accent practice*\n\n\nMe:Wise Choice", "i need the timestamp for valley girl watson", "Ame has a nice rolling 'R' sound, it's pleasant to listen to.", "\"How to do a __ accent\" videos tend to be pretty bad", "I had some big laughs this stream. Cheeks hurt from smiling. Amelia is just a natural entertainer. Love our Scottish detective.", "27:55 lol do more King of the Hill conversations", "This fake \"general russian\" accent got me hard.\n\nWhat a pity that russians actually \"tolk een broken eengleesh een reel laif\".", "Well, that was a lot of fun. Even if everything did sorta devolve into Scottish", "That flag is definitely an IRA moment", "That's worth a yike", "Ame's genuine laugh warms my heart ♥️", "god tier stream as per usual. very very strong week for teamates. 10/10", "I kinda wonder what her “corrupted hard drive” accent is. Midwestern American?", "Nah. I think more UP", "Scottish mode on forever", "Its all scotish?\n\nAlways has been", "The way Ame clears her throat always sounds to me like the start of Callis \"Excuse me...\" song.", "1:05:29\nFor all your clipping pleasure.", "Sees Irish flag in thumbnail\nHehe, I'm in danger", "Yep", "That's why I'm here lmao", "She needs to do the Hawaii Pidgin accent. Plz I wanna hear you speak my dialect 😂", "I'm so glad I got her to say ara ara in Scottish. I shall die happy now", "I feel like it would have been easier for her if she had just looked up vids of people talking in the accents and then exaggerated the accents, rather than looking up tutorials about \"mouth posture\" etc aimed at people with the time and effort to learn an accurate accent lol, but I guess Ame will Ame", "Why British people have to practice British accent?", "This stream was damn hilarious", "Elo there amelia! Loved watching the stream ! ♥️", "I saw this entire stream... now I want to eat haggis with whisky while play my bagpipe and find for Nessie.", "This was incredibly fun to watch ame hahaha", "Love amelia's scottish accent.", "The live was fun", "Scottish all the way!\nI love it Ame xD", "Oh I see the Scotland flag for the first time! So it seems like the background of the UK flag. Good to remember these flags.", "The UK flag is composed of three different flags of the three kingdoms that form the United Kingdom. These are 1) the big red cross that represents England, 2) the white cross against blue that represents Scotland, and 3) the red cross that fills the white cross of Scotland which represents Ireland. Wales is not represented on the flag by itself (though the red cross of England is meant to represent both England and Wales).", "@CrescentSickle thank you lol, I know Wales flag, it’s a red dragon or something, really recognizable", "Does she come Scotland yard?", "Ha! \"mate\" the classic aussie slang", "Good job  on learning the Scottish accent, Ame. Thanks for the stream.", "あなたの笑い声がとても大好きです", "Rolling erres and being hardly understandable? my time has come", "The important things in life", "One thing I've learn is NEVER call \"Scottish\" English.", "Cute: 29:00 🥰", "How did I miss this 😭", "She sounds like my english teacher", "Ah, she made me smile again", "I just got a giant beanbag too😂 The Big Joe", "In this episode of \"Amelia learns that what she set out to do is, surprisingly, too difficult to achieve in the span of an hour\".~", "lol, she's such a brummie", "It’s very interesting!", "Missed the stream too oh well", "I can't stop thinking of the banana bots in the beginning", "I missed this stream =(", "chat was so mad that filipinos invented swag :/", "When she said 1:25:00 I felt that", "Love how she's trying to speak Australian so cute", "G'day mate ya got some goody good accent there. Goodonya", "Amelia the multilingual detective.", "Wait, everything is scottish?", "God Bless the (English) Empire", "Hotel:trivago \nAccent:Scottish", "this is cute. that is all I came to say", "Yeeeeeeee Há...", "The UK flag is correct, because she is a time traveler ~200 years from the past.", "I guess so but, she already has a Scottish flag so wouldn’t it better to use the traditional English flag? (Saint George’s cross)", "@Mitchell I totally agree with you, the English flag is probably fine when she already has a Scottish and an Irish flag there. Although that does mean the lack of representation of Northern Ireland and the implication that Northern Ireland can be represented using the Irish flag... Which might be problematic.", "@ancillarity yeah that’s a fair enough point, I probably should’ve thought of that considering N.Ireland’s stance on sovereignty. \n\nHopefully  Irish viewers don’t think of this as poor taste like with happened in the jp branch recently. ", "This gremlin is too much lol", "1:03:35\n\nWait she is Scottish?\nAlways has been", "30:48*\n59:00 W I K I D", "SCOTLAND FOREVER", "Californian was actually Valley Girl accent. Show us your beanbag!", "Hey Ame, I wanted to say that your voice is really pretty and I'm trying to model my own after it (I'm MtF trans) so keep practicing! Youre doing great and I hope I can speak as prettily as you do❤", "Such a creative stream lol. Amelia is so fucken entertaining", "oh no missed it :C", "Pretty good Ame\nBubba's accent could use some work though", "1:03:23 Why does that \"ehe\" sound familiar?", "who?", "@mae Searvh up \"ehe te nandayo\", it kinda sounds like Venti", "You see a turns to ah- pronounced eh-.", "Wait it's all Scottish?", "So what does that matter? I don't know much about it. Thank you.", "Shrek approves of Amelia's Scottish accents.", "i think ame need to watch some benedict cumberbatch movie. i love cumberbatch british accent. i recommend ame to watch  sherlock holmes by Benedict Cumberbatch since ame is detective too.", "Wait...\nIt's all Scottish?", "Can Amelia speak Welsh??", "Nooooo, am i late? 😞", "She brotherzoned all of us", "Why was there no Canadian? Why was there no Canadian, eh!?", "This is possibly the best stream on all of Youtube. What can't Ame do?", "Ahhhhhh I just forgot ittttttt😞", "No Gremlin Accent?", "Faq i missed it", "Ame would Excell in playing demoman", "Scottish is the sliced beetroot of accents, it colours everything that comes after it.", "I thought these guys are lying... Ame indeed sounds more scottish than anything she could produce. Now i want to hear her say one Kilogram of steel and one Kilogram of feathers.", "Of course her Scottish accent is good she works for Scotland Yard.", "Haha, why she barks when her dog do it?", "Amelia Watson of Hololive SCO practicing accents", "Oh no, she's now stuck with scottish accent", "This is gold.", "1:25:00", "yeehaw", "Someone Should have sent Ame eric cartmen talking as a NASCAR driver. That would have been fun to hear her try talking like that.", "linolium? eh watson", "33:44 ", "did she learn to pronounce Worchester?", "Did she try an Irish accent ?? I'm not sure", "Scottish ame", "Bubba needs to become a v tuber", "WALES IS GONE", "Howdy, Amelia Scottson. I see you've been sat there for a while.", "SCOTLAND FOREVER INTENSIFIES", "Now listen here sheila, the Australian accent video is missing something. you need to swear every 3 or 4 bloody words or you'll be called out as a bloomin tourist.", "YEEEEEHAA！", "She tried", "ELLO M8", "Apparently ame is a scottish detective", "SCOTLAND FOREVER", "SCOTLAND FOREVER", "Wonder if she has a plan!!! 1:25:01", "North Eastern American Gura accent.", "Currsed", "YEEEHAW", "SCOTLAND FOREVER 🏴󠁧󠁢󠁳󠁣󠁴󠁿", "Never thought I'd learn while watching this stream! It was fun! Thanks, Amelia! ^_^", "Amelia Scottson", "The British flag isn't wrong at all, it's perfectly correct because it doesn't include Northern Ireland ;)", "Hi ame!!!!!", "", "What’s the point of this?", "this is why Amelia is the myth of british. KONO POWA DA!", "watson", "oof", "Bri'ish", "The Amazing Spider-man x Hololive Enelish", "So Amelia is Scottish then", "1:25:01 AAAAAAAAAA~", "where's the saint patrick's cross on the union jack?", "pog", "Vot abaut rashan exent, comrad? Not iven menshond? Stalin dasnt apruv. Fogiv mi bat ai can't laik ze strim in fir of biing sent tu GULAG.", "U definitli didnt woched the vidio comrad 49:30", "So funny", "For most people, hiccups usually last a few minutes and are not a medical concern. However, if your hiccups last longer than two days, they’re considered chronic. Chronic hiccups can last for years in some people and are usually a sign of a medical issue. They can also cause health issues themselves.", "aw man I was late", "aw man I was late", "Me from NZ", "NOTICE MEEEE AMEEEEEEEEEE!!"]