["The part when Ina betrayed Ame when she was just trying to help brings a smile to my face", "Kiara: Basically, we are all children-\n\nCalli: Can confirm.", "https://youtu.be/axzjvQGO-es", "Watson embracing the FPS role rather than the Detective role lmao ", "Guess she's an American detective.", "Whether you're a friend or foe you are never safe from Amelia's \"gamer\" side", "🎃 Amelia helping Kiara only to be left alone was hilarious. / I used to believe my neighbour when he said he slept standing upright. But he's been lying.", "Ame flexing her fps skills again...", "55:16 Local Bird gets hunted by pro FPS gamer detective", "Ouija board called the Toxson coming out telling the rest of the girls to “get gud” after she steamrolled them as imposter.", "\"Is there a way to make it easier for you guys?\"", "52:59 nice calli scream 10/10 i would hear it again", "Lol the dude in the chat : \"she screams like tyler1\"", "39:00\nIna: Oh! The crow marks where the key is!\nKiara: Oh... who is the grow??\nAme: The cutest laugh I’ve ever heard", "Stream Start!: 01:35\nHiccup Count:\n1. 28:55\n2. 51:15", "It ain't much but it's honest work!", "carefully, he's a hero", "Madlad", "Ame flexing her FPS skills in a non-FPS game", "Ame kills everyone without even a single ", "56:12 no caption needed", "Kiara was so mad. \"Ame is a pro FPS player!\" 😂", "https://youtu.be/axzjvQGO-es", "\"What the hell is that?\" -Amelia seconds before her demise 34:01", "1:11:54 damn Ina shooting Amelia in the back again! (1st time during L4D2)", "I don't really get what the downside is to everyone knowing who the neighbor is. You miss out on that element of surprise but you can't really counter the neighbor anyways?", "So we have our cipher finaly solved i think. Yagoo spider..... THE HELL DOES THAT MEAN??", "Check Ame's twitter and watch the twitter video, you will understand once you watch it.", "Kiara's cut screams made her death all the more better", "You know what's going to happens when HoloEn best fps shooter gets the gun.", "It was very fun collabo! I like you, Ame! Your camera work was easy to watch the stream for me and your clear voice was easy to listen English for me!", "Thank you for the collab! Our Detective has flexed her FPS skill and get a little toxic by telling them \"Get gud\" lmao\n\nP.S: No secret ending, see ya in Calli's new song, have a good day! o7", "To all 569 Teamates who stayed, I hope you enjoyed the stream as much as I did~! See you all in Calli's stream~! \n\no7", "see there soon o7", "20:13 This conversation between Gura and Ina tho. 🤣🤣", "Ame always puts so much extra work in her streams, it's great. The concoction stream was so delightfully odd and funny, this stream (like Among Us collab) has a wonderful audio set up for when others speak... keep up the good work, best detective!", "Actually way more disturbing than Among Us.", "This was a fantastic halloween stream thank you Amelia~ I think everybody in Hallo-EN did amazing uwu i had a lot of fun watching your stream~!", "HAPPY HALLOWEEN AME AND THE GANG!", "First Enma-Chan surprise debut, now Discord itself simping. What's next? Gabe Newell simping?", "In due time, all will kneel before their might.", "14:17 but but she had the high ground! Wait a minute how did this happen we’re smarter than this?", "55:50 shocked gura", "I love how Kiara was just running behind Clown Calli for a solid 30 seconds at least and Ame is just cackling about it", "This stream was amazing", "Man, this really reminds me of Prop Hunt.", "This was super fun. Looking forward to the next collab with all the members!", "57:44 1:02:15 1:05:17 I love how they say it", "does anyone know what to do with the numbers in the description", "Not sure, she's been giving us numbers the whole week.", "some people translated the numbers in caesar iirc and the meaning of the numbers is \"yagoo spider\"", "@Hernán Parra González That explains the Yagoo spider in the twitter video.", "Really wish they actually played with the proximity game chat it woulda made the game way more fun", "I just missed it damn", "The candy puzzle was really cute and a super fun idea! I hope you do similar scavenger hunt type things in the future.", "I Had An Add About An Online Class For Simping... I'm Not Even Joking...", "This was a very spooky stream happy Halloween", "Rip to my recommended", "I've been gathering the numbers in the videos description, what are they about anyways?", "Happy Halloween Ame and chat❤️🎉", "I missed this :c", "how do they do that popping bobbing head thing for the other girls? :OOO where it lights up and stuff", "Neither love nor hate. But most the important of all that I will Always Love you From who you are Detective Watson \nNeither Care nor Not. I wish this Small message Reach out to you and makes you Smile. 😊", "Cool game, funny balancing.", "Loveeeee it ", "I enjoyed when Ina looped the killer that looked funny.", "Gremlin Attacks once again ", "Yagoo's Spider!!! 🧐", "Alternate title: 133,999 people stare at a thumbnail made by a creepy old idot", "Thanks Amelia Mom.", "yagoo's spider?", "After that Neighbor round, it turns out that Watson is the true apex predator.", "will watson play warhammer games？", "Ame do her best this time", "Happy Halloween 👻", "captainsauce. Game egg", "I told y'all man, world domination isn't that far off", "Hello", "nice,.", "nuuh am late", "Lol", "27:14*\n36:00*\n52:55*\n54:55*", "Amee", "A", "Hi Ame, Would you guys like to Try \"Don't starve together\"  as a Halloween themed game", "", "", "wait there not using the in-game voice chat?, then that sucks for the neighbor", "they didnt use it it :< it was a pretty easy fix too i think, just making the microphone the default device"]