["MVP Amelia, like a true mom...", "Calli: homeless noob\nKiara: sacrificial bomb, gacha addict\nGura: likes to wander off by herself\nIna: Ame's assistant", "Amelia is seriously underrated, she is funny, hardworking and have a lovely voice", "@Jacky Mraz 100% true. They are all unique for sure. Something about Watson is very special though !", "\"Homeless noob\" LMAO", "Gura what do ur gremlin eyes see !!", "I always see Ame as the center or focal point of the group as she is the only human and we sorta 'investigate' the mysteries that is the other members together. It is hard for me to put that into words.", "Everyone - Exploring the wonders of the Nether\nAme - Mining every visible gold ore", "Golden Yagoo must be built", "Her avarice and hubris will be her own demise.", "@Uncle Biff No greed in sight, just wholesome sharing after some \"hoarding\". You gotta feed the kids in some way.", "She needs to fund her daughters' gacha addictions", "@Kent S speaking of gacha. addiction imagine dropping 2000 on genshin impact.", "Activator rails ain't cheap.", "We need a fanart of either:\n\n- Watson playing tennis with a magnifying glass, or", "Or a fanart of Amelia being addicted to mincecraft with tons of syringes", "@Jus Astroknot dirt block sryinges", "thanks for the idea, gonna do the second one i think~", "YES", "@Rifuki what platform do you post on?", "@JC IsArt twitter\nhttps://twitter.com/Rutorifuki here's my account if you want to check it out", "https://twitter.com/Rutorifuki/status/1318570483978096640 \nhere i made the doodle~", "Mama Watson and Mama Ina took their 3 chaotic children to hell to sightseeing and then proceeded to gamble with a pig.", "amazing title", "Why did Amelia  buy nine rackets? because tennis too many", "Nice pun", "Good joke", "@没入習得方法 thanks =)", "@DAUS DA GAMER 10Q", "Got me good xD", "Badump tss", "Ina, is that you?", "Eeehhhhhh HAAHHAHAA! He did it... He done did a goof!!!🤣🤣🤣", "145 IQ plays", "Tol fast for likes", "Kiara genuinely sounds like she’s being murdered every time she dies LOL", "I love Amelia being addicted, it's a fun meme and she really seems to enjoy building and progressing for her friends! When she finished the build and gave Kiara the naming rights, it's possible she just didn't want to name it, but it's kind of her to give one of her friends the pleasure who might get more enjoyment out of it. ", "alternative title: ame being a gold goblin", "*gremlin", "Leprechaun.", "1:04:45 They found a Tall Birch tree biome??!!! Isn't that kinda rare???!!!", "They found a zombie piglin on a chicken", "They have crazy crazy luck... After exiting the nether they immediately found another abandoned portal. Like what the hell 😆\n\nEdit: which is also close to a dessert temple!", "Amelia next stream: \"Hey guys, I did a little bit of offline work in the nether.\"\n\n*Opens up two large chests full of gold blocks", "Or she made a gold farm", "@Astley • KFP's Singer There's a gold farm?", "@twotothehalf yes it's basically a zombified piglin grinding farm", "Wait so that joke was that they cheat? I always thought that the joke was that they actually did offcam mining and they gained so much stuff it’s suspicious....   Damn the joke was so simple yet I missed it.", "@Glorbnorgaborg • 37 years ago yeah you missed alot of laughs bc of that", "Kiara and Amelia planning to build a chess board so they can play in Minecraft? Pain-peko.", "Now amelia is going to explore nether off stream for next 10 hours", "I hope she brings gura again", "@Jus Astroknot they are good patner", "More like she'll start a Minecraft stream in less than 2 hours.", "@Christian Cinnabars haahaha, we know it. WE KNOW IT WILL BE HAPPEN", "I wish she learned more about redstone", "@Christian Cinnabars lol you were right", "she's streaming bro\njust after hours after the collab\nshe really is addicted hahahaga", "Amelia's thirst for gold is only matched by her thirst for violence", "Ame's like all of us that just take the time to build a home while the rest are dying on their own.", "39:30 1:43:32 1:45:47\nkiara death counter 3 \n1:28:00 1:41:38\ncali death counter 2", "Two of Kiara's deaths were intentional though.", "@Kent S its still count as death ", "Detective, FPS Player, Lewd, MVP and Santa Claus.\n\nWonder whats next.", "Tennis player by the looks of it 😆", "27:08 Ame forgets what \"boots\" were called", "Amelia needs to try LA Noire, really test her detective skills", "Correct me if I'm wrong but I think that the chat was a lot better today I was disbelieved by how wholesome it was I could cry. This might only be the case because I didn't really read chat much this stream but regardless it was way better than before.\n\nAnyways, this stream was so wholesome. Ame mom material. Thanks for the stream as usual!", "top quality comment right here... thanks bro.", "I think it was because it was a collab, and the problematic viewers were dispersed across all 5 channels. The ones who will be in  her chat are those who genuinely want to watch  and support Amelia or those popping in while watching multiple streams.", "It's a full collab so every fans come to their own girls so I think chat today is pure amelia fan only", "@Joe 冗 Hm. Yeah. That makes sense.", "@Joe 冗 I really hope there can be a volunteer mod system employed in streams, to block antis spamming garbage. They are apparently trying to use software with multiple fake accounts to spam now, and it will get worse when Coco-senpai and Haachamachama are back.", "@tonalwake nah no fan mods, if they get mods it has to be from cover or hololive. Any sort of fan mods would make things worse", "Chat size makes a big difference, and everyone was spread out so the potatoes weren't all concentrated into one channel.", "She didn't lie when Ame said she's a gold digger.\n\nA total of 10hrs to watch all of their pov's one by one of this stream. It's a sunday anyway 🤷‍♂️", "Next stream the Nether will suddenly have it's own railroad.", "Deadass tho like it’s happening", "Theory: Amelia is actually Santa Claus in disguise!!!", "This stream: ame and ina doing all the work", "1:45:07 Watson: mines gold, looks at pigman. ... mines gold, looks at pigman. ...", "11:39 \"tennis racket\" comment", "\"I want to get the gold in ceiling\" sounds like an inspirational motto.", "44:02 Did i just hear what i think i heard?\nDid she say \"Booba\"?\n\nEdit: Also around 18:30", "Ame mama carried. LMAO", "I love watching these streams because it reminds me of my experiences when I first started playing", "Amelia the Detective, the Miner, the Architect, the Santa, what is she gonna be next time? I'm looking forward to it. ", "The Mom", "She's also a ZZZZZZOOOOOOOOOOmer", "I forgot also a gremlin", "Some people in the chat still need to chill out... But overall chat has improved on not shouting at Ame every single time she does not follow \"the right way to play Minecraft.\"\n\nRIP Calliope, got NTR'd", "Yea, the chat has toned down from the last minecr stream", "I also thought it was a racket", "10:01 Sad moments only Skyrim players will understand", "How would be the live if ame didn't remembered the way back home...? She's a hero!", "Alternate Title: (Collab) Ame N` Ina playing minecraft", "Really fun collab. It was pretty comfy. Also you really led very well the rest of your friends towards the goal. Good Job ", "AMEzing stream as always! And the chat is calmer and more wholesome than before, so that's good too!", "Well at least I wasn't the only one that thought it was a racket.", "1:47:41\nSanta Amelia Watson begins.\n1:48:45\nFirst Santa lover sits on lap and makes funny.", "As soon as kiara blew herself up last night I knew I would be searching for other POV's. Unfortunate to be a KFP employee last night, but at least there was footage lol", "Stream start!: 3:09\n\nHiccup count:\n1. 6:07", "Holorail is complete and she already has an enchanting room......I bet she's still playing as of this moment.", "Amelia, you are a good player, it doesn't matter what someone says.\nYou can learn easily 👏🏼👏🏼👏🏼🤩", "9:27 imagine getting called stinkey by gura kekW", "Ame looking at gold: its free real estate!\n\nEdit: Ame, pls put your brightness up, I’m not sure if its just me but my eyes hurt after I watch the stream", "The fact Gura said striders and Kiara immediately said \"Aragorn\" pleases me.", "Now that they called it a tennis racket I can't unsee it. Lmao it's so cool tho", "Hololive en needs to play among us with 5 other English speaking hololive members like coco, haachama, and anyone else who wants to.", "Ame: Arkitek", "Another great stream from this amazing individual, world needs more ame’s for real", "Ame not giving the curse of binding boots to cali made me love her more", "57:58 she laughed like a child. I've repeated it for thousands times", "Really happy that all of you got to explore the Nether together for the first time~ That was a fun stream.", "Ame is santa. yes,gifts to all of them", "i see u ", "@Left Testicle I also see you.", "so the railroad if finished. wonder if that will get her out of the addiction lol. she has to find a new objective now. hopefully she will get interested and redstone engineering and join one of her senpais' construction company in the jp server at some point.", "Yes learn more redstone yes", "Ame is the true MVP of this stream. Hats off to her.", "I swear me looking at this video makes me so triggered", "ame, the true MVP and santa claus XD", "you guys made me remember I have minecraft as well. Started out last weekend. It's addictive af.", "when did ame had an enchanting table", "Amelia is my favorite one to watch so it makes me happy to watch her", "now to make that holo nether railway", "Ame shot down the mighty phoenix like she was nothing.  Big \"F\" for \"Friendzone\".", "Aah, I missed it...", "Calliope used to be an adventurer until she took an arrow to the knee.", "Amelia moves like a pro. I think she only needs time to know a lot of this game.\n\nBy the way, アメリアはワイフです!!　Being specific, my waifu.", "That's easily the most scenic nether I've ever seen", "11:42 tennis racket", "Detective santa amelia watson lol", "44:06 dog mode", "If there any pre chat gang i only have 1 thing to say \" counting bananas\"", "Ame: True gamer & team mvp\nIna: Assistant & supportive mother\nKiara: Jumpy & gambling addict\nGura: Innocent & easily distracted", ".?..?..?", "its amazing how fast amelia got the hang of minecraft lmao. she already exploring the nether by herself", "I tried watching gura & ame at the same time on my PS4 & phone but everyone’s chat audio cannot sync but it’s interesting", "Anybody know the outro bgm name?", "Dova Syndrome- Foam Flower", "You have to craft the golden nuggets into golden ingots first before you can trade with piglins just like trading with villagers in the overworld", "1:42:22\nPig-man gives his last trade.", "Ame is such a power gamer ♥️", "Watson really Organize girl..just look at her chest everything really in order.", "Ame is just so reliable", "Is it possible to make portal to HololiveJP server? hahaha", "1:49:08 Gura Contemplates \n1:49:14 Gura Has an Idea\n1:49:53 Gura Shoots", "Give the goblin some gold", "GG to all the girls!", "All those minecraft hours being put to good use!", "Can I call you mommy?", "I’m so like you,Ame.", "noooooo I missed it", "Carry a cauldron and you can drop water in it to jump in", "first", "yay another adventure on the microft server", "I like the ending song", "47:58", "Amelia you the best!", "Imagine if Amelia Watson liked my comment", "Ame is the An Cap one", "Momelia 🕵️", "Hello I am a small creator and I would like to interview you And ask same questions because I’m interested how did you make the genre and why did  you make the group", "Message me if you would like to be Interviewed", "@Chillingout 123 you oughta do some research on Vtubers and Hololive. It would answer both your questions.", "Ok thx", "o7", "this is the last server invite of the 150 gang discord server so join now or regret forever https://discord.gg/vvVbQU", "What does o7 mean ?", "@SearBurrito745 \"o\" is a head, and \"7\" is a hand saluting. In other words, \"roger\".", "@Nazgrel Wolfsong that makes a lot of sense thank you", "Nazgrel Wolfsong wait really? I thought ame just typed that randomly at the end of the stream", "@Luke C see I thought that as well", "@Luke C Oh, really? I was watching from Gura's perspective so I didn't know. ʅ（◞‿◟）ʃ", "Oh hello there", "150 gang is done we are full", "@Left Testicle is this official discord or something? Or run by the girls?", "cali's voice makes me cringe", "Can you guys not be such noobs?", "They're fucking new, what do you expect?", "@Robert Kristian Zambrano Agreed. You ain't a veteran if you call out new players for sucking at a game.", "I was the first dislike", "Your name makes it clear", "@Astley • KFP's Singer Chuckle worthy"]