["今日もまた角巻親方のこだわりが出てしまった...！暖炉いい感じに出来たし、ホロメンのみんなにも積極的に遊びにいけて楽しかったね✨", "なんか途中まで違う物になってたけど暖炉出来て良かったね！w\nというか毒盛りすぎて笑う", "今日もお疲れ様！そしてありがとう❣️\n冒頭で言っていた１日空いただけで1週間くらいに感じるのはわためいともきっと思っていることだからとても嬉しく思いました🐏✨(無論ワイも)", "Watame No.1All of us will stand by you forever!!", "Jesus knows what's up", "", "", "Amen🙏", "based Jesus", "The word of the Lord. 🙏", "The shepherd isnout here doing serious work", "Watame poison Subaru arc\n\n7:35 The laugh when watame remember the fun with fugu\n8:11 Watame: Let's bring this as a present, eh he( Evil~~~~~~~~~)", "6:39:12 to 6:40:50 this is just for me to remember. I watched her whole getting over it stream for 8 hours, when she won, I cried along with her. I finally beat the game because of Watame and then to have her acknowledge that, I didn't actually expect it. Especially since my comment was in English. Thank you so much Watame, you're a very hard working sheep and honestly my days are much brighter because of you and your streams. I did something I never thought I'd ever do since I had totally given up on that game. But I was inspired and I cleared it. It reminds me that I can do lots of things if I am willing to work hard. Arigato! Daisuki Watame!", "Side note: I DID use her \"coffin dance\" technique/rhythm to clear the stairs, it works strangely well", "Nice SC!", "good friend, try hard", "That's awesome to hear!!", "11:21　勇者スバルド、テトロドトキシン盛られる", "Dont mind me just saving this for later\n\n5:16:44", "5:30:00　わためん坊将軍のテーマ", "6:42:45 海外ニキのプロポーズ/Confession by oversea bro\n6:44:55 恥ずかしーぷ/Shy sheep", "名だたる先輩方にフグ毒を盛る。毒盛りわため🐏w前回のそら先輩に続き、すばる先輩、ミオ先輩…を毒牙にかける🐡😱\n\nミオ先輩については、走らせたり、先輩のベットとっちゃったり、ベット作らせたり、鬼畜の限りを尽く…？w畜生羊を愉しく演じます。", "This sheep is too dangerous with a fugu", "2:10:51 ルーナ姫w", "2:14:17 ほんもののグフとは？ｗ", "フグテロとメル先輩のお礼参り楽しかったね。スバルの呪いもすごかったｗおつかれー！", "4:33:50 Yummy Yummy Pizza", "4:31:32 Peppe Pizza", "In this video we can see how a sheep looks for new defense mechanisms after  her tsunodrill failed; thus the world first poisonous sheep is born via fugu type asacoco.", "自分用   5:04:49\n自分用2 5:14:33\n自分用3 6:02:10", "watame No.1", "Thank you, Watame! ", "いつかポイズン歌ってほしい", "Can someone locate a superchat I made? I had to leave before she could read it. It says something about burning.", "Just how many unsuspecting victims have been poisoned by Watame's fugu (pufferfish)?\nSuisei (attempted; Sui-chan didn't eat it)\nAki, Sora, Subaru, Mio, Luna, Mel (confirmed victims)\nIf Watame can get away with poisoning Sora, no one is safe.", "The day she poisoned Pekora is the day the sheep get dragged into the neighbor war", "Suisei didn't fell for it because she knows how to handle poisons. In real life.", "マイクラお疲れ😉\nボイドテラリュウムやるみたいだけどPS4版でもホーム画面に戻されるアプリケーションエラーや再起動が必要なバグがまだ残ってるみたい💦", "わため～～　牛乳はもっとじらさないとｗ", "I want to eat Watame pizza", "Watame going around distributing Fugu like it's Asacoco... Fugu type... Asacoco?", "❤️ 6:42:52", "😎☝👍👍👍👍👍VERY BEAUTİFUL THANK I LOVE YOU🐏❤❤❤❤❤💯👈", "2:48:26 Watame→Mel\n3:44:10 Mel→Watame", "暖炉で圧迫感が出るなら、暖炉面の壁にチェスト収納移動させて壁面にすれば、奥行き的な圧迫感は軽減されると思うの…\nチェスト移動面倒だろうけど、チェストと暖炉のデッドスペース両方減らせて、その分部屋面積は増えるから内装に凝れる\n暖炉を右に1マスずらせば、チェストが左右に2列で天井がガラスで透過するから、天井いっぱいまでチェスト拡張可能の大容量収納壁面になるよ", "🐑#☝️", "Watame likes pineapple pizza? Oh, no. 😱😭💔"]