["今日もとっても楽しかったー！！！お家が出来上がっていくのウキウキしちゃう！", "Thank you :)", "Thank you for streaming!!", "どんどん完成が近づくからやめられないんだよねw", "あまり気乗りしていなかったチェスト整理お疲れ様w\n整理整頓と二階の倉庫も出来て良かったねぇ〜\n\nわためぇが嫌になったり辞めたくなるまではそばに居るつもりだからこれからもよろしくね！🐏", "お疲れ様、これからどうなっていくんだろうね楽しみ", "おつのまき！整理と内装ちゃんと進んだねｗいなくなったりせんから大丈夫やで一緒に歩んでこうな", "もうすぐ50万人ですね。おめでとうございます～\n綺麗なお家に仕上がってきて楽しみです", "Let's look back. I really can't fight the sheep.", "Watame shall eat flare", "Thank you for always doing your best! 🐏", "thank you", "Lmao. I didn’t know you also fell deep in the Rabbit Hole! xD", "oh no", "FYI if you name your sheep \"Jeb_\" you'll get RGB sheep like that.\n\nIt's an easter egg where jeb is one  of minecraft developer.", "I need to start learning Japanese...", "You got this", "You already are doing :)  Just keep the subs off.", "(Sora and Flare come to visit ) \n17:14 RGB Sheep has arrive \n20:20 What happens if you sheer an RGB sheep \n23:00 Watame try to poison Sora-senpai, meanwhile Flare knew what's going to happen", "自分用\n4:40:27\nわためかわいい", "25:06 そらそらに毒盛った時点でわためぇもレジスタンスの仲間入りやね。", "1:28:27 happy birthday reference for myself", "Watame see RGB sheep\nwatame:\"Gaming sheep.\"", "5:45 \"(incoming 8 hour stream lol)\" - @mynameJTV\nAnd the stream actually ended up being almost 8 hours, lol.", "6:55:30 友達感覚でおこになるわためぇ好きよｗ\nゆっくりやすんでね", "6:55:05 「にへへ かわいいだよ｣\n6:55:23「わためは4歳だよ」\nここすっごいかわいくてすきw", "That was fun! Looking forward to next stream!\n私は楽しかった!ありがとうございました！", "I just cry very hard right now, this Direct was in my birthday and I notice 9 Days later. That day I didn't have a Birthday party and few people said me Happy Birthday.\nIt really makes me very happy hear Watame singing \"Happy Birthday\"\nThank you Watame 😭", "Happy Birthday fellow Watamate. Hope she made your day better", "約8時間はやりすぎやで…わためぇ", "Does anyone know where is Sora's house in the server", "The one with alpaca shape", "念願の整理整頓と思いきや⁉️\nそら先輩&フーたんが、来てゲーミング羊🐏くれたり、フーたんハウスで、てぇてぇ❤️\nわため、愛されてんにぇ〜っ❣️ \n整頓も上手くいきました。", "17:10 そら先輩とフレア発見 Sora-senpai and Flare", "15:49 \"女児\"って後ろの看板、気になる．．．", "自分用 6:27:53\n甘えるかわいい 6:58:15", "1:16:19 leaving myself another mental note", "ara ara", "Have a good morning 💤", "gaming sheep", "watame Haven't seen Aqua underground tunnel 🤭", "~shiiiiiinnnn~ watame-san funny.", "1:29:41 Well thx, lady", "Proud of Ikazu401!!", "可愛い", "Hardworking sheep!", "Watame best sheep", "2:00", "Wait, did she finish the peko building?", "yeah, like almost a month ago", "自分用\n7:38:45", "Thank you for streaming Watame! I don't understand Japanese at all but I find your stream so relaxing to watch. Keep up the hard work DoDoDo!!!", "自分用\n6:25:35 asmr superchat start\n6:55:15 minecraft superchat starts", "1:28:27", "Thank you for the relaxing stream, much love to and from the watamates and the membersheep (7:01:31 for my shout-out ❤️)", "👍", "THUMBNAIL AGUNG-SAMA\n\nLEAVE A LIKE IF YOU'RE INDON", "Thank you for streaming hitsuji! Now rest sheep, rest!", "Watame's house is more creative than my Minecraft world", "深夜で配信時間長くてみんなアーカイブ追うのが大変だからもう少し短くしてほしいなぁ"]