["みんなの愛をたくさん受け取りました！また一緒に歩いていこう🐏", "一緒に歩いて行こうね！\nわためぇいつでも愛してんで❤️🐏", "Oyasumi, we're Watamates forever.", "わためナンバーワン！", "You stole our hearts. We love you!", "Thank you for the stream and meeting us today Watame ❤️ I'm happy to see so many Watamates love you. We will never stop supporting you.", "止まらないで", "WATAME NO.1", "❤️ ❤️ ❤️ ❤️❤️ ❤️ ❤️ ❤️", "いつでも愛してんで", "Watame is the best", "わため NO.1!!", "わためぇのおかげで救われてる人いっぱいいると思うで！\nこれからも一緒に歩いて行こう！", "This is the first Watame stream I was ever able to watch, after seeing a ton of clips (especially the rap!). I was really happy to be here, and see all the love. Watame deserves all the warmth that she received, I can tell already. Excited to be a Member~ □", "頑張って！わため大好き❤️", "Thanks a lot for your stream today. We'll never stop supporting you.", "Watamates Forever!", "たまには立ち止まってのんびりするのも必要なことだと思う\nみんな温かく応援してるから焦らなくても大丈夫！落ち着いて歩いてこ！", "これからも一緒に歩いていこうね！わためNo.1☝️🐏", "共にいることを忘れるんじゃあねぇぞ？😁", "We will support you forever❤️❤️ ❤️ Watame NO.1!!!!!!!", "In sheep we trust", "We watamates have to protect her beautiful smiles", "いつもありがとう！", "we will be by your side whenever you need us\n[DeepL:]   困ったときはいつでもそばにいる", "みんなもわためが必要や！壁にぶつかっても突き抜けるぞ\nwatame No.1☝️🐏", "I love this sheep! We will support you, Watame!", "A Watame for life. We'll be here for you, no matter what!!❤❤❤❤❤❤❤🐑🐑", "ここにはみんないるから安心してね！また一緒に遊んでいこう！", "Watamates Forever!", "わためと一緒にいつまでも歩んで行くよ！\nわためNO.1☝🐏", "Just move on~~~", "❤️❤️❤️\nいろんな夢に向かって一緒にどんどん歩んでいこ！！", "わために救われてる人はいっぱい居る。\nだからこれからも一緒に突き進んで行くで🐏", "最近の出来事やRedditを頻繁に利用していることが、海外ニキへの思いに影響を与えているのかもしれません。でも、心配しないでください。私たちはいつでもあなたと一緒にいます。これはDeepLの翻訳です。\nRecent event and your frequent visit to Reddit may have influence your though on overseas bros. But dont worry! We will always be here with you!", "WATAME NO.1 ", "ずっとわためぇを応援します、これからも一緒に歩いていこう🐏", "We are support watame-san every time you No.1 in our heart😊", "進み続けよう俺達と一緒に", "we love you watame!", "気を付けないといけないことも当然あるけど、\nわためはわためらしくやっていけばいいのよ！\n自分らしさを忘れずにね！", "わためナンバーワン！これからも一緒に歩いていきましょう", "わため！いっぱい愛してんで！", "今の状況を考えると心中お察しします。気晴らしになるなら雑談にはいつでも付き合いたい所存\nむしろドンと来い？", "わためぇ応援してんで！！\n海外の色んな方にも見られてる以上、すべての国の常識非常識その他諸々は把握できないのは仕方ないよ。日本の常識は別の国では非常識なことも多々ある事だし。\nわためぇは(規約内で)わためぇのやりたい様にやってくれれば良いと思うよ！！", "こんな素敵な子は滅多におらへんで", "もちろん喜んで！", "リスナーとの対話がメインの配信スタイルですからね、リスナーへの配慮を忘れないその姿勢は助かります。\nまだ気付いてない方達も諸々の事情にいつか気付いてくれますよ。", "I love you watame. T_T", "行けるとこまでみんなで行こうー！もっといろんな景色みたいね！！", "はい！落ち込む時、辛い時こそ笑いなさい。\nあなた笑顔になることで皆を笑顔にさせるんだ。\n同じで、僕たち笑顔になることで君を笑顔にさせる欲しいです。", "これからも一緒に歩いていくで！\nわためNo.1☝️🐑", "Always be with u  :_にこにこ:", "Thank you for the stream. <3  Always support you Watame.", "Watame Ch. 角巻わため 迷っても間違えても、それから正していければ良いと思うよ。\nわためぇ愛してんでぇ〜:_ナンバー1::_にこにこ:", "WATAME    ベスト", "これからも一緒に歩いていこうね！わためNo.1", "We love you.\nWe will respect your decision.", "You are a wonderful person, Watame! ❤️", "ほとんどアーカイブでしか見れず、一歩二歩遅れですが、必ずついて行きます(≧∀≦)", "ずっと応援してるよ！", "watame No.1!\nこれからもよろしくね!", "加油 Watame~form Malaysia fans", "我來自台灣  Watame 要堅強  ，妳很努力了 謝謝妳", "わためぇかわいいよわためぇ", "あなたを応援したいと思っている人が世界にたくさんいます。これからも焦らず夢にむかって歩いていってください。", "わため頑張ってください、君をいつまでも応援します", "私は台湾の海外の聴衆なので、翻訳しか使えません。ご容赦ください。\n「わため」が誰かが退会したのは何か悪いことをしたからではなく、中国が悪意を持って他人と私たち台湾人の権利を分割したかったからだと説明したい。この方法は、HOLOLIVEの罰に対する不満を表現するためにしか使えない。演じる前と同じように、「わため」の生放送を楽しく見たかったのです。もう悲しくて泣かないでください。台湾では「わため」が好きですが、悪意のある人にさせないように頑張っていかなければなりません。一部の中国人は私たちの楽しみを奪っています。まだまだ「わため」の生放送を楽しく見たいので、ベストプランを立てて、どんどんみんなでチャンネル登録して戻ってきますので、ご安心ください。", "いつもありがとう、これからも一緒に頑張って進め!", "一緒に頑張れましょう!\nわためは悪くないよね", "中国のリスナーです わためはわるくないよ。君は優しい子。大丈夫。\n请各位冲国DD评论就事论事，不要伤及无关者，自己理智判断，不要人云亦云被带了节奏。", "誰も怪我をしない世界線に足を踏み入れたい(google translate)", "Watame No.1  いつもありがとう！", "♂️❤️♂️❤️♂️❤️♂️❤️♂️❤️♂️❤️♂️", "I can only love watame and hololive ", "❤️❤️❤️❤️❤️❤️❤️", "You have my support 100 percent! Watame forever! ❤️❤️❤️❤️❤️❤️❤️", "海外ニキ（ドイツ）です。今回の件は是非とも金以外で力になりたいけどさすがに48万人のわたメイトもいて全部読むとか無理そう。だったら、頑張れるまでいっぱいいっぱいいいコメントを読んで欲しい。\n一般リスナー側（「関係者」以外）にはなんの変わりもない。わためぇはいつものわためぇ。無職から就活して採用まで仕事から帰ってもわためぇの配信で力がみなぎって来る。そういう優しいお姉さんは現実にはいない、せめて俺にはないし。ホロとお酒は勇逸の癒しで、お酒はもちろんやめ。。。控えたいｗｗ", "Please don't think you are hated. Everyone loves you so let's do our best together! ❤️", "This really breaks my heart, she is now worried that she may say something that upsets someone unconsciously just as Coco did, this is not ok. I want to protect this awesome lovely sheep as much as I can.", "Well, management shouldn't put their talents under this kind of pressure. A number of Western viewers unsubbed and cancelled memberships to demand Cover Corp to take better care of their artists. There are a lot of concern trolls making bad faith arguments, that voting with your wallet just hurts the streamers. Real fans are voting with their wallets to make Cover Corp do their damn job, to ensure that Watame and all other talents can perform without being afraid.", "@dkosmari Yeah, everyone has their right to vote. That's what \"vote\" means. This probably works a little bit.  Cove gave a new statement at least.", "I can appreciate the sentiment of wanting to entertain people from all over the world, but when there are places where you get disappeared for saying the wrong thing, or even HEARING the wrong thing, then it becomes really hard.", "Support from Hong Kong btw", "This girl is a blessing", "Must protect the best sheep 😭😭😭", "Seeing that this planet still has people like Watame gives me hope", "We should reassure every Hololive members that we (especially the overseas members and viewers) are not going anywhere and will always stay with them, through all the ups and downs of their careers. We are all Holobros.", "11:06      Brain Power ~NOMA~\n14:06      プナイプナイたいそう ~立秋 feat.ちょこ~\n21:50      ouroboros - twin stroke of the end - ~Cranky VS MASAKI~\n25:38  　FUJIN Rumble ~COSIO(ZUNTATA)~", "This dude right here is the MVP.", "This stream was a whole feels trip. It just shows that Watame is the best sheep and her live chats will always be the most wholesome place. Watamates are the best! \nWhen Watame cried, Watamates cried harder. 😭😭 (unless it was just me haha😅😅)", "I was outside when the ramen session happened lol. Cried in public while chilling with friends.", "Have a timestamp?  Could use a good cry today", "I wish i could understand her :(", "@Zekiel you and me both. :/ \nThankfully there are live translators who lift the language barrier for us so we can understand Watame! :)", "I cried too 😭", "@Maesan almost the whole SC reading is a good cry. And the beginning of the stream.", "わため加油~!!\n妳是我第一個被推進hololive所接觸的vt，\n雖然這些話不知道是否能傳達給妳，但還是希望能看到わため開心著並享受著每次的實況，當然，心裡肯定會對自己有些些期許，甚至是目標，請不要自責自己做的不好，或是辜負了誰，也許這麼說有點自私，但妳的努力大家肯定都看在眼裡，是妳將快樂帶給大家，能夠看到わため開開心心的，我想這也是大家所希望的。", "Extremely emotional stream with every minute worth watching! Watame is truly no.1 :_ナンバー1::_にこにこ: ♥️\n\nEdit: Either I'm too dumb to do it right or the Membersheep emotes don't work in comments. Oh well.", "borgi", "Yes i tried it so many times too, haha!", "", "@Zefo No  What does it needed to work like that?", "I had the same issue. It seems to work when I type it out on PC, but not on mobile devices \n\nEdit: Works on my iPad but not on my Android phone ", "rockkuman im using mobile but :_ナンバー1::_にこにこ:", "Seems to be YT problem.\n\nI just close app and start it again if it happens.", "@rockkuman It indeed worked on PC, but not mobile.", "@Brownie Sun   Odd, I'm using mobile but its working for me.", "Maybe you're just not worthy enough to use them lmao", "It works perfectly fine on mobile □", "I am completely grateful to you Watamates, today we demonstrate our love for Watame, I really appreciate your support for Watame. You guys are amazing!\nあなたに完全に感謝しています わたまて. 今日、私たちはわためへの愛を示します. みんながわためを応援してくれていることに感謝しています. あなたたちは素晴らしい！", "you are from brazil", "Maybe あなた is too strong word, maybe omit or say わためいとたち instead haha (if that’s not how you write watamate I apologise since I’m not a regular)", "@ちょこ心 Thanks for explaining, i'm still learning, all help is welcome ^^", ":_ナンバー1::_にこにこ:❤️❤️", "Watamates❤️. We will always love and support you Watame ☝️🐏", "So warm, so comfy...\n\nWatamates forever!!", "Poor Watame, two of her closest friends are suspended, she got accused as a sellout for not standing up for her friends and as a result lost 5k subs. While on the other side, she got harassed for being associated with them. She also can't talk to much about the situation due to the sensitivity and might set off a landmine thanks to Cover, Antis, Bilibili and CCP. She is in the most difficult situation out of all the girls (not including Haachama and Coco who are obviously the victims).", "Good summarization of the situation but I personally will not discuss or say it on her comment section explicitly. She knows better than us on the situation and what she feels, discussing it might hurt her even further. Just show her love and support, never engage with negativity (report them instead).", "Where I can read more of this ? Accused aa Sellout etc", "@Ahmad The Sellout Accusation was made by Japanese and Western Twitter. Reddit has compiled most of what has happened since all the events happened across websites involving Bilibili, YouTube and Twitter. Also it involves politics which I rather not discuss here on Watame since as I said she is the one currently the most hurt by what happened with Haachama and Coco.", "Actually their thought is Cover shouldn't punish girls because few people are angry. They want to putting pressure to Cover by cancel subscription. They are so sorry about their action make watame sad.", "Platinum V3 Watame is a very perceptive and sensitive sheep. The moment i heard the news, i already knew she got hit pretty hard.", "She lost hachama and coco fans? It's ok.", "Tears were shed, hearts were sent, love and support coming from left and right. Those 6 hours I spent watching were truly worth the time. My heart pours out to Watame and all the Watamates. I am so incredibly proud and grateful for all of the Watamates, translators, and Watame of course! ", "how come she was crying? i don't understand Japanese.", "@Lord Zarcon probably what happened to coco.. and also hapoy tears because of the chat showing love/support for her and coco..\nSomething like that..", "@Shegs we don't know that for sure. What we do know is that she had a rough few days especially during her break. Even if she was away, she was always thinking about us Watamates. She was overwhelmed by the love, support, and understanding of the Watamates, so that's why she cried. This was all happy tears, so please don't assume it's about \"that\"", "『言霊』なんて単語がありますけれども、心を乗せた言葉を伝えるには得るものも失うものもあって、伝えない選択をしても得るものと失うものがあります。\n《フレーミング効果》結果的に同じ内容の言葉でも伝え方によってポジティブにもネガティブにも伝わりますし、私も難しい事だと常々感じてます。", "Watame best sheep, watamates best brothers", "3:49:54 my favrie point", "Don't worry about drama, just keep moving forward! Number 1 Sheep Watame 🐑☝", "18:29 Wataojii strike again ", "I was so happy to see her enjoy it, don't crying and keep fighting, because we all love you too watame-chan, thank you for the stream ❤️", "WATAME DID NOTHING WRONG. 「わためはわるくないよね」", "I could only arrive at the very end of the stream, but even by the last few words it was clear I had missed quite an emotional rollercoaster.\n\nWe love you too, Watame!", "ホロライブの人気がどんどん高くなり、海外にも広く知れ渡っているからこそ、メリットばかりではなく特定の国のタブーに意図せず触れて炎上してしまうようなリスクも高まっていっちゃうんですよね。\n全ての国に完璧に配慮することは難しいでしょうけど、こういう出来事を無駄にせず教訓にして、安定したスタイルを確立できればいいなと思います。", "i'll treasure this wholesome stream for my life", "What was she upset about?  The recent you-know-what or was it something personal?", "Most likely the you know what, Coco is a good friend of hers.", "Not only Coco, but Haato as well.", "@Mr.McErger This is most likely true but it Coco hits more I imagine since she is part of the same gen.", "わためとわためいとてえてえ　:o\nUltimate Watame x Watamates tete stream!", "Oyasumi Watame ❤️ thank you for the stream and being with us today. This is a blessed stream and I will treasure every moment spent with you and all the lovely Watamates!\n\nWe will never stop supporting and loving you. We will see you achieve all your dreams, and even then, we will still be with you forever. ☝️🐏", "ヒツジ公！俺達はそれぞれの推しを信じて守る。　ヒツジ公は傷を負っている仲間と自分を守んだぞ！", "わためぇが病める時も健やかな時も、一緒に寄り添っていたいよ。", "自分用4:19:22", "一緒に歩ていこね！！！ わため大好き～～", "stay strong watame,we always be here with you and the rest of the hololive. we will make sure everything will be fine, we will make sure thing will go back as normal as before, we will make sure to try our best not to make you and hololive go through this again, we will make sure that you and hololive wont be sad, we will make sure that you and hololive will be able to stream with smile and love again. so please bear with this for a bit, and let out your frusturation when you want to,dont keep it in.  <3 <3 <3", "I hope after time passes that you and all the girls can be at ease. You’re the sweetest vtuber ever and the fact you have to worry about offending or hurting someone when you have done nothing wrong quite frankly frustrates me. Just know that us Watamates will always be here for you and I’ll keep supporting you as long as time allows.", "Remember Watame, me and the boys will support you and the whole Hololive Girls! We love you so much! Thanks for making us happy", "就算再怎麼難受，有わため的陪伴\n生活就多了很多色彩", "おつのまき〜！\nわためぇ一生着いていくで", "やっぱりわための配信はこれがあるからやめらんねぇ…\nリスナー思いのわためにわため思いのリスナー達…、こんな温かい場所に私がいられる事に今でも信じられない\nわためは弱いと言っていたが、意志の硬さ的な意味では全然強いと思うんだよね？\n私の乾き切った心に潤いをもたらしてくれて、生きる意味を見つける事が出来たのはわためのおかげなんだ…、わために助けられた人は私以外にも沢山いると思うだから大丈夫", "仰せの通り!", "@Kaoryu Kishi やり過ぎない程度で頑張りましょう( ᐛ )و", "わためぇが笑って楽しく配信してくれるだけで満足や", "I just want my Hololive girls happy as much as they made me happy. One of the first I watched and brighten up my days, Love from South Africa❤", "We love you, Watame!\nワタメちゃん大好きです!!!!!", "Come back. We will support you forever!", "Thank you for the 6 hours stream, its all fun, and emotional at the same time. If this comment happen to be read by you Watame, i hope you always be happy, always be positive, and always be the best sheep Watamates ever known.", "This stream was fun, heart warming, tear jerking, beautiful and cute. Thank you so much Watame :_ナンバー1::_にこにこ:❤️\n\nYou are a blessing to us all. Thank you for being you.", "私はあなたを愛し、常にあなたをサポートします。♥", "色々思う所も、あるでしょう。ましてや、同期であればなおさら、人事でもない。大丈夫、みんなも解ってくれると思います。配慮が少しだけ足りなかっただけ、悪気があったわけじゃない。バタフライ効果です。誰も傷つけようとしていないのです。\n\nこれを本当に伝えたいから…こちらにも残しますね。皆んなを1番心配してくれたのは、わためでしょ👍皆んなは、知ってるんだからね❤️大丈夫。皆んな理解して下さいます。", "本当にいい子だなぁ(；＿；)\n今回、生配信に行けなかったから思わずコメントしちゃった(/// ^///)\nありきたりな事だけど無理しないで\n欲しい。", "メンバーシップでもない自分だけどいつもアーカイブや生配信で癒されてるから", "改めて昼休み中観たけど泣ける\nわためぇが作る空間は優しい枠だから観ていて心暖まる\n配信主にリスナーも似るって言うけどホントあったけ〜リスナーでいい", "Damn, that was a wholesome stream truly an amazing stream, it was really nice to see English and Japanese viewers help each other like that. I also love the secret last words she has like it's an MCU movie XD 6:20:15", "僕達も全力で応援するけど直接声を届けることは出来ないから僕達の分もあの2人を支えてあげて欲しいし、何よりわためぇ自身も大切にして欲しい。\n焦らずドドドっと行こう。", "上手いことは言えないですけど、長い一生、色々な事が起こります。\n皆で支え合いながら乗り越えましょう！\n「世界は一家、人類皆兄弟。」\n今、この言葉が滲みる…", ".......我相信你能度過這段時間的，畢竟除了那些少數的人之外，還有著那麼多喜歡且支持著妳的人(我也是其中一人w)，希望你別只看見那些充滿惡意的人事物。", "We will always love and support watame!☝️🐏❤", "I had to leave for work during the superchat reading and am watching the archive now. I just want to say that Watame is very important to me and I'll keep supporting her no matter what. ♥️", "マイペースマイライフ\nわためぇの思う通りにわためぇのペースでやっていけばいいと思う。\n誰しも間違うことはあるから間違えた時は反省してまたやり直せばいいと思う。\n心無い言葉とかあると思うけどわためぇのことが好きな人、ついていく人は必ずいるからそんな人達のことを忘れないでね。", "わため頑張って、みんなはずっとあなたを支えてあげます", "Since almost pretty much everyone had said how I also feel too in this stream, well, let's keep moving forward together, Watame and the Watamates/Membersheep! We'll support you no matter what!:_ナンバー1::_にこにこ:", "How am I supposed to catch up with a 6 hour stream when every minute of it is worth watching? aaa", "You never fail to put a smile on my face and let me have a good time while watching your streams. All of us really love everything that you do and we would support you through thick and thin no matter what", "I joined the membersheep yesterday and it was great. Good job watamates for spamming ❤ Also, thank you translators. わためNo.1", "Welcome to Membersheep! Let's show Watame our love forever together!", "The ones attacking hololive are not the ones that love and enjoy your works. It will take time but don't lose heart", "Watame you have made quite and impact in my life and I hope to stay longer with you and the Watamates:_にこにこ:❤️", "Goodluck with the exam and Welcome to Membersheep!!", "みんなは悲しんでいるけれど、お互いに支えてくれて、もちろんわためも、強く生きていく。", "仕事終わりばっかりアーカイブ見る\n最初はわためが泣くでいる\n心が辛い　痛い　悲しい\nとうか元気になってください。・゜・(ノД`)・゜・。", "プレイを開始した後はより安定します　少し安心した　1:47:25 次ここからアーカイブみるはじめｐ", "ころさん誕生日 2:21:50\n自分用   2:24:38\n自分用2 2:28:22\n自分用3 2:31:02", "What a precious little treasure \nWe Must protect her at all costs", "わため:_にこにこ::_ナンバー1:", "Fluffy sheep Watame, we are all here because we love your content and the personality you bring as a streamer. Most fans here will support and help you, do not worry", "高評価！それだけで俺の思いは伝わるだろう", "我想要訂閱回來，但是...如果不對營運做些抵抗的話Cover他們會持續利用你們vtuber作為擋箭牌的，對不起，等我們的聲音被聽到的時候就會訂閱回來了。\nWatame ごめんなさい QAQ", "this stream hit me in the feels, watame, you truly are number 1 <3", ":_にこにこ::_ナンバー1:", "33:12 自分用", "WATAME-CHAN!!! Thank you for streaming even though you did not feel like it. :D You will always have support from me and all the other Watamates! Together, we will get through this!", "奇跡を信じる", "わため頑張れ，わためは悪くないからね", "Please Protect this Wholesome Sheep\n\nit breaks my heart everytime she cried..", "わためぇって音ゲーつよつよひつじだったのか！", "わためぇー！愛してんで❤", "Watame №1", "I love that Watame gameplay is just 2 hours and the rest is pure chat, I love it  :_ナンバー1: :_にこにこ:", "わたメイト良い人達すぎん？\nたまにわための配信見にくる程度ですけど、そんな自分でもわたメイトには敬意を抱いてる。\nもちろんわためにも。", "<3 you Watame! Always a soft and fluffy stream no matter what! \n\n<3 Misunderstandings naturally happen but what matters is that involved parties are willing to work things out together! <3", "our sheep sounds like she thinks we are going to leave \nwhat a silly sheep lol", "No matter how hard things are, we can share our smiles with you Watame! Thank you for always brightening our days!", "All of us will support you in anyway we can Watame so don't worry ;)\n\nWatching your streams helped me going through some tough time. The least I can do to you is to support you back.", "2:58:00 it's heartbreaking hearing her crying, but loot at the AMAZING SUPPORT from the chat, I have mixed feelings, I'm sad but I'm smiling at the same time, pretty weird.", "わためも辛いと思うけど当事者の二人のことを思うと本当に辛いです。\n帰ってきたら、わためいともみんな温かく向かうてあげて欲しい。", "we will support you watame\n僕たちは応援にします！", "本当に不公平です…本来自由社会に政治を選ぶ権利と自由言論の権利が与えられるのは当然だろう、何で国家と国家の関係が知らないままで、無意識で言ったことに責任を取りしなければならないの?(できる限り日本語を使いました~文法が間違ったら優しくして~)", "thank you   日本ニキより。", "わためが間違っているとは誰も言わなかった、トラブルをやめてください", "I can't wait for the Home 3D model. Watame is always cute!! ❤️", "Thank you for your beautiful words and outstanding attitude Watame. Love your streams!", "The way to break the language barrier.\n❤🐏.\nThanks for your content Watame. You'll always have fans, even if you make a mistake.", "Only support for watame, blessed sheep", "I'll always support you Watame!\nAlways chase your dreams!", "Watame don't worry. You're doing a great work! Giving joy and entreteniment to thousands people worldwide... Have no fear, keep streaming proudly with happiness or sadness. Keep working with your genuine feelings. =)  ❤️ ❤️ ❤️ ❤️ ❤️", "応援してる", "Just wanted to say that you are blessed by the holy sheep! Hug! 💌", "WE LOVE YOU  WATAME ❤️", "I LOVE YOU WATAME THANK YOU VERY MUCH FOR ALL THE STREAMS !! I appreciate you and I support you !!!! Im sure many can say the same too!!!! Thank you watame!!!! ❤❤❤❤❤❤❤ I love you all!!!!! Thank you very much !!!!!", "Her fast hand and talk at the same time...such a big brain sheep❤️", "Watame, even if this comment won't reach you, I want you to know we will always be with you. We are all hurt, sad and frustrated by this situation, and so now more than ever we have to stay together, stay strong. No matter what happens, you will always have my and everyone's support, because you are special to us, because Hololive is special to us. We will always be here to be with you, laugh with you, listen to you, and live our days the best we can. You are always a bright light in these dark days, and I will forever be grateful for that. We love you! ", "I feel my heart crack", "e Love Watame!!  Stay strong watame-chan!! we will always supporting you!! ", "No matter what you say or do, just remember. You're real follower will never leave you, and Im sure that I will always be watching your stream with a smile", "人種関係なく何も知らない根っこから否定的な感性しか生み出せない人間ってたかが知れてる、そんな人間まで配慮するのは流石わためぇ今後も配信頑張ってくだ", "watame is the best <3", "Home from work time to find some timestamps", "3:18:02 I shall never give up the day we are able to get watame plushies is the day my wallet  will hate me.", "ランキングの湊あくあ率高いな・・・\n実況が2時間でスパチャ読みが4時間・・・わため・・・すげえな(ゴクリ", "need timestamp", "Thank you for all your hard work Watamelon, we will continue to love and support you", "we love you Watame. we're glad you were born and chose to be with us. Thank you.", "love you watame, keep going, cheer up we can go together like before, with hololive other members too and many many fans that really loves you. i believe  , no we believe we can overcome it together !!. FIGHTING!! we don't deserve your tears, keep smiling, keep your cute swag smile,  don't' get depressed we love you, we here for you watame , and hololive other members too!!", "I truly adore you.  You are the sweetest girl and you deserve to be happy.", "We will always fight for you , forever.", "只能跟妳說加油", "WTM NO. 1ヾ(*´∀｀*)ﾉ", "Hope you know most of us overseas are just happy to see you happy. Most of us are not out to cause any trouble, even if you say something wrong.", "You're a blessing Watame. ", "ブレインパワー用\n\n2:02:00", "Watame No.1", "Watame No. ☝🏼...Best 🐑...we love you Watame!!!", "watame best sheep", "50万の購読がなくても大丈夫ですよ", "Love your content Watame! I will support you no matter what!", "¡¡Watame-chan, ganbatte!!", "We love you Watame!", "Watame's pure heart and kindness transcend all language barriers", "We Love You Watame, please keep strong", "Many of us will always support you. All Hololive girls deserve support, they are all good people, mistakes or \"scandals\" don't change anything about how much you all care and how many hardsheeps you all endure.\nThank you.\nWe love you", "心痛。。。 唉", "Main Content starts @ 2:11:58", "Te amo watame, eres la numero 1 de las ovejas", "Petition for Watame slurping ramen 🐏🍜 emoji/badge", "We love Watame a lot:D", "❤️ sheep ❤️", "Don't worry watame we love you, you're number one", "18:49 Who is she?", "Watamelon we are here to support all of you don't even worry about that nothing has changed for us !", "Watame No.1 ☝️☝️☝️☝️☝️❤❤❤❤❤❤", "we love you always watame.", "These girls may feel isolated now, that they can be attacked at any time by haters that simply wish to destroy them. They put on their mask and continue their jobs, but may be hurt from all this. Watching their colleges and friends get attacked, threatened and hated for essentially nothing, they may feel disheartened.", "羊がどれだけ購読しているか気にしないよ", "WATAME NUMBER ONE!", "Wholesome girl", "Watame wa warukunai yo ne..", "Wata-mates Battle Formation - Flooding Heart @ 02:55:00", "Watame is a pure ray of sunshine.", "Stay how you are we love you like this!", "Precious sheep 🐑🐑", "Tal vez no entienda nada japonés, pero vengo de un canal que tradujo una parte del directo\nWatame te apoyare y te seguiré apoyando, actualmente no económicamente pero espero poder darte mi primera donación a ti\nEspero con ansias tus próximos directos y muchas gracias por existir", "WATAME IS NO 1", "Te amamos ovejita, sigue haciendo contenido tan agradable ❤️🐑", "I love you", "Watame wa zenzen warukinai desu.", "It's zenzen and warukunai. Also Japanese doesn't really need commas.", "@にょろ〜ん Gracias. In my defense, I was almost asleep.", "😀☝👍👍👍👍👍very beautiful THANK I LOVE YOU❤❤❤❤❤💯👈", "FYI, the song she hums at 1:52:30 is Pretender by Official HIGE DANdism!", "❤️", "❤️❤️❤️❤️❤️❤️❤️", "Ganbatte!!!", "❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "why was she crying? i don't speak Japanese.", "Probably what happened to coco.. and also happy tears because the chat shows a lot of love/support for both of them.. i think..", "すみませんーます、この一つの言葉を言いで\n\n僕たちは無力ので　この方でcoverに僕たちの思い届きます。\nもじろんこの方は色々な人を傷つく、そんな事わかります、わかりますけど、", "watame", "I love you", "❤", "dame dame dame yo dame na no yo", "holy molly 6 hours, her fingers must be destroyed", "Well she only played muse dash for 2 hours and the 4 hours left, she did a chat stream. So her fingers are not fully destroyed 😉", "shak", "It's a terrible day for rain", "Can someone explain me why is she crying in the stream?", "Because the Cover keep giving them stress plus the CCP attack.", "@115 Des she didn't explicitly said it and I prefer if we don't speculate or discuss or argue about it in her comment section adding to her stress. However the main reason that pushed her to cry in this stream is the non-stop love and support she received from the chat.", "Mainly because large amount of her viewer are from T, a lot of them Unsub due to the incident\nAnd She's in a good relationship with Coco, so she gotta be concern about her career too\nWhich give her a lot of stress\nBut some of them were back, that a good sign", "", "", "🐑 number 1☝", "Not your faults, sorry to affect you, cute sheep.Cover kept ignoring our demands intentionally and doesn't realise why we are so angry about this event at all.Cover doesn’t respect other country’s history and cultures,we have no choice but to against it.我很抱歉,我可爱的小羊", "I don't want to debate but how can you expect someone outside your country to know about your country political view on other country?\n\nFor example just example, what if you accidentally say \"Ukraine\" then Russian people got mad at you because they think ukraine is part of russia. What would you do? Do you like being blamed because you don't know what Russian prespective on ukraine? does that means you don't respect Russian culture and history?"]