["良い感じのキッチン作れてうれSHEEP！！", "Thank you Watame!!\nToday was fun!!(as always hehe).", "少しでもお役に立てたようで良かったです！笑 参考にしていただけたのなら頑張った甲斐があります。笑", "キチンと作れましたね！\nテンション高くて可愛らしかったww", "キチンと作れて良かったねぇ！\n日ごろの配信も未来の夢も\nわためぇがやりたいことはよっぽの事で無い限り応援したいので、安心してわためぇ自分を信じて突き進んでもろて🐏", "I want to thank watame also for the fun stream everyday. We watamates also love watame. Looking forward to tomorrow's stream. 今日もカチッ😎", "内装がないすー！\n\n・・・", "Thanks a lot for the stream today! Rest well", "リスナーと楽しそうに相談しながらこだわりのキッチンを作っている姿が印象的でした。\n今回はホロ鯖も大賑わいでいろんな絡みが見れて楽しかったです！", "Some of the spiciest Hololive drama tonight, Haachama cheated on Watame earlier but Watame pulled the legendary move and ask kisses from Lamy instead...", "Chadame Went in", "1:10:50    Panik !!!!\n2:07:40 Haachama flirting at the background\n2:08:20 Watame's heart is crying just like how the sky is crying for her \n3:17:44 Flare's delivery for Asacoco product! ", "1:30:37 はあちゃま何してるんだろう？　Watame sneaking on Haachama\n1:43:54 わためフレアのドア遊び　Watame and Flare playing with doors\n2:04:54 浮気の始まり Beginning of affair", "The whole interaction with aki was precious lol", "おつのまきー！\n少しずつだけど内装できてきたね\n今回は色んな人とのてぇてぇ見れてよかった。\nあとチェスト整理待ってます。。。", "another great stream, can't wait for the sunday 3D stream. Also can't thank Harry Lin enough for the translations. He was a machine this stream with how fast he was translating!", "Was such a good stream. Great to see so many Hololive members online on the Minecraft server at once! Tried my best to watch all of them.", "はあわたラミ修羅場スタート\n2:04:56", "おつのまき〜。\n収録頑張ってな！", "目標に向かって寄り道や試行錯誤することも楽しさの一つだと思う！\nフグを食べたりオウムガイを釣ったことも何かに繋がる…はず", "3:18:40 わためいとの鼓膜ないなった/Our eardrum is gone\n3:20:00 直すためには・・・/To fix it...\n3:23:40 わためいとのみんなに一言/Confession from Watame", "ロシアのくそ回線なので、ストリームをあまり見られなかったけど、楽しかったね。わためさん、ありがとう〜", "棚悩みましたねぇ〜。モダンやスタイリッシュって、難しい。\nキッチンやら、お寿司屋さんやら…やる事が沢山。流石マイクラだね。\n\n体調と睡眠時間が心配ですが、本日の収録頑張ってね。", "笑すぎました", "2:05:15  haachama 脱線シーン  (google翻譯)", "Legendary PLAYER \n\n\"But there's one they fear. In their tongue is Watame, Hitsujiborn. KON BAN DO\"", "自分用　1:51:10 こっちからアーカイブ見る", "3:23:47", "28:02", "2:04:54", "Thank you for the great stream Watame!!! I'll always support you 100% of the way until you reach your goals, and even after you've accomplished everything you want to do. Us Watamates will be behind you every step of the way!!! Hard working sheep will pay off soon. Keep your head high Queen, your crown is tilting. 👸", "Make more", "!!!!!！！！！", "me pasa"]