["今日もみんなのおかげで最高の１日になった！ありがとう！", "Good night imouto ~~~", "今日も楽しかった＆懐かしかった！\n妹ボイスも待ってんで！🐏", "thanks for your hard work watame! cute sheep", "おつのまき！\nわためちゃんが幸せならみんなも幸せよ。いつもありがとね", "Goodnight Watame! Thank you for the great Night Fever and wholesome stream. Happy to be in Tsunomaki family! Have a nice rest~", "ほんと歌上手だねぇ⤴🐏🐏🐏", "Otsunomakiii~ 🐑♥️", "Thanks for the beautiful singing, Watame!", "I cried watching, we all love you! special thanks to @harry lin's live translation", "I always fall asleep with your beautiful voice, thank you golden sheep", "Here are some english and japanese time stamps / こちらが英語と日本語のタイムスタンプです\n\n00:02:50  ★Start\n00:04:55  1. Ano Kane wo Narasu no Wa Anata (New Version)/ Akiko Wada", "thanks g", "日本語完璧だと思います / I think you did perfect job.", "Wait, this sheep spent 3 hour more for chat only? Sugoii", "Thank you very much!", "thank you❤️", "Nice bro, ty", "4:18:33 妹系わため1/Little sister Watame1\n4:42:30 妹系わため2/Little sister Watame2", "Naiiiiiiiiiiiiiisuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu", "@Cashew Chee I'm so happy I could die.", "助かる!!!", "Great help, almost die because of how wholesome that was  but worth it !", "Now imagine little sister Watame meeting little sister Ui... わため妹がうい妹と出会ったらどうなるのか？", "最初ので心臓止まったけど、2つ目ので蘇生した。", "55:40　 超高速わため　Super Sonic Sheep", "I was so so happy to have finally heard watame sing AI-mai Chocolate live. There's something about it. It hits close. ", "I love the singing Watame, the joking Watame, the crying Watame, I love all of her, I'm happy that we can all share our thoughts and support each other, it really does feel like we're a big family, Watamates are the best ", "04:55 あの鐘を鳴らすのはあなた(NEW VERSION)／和田アキ子\n10:28 if...／DA PUMP\n18:31 BE TOGETHER／鈴木 あみ\n25:32 God Knows... /平野綾", "💪(🔥w🔥💪) WataSuper Serious Speed", "I love Ai no Scenario. Reminds me of when I was just discovering anime and I watched Kaito Kid. I wanted to be Kaito so bad.", "Same my dude\n1412", "Kaito kid is too cool", "久しぶりに最初から最後までリアタイができて最高に楽しめた！\nレッスンの成果だよ！本当に高音が綺麗に聴こえてきて鳥肌が止まらなかった！", "The \"if...\" song by watame is awesome but okakoro's version is.......", "3:24:11\ndon't mind me, i'm just happy watame celebrating my birthday\nお疲れ様でしたわため", "Happy Birthday!!! / お誕生日おめでとう", "@NashySc thankyou!", "happy birthday  bro", "Happy birthday~", "Kinda Late but HBD!", "ボイトレの効果が、出てるのかな？\n『アイのシナリオ』の高音域では、🦜インコ騒いだで‼️\n\nスパチャ読みでは、グレンラガンもマックも可愛い。マイクラでは、わため将軍やお寿司屋さんと本当に沢山のファンに支えられていますね。日々感謝を忘れない、わためも本当に偉い。私も皆さんに感謝いたします。", "アイのシナリオ 本当に 難しいですよね　いい曲", "32:13\nFubuki attack", "For Porno Graffitti fans / ポルノグラフィティファンのために\n2:51:44 (Song start: 2:52:18) Winding Road\n2:54:31 (Song start: 2:55:09) Zombies are standing out", "Omg I forgot these songs! Could I add Porno timeline list to a cappela song list? / ぬわー！忘れてた！ポルノ曲のタイムラインを私のタイムラインに追記してもよろしいでしょうか？", "@ナス Yes, go ahead! / はい、追記していいよ！", "@watchtheclock Thanks!!", "phew, your singing always cheers me up. we almost reached 17k listeners last night and it makes me happy that your singing is getting recognised and enjoyed by more people! see you again next time, watame! and good luck on your dance lessons!", "Thank you for reading my super chat! Your voice was incredible tonight! \n今夜、俺のスーパーチャを読んでくれてありがとうございました。わための声はいつものように素晴らしかったです。ファルセットまで上手くできました！それでは、また！", "Looking forward to when you release your album!", "アカペラ曲リスト/A cappella song list\n🐏4:01:59 SPiCa\n🐏4:10:08 トリノコシティ/Urbandonment\n2:48:11 夜の女王のアリア/Der Hölle Rache kocht in meinem Herzen", "アカペラ曲リスト助かる\n\nあと、『初音ミクの消失』の正式英語名って\" THE END OF HATSUNE MIKU \"のことは面白いなぁ、初めて聞いた。英語圏ではみんな\"The Disappearance of Hatsune Miku\"って呼んでるんだもんね", "@Asok Tenchea ゾンビ映画みたいだよね🎬", "last night good night！？！？  12年前の曲  懐かしい！", "Always love listening to you Watame! <3", "自分用 1:39:21\n自分用 3:52:23\nメルト！好き！ 3:59:35\nSPiCa (初音ミク) 4:01:58", "Thank you so much for today, and thank you for sharing your story. It really helps get through these hard times.", "I need \"Just Be Friends/ Fubuki feat Watame\" duet.", "いつも思うけどわための放送はスパチャ読みがほんへな所ある", "2:39:00\n何で寝落ちしてもうたんや…( ´ ཫ ` )\nチャットも盛り上がってたみたいなのでバレて悔いなし", "God Knows it's my favorite song of all time, thank you Watame, it was beautiful", "Gotta love the sheep", "素晴らしい動画有難う御座います！", "55:46 my fluffy sheep can't be this cute!!!!!! Our zoomer queen sheep.", "I rewatched that part and realized she actually mentioned about using a Pokemon move \"Quick Attack\" (でんこうせっか [Denkou Sekka]) after the zoomin'. Watame likes to be a Pokemon after all.", "歌枠1時間で切り上げたと思ったらその後3時間以上雑談してたんかw喉大丈夫ならいいんだけど無理はせんでね", "炉心融解 !! nice ~", "I'm feeling it! Feeling it!! Come on, come on!", "わためぇのジトメェ最高\n\nBe togetherと聞いて校歌を思い浮かべた人他にもいるはず…いてくれ…", "50:05 Kaito Watame!", "夜勤だったのでアーカイブ見ました～♫\n昂るGod knows...熱くなりました！「わためぇ～ついていくよ～♪」\nすっごく忙しそうだけど、ご自愛ください(*´▽｀*)", "Rap sheep", "お疲れさまでした :D", "Watame RAP 13:00 Playback speed 1.5", "30でわかる曲を老人会やめいｗ", "I got brozoned by my fav sheep.", "あの鐘きもちいいけど、ビブラート増やしたい。", "Yeah.\n\nAlright.", "definitely best sheep", "I really love Ai-mai Chocolate ❤", "God Knows & Scenario of Love!!!!!!!", "Watame hontou ni utau ga suki nee~", "Watame is so precious", "00:10:28 Rap Sheep!!", "2:44:43 Cute angry sheep! ", "WATABURGER BEST SHEEP COMBO!", "I havent heard Just Be Friends in all its glory in so long! Besto sheep at it again. All we gotta do chubby friends", "wow! oh!! wow! oh! oh!!", "Watame-chan #1", "😎☝👍👍👍👍👍VERY BEAUTİFUL THANK I LOVE YOU❤❤❤❤❤💯👈", "❤️", "❤", "I'm only here for the if.... By DA PUMP", "Noice-dodododo", "Your singing really improves a lot, remember to rest well. \nWant to see your best moment during the Cinderella Switch ", "Thank you so much for this Night Fever stream Watame! really loved when you singed God Knows, your singing just gets better and better! also the Tengen Borgar Watame Lagann part got me 😁 [those are the horns that will pierce the heaven! Giga Tsunomaki Doriru Break !] \nGreetings and I really daisuki you, Watame Forevah Numbah Wan! ☝️🐑", "Naisu"]