["今日も楽しかったー！ちょっとずつおしゃれハウスに近づいてんで...！！！", "進捗めっちゃいい感じやったね！\nおつのまき！", "今日もお疲れ様〜\n親方の拘りも踏まえつつオシャレな家になって来てるねー\n2階の内装もチェスト整理も楽しみにしてるで！🐏", "It was fun to watch you play with Moona and Roboco!\nthank you for sharing your fun with us!!", "Otsunomakiiii~ 🐑♥️", "おつのまき～\n素敵な内装になってきていい感じだね\n2階とかもどうなっていくのな楽しみだよ、がんばえぇわためぇ", "いい感じだねぇ！\n突発コラボもオシャレ改造も、楽しみながら進めてこう☺️", "わための配信は安心するので寝落ちしちゃいます♪♪ありがとう", "2:07:20のムーナちゃんが欲しいのくだりが個人的に一番大好き\nわため可愛すぎやでぇ......", "これは楽しい拝しんです w  w", "6:53:00 Watame told me to have a Happy birthday, I feel blessed.", "You lucky man", "Moona: logs into Minecraft server\n\nJP Hololive members: \"English practice time!\"", "2:04:30 Watambe 5 Star hotel\n2:06:50 Watame join the herd and got trapped by Moona 🤣\n2:12:01 the betrayal 🤣😂", "Watame's English is getting better and better. Watame is a fast learner.\n\nPracticing English with Moona and Iofi will be a good idea.", "Don't forget Coco and Haachama. If we can see both of them in the next 2 weeks...", "How come a sheep with a construction hat on is 200 times more creative than me in Minecraft.", "1. You're not a sheep\n2. You don't use construction hat\nLol", "@AYAME'S GIGGLE VIRUS facts", "1:10:05 ~ Watame curious with a conversation between Roboco and Moona is adorable.\n\n1:10:05 〜わためがロボ子さんとムーナちゃんのチャットがめっちゃ気になるで可愛い", "3:15:07 Captain Look!", "I know where this is going", "Watambe is Watame + Mbe (mbe mean sheep sound in Indonesia just like Nyaa in Japan)\n.\nmeanwhile some people in livechat with 1000IQ Watambe = Watame + Harambe..", "Lmaoooo", "mbek", "Ngl, Watambe reminds me of Harambe. Oh if he didn't die our world will not fall into chaos.", "Watame: I am doing ASMR tomorrow.\nChat: メンバーシープいらっしゃい!/Welcome to Membersheep x999.", "Te queremos, Watame! ❤️", "I miss this chill stream of Watame just having fun playing minecraft.", "38:20 leavin this for myself tq", "3:15:48 Sheep Pirate", "Thank you. It made my day.", "2:27:34 wataoji !!", "I don’t understand Japanese but Watame is so cute that I watch lol", "おつのまき～\n途中参戦だったけど久しぶりにリアタイできた！\nいい感じの内装になったねぇ～", "6:53:32 Timestamp for myself :D  Thank you Watame. Zutto ouen shimasu ~", "First time watching three MC streams at once XD\nThis was fun, thanks Watame!", "今日もお疲れ様でした！", "自分用 6:40:42\nカチ　7:17:12", "Thank you for this stream Watame! I finally finished my first period of my exams so I can relax a little now, I also removed my brackets but I have to use a dental plan and it bothers me a little\nI had a lot of fun watching you playing with Moona and Roboco, you're really good building things! please have a nice rest, Watame Numbah Wan! ", "Lol weren’t you on toemads new vid", "@Looking cool Joker Yes I was XD", "Lmao I knew I seen you somewhere", "her voice 🥺", "7時間も！すごいーー！マイクラお疲れ様でした〜", "いつにも増して、『悩まシープ🐏』なわため、こだわりの内装回☝️素材だったり、レイアウトだったり、是非リアルわためドリーム🍀マイホーム建築の時に役立てね✨\n\nねねちベットの匂いを、『すんすん♪』する、わたおじ炸裂w『もしもし、ポリスメン？変態がおります。』", "2:27:45\n\nあぁぅ．．．やぁぁめろぉぉぅ (´Д`；)", "help meeeeeeeeeがヘルプめぇーーーーーに見える", "おしゃれやな", "2:11:00 Indonesian National Monument, \"Monas\"", "Her outro name? That piano is too smooth...oh and goodnight Watame~", "Happy dayになる動画です", "Watame knows them blocky streets.", "7:02:23 now im curious what she said about this chat comment?", "I can hear \"Mentor008-san\"", "Very hard working sheep!", "Watame is sheep! 🐑 Yes!! ♥️", "Where did her asmr stream go?", "Omy god watame CaN do it all day", "2:16:22 \n\na", "Almost half a million subscribers Watame-san!!!! It is a big celebration for us fans ", "I really want watame construction hat merch", "42:03", "watame doing another all nighter", "what is 3:41 song name?", "song name\nワンダーランドと羊の歌", "@ひらさく THANK", "❤️", "Noice-dododo", "WATAMBEEEE", "", "🐑☝️", "🍪", "あのゴーレムトラップ立地が悪いんですよねぇ", "Ganba Hitsuji"]