["今日も見てくれてありがとう！愛してんでぇ！", "こちらこそやで！", "Best sheep deserve best love. Sleep well~~~", "Otsunomaki, your love confession is too dangerous for our heart.", "めっちゃ可愛いかったw\n愛してんででで！", "いつも楽しい配信をありがとう！\nわためぇが折れずに、諦めずに努力し続けてくれたのでわためぇを見つけることが出来ました\nずっと愛してんで🐏", "今日もカチッ!🐑💪", "今日はSCが初めてです、生放送にメッセージを残せて嬉しいです", "Thank you so much for the stream!!!\nOtsunomakiiii~ 🐑♥️", "いつも応援してるよ～ドドド", "Love you watame", "lol, so after the stream has ended (where the chat remains opened, but sadly not saved to the achieve), Watame typed a ✌️ into the chat. Naturally, everyone started posting ✌️ too. But then Watame followed up with a ✊ and ended the chat almost immediately after, thus beating everyone at Tsunomaki Janken without giving them a chance to fight back.", "Haha trueeee!", "What a clever sheep :_ノーマル::_グーー:", "BigBrainSheep 🐏🐏", "1:48:30 the most adorable sneeze i've ever seen", "*nothing*(pika)CHÜÜÜÜÜÜÜÜÜ", "3:25:00 妹さんASMR/Little sister ASMR\n個人の感想ですが、できれば片耳イヤホンで目をつぶってお楽しみください\nJust my personal opinion, but if you can, please close your eyes with one earpiece.", "Best!", "Cashew Chee New mike notify me that Watame is always adorable.", "I’m getting massive Wata-oji vibes from that thumbnail.", "2:00:15\nここまで本編(クラフトピア)\nここからも本編(スパチャ読み雑談)", "1:42:20 Mahou Shoujou Watame casts a magic to make us love Watame more ❤️", "おつのまき！\n水晶見つかってよかったね！w", "Thank you so much for the stream Watame!! I had a lot of fun and hearing your sneezes heals my heart! 😁\nWatame Numbah Wan! 🐑☝️", "ありがとう！", "2:58:24 Watame RickRolled", "2:16:16 自分用", "バカタレ共の話も聞けて良かった。\n鯛、海老、鯛、ホーミーターイ、葬りたい☠️\n念願の水晶良かったね。おめでとう🎉", "1:21 開始", "配信お疲れ様でした〜(*・ω・)\n1:21開始", "people normally enslave sheep for the hamster wheel energy, while watame enslaves humans. The rise of the sheeps is upon us lol", "Thank you for the stream. Always fun and fun and fun.\nありがとう", "The first time I super chat and and it was all worth it 😊 thank you watame for being Number 1 in all our hearts", "3:10:00 ", "前のマイクの良いところは音質が若干ぼんやりしてたから寝落ちに向いてたところかなw\n新しいマイクは本当クリアですね、1.5倍速でアーカイブ消化しても違和感無しで聴き取れてます。（アーカイブ民歓喜）", "4:11  ここすき", "サムネめちゃくちゃ良い顔してる！", "ホロライブというブランドあってわためぇを知ったのは事実。だけどそれだけなら推せないよ。\n応援してるでぇ。頑張って", "27:46 Best part xD", "That thumbnail tho", "ほかの人のいい声とかじゃなくて、わための声だから聴きに来るやで！", "ここすき　\n2:51 13:54 3:44:10\n\n18:29　スタンプ追加の話", "I only had a couple bucks to spare but I'm glad I got a little taste of what her laughing ASMR could be lol. Cured my depression", "初コメ失礼します。\nいつもアーカイブで拝見できてませんが、楽しい配信ありがとうございます。\nクラフトピアでは何かVRMのMODを入れると自分のアバターで遊べるみたいですよ！\nクラフトピア内でわためさんが動きまくるのが見たい...(願望)です。", "自分用   2:17:34　もふもふもふもふ❤️\n自分用2 3:03:12\n自分用3 3:06:59", "3:02:49 :)", "Oveja qla por que eres tan tierna .....te amo", "😀☝👍👍👍👍👍👍very beautiful THANK I LOVE YOU🐏❤🐏❤🐏❤🐏❤🐏❤💯👈"]