["みんないつもたくさんの愛をありがとう！", "ストリームありがとうございます\n⊂（（・▽・））⊃（つ≧▽≦）つ", "Keep being amazing Watame❤️", "", "", "You deserve all of it and more. Thank you for all your effort.", "WATAME  NO.1~~", "わためぇも、いつも愛をありがとう。わためぇの配信のおかげでいつも癒されてるよ！", "", "わためのそういうところだよ。\nみんなが好きなところ。", "6 hours?! Watame is the true madlad.", "わため大好き！", "6:32:43 important", "Thanks for the timestamp", "quintessential", "This is very important. Thank you", "Crucial", "Motorboat sound", "1:28:30 sequence of absurdly adorable expressions", "I love it when she's doing this kind of stream...even though I don't understand a thing...", "Hololive in a nutshell", "Watame Plushie ", "Fluffy and wholesome galaxy space sheep ride with Watame herself 🐏", "I only understand one or two simple words in Japanese. However, Watame has such a nice, soothing voice I'm fine just listening even without understanding.", "I slept at 2AM just to wake up to her still streaming at 8AM,  amazing! thanks for the great start to the morning!", "Is it just me or when Watame has a worried expression on her face looks much cuter than usual Watame?", "Almost like it’s a natural human male reaction to want to protect. I agree btw.", "@Stumblewater B-but what about the female watamates like me who also want to protect her? :(", "@Mika Girlx Motherly instinct?", "@Stumblewater Yes, exactly that!", "@Stumblewater something girls won't understand about guys when they feel to protect someone.", "6:52:13 じゃんけんで煽られて怒るわためぇ（かわいい）/Watame got angry cause of janken (but so cute)\n6:59:15 ちゅっ/Kiss and embarassing sheep", "I love you my cute little sheep <3", "Let us encourage each other!\n2:04:54\n5:39:44", "Thank you Jesus for supporting and blessing this sheep! ", "@buluhterbang ", "Ok Jesus", "Thank you for supporting Watame!! Oh my goddess!", "You guys are so kindness!!I am proud of that you guys are my sons, hope you guys have a nice day!", "3:49:12 自分用\n翻訳なんてはただわため好きだから、そして自分もわためが言っていることを理解したいからするので\n承認なんて求めているわけではありませんが、\nわための言葉を聞くと嬉しくてなんか泣きそうｗ", "1:31:52　自分用", "約7時間スパチャ読み雑談とか凄いなぁ…\n私は途中寝たんだけど、わためが体調崩さないか本当に心配だ…\nちゃんと休むんやで…(´・ω・｀)", "今日も一日頑張れそうです！", "6:35:28  ", "whys she bopping her head in silence", "Cuz why not", "@Vertti Listening to Watame no Uta, while everyone will simultaneously watched that as well.", "ASACOCO withdrawal symptoms...", "I love Watame :), she is such a hard-working sheep", "わための芯の強さと優しさにはよく心を救われてます…ありがとう…", "まさかホルジンコメでで笑顔になってくれるなんて感謝です", "3:58:00　くらいから\nわためのうた待機所、今日のWNFと、今日のこの枠の分のスパチャ読み", "わためLOVE", "2:13:58　寂しくて水流しSCしてしまったことを謝るたつのこの方と、わためいとが嫌じゃなければしてもいいよと言うわためぇと、わためぇが嫌じゃなければいいよと言うわためいと。みんな優しいわためぇの配信が本当に好き。", "ふわふわな世界", "スパチャ読みお疲れ様でした🍀✨🍀\nわための知られざる過去のお話し🎷\n口笛吹けないわためが、可愛い❣️", "Watame, as always, IS NUMBER 1!", "素晴らし！　頑張って！", "WE LOVE YOU WATAME!", "初めてずっと見てたけどこれだけコメントを丁寧に読んで貰えると海外ニキが増えるのがわかりますね\n英語でコメントしたくなってくるｗ\n\n※初スパチャの自分用です", "Wholesome stream. \nLove the Galaxy Sheep! ", "いつもわためぇの配信で癒しと元気をもらってる。ありがとう。\nあと、この日から禁煙また始めた。ワイも頑張ります。\n自分用 5:31:40", "Thanks you for the amazing watame night fever watame galaxy sheep", "5:44:45  thank me later", "That thumbnail cute as heck", "サムネいい笑顔だ、それ見て俺も笑顔、みんなも笑顔", "Best Sheep!", "You're welcome Watame! 2:08:00", "2:54:50 watame vibing", "Anyone know the opening BGM?", "blessed stream", "Galaxy sheep\nSpace ship", "Samsung Galaxsheep ?", "6:32:00", "yes bruv", "2:02", "It's ellegal to be this cute and entertaining mam", "what is the name of the intro song?", "It's the Haato/Watame song. Arranged for BGM use. It also uses parts of her outro on the beggining.\nYou can find both on her channel.", "@Batora thanks", "☝️ 🐏", "日本時間2時半くらいのスパチャはいつ頃読まれたのか誰かご存知でしょうか😖😖", "2:14:30 あたりから触れてます", "@Pastel 本当にありがとうございます！自分のは5:48:17で見つけました。ここからゆっくり仕事しながら見ます(笑", "おそろしい子羊...！ 一晩中のSC読む全然眠らなかった　俺が夜勤仕事始めた時から仕事が終わる少し前に配信終了\n残念だが今夜も仕事　明日はアーカイブ見る耐久！", "自分用   1:15:52\n自分用2 1:25:25\n自分用3 1:31:17\n脫出ゲームの時　わためすごくかわいい 1:40:18", "a", "a"]