["みんなの応援がなかったら絶対ここまで来れなかったよ。本当にありがとう！", "一緒に見届けできてほんとに良かったよ！これからもずっと応援してくで！", "50万人おめでとです!", "わためぇ、本当におめでとう！\nこれからも全力で応援してるね✨", "50万人おめでとう!!!!! ", "これからも応援してんで！", "50万人おめでとう！\nわためぇが頑張ったからみんな応援してるんだよ！\nわためぇほんとに最高だよ！", "わためいと達に色々な景色を見せてくれてこちらこそ本当にありがとう\nこれからも応援してんで！まだ見ぬ景色が楽しみ！！！", "ハーフミリオン突破おめでとう！！！！！🎉🎉🎉🎉🎉\nホロライブでは珍しく無くなってきたけれども実は現時点で全体のVチューバーでも25人いないことなのです。\nスゴイぜわためぇ！\nこれからも照れ屋で泣き虫で優しくて可愛くて素敵なわためぇをずっと応援しているので", "50万 おめでとう㊗️🎉🎊", "これからもずっとずっと応援します！\n🎊㊗本当におめでとうございます！！！", "まったり増えてくの、羊らしくて好き！\nおめでとう！", "おめでとーー！！！🎉", "こちらこそわためぇにいつも励まされてるで！50万人おめでとう！これからも応援してる！", "仕事でギリ間に合わなかった！チャンネル登録者数50万人突破おめでとうございます！50万人記念配信はリアタイできるようにがんばる！", "50万人おめでとう㊗️", "Congratulations Watame! We love you! ", "50万人おめでとうございます🎉✨🎂✨🎊いつも素敵な時間をありがとう！これからもと推していくのでよろしくお願いします", "50万おめでとう!!!\n自分のせいで見えなかった\n次回の配信はお祝いさせてください", "羊羊加油~ ^_^  唱歌好好聽～", "おめでとう♪", "見れなかった、おめでとう！", "恭喜50訂閱", "50万おめでとう！ <3", "500k subs Congratulation!! Watame-san", "おめでとう！！", "Congratulations on 500k Watame! You are wonderful and lovely! Thanks for everything!", "Congratulations, best sheep!", "We love Watame!", "We love you Watame!!!!!!! And we know how hard you worked to get here! Thank you Watame!!", "これからもガンギマリグッズ出してくれ!", "私は海外人です，日本語は少し話せますが......\nPlz forgive me for using some English.....\n\n07:35 50万人おめでとです!", "Thank you for doing god's work", "Bless your soul! 助かる", "\"Plz forgive me for using some English\"\nThere's nothing to forgive, you are doing great.", "Its so good bro nice 1", "I will always regard learning about Hololive and discovering this sheep as a monumentous part of my life. I'm extremely proud of Watame being able to get so far. I remember when I joined this community she was around 300k, and it amazes me that she has reached this wonderful milestone. She also would not have been able to get this far without all the support of the community and Watamates. To everyone, thank you for all your continued love and support towards Watame. Congratulations on passing 500k subscribers, Watame! We love you! ❤️💐🎉", "Watame number one! Mhmm, mhmm... This sheep is definitely the best part of my current life at the moment considering the expectations put on my generation here in New Zealand as we are currently in debt as a country lolz... keep it up, we luv u Watame!", "After all this time, we finally did it! Watame reached the long awaited 500k and I couldn't be happier.\n This sheep steals my heart every day anew and I am very proud to be part of the Watamates!\nThis community is truly one of the most kind and welcoming ones and Watame deserves nothing less! \nCongratulations to Watame and congratulations to everyone else who is celebrating this moment! Onwards to one million!", "Congratulations Watame on reaching 500k🎉🎉🎉!\nLet's aim for 1million next", "おつのまき〜。\nわためちゃん50万人おめでとう！", "Congratualtion with 500000 sheeps! Sadly i am at work and missed stream orz", "わためぇの夢「ポケモンになりたい」\n可愛らしすぎて涙出ちゃったｗ", "Congratulation on 500k subs Watame!!!\nsorry I can't watch the stream because of work.\nI'm happy for you, let's aim for 1 million\nWatame always no. 1 ", "500k おめでとう!!\nTruly すばらsheep\nCool intro music", "!!!! I can't believe I missed this nooo D: congrats on 500k Watame!!", "500k congratulations\nLet's poison more people with FuGu to celebrate.", "Congratulations for reaching 500k subs Watame!!! 🎉🎉🎉\nI'm really proud of you, I have been following you since around of the 150k subs and now you're in the half of the million, I really hope you can reach the 1M Watamates at the end of the year, but if not, just wait for the next year! ✨\nEven if I can't watch streams so frequently unlike the past I will be always cheering and supporting you, and you will be always my favorite sheep! please take a nice rest, Watame Numbah Wan! ☝️🐑", "Congratulations Watame! I'm happy for you!", "so proud of this sheep! i love the amount of effort she puts into every day of work and i am so glad i can support someone like this!! kachi!!", "Congratulations for the 500k subs, Watame! Please continue to be the very best sheep that no one ever was. \n\nWe will always support you! ", "うわああああ!!!見なかった\n・゜・(つД｀)・゜・\n祝うのSCも投がない 悔しい", "I missed it, but congratulations on reaching 500k subs!", "わためぇ！！！おめでとうございます！！！\nこれからも応援しています！！！！！", "50万人すご！！ほんとにおめでとう！！！", "Congratulations on the 500ks subs WATAMEE!!!", "50万人突破おめでとう！！！これからも応援していくで！", "Congratulations on 500k subs for best sheep!\n50万人登録者おめでとうございます！わためナンバーワン！", "仕事で見れなかった\n50万人おめでとう！！！", "したっぽいで祝っちゃうのわためっぽい", "あぁー！仕事で見届けできなんだ！！\nおめでとう、おめでとう、おめでとう！", "50万人おめでとう🎉🎉🎉\nわためならまだまだ行ける！でも無理せずマイペースでね👍", "50万人おめでとう!!!", "50万人本当におめでとう！！", "50万おめでとう🎉\nリアタイで参加出来なかったからアーカイブで追いますね。わためNo. 1\n追伸、角巻じゃんけん毎度負けてしまう笑  流石わため", "Gratz on 500k here is to 500k more! The sheep only knows one direction and it's forward!", "50万人おめでとうございます！\nこれからも頑張って下さい！", "50万人おめでとう！まだ最近見始めた新米だけどこれからもよろしくっ！", "500ｋおめでとう！！", "わためちゃん50万人おめでとうございます。", "We wish only the best for the best sheep in the world! but this is just the first half, lets aim for 1m with everyone, Congratulations Watame!", "Couldn't watch live (4:30 AM in my timezone) but managed to watch the archive for the first time! Congratulations on 500k subs, hope you can get many many more, we love you ", "仕事で見れなかったー！\n50万人おめでとうございます🎉", "Best sheep did it! Congratulations", "uwa i'm late. but congrats on reaching 500k subs, watame!", "Congrats on 500k!", "50万人突破おめでとうございますわためさん\nCongratulations on 500k subs\nあなたはいつも最高の羊になる\nYour always be the best sheep", "Congratulations, Watame! :D", "わためちゃん本当におめでとう！\nこれからもドドドっと突き進んで！\n置いてかれないように横で一緒に走れるように僕もがんばるよ！\nこれからもよろしくね", "Watame_chan is the ☝️🐑 ever~\nCongrats on 500k ^^", "50万人突破おめでとう！応援していますね☝️🐏", "Congratulations, you beautiful sheep!", "Congrats on reaching 500k subs!!! Watame no.1", "５０万おめでとう！！！", "やったぁぁぁぁぁぁぁぁぁぁぁぁぁ！！！", "五十万人庆祝！！", "I'm so proud of her", "Congratulations on the 500k best sheep! ", "Congratulations on 500k Watame ! Only half way to 1 million", "Congratulations Watame! Best sheep ", "I missed it :(((", "Congratulations!!!!!", "50万人突破！！", "I’m so happy for Watame! \n\nThe best sheep! No.🐑!", "Congratulations!", "Congratulations Watame", "Does anyone have the link for the bgm of the opening", "Congratulations Watame!!!!~~~", "50万人おめでとう", "Congratulations Watame!!!", "I guess the video of Watame Factory with the tons of sheep on the road can now be played.", "Congratulations Watamedododododododododo", "Congratulations Watame-san!!!!!!!!", "watame army constantly growing in number", "50万人改めておめでとう㊗️1年に1回誕生日が来るように、1日に1回誕生時間が来ます。わため、みなさん今日も、Happy time to you ありマトン🐏✨", "omededone😭🎉", ":)", "♥️♥️♥️", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK I LOVE YOU🐏❤❤❤💯👈", "☝️🐑", "Buko juice"]