["私の悪い日本人を許してください。 私はグーグル翻訳を使用しています。 私はハワイ出身です。お気に入りのホロライブJPメンバーからの英語のみのストリームを楽しみにしていますPEKORA。 頑張ってくれてありがとう。たくさんの冒険に出かけるのを見ながら、これからも日本語を学びていきます。 どうもありがとうございました！", "English Version.\n00:03:11 Start.\n00:04:04 Surprise is a great success.\n00:05:39 Penguin's reaction.", "Aripekoooo...", "Thanks！", "これは助かる、本当にありがとございます🙏", "This is one of the most informative timestamp I've ever seen peko. Aripeko!", "Thakyou!!!", "Man you're a hero", "Finally, thanks ❤️", "Actually, no need timestamp.\nEvery minutes are meme.", "Aripeko!!!", "wow Thank you", "Thanks!!!", "Thanks for the timestamp and translation", "thank you very much! ^^", "you're a angel", "Epic", "ArigatougozaiPeko", "Thanks!", "Thank you so much for this detailed timestamp list!", "Thank you i daisuki you", "You do great job. Thx dude", "I can understand why she likes speaking in broken English with moona. There’s no worrying about saying something wrong or giving off the wrong impression, because you know the two of you are trying to communicate in good faith at all times. It’s very honest.", "yeah that's why communicating with a person with brain is good", "S", "@flower already is aswayyisaatehiua", "@flower 6saalaw", "Pekora: \"Goodbye everyone, see you next time!\"\n\n\nMoona: furiously fighting hordes while on fire in the background", "Perfectly described Pekora Usagi in a nutshell lol", "that was funny.", "Hope moona got paid soon,work in usada construction is hard\n\nEdit:nice she got usada heybird shoes", "@Heru Kurniawan she have been paid with 4 diamonds", "Just usual life of Usada Construction employee.\nIts worse than Aqua company.", "they're comedian at heart", "@RTKPL just as Moona said, Usada Job task more interesting and challenging", "Moona be like : What's the point of living if it's just for peace ??? \nWouldn't life be more fun if there were more challenges !!!", "That Was Bruh Moments", "2:57:50 xD", "I wanna join Usada construction XD", "don't we all 😂", "@Darkwinx CMIIW Moona later somehow put the diamonds in Pekora's chest", "Why this chaotic scene reminds me of miko's 35p GTA farewell party?", "@Bryan T. Coz you miss Miko like we all.", "hahaha 😂🤣", "@zeroyuki92 yes, she did.", "@zeroyuki92 aww thats really cute", "i thought no one notice this moment", "the comedic timing is so good", "Like the anime ending continues in the next season, it stops at the core battle", "@Darkwinx isn't she return it already?", "ムーナたちID勢は3人とも半年前の初配信で目標の一つにホロメンとコラボすることを挙げてたんだよ\nだからムーナはぺこらと一緒に作業できてめちゃくちゃ嬉しかったと思う\n今後ID勢とのコラボが増えるといいな", "そマ？！？！？！めちゃくちゃてぇてぇじゃん……", "優秀すぎた後輩。独断と偏見の時間割。\n00:03:11 開始。\n00:04:04 ドッキリ大成功。\n00:05:39 ペンギンの反応。", "凄いですね、お疲れ様です", "キミ丁寧な仕事するねぇ･･･うちの会社で働かないかい？（ﾆﾁｬｧ", "いつもお疲れ様です、さすが仕事が早いですね！", "english pls", "arigatou", "Thanks again for the timestamps! I always enjoy reading your notes and comments for the timestamps, too.", "This dude is a legend, thanks Bro!!", "Man you're the best", "いつも助かります", "I cant read this lmao", "いつもありがとうございます", "最近リアタイで見れないからめっちゃ助かるぺこ(/・ω・)/にゃー！\n\nいつも感謝してやす(* ॑꒳ ॑*)", "Thank you so much Peko!!! 🥕", "Remember once Pekora said that she's doing better alone?\n\nShe leveled up! Not only that, she's trying her hardest to communicate in English, safe to say she's going to improve her English as well. ", "That's really make me happy", "She did say that it feel less challenging when speaking in english, so speaking with moona pekora feels less shy", "It could be also said it's her first full duration English collab in a sense. Even if she didn't learn much form this alone the confidence boost she received was pretty big I bet, and thats helpful in both learning a new language and overcoming social anxiety she has. Gotta give credit to Moona as well for playing along and trying her hardest to understand Pekinglish.", "@elisirfly I mean Moona didn't understand Japanese either but she's learnings under Pekora now...\n\nI must said... Two peas in one pod.", "Pekora is the best.", "she's growing up.. :\")", "And in the chat after this stream ended she's DM-ing Moona so it seems like they're really making friends now. This is so blessed", "Pekora feels very comfortable practicing english with Moona, I'm sure Pekora will be very sad if Moona has to play on a separate server because there must be a hololive ID server in the future", "@Stinkbeanz that maybe true, since I heard the 2nd gen of HoloID is about to come. I hope the 1st gen holoid girl is still allowed to come to JP server even after they have more people (as the reason they play minecraft on jp server is becuase 3 people would be so lonely)", "@Varsnicky If that happens then let's see what hololive managers can do about minecraft server", "@Stinkbeanz hope this server going to be Holo Global server instead, I think so much things could happen", "@Rizky I see.. There's EN, ID and JPN... So much potential collab", "@helmiboboy don't forget about CN too..", "She need to communicate in english irl ?", "@Dude Dey no, she's bad communicating with people in general. If you ever read Komi-san manga, Pekora's condition is pretty much that", "They grow up so fast sobs", "I was really happy when she said that\nShe's growing up ;')", "sniff\n\nI'm proud of this cute crazy rabbit comedian idol girl.", "PekoMoona proper moon collab when?", "@Varsnicky lets make HoloId join HoloEN server if that happens. Sinced every HoloId is good at eng.", "@Slaine its hard for CN . They're banned from yt. And theres also the potential of political issue. I hope hololive CN doing well. I miss Arria to stream on twicth again. :(", "maybe pekora is actually better with non-native speaker...", "@Little Chemie I think it will come soon. After this stream, Moona ask Pekora if she want to join to digging at her house ( to make secret underground base maybe) and Pekora accept it", "she did great", "Its her preparation for a future collab  with Kiara.", "@helmiboboy dont forget holomy as well 🤔", "@ExDestiny Shinn HoloMy?\n\nMalaysia??", "@helmiboboy yes\nHoloMy collabs with moona before?\n3 times i think\nThey speak english as well", "@ExDestiny Shinn Myholo tv? is not from cover corp", "@ExDestiny Shinn holomy ?? Btw malaysia don't have own Hololive brand. Is MyHolo not Hololive.", "@zafran afif ouhh", "@THE MOON VIRUS i see\nI didn't watch that much so i didn't know\nI just subscribed as some of the translator i know make some of her video", "no need to clip/translate this, every second of this stream is gold..", "Learning Pekoenglish:\n\nlesson 1:\nHEY MOONA", "@Artharem Advanced Pekoenglish:\n\"yes\"\nOkay, so far so good\n\"pig push water\"", "@Johan water hell.\n...what?\n\nFire fire", "I agree - Every minute, every second it's pure gold .", "I still need it tho :,v", "@daviddare100 If someone can clip this maybe it can add other member perspective, like from Noel or Shion. I did watch Noel stream side by side and she comment that even though Pekora english isn't perfect but the way that she can hold conversation with Moona is great (or something around that).", "@Swarde Maru that culd be cool", "Pardun?", "true but clipping this has chances of bringing more audience", "@Swarde Maru ah, yeah, i need that another POV too.. there's Shion, Noel Flare, and Matsuri too..", "Pekora's Minecraft streams easily average over 30,000 live viewers, which is REALLY good.\nAccording to Holostats, this particular stream averaged over 48,000 live viewers, with a peak of nearly 56,000 live viewers.", "They're building a gold farm when the real gold is their interactions while building it", "Yes", "But i need the translation tho :( i don't understand japanese T^T", "Yeah..", "@Charles Xavier Because I mostly watch Anime and Vtubers ... I somehow understand Japanese.", "The unexpected collab become a golden stream, peko never talk like this even with her jp kouhai, there is still respect, afraid, and shy so she always carefully talking with other even with her jp kouhai, but with moona that peko never met, I feel she talking and playing with her little sister, it's collab but peko can freely talk like peko usual solo play, it more wholesome because it defeats the language barrier and even makes the stream more fun to watch.", "There's no need to clip this stream lol, this entire stream is a highlight\n\n先輩後輩最高てぇてぇ", "yes", "Exactly. Whole stream is gold!", "well said", "I need Pekora's \"Hey Moona\" compilation loll", "Wait till madlad clipper translate whole VOD", "I didn't know to much about Moona but now i love her , she and Pekora are one of my best couple ever.", "@Fayt Leingod ahem, Iofi still lurking around y'know XD", "@helmiboboy iofi is cheating so moona does same thing to her xD", "@DBT its joke its joke we all joke", "@Reno Fahrezi Purnomo meanwhile, miko in the background holding bunch of magma bucket to get \"roasted rabbit\" lmao", "My favorite catchphrase now is \"Hey Moona\"", "OGEY!!", "HEY MOONA COME ON COME ON COME ON", "Best quote ever 👍", "YES YES YES YES!!", "AEEEEY", "OKOK!!!!!!", "It's just like Okuyasu's \"Oi Josuke\"", "FALL IN LOVE!!!", "NO", "Come on come on", "Pardun?", "おつぺこー！\nぺこらもムーナと一緒にトラップ作成ができて楽しそうだった！\nMoona!!You are amazing!!\nThank you for building trap with Pekora.", "When your favorite anime doesn't have a single filler episode.", "Word bruh❤️❤️❤️", "(つ≧▽≦)つ", "is that a frostleaf pfp i see 👀", "Of course it's Frostleaf", "概要欄にムーナちゃんのチャンネル即追加助かる！\n副社長になってる...ｗ", "Im a overseas worker in Japan. Watching this stream feels close to home, getting bossed around by my japanese boss. Kusa", "ぺこらの一生懸命なところが好き\nI like 「Hey moona！」", "ここまで文句もいわず全力で協力・空気を読んでくれたムーナがオチを全く空気読まず回避したのが最高に面白い配信だったw", "普段一人でやってる兎田建設に最高の助っ人登場！\n伝いえたい気持ちと理解したい気持ちが交差するとき言葉はその壁を超える！神回。", "ムナムナムーナー！と懐くぺこらはまるで自分より大きい大型犬にじゃれる子供みたいでかわいい\nペットのように見てると言うことではなく。\n自分より強い生き物だとわかってるけど偉そうにあれ取ってこいスティーブ！って言って全然伝わらなくて泣く女児感", "ぺこらのマイクラは見応えあるし、見てて楽しいから特に好き。\nしかも今回は、ムーナちゃんとの共同作業が特別感あって凄く良かった！\n\n優秀な仲間が加わった兎田建設に死角はない。", "Timestamps for anyone who wants to make translated clips:\n23:26 Moona's Cow Crusher\n26:02 Moona's Fried Chicken Machine\n28:40 Pekora fascinated by Moona's buildings", "It would seem Pekora's evil genius has rubbed off on Moona.", "The face she's make when see Chicken and cow crusher is actually had me in tears XD", "@ғɪʟʟ 1ɴ ᴛ҉ ʜ3 ʙʟᴀɴᴋs Moona had her evil moment herself tho lol\n\nMoonas tower as suicide tower, Chicken fried and Cow crusher is Yabai lol", "Did Moona showed Pekora her secret base?", "@AYAME'S GIGGLE VIRUS  19:11", "what a gold mine!", "Thank u Soo much man you're awesome", "@ArmyAntAdam you're welcome. Glad to share haha 😆", ":D", "@AYAME'S GIGGLE VIRUS yes, even Moona trapped Pekora", "Do they even need to clip this lmao the entire vod is translation worthy XD", "@kb true hahahaha", "月と兎の組み合わせてぇてぇ🌕🐇", "PIG DIE, GOLD GET\n-兎田ぺこら", "羅生門完成＆稼働おめでとう！\nムーナちゃんと英語でコミュニケーション取りながらの共同作業結構スムーズに進んですごかった！\n優秀な従業員も入ってくれたし次の建設も楽しみだよ！\n次はディスコでお話しながら遊べるといいね！", "建築始まったのに珍しく3時間で配信が終わってるって時点でムーナちゃんが優秀すぎるのがよくわかるよね！", "実質moonaちゃんとの突発コラボマインクラフト！\n\n慣れない英会話をしながらも一緒に金トラップ作成の思い出作りが出来てて凄くよかったー！", "It all just started as greeting then pekora decided to talk to her to test her english skills and now it turned into unexpected collab. I'm hoping for more pekomoona collab in the future", "It's always a fricking Phantom ruined someone moment lol", "and also zombie hordes came from nowhere even though the surroundings are all bright XDDDD\nThat end so chaotic with Moona fighting the monsters in the background XD", "Just usual life of Usada Construction employee.\nIts worse than Aqua company.", "God of comedy always watch pekora's back", "It all started with LAPISLAZULI GIVE ME", "It was like an epilogue : Today stream has ended, but at the last moment a horde of monster come attacking.. but that was for another story. FIN", "以前に指示が苦手だから共同作業の予定はまだ無いみたいなことを聞いたけど、配信で突発で始まったコラボの中で構想を練りながら分担する作業を考えてそれを英語で伝えるってすごい事やってると思いますよｗ\n咄嗟に歓迎会ドッキリを思いつくのもさすがでした！", "One of the best streams that happened in a while. It's also a really big achievement for Pekora having her first full stream duration English collab in a way - and almost 3 full hours at that. It gave her so much confidence as well, I hope Peko sees even more value in studying English after this. Not only one of the most fun spontaneous collabs to happen in recent history it also had the most consistent 50K live viewership I've seen on a hololive stream this long and pretty much everyone loved it too. Big Thanks to Moona for playing along and giving our rabbit the confidence she needs.", "It's 60k bruh i see the number for this stream", "Its reach 60k bro. Crazy", "it already like a debut stream viewer", "The best part is that this collab is coincidental they didn’t plan this at all.", "@Constabriel Bell lucky usagi is crazy bruh", "@Millah Musyir Holostats shows this, still 55K peak is her new record for a minecraft stream https://holo.poi.cat/stream/AEPqwCuJRys", "羅生門完成おめでとう！圧巻ですごい！！\n有能新入社員ムーナちゃんと英語でコミュニケーション取って協力して完成させていくの見てて楽しかった！通話ありのコラボも見てみたいな～", "17:58 I love Pekora \"bath song\" so much 😂 She's so happy.. Pekora & Moona really got chemistry together. The Rabbit & Moon Team. 🐰🌗", "上手くできない英語だろうと積極的にガンガン絡みに行く姿勢凄い\n本当に配信中のぺこらは無敵なんだな", "マイクラ共同作業なんて同じ日本語でも難しいのによくやりきったね\n今日は完全にコミュ強だった", "ムーナちゃんとのやり取りかわいかったし面白かったー！\nムーナちゃんと英語でやり取りできるぺこーらもぺこーらの言っている意味を理解するムーナちゃんもすごい！\n次は通話出来たらいいねー！楽しみ！", "ムーナちゃんと積極的にコミュニケーションとってるぺこらを見てると、実はホロメン内では上位の英語つよつよ＆コミュ強キャラに見えてくる不思議…", "ペコら中学英語はしっかり理解できてて驚いた\n学校ではちゃんとお勉強してたのかな", "次はインドネシアと日本の架け橋作るか！！", "ムーナちゃんとの絡み見るの好きだったから今回は神回だった", "ムーナちゃんとの突発コラボ最高でした！ムーナちゃんから呼ばれ、ぺこーらも誘ったりと仲良さげで何よりです。ムーナちゃんもこの配信中に登録者数2000人近く増えて良かった！どんどんお互いにリスナー増えてほしいです。次回はディスコ通話でのコラボがみたいですね！", "HEY MOONA\nIm going to hear this in my sleep now", "Hey moona daimons!", "Moona moona Hi moona....", "Hey moona. Come!! GoGoGo", "I found it funny how she started saying it out loud as well even when not typing it out.", "COME MOONA!", "gulss please", "Amaising", "おつぺこー！ムーナちゃんとの共同作業で羅生門完成までいけたねー！2人で作業するのも楽しいし、掛け合いが面白いー！これでぺこちゃんも英語つよつよぺこなー！", "神回！兎田建設人員1人増加\nムーナちゃんは天才だ", "羅生門完成おめでとうございます！このたどたどしくても英語でしっかり会話が成立して協力して何かを成し遂げるこの感じがめちゃくちゃ好きだ…！！(*ノωノ)", "ムーナちゃんとってもいい子だった〜！！今日もたのしかった", "羅生門完成おめでとう🥕\nぺこダムも期待してる！", "羅生門完成おめぺこ！！\nムーナちゃんとあれでちゃんと意思疎通出来てるからすごい！！やたらとガツガツ絡みにいったり雑なやり取りしたり作業中のハシゴ外したり普段あんまりみられないようなぺこちゃんが見られて楽しいコラボでした！！今度は通話しながら作業できたらまた楽しそうぺこな🥳", "羅生門完成おめでとう！\n急遽ムーナちゃんとのコラボになって楽しかった！\nいっぱい交流出来たし、手伝えて貰えて良かったね！\nこれからもお互いにウィンウィンな関係を築けていけたらいいぺこね！", "私は日本人ですが、ムーナチャンはとても可愛いと感じます。", "とりあえずむーなちゃん登録したわ( ˘ω˘ ) ｽﾔｧ…", "What a gold stream, I can't concentrate on my online lecturer while watching this stream. 3 hours feel so fast ahahahaaha. One of best pekora's stream IMO.", "Same man, it was more interesting than marketing lecture xD", "Too bad we can't see it from Moona POV", "I know right", "bjir kulon tengah malem", "全編切り抜きレベルの神回", "1:27:14　楽しすぎる（笑）", "一を聞いて十を知る天才・Moonaの働きを前に揺らぐ兎田建設社長の威厳\n果たしてぺこーらは長としての誇りを守れるのか。頑張れ長、負けるな長", "ゾンビピッグマントラップ完成おめでとう！\n突然始まったムーナちゃんとの共同建築。必死に英語で会話しようとしてて可愛かった\nスペルミスやよくわからない単語・文法でも伝わったのはムーナちゃんの理解力が高かったからかな？\n通話したらどうなるのか気になるところｗ", "高所恐怖症の俺からすれば、この高所の作業は見てるだけで怖かったw", "初めてぺこらがムーナと会話した時から追えてるけどやっぱ積極的に絡みにいってたからムーナも懐いてきたんだろうなぁ 尊い\n \nぺこら  英語でこんだけ絡めるんだ  他のホロメンとのコラボも頑張るんやで", "pekora : \"where's my bed?\".\n\nmoona : \" bed gone\".", "Sorry for bad english\nWhen were you when gone?\nI was killing mobs in the field when  phone ring\n'bed gone'", "pig fall ,pig die, get gold", "Time stamp please", "ノリと勢いで会話するってこういうことなんやな", "パシリのぺこら、建築の鬼moona、兎田建設の未来は明るいな", "ムーナちゃんとのコラボめちゃくちゃ面白かった！楽しかったです！！", "突発コラボ面白かった😊ムーナちゃん有能。羅生門の完成おめでとう！！", "この兎ものの数秒でダイア掘り当ててるんですけど.......", "なんで直下掘りで引き当ててるんですかねぇ…？", "幸運ウサギ", "あまりにも自然すぎて流してた。幸運値MAXは伊達じゃないぞこのウサギ。で、おしげもなくMoonaちゃんにあげるところ、さすが長。やさしい。\nあ、なんだかんだで給料払ってるじゃん。", "2:27:55\nわためやシオンのところではなくみこちのところにまっしぐらなのほんとすき", "IDの子たちがデビューした頃はまだホロメンがARKにハマってた時期だったからコラボ少なかったけど、マイクラ通して絡むことが多くなって嬉しい！！！", "ぺこむな　てぇてぇでした！\nムーナちゃん　可愛い＾＾", "This is the ideal stream for both JP and EN since it entertains both equally", "Broken english unite all manners of people", "ムーナちゃん優秀やね。社長交代も近いで", "イオフィ以外日本勢と絡みないと思ってたけど、マイクラはグローバルやな", "最初のとこ見られなかったから見直し。", "ムーナちゃんになつかれてるの良いな\n末永く仲良くして欲しい", "楽しかった。その絡みもっと見たいな。", "ムーナちゃんとの建設見てて本当に楽しかった！\nてか配信した次の日の朝の時点でコメントが400以上付いてるのすご…", "ライブの同接も最後まで5万人維持してたし、ホントすごいよ。", "ガチ有能すぎてムーナ株ストップ高\nムーナちゃんの良さを引き出すぺこーらも流石でした", "ムーナちゃんの理解力と効率的な建築するセンスすごいぺこ〜\n1:28:51 ぺこーら壊れちゃう！\nからの\n1:29:07 クゥーン", "On another note someone need to make 'Hey Moona' compilation. That phrase was so cute lmao.", "今回は実際moonaとコラボする回ｗｗｗめちゃくちゃ面白い！", "Like Pekora said.. Moona Tensai! Moona is a genius indeed for being able to decipher Pekonglish. 😂\n\nSome suspect that moona was watching the stream and reading the chat to figure out Pekonglish but the chat rarely figures out what Pekora was saying while Moona get it right 99% of the time. 😂 Her response time is faster than the chat. Plus, Moona is the focused type. She rarely reads fan chat when she's too into games. Even if she's watching Peko's stream, she won't be reading the fan chat while she's playing.", "花火のダメージで4にそうって言ってたら本当に4んだの草\nムーナはぺこいんぐりっしゅ理解できる天才\nlook me でまず先にぺこらのこと見つめるのかわいい", "ぺこムーナ最高", "ぺこらの英語力にはたまに驚かされるぺこな", "海外ニキ大歓喜回でこっちまでうれしい", "Ngl, I'm stupidly happy for someone whom I'll probably never meet irl. The fact that she not only played with Moona for a full stream, she also communiated in english even if she wasn't confident in it. But honestly, Pekora's english is really good. Don't mind the doubters or haters on chat, you're doing great, sweetie! ", "Haters? Are you making up non existing things?", "@Distinct Loafer Some in chat were making fun of pekora's english, specifically the spelling. I'm like come on....so what if she misspells, jeez.", "Funny is that since Moona and I were living in the same city, I could have met her but never knew it was her lol.\n\nI dont think anyone in the chat is a \"hater\", since Pekora English pronunciation has been a meme among nousagi, but I think seeing this they also touched with Pekora's effort", "@TwistedPencils There's 3 kind of Nousagis (Blue, Pink and Orange Nousagi info > 2:12 ). One of them is bully nousagis (blue nousagi). They are kind of nousagis that like to tease Pekora (sometimes even make Pekora crying and angry), but they are the one who love her the most (some of them worship her like a 'fantasy' god) and Pekora herself love them too. They are not haters, it's just Pekora character is make them become like that. If you know Pekora for a long time, you will know the person behind Pekora (IRL Pekora) is actually acting as a fantasy character. That is why if you see someone tease Pekora, is because IRL Pekora make them become like that to make stream more interesting. She is a natural born comedian.", "@TwistedPencils its not bullying we just teasing her, its so fun, and she love it", "@FoX Shirakami yeah I know you guys tease her. But there really were some who were going beyond teasing. I know nousagis love Pekora yo.", "@Muhammad Rizky ah nice info, I never paid attention to the opening lol", "Bruh, there's always haters no matter what", "770.000 とろくしゃおめでとうペコラ ! ! 🎉🎉🎉 そして拝しんはめちゃくちゃおもしろい買った !! Moona peko best construction", "ムーナちゃん凄くて面白かった", "なんか心がほっこりする動画だった。\n2人とも可愛い", "突然のコラボ面白かったです！", "つぎはウィザスケトラップあたり作れば、みんなかなり喜びそう", "知ってるか？　英語の上達は、使う事が一番なのだ。どんな片言でもいいから、使っていけば覚える。\n会長が最初の頃と今で圧倒的に違うのは、使い続けて慣れた事がでかい。\nというわけで、どんどん絡んで行こうぜ、ぺこら！\nコミュニケーション能力開花してるぅ！", "最後ぺこらの火の矢で木材にチャッカしてTNT爆破するんじゃないかってヒヤヒヤしたｗ", "Pekora: Hey moona sorry!\nMoona: ?\nAlso pekora: ok", "Lmao", "ムーナちゃんとの共同作業ほんと面白かったw\nぺこらのふにゃふにゃ英語を理解するムーナちゃん強い(確信)\n建築センスエグかった…", "Who would've thought that Moona is the catalyst Pekora needs to boost her confidence in speaking english. It's so heart warming to see that they enabling each other.", "急上昇3位おめ！過去最高順位では？", "いつか通話繋いで一緒にマイクラやって欲しいぺこ", "Moona learned the art of Creation but with Pekora's guidance she will also learn the art of Destruction(mainly TNTs)", "i don't know why, but this absolutely give a smile on my face. and also, everytime pekora called moona \"hey moona\" it's very cute", "わっしょおおおおおおおおおおいぃ！！", "終始笑いが絶えない回だったw", "01:06:52 こういう不意に出る地声なんか好き", "This is too wholesome and heartwarming for us", "最初から最後までニヤニヤ止まらん", "Probably the best pekora stream ive ever seen, glad i can witness this live.", "I love how they break language barrier easily.", "最近のぺこらの頑張りに励まされています。ありがとう。", "Every second, every minute is pure gold, no moments waste. This will be a challenging for clippers and translators as this whole 3 hour VOD is pure comedic and wholesome. As we take note that this is an unexpected collab, and have language barriers.", "Pekoland's vocabulary (Pekolish)\nWats = what\nFall = Fall in love\nJamp = jump", "FireFire = Flint and steel", "@Fadli Rahmansyah  thank you! XD", "ploblem", "@harute wakurata  OK OK !", "Pardun?", "Black Stone = Obsidian", "foot step = scaffolding", "amaising", "fire stone = coal / furnace", "Gogogo = gogogo", "Pardun?", "horse = house", "Kamon kamon = let's go", "NO = NO", "You can make meme with this", "Ogeh", "se-zasu: scissors", "Look at this, YAGOO. You made this happen.", "持っとるなぁw", "31:50\n\nMoona: You can bring someone to kill in here as well!", "「次の株式総会が楽しみですね、ぺこら社長。」- Moona副社長", "This is truelly \"Astounding\" in terms of Pekora. I mean this is on par as what the Previous Members all did with 5th Gen. Let me explain by pointing out some key moments here in this MineCraft So far and by that I mean just in 30 Minutes into the Stream. \n\n1. Since there first meeting and convosation (Pekora & Moona) Pekora has learned quite a bit of English and how to propperly spell out the words too as well as a result of Conversing with Moona. ", "You know, some random redditor gonna steal this top-tier comment and pass it along as their own lmao😂🤭\n\nBut in all seriousness, your words truly reflected what Pekora felt in this stream👍", "@mainecp9 fuck reddit", "Exactly. If I were in her place  I will do the same way and talk more freely since both of them using different language and they're from different country. All they think is understanding each other and finding fun activities.\n\nI found how Pekora speak to Moona is more like a bestfriend than a gaming friend.", "This is need to be top comment", "More pekomoona colab please, i really like your colab like this. I want more “ Hey Moona “ in future 👍🏻", "Pekora was more at ease with Moona with the recent MC stream. Seems like the folklore of the rabbit and the moon is coming together.", "1:43:49 パァン！", "このチャンネルは純金<3", "I'm thinking Pekora first time meeting with Moona is a fated one.. as there's a myth surrounding rabbit and moon. It is said that rabbit and moon closely associated with each other. Here's some description i got from cgtn: \n\"In Chinese folklore, the moon rabbit lives on the moon and mix its elixir of life under a cassia tree. In the Mayan culture, the moon goddess is always depicted with a rabbit in her hand. In Egyptian mythology, rabbits are closely associated to the cycles of the moon. In the Greek mythology, rabbits have an important role that resembles fruitfulness and is related to moon goddesses.\"", "lol remember pekora wanted to go to the moon with miko? now the moon came down to see pekora", "good to know. \n\nwhats on my head while watching this stream is carrot's sulong. lol", "Up", "Thats because if you look at the moon, you can vaguely see the shape of a rabbit. It's no wonder why the moon and rabbit are closely connected in different cultures.", "出川イングリッシュ並みの英語力のぺこら、ポテンシャルの高さで早くもNo.2に登り詰めたムーナ。\n兎田建設の次の建設から目が離せない！", "Such a fun and wholesome stream... Thanks as always Pekora + Moona..\nI don't expect this collaboration.. On top of that, not only this is sudden collaboration, it's also became semi-English Stream.\nReally hope Moona can speak Japon soon, because according to her, she still tried to learn it.. So, if Moona can speak Japon, next time this two can collaboration using Discord. ", "She learned and she can learn fast cuz iofi and risu can speak japanese", "@Millah Musyir I think it would be faster if she is in Pekora's shoes, being forced to communicate in Japanese.", "Yes but I think isn't the language barrier that makes their interaction so wholesome, well I'm not disagree with you, of course its better if both of them could communicate better but yeah pekonglish is enjoyable so far", "盛り上がったけど気遣うだろうなこれ\n直接コラボも期待されるだろうけど海外勢とのコラボはこういう形式が本人同士も気楽だろうし視聴者も参加しやすいから1番良さそう", "そうだね。ディスコ繋ぐと一気に遠慮が出てきて会話も気使ってる感じが凄く出てしまって、\n無理して楽しい空気にしようとしてる感が出ちゃうんだよな。\n例えID圏のむーなちゃんとでもそこは変わらんだろうな～", "Trending 4 おめでとう", "ムーナええ子やん・・", "legend says, when a rabbit stared to the moon, she'll transform and goes sulong.", "ah yes, its all coming together", "The other members are lucky they don't need to have lightning resistance enchantment lol", "英語使うとビックリマーク多くなるのめっちゃわかる", "26:20\n間に合わなかった”be careful”に草ぺこ", "34:23 Saving this for myself", "18:02 kimochii~~", "This is one of those \"streams of legend.\"", "Your English is good, u will become comfortable to using English the more u use Pekora. Ganbatte Pekora I hope u can be fluent in English, someday", "Please dont be fluent. Just engrisu is fun to watch lol", "ゼネコン兎田組№１", "00:38:10 ここすき", "You know the myth where there are rabbits on the moon pounding mochi?\n\nSeems like this unexpected collab was never a coincidence", "Omg you are right! This pairing was in the stars. What a coincidence!", "月と兎のコラボなのがなんか素敵で良き", "Moonaちゃんの名前は、moonとMONAS(Moonaちゃんが作ってたインドネシアのモニュメント)に掛けてるんだ…", "めっちゃ面白かったし、多少英語がわからなくても、伝えようとする気持ちは大切だよね！\n\nきっと英語しかわからない人には伝わるし、変な英語は笑ってくれるから更に面白いのかも！\nぺこらの盛り上げる能力は凄いよ！", "Pekora: \"where are you going?\"\nMoona: \"In my house\"\nPekora be like, \"okay, I'm walking\"\nHa⬆️ha⬆️ha⬆️ha⬆️", "19:13 her reaction is so priceless www", "2:32:17 sounds so Echhi Lmao 🤣", "Literally everything said in this stream is quotable. \nThat's how good this stream is.", "This is too gold, i can watch this all day long. xD", "つくったのは、兎田建設。\n運用するのは、兎田マテリアル。", "When the whole stream is clip worthy.... ugh I should have taken my Japanese class more seriously", "Ur lucky u have japanese class TvT", "@I'm not a Weeb Maybe it was a requirement for work, after 3 months of Nihonggo we were supposed to be deployed at Yokohama though it was postponed due to covid", "@I'm not a Weeb Maybe even with Japanese classes, you’d still have to study hard and for a long time on your own to actually learn the language. I also want to learn Japanese and am slowly lol. Self-education is the best education.", "Moona x Pekora collab\n\nPekora : English Level Up\nMoona : Japanese Level Up", "ゲーム急上昇4位⁉", "悲報 ぺこら 技術力がムーナ以下", "Konbanwa Peko, I want to say before u going to play among us tomorrow, it's better you try free play to try sabotage. Please someone translate it please, I want pekora to become crazy rabbit killing people while she is laughing hard", "understandable, have a nice day!", "ぜひブレイズトラップを作ってみてyo！", "ムーナちゃんが、アクキン建設に入社したのっていつの話だったのかな\n分かる人おるぺこ？", "これから\n\nhttps://youtu.be/uMUVcEH6HOY", "@Riduwan Purnaminyan サンキューぺこ！\nあくあちゃんのアーカイブ掘ってたわ、マリン船長の方だったのぺこね", "Still on #45 trending for gaming... this is really GOLD CONTENT !!", "1:23:50 yes moona", "マジでこれは神回本当に楽しかった！良い突発コラボ！ありがとう！", "This is exemple of heart to heart talk 😁", "33:06 I'm weak", "むな、ちゃんげ", "最高！", "アイロンで英語力確定", "even Pekora the Prankster is getting pranked by the moon 😂🤣🤣\nand how the hell moona understand the ultimate pekonglish?? even some of the foreigners and jp bros in chat is so confused 😂", "You must ever heard bout connection between moon and rabbit right so yeah it's all make sense", "Really fun :v stream", "新入社員✕  パシリ○", "Big bwain Moona to can understand all a part of PekoEngurish. even when pekora wanted to ask Moona to do something he didn't need to explain it first", "神回", "I, love Moona and Pekora\nI hope they play more together", "Trying to figure out how do Moona understand Pekora's english", "I mean, that's just how non-english speaking people learned english before... Maybe 'cause of that they understand each other?", "It simply because they're connected", "Did Moona just got employed at a Black Company?", "Nice to see pekora and moons get along. Good job.", "Pekora: Fall in Love\nMe: Ok imma fall right now\n\nVery cringy right, yes I think so too", "ムーナちゃん、前見たときより色々発展しててすげえｗｗ\n牛の装置を動かすムーナちゃん、フライドチキン作るやつにうーぺー落ちるのまじで草\nロボ子さんは溶岩の方に落ちてたし、ホロメントラップとしての役割でもあるのか…", "神回", "神回", "神回", "This was an amazing stream, hope to see more Pekora x Moona Collabs in the future 😍😍😍", "Pekora :HEY MOONA", "ぺこらやさしいな", "When Pekora was looking at the cow farm, and the sheer brutal efficiency... She knew she found a comrade in Moona", "25:25\nThe brief pause and looked at Moona astonished seeing Cows farm is really gets me most lol", "Pekora approved it, she saw real potential in Moona. That reaction and laugh are so damn good though.", "Enjoyed every second of it\nEvery second of this stream was GOLD", "Moonaaa.. come to me I will make you took N1 in one(half) years.", "this streams is SO FUN and i cant stop laughing when pekora sabotaging Moona lolll", "*Moona joined the server\n\nHoloJP : wheres my dictionary", "The chat is dictionary lol", "正方形の形に四辺にゲートを作って真ん中に落とし込むように作れば綺麗に仕上がるよ。", "Really love this one. Thank you Pekora Usada and Moona Hosinova.", "This was such a good stream. I love MoonaPeko combo!", "01:18:28 boros kayu nya njir", "26:20 傳說中的雞兔同籠 XDDDDDD", "這回真的很好看，不懂日文應該也能看得很開心XDD\nMoona真的是理解力100分的超級員工。\nPekora的\"Hey!!Moona!!\"也很洗腦XD", "hEy MooNa ComE oN", "I need more of these kind of stream.", "1:58:17 pig pig fall in love~\nLmao. This was a wonderful stream and I'm glad Pekora was able to communicate and work with Moona so well.", "Looks like Kiara needs to step up her game, or Pekora is gonna be taken away by Moona", "Ironically Kiara prolly speaks both Japanese and English better than Moona", "38:00", "23:06 is quite possibly the best English pronunciation Pekora has done so far.", "Hey siri but it's Moona", "i love the pidgin they all speak in. its so endearing", "Would love to see next stream like this... Funny and cute interaction between them ", "17:35", "Make \"Hey moona\" counter everytime pekora meet moona", "This Stream is FULL OF GOLD XD \nI hope UsadaConstruction will always partnership with MoonaTech XD", "aqukin lost an incredible employee haha", "rabbit and the moon\n\nGreat stream", "The real entertainment. Love this stream", "moona 建設!!", "And this is why im subbed to Moona Channel...", "Moona just died on her first day as a pekora employee", "31:45\n\nThis make me realize how much Hololive grown from past 8 month I have been in the Rabbit Hole.. I actually cried here.. anyone else did?", "i tears up remember the first time i see this rabbit like almost 10 months ago, she growing so much", "Yes, here tho", "well someone manage to impress the mad scientist. moment pekora get locked in moona basement,seeing her cow crusher and trapped(again) in moona fried chicken machine pretty epic\n\nlooking forward next project from the two psychopath.especially when Elite joined the fry", "You're a truly genius pekora, i'm so glad that see peko so much happiness ever\nbecause moona become a new friend of her that make me feel really interesting, see you in next stream peko-chan~", "me smiling for almost 3hours... \nsore jaw tomorrow", "Only about a month since moona playing mooncraft, and she could impress the rabbit genius", "No podria vivir sin Pekora la amo tanto que ver sus streams me alegran mucho el dia despues de un largo dia de trabajo. Thank you pekora for such beautiful moments please don't ever change.", "No one will achieve this level of monkey conversation", "After finishing the SAT, I need this.", "In this stream Pekora has:\n1) Extorted Moona's house, leaving her homeless\n2)Sabotaged her chicken grill, cutting off her sole source of income\n3)Forced Moona to become an employee at her construction company, since Moona is now homeless and without income", "It seems Moona is M, she enjoyed it", "But hey, she got paid 4 Diamonds", "@Ben Tierkries Can't spell Moona without M though", "Moona and Pekora\n\nUsagi and moon.. it's  perfectly balanced", "Japanese VTuber reenacts romusha on an Indonesian kouhai (2020, colorized)", "You forgot :\n6) Pekora tried to kill Moona after hard work  )", "Also Pekora almost got locked in Hoshinova dungeon 😂", "@Bryan Ramaputra that not funny.", "How do we stop this usagi bros? She cant keep getting away with it! kusa", "@Bryan Ramaputra stop it dude it's not funny", "Seems like Moona is already on the right track to be an isekai anime protagonist", "Pekora and Moona: The Story Begins", "BEST. HOLOLIVE. MINECRAFT. STREAM. EVER.", "right, this is my first time watching live stream until it's finished. must watch moona next time", "Is \"Hey Moona\" the new \"Hey Siri\"?", "Da WAAAAAAAGGGHH!!!! wuz strong in diz un' ya gitz!", "Amazing steam and I watched at least 3times  thanks pekora and moona!!", "Bring back ol memories yeah", "Usada construction is the scariest thing I've seen this October", "PIG FALL. PIG DIE. GOLD GET.\n~Pekora 2020. \nArigato peko", "I'm really happy HoloID started playing on the server.  It's been really fun watching them interact with everyone.", "Usada Construction questionable idea combined with MoonArchitect redstone specialized technology will unleash chaos upon this server", "Japanese architect designing construction with Indonesian labor, colored in 1970\nインドネシアの労働力で建設を設計する日本の建築家、1970年に色付け", "That was so much fun and wholesome. Three hours and time flies so fast.", "37:23 「もーらったぺこ！」\nここの声かわいい", "rabbit and moon seems go well together", "2:52:48 Usada Mission Failed", "Every Moona understands what Pekora is saying, I can only say\n\nHOW?!", "exactly lol", "When you also learned English as a second language, you understand the struggle", "@Loxer150Gaming yes, exactly", "Legendary stream", "Most of the time \nPekora : (Moona pls understand what I say)\nMe : No way\nMoona : Did it very well.", "Gold stream, laughed my ass off almost every minute xD\n\nPeko engrish is hilarious", "Wow moona's channel in desc", "I love it when pekora talks to moona. Usually is see her as a crazy rabbit but when she talks to Moona I kinda thinks shes cute.", "I mean, two mad scientist did flock together even with a language barrier lol", "I see a pattern here.. PekoMiko, PekoMarine, PekoMoona. Senpai, Douhai, and Kouhai Relationship.", "PekoMarine same as gen3", "@kre wa yes, douhai mean colleague or co-worker, in this case same gen", "@Swarde Maru Oh I understand, thanks for info\n\n And all of them Have M in their name", "So... maybe the next will be.. PekoMori?", "By Allah someone please make full stream translation", "G O L D", "Pekoland language hard to understand lmfao", "2:08:17", "How nice of Pekora to include Moona's details in the description even though this whole stream wasn't planned. Even Moona's icon is on the hololive schedule website with Pekora's.", "19:38 the prankster herself got pranked! Lmao\n31:45 Moona spared her\nThis stream was really fun 😂", "Usada Construction, upon realizing the technological advancement of its new rival, Hoshinova Agriculture, decided to sabotage their business by extorting them into giving their private land. Furthermore,, using the facade of partnership, deceived them into helping to build one of Usada Construction project. \nThey even went as far as sacrificing a few of it's rival employee's life in the process.", "This was one of my favorite streams in a long time. PekoMoona Minecraft is great. Moona is really cute. Please check out her channel! She is criminally underappreciated. Hoping this brings more attention to her.", "喉が…？\nイビキ凄いのか…？", "Clippers gotta go extra hard for this one", "39:39 pretty impressive Moona", "wkwkwkwkwk gila, aliansi tergreget di holo server wkwkwkwk", "Pekora jadi senpai yang baik dan bisa diandalkan disini, www.\n\nI hope they do collab soon", "Can we get \"HEY MOONA!\"10 Hours version ?", "Hey moona compilation*", "WE NEED \"HEY MOONA\" COMPILATION", "Usada kensetsu + MoonArchitect = Stonk", "It's so cute watching this thing learn english 😂 omg.", "Still the skeleton horse tho... HaAHHAHAHAhahahhahHHahahha", "I can really feel that senpai shame as i watch a junior work better than me hahahahaha", "it's really fun when pekora talking with moona", "Pardun peko in chat under pekoras vids will always be funny", "27:38 Almost Says Temeee 😂", "Every second of this stream is gold LOL so much fun", "♥️", "I'm still wishing some madlad translate this full stream.", "Cover won't like it if someone translates the full stream", "Yeah i hope someone add translation in this video using caption", "@D D yeah, a man can dream", "Its a really fun stream hahahaha. I enjoy Moona being \"accidentally\" killed by you 😂😂😂👌", "Full english stream japan vtuber idol........", "36:40\nMoona : Where's Your Horse ?\nPekora : Oh, You Mean House ?", "Moona probably become pekora's favorite sooner or later", "This is pure gold. Watching Pekora speaking with Moona is priceless.", "2:55:13 i got jump scared here", "月の兎 aka MOON AND RABBIT TALE!", "This stream was too enjoyable.  I'm amazed Pekora managed to pull this off while being impromptu and across language barriers ", "Realmente espero que un dia hagan collab con voz XDDD ojala se cumpla ese sueño XD <3", "1:53:03", "25:15 nightmare.", "Gold stream!", "WELCOME TO USADA KEINSHITSU, MOONA", "Me trying to sleep \nMy Brain : \"Hey Moona!!!!\"", "兎鍋", "after watch this live I want to listen discommunication cover again lol", "Try search \"taka radjiman tamaki\" on youtube", "Indonesia is in indonesia 🤣", "@kre wa Legendary stream", "wahahaha Taka and Tamaki,, very funny", "pekora is 1000% adorable in this one", "The clippers should be really work hard for this, because they have to clip and translate for every second of this stream", "Yeah. Almost all of the stream is intresting", "best stream ever\npekomoona officially best senpai-kouhai pair now", "I don't know, but I want to make this an alarm. Pekora saying Good Morning to motivate you in whole day 1:16:25", "2:52:40 pekora failed to prank moona", "PewDiePie : Water Sheep!!!\nPekora : Water Hell!!!\nMoona : Cow Crusher!!!\nWatame : NANI?", "1:28:18 Joseph returns!\n1:29:05 annnddd he's gone", "IT'S ME MARIO!\nIT'S ME PEKORA!", "♡♡♡", "absolutely 10/10 peko..", "Moona's little sister", "Cute voice", "this stream is just perfect", "9:05 the start of rare english event", "Hey Moona will be great anime.", "Pekora look so happy with moona", "兎田ぺこらに謹慎中の王の姿を見た。すげーよあんた", "23:06 sounded very fluent", "Moona: how does it work?\nPekora: PIG IS FALL, PIG DIE GOLD GET\n\nAs simple as that 🤣", "And Moona completely understood the sentence", "3:10 Usada Pekora Story 8:43 \n                  🥕🐇🌛\n15:50 Epic Beginning 36:44 \n          *草*🥕🐇🌛🔥", "Peko you need more rest", "kiara:I'm not jealous...", "pain peko", "pain peko (2)", "I wish hololiveEn join this server but they have own server theyself :(", "@Stinkbeanz you must look Nijisanji Minecraft Server then", "@SandyGaflow with the hype Hololive en definitely have 2nd gen that's why they have their own server while holoid is still🤷", "@女神ですKimMinJu hololive Indonesia has been announced auditions for its second generation tho", "@Fernando Cahya but it's like really long time ago they announced it and there's no further update about it so🤷", "\"Fall In Love\" with this video XD\nGreat stream!!", "Are you... a pig?", "Just HEY MOOOONA should invoke something in you", "what's the  R word chats keep on asking not to mention?? I'm so confuse", "I dont know whether it's allowed to be said here. but it's related to dark past relationship between indonesia and japan.", "@Lilia Ixalia oh sh*t that's why.. thanks", "it's the equivalent of Plantation in the US in the past.", "long ago Japan colonize Indonesia and the R word is the \"force labor\"that the soldiers do to the locals.\n\nbut I must say,as an ex colonizers,Japan government pretty responsible.they often gave Indonesia soft loan or even donation when Indonesia have troubles.unlike the Dutch who colonize Indonesia before Japan(and Dutch rule very long time)...when Indonesia have trouble,Dutch always find excuses for not helping", "Amazing stream! Love the budding relationship of Pekora and Moona, it's adorable!", "I don't need a clipper now.. completely understand this video", "Same 🤣🤣", "このウサギ、文明を築こうとしてる\nThis rabbit is creating civilization", "no mercy for escaped chicken,\nsasuga moona", "This stream was gold!\nGo watch it all ", "I'm so happy i didn't lose this stream, PekoMoon makes this full stream a true fun and wholesome moment . I'll save this 1:22:55 for myself that \"awaiting waiting sori sori\" it just so cute . Thank you Pekora and Moona for this wonderful stream.", "This stream just became an english only stream, im sure the translators are gonna make this stream a gold mine", "NEW CONTENT : STONKKKKKKKKKKK", "Free Real Estate ... W8 till madlad Translate whole VOD", "Moona's house so beautiful. \nThere are so many minecraft pro in Holo server", "Last month she said \"what's a crafting table?\" 😂", "My first time play minecraft, \n\"where is diamond ?\" y=70", "25:24 that quick glance between moona smiling proudly infront of her creation and the cow, Pekora didn't believe her eyes there's another mad idol/scientist in hololive LOL....", "I can't believe I'm hearing Pekora real laugh for the first time too lol", "Peko laugh is the greatest gift 2020 gave me", "Yo this is the first time ive seen pekora laugh HA⬆️HA⬆️⬆️HA⬆️⬆️⬆️HA⬆️⬆️⬆️⬆️", "nice peko i know the video always better", "Good thing she didnt accidentally light up those tnt in the ending 😂😂😂", "Late, definitely watching the archive!", "no no no, moona have iofi for help translate because moona and iofi live together", "i think no, because iofi was streaming to at that time", "moona can message iofi or she can gulugulu translate", "She learned japanese maybe 2-3 month she can understand japanese", "She can understand basic japanese thought", "yeah, if romaji moona probably still understand", "Actually moona leave holo dorm", "“Hey Moona” is now stuck in my head lol..\n\nUp until now it still amazes me on how Moona can understand Pekora lol...", "I bet moona loat some braincells trying to understand that 😂", "I called it, she's running a black company!!!\n\nPoor Moona", "but... Moona Agriculture itself also promotes the use of the animal abuse...\nLook at that Cow & Chicken Farm XDDD", "this video is another clipper's gold mine.\nlot of clip worthy moments XD", "Water Hell lol", "Literally every second cant be separated 😂", "41:05 Botan will flip when she finds out about this 😂 I hope she makes a rival company", "Can someone explain to me how Moona’s cow crusher works? I don’t get it at all.", "i guess it suffocates the cows and die, idk if its efficient or not", "i think she just put several cows in a tight place. the cows will still reproduce. and when the switch is pushed, the ground will open and there are water there that make the cows float. kill the cows, and profit!", "Yup she need to breed them gradually. the limit of cow spawn on that one block cage is 24 cow.after that the 25 cow start dying and absorbed to Hopper and goes to chest.\n\nthe button on dispenser is to make water come out and flood the cow platform.i don't know the purpose of it,maybe to kill them faster since it become cramped", "@Freyja Wion the water is there to make them bob up and down to make it easier to feed them. if there was no water they would clump together facing you and its a lot harder to aim for a different one you havent fed yet.", "Aaahh....I didn't really notice the difference since I usually feeding them on one side", "Congratz for reaching Japan trending topic #4 for gaming\nおめでとうぺこ🎉🎉", "Wow really", "Sasuga hehe hopefully it's increase moona popularity on Japanese viewer", "WE DID IT\n500K VIEWS IN 22H\nI’m so happy for her\nEdit: seriously someone answer me, why is the views now 495k? What’s the problem with youtube", "Moona is more like pekora's imouto here", "00:30:00 SNAAAAAAAAAAAKE EATEEEEEEEEEEEEEEEEER!", "Hey Moona, I use TNT to prank Subaduck, ain't that wacky?", "This is gold, ngl", "I'm glad to see pekora found her soulmates in minecraft, she always done something alone so it's refreshing", "19:11 catch Rabbit\n25:26 when u see someone with your abillity(mad scientist)\nI wish \"Hey moona \" repeat clip for full 30 minutes", "Pekora's English:\nglass=gluss、gulss\nfurnace=stone fire\nobsidian=black stone", "Black stone don't forget", "@Kevin Rochman when obsidian called black stone🤣", "horse = house", "no no no In that stream pekora know about horse, and want to leave in that house\n.\nbecause Moona House is Pekora House ?\nand moona reply ok", "@NoireLeanboX and finally,senpai try robbing her kouhai again like before🤣", "Best Collab Stream Ever , so much fun watching Pekora and Moona", "is that legal to clip this whole stream?", "With very heavy editing to make sure YouTube didn't flag it as duplicate upload or copied content.", "Very heavy editing, and the VOD is cut into several part of video.", "I wonder Hololove/Cover get anything as return from these clips beside free advertisements...", "@Tegar Adi Destara Just pure free advertisements. Look at how successful they're doing with those clips. From no name company who resorted to open China branch because they're more famous in China than Japan to globally recognized company.", "54:19 Moona: \"Now how can we get down?\"\n\nPekora: \"I DON'T KNOW\"", "HEY MOONA!!! JYUM", "JAMP!", "Pekora is a great senpai", "This whole stream is truly a 『Gold Experience』", "Today's stream is fun, I've watched until the end", "Thank you for the stream, Pekora and guest star Moona! I enjoyed it a lot! It made me very happy :)", "Thank you for the stream Peko.\nIt was gold! xD", "Ngl, i can't stop laughing when watching this stream. Such a wholesome and funny moment", "PekoMiko ...\nPekoMarine ...\nPekoMoona ...", "Peko's chaotic energy and Flare's chillness oddly compliments somehow", "I'm still waiting for Pekora prank iofi in minecraft", "PekoMori\n\nAnd btw, this is stolen comment, dangit....", "PekoMinecraft", "or maybe PekoMano", "Her confidence just went stonk when she is speaking English lmao", "Pekora-chan’s English was good. More Moona collaboration please <3", "Moona: Joins Usada Construction\n52.000 people: Woooooo Yeah Baby! That's What I've Been Waiting For!", "nice, this stream exploded!", "I am shipping them now and i need some arts with this couple)", "HEY MOONA", "Pekora and Moona make a great team hahahaha. this stream is gold", "As expected from moona, she even understand pekoenglish", "MOONA understand all type of english she just need one type of english to complete the achievement, that's elite englishhhhh", "Wholesome stream overall.. glad that both Pekora and Moona are able to overcome the language barrier to work together on this project!", "Moona is a one of a kind genius who understands the Japenglish... She's great lol", "@helmiboboy fire fire gibe me, pig fall inlove,", "the entire contents of this video will be a clip... lol", "I still love this usagu from the first stream till days. even newcomer keep coming. she still the one for me with after aqua and the duck.", "Ohayo senpai😇", "it was really fun to see you both have fun working together! pekora really tried her best communicating and moona was really helpful and funny!! omedetou to usada kensetsu!!", "MMT=Moona Maji Tensai\nShe can understand pekora English so well xD", "What hours of constant Pekonglish exposure does to a mf", "Well, she's understand Marinenglish.. she's fine lol", "This stream literally can cure depression.", "1:58:32 Piku Piku Piku", "2:15:00", "Such a fun stream. I loved it all.", "i want the full translate of this stream :v", "Moona Can Understand PekoEnglish Very Well \n\nPekora : Fire Fire \nViewers 🤔🤔😲😲", "At this point, I won't be surprised if Moona can actually read minds", "Moona Tech tips", "☺", "I always love to see the way Pekora interacts with Moona.", "I'm so happy Pekora is learning more english to communicate better with Moona! while Usagi Company destroys things Moona just wants to build www\nAripeko for the stream Peko! 🥕🐰", "jokes aside I must admit pekora's ideas are crazily creative and out of the box, carrying hololive server 👍", "This is now my favorite pekora stream, so lovely and how she tries to communicate with her broken English to moona, all so cute", "Even tho i don't understand japanese, i really like her cuz she's very funny!", "Welcome fellow nousagi👏👍❤️", "Pardun?", "there is so many moment u can clip in this stream", "You can clip every minutes of this stream", "Moona expanding her harem", "uhh.. it's actually reverse..\nMoona expanding her master. she becoming a harem for many\n\nah actually not harem. but like.. teacher. someone that teach her some new things.", "@DBT you forgot Watame And Marine, and i keep waiting for haachama sensei streaming again", "PEKORA DICTIONARY\n1. Love : lava\n2. Fall in love : fall in lava\n3. Wehew : where", "Pardun?", "Love how moona english is following pekora level english", "what time did she saw the Subaru revenge?", "1:17:27", "@Darkwinx i watched till that time but when i came back the rails sounds are gone ( 2:24:30 ) so i thought she already saw it and dismantled the cart", "@Ren-chon Pekora played MC  off stream earlier when Suisei was streaming MC. Maybe at that time Pekora repaired her house.\nNot to mention when Subaru destroyed Pekora's house, Pekora was supposed to stream MC but canceled it. I bet Pekora watched Subaru repaired her house.", "@AYAME'S GIGGLE VIRUS i doubt that, here ( 1:17:27 ) she's wondering where the train sounds are coming from because that's not there before, then she said that her house is better after being fixed than before. NVM im gonna rewatch the stream tomorrow. thanks btw", "@AYAME'S GIGGLE VIRUS subaru fix the penguin but didn't know some details interior and apologize to pekora", "UsadaConstruction and MoonArchitect joint venture is GREAT SUCCESS\n\n\nSeeing these two play and communicate for 2hrs is peak wholesome", "Keep watching this stream everyone to make this video can get 500k view/24h", "best collabhas happened and it wasnt even an official one", "Moona: *exists\nPekora: \"Hey Moona!\"", "This stream is pure gold...\nYou did your best pekooooo!!!", "Pekora really like moona haha 😃", "I wasn't able to watch the first half of this stream, aaaaaaaaaaaaaaaa\n\ntime to rewatch.\notsupekodeshita! this stream was fun! seeing two geniuses in the hololive renaissance", "1:54:00 cute", "Oh my god\nthis was gold amazing engrish", "this stream is blasted. Cant wait for your collab with moona www", "When usagi see moon , she will transform become sulong.", "I would love to see pekora in sulong form", "A Pekora é muito fofa!!❤❤ha↘️ha↖️ha↘️!", "How many time pekora say \"moona\" in this stream ? XD", "HEY MOONA!!! - Usada Pekora 2020", "I'm wheezing from start to finish 🤣🤣🤣", "Moona have pekora's dictionary", "？？？「またお邪魔虫が一人増えたにぇ…」", "Her hay Moona gonna stick in my mind for a while \n\nHA⬆HA⬆HA⬆HA⬆HA⬆", "18:17 26:28 37:22 45:55 1:02:39 1:21:46 1:30:47 1:36:38", "I kept thinking about how gravity works in Minecraft.", "Rabbit and Moon\nYep, best combi", "1:58:21Yes, Pig Push Water Fallinlove", "This stream is indeed pure gold!\n\nPekora is as cute as ever, but with a smart Kouhai like Moona and having to speak English, we see new sides of her!", "Pekora: I loved the joke when you tried to lock me up\n\nMoona (the best architect) : What a joke? I got confused as a button", "Did anyone clipped the fireworks trap?", "I am very disappointed with Indonesian fans because they spam in the live chat by making jokes with the word ROM** which is funny for Indonesians but this may not be good for people outside Indonesia, especially Japan, because they are afraid it could cause massive uproar  in Japanese people, so please for Indonesian hololive fans, don't make joke rom** in live chat, it's better to make these jokes outside of live chat....", "Choco sensei: cracking the ancient elito-english language\nMoona: cracking the advanced pekonglish language\n\nNow we'll just wait and hope if there will be another english test stream by haachama & coco to know which combo is on top wwww", "(edited for info) Moon Rabbit is an Asian mythology story.\n\nSpecially in Japan, you can search \"Tsuki no Usagi\" (The Moon Rabbit). This is the japanese tale about the rabbit who live together with an old man in the moon.", "...or Rabbit Company will Joint Venture with Moon Architect and create something random project.", "Moona what a Minecraft veteran, Pekora got a SSR kouhai lol", "Petition to add Moona counter please.", "This STREAM IS GOLD no ITS DIAMOND", "they build a GOLD trap and found DIAMONDs on the way, literally.", "time stamp? no need, cuz this whole stream is a highlight", "Bruh Imagine Playing Genshin and miss a Stream", "A diamond stream", "You miss a Legendary stream", "You miss a legendary stream", "You miss a legendary stream where at the peak 60k people watching", "BEUTIFUL!!!!", "Wats? How the water hell Moona no ploblem  andastad pekolish language.", "lol\nokok!! gulss plese", "Pardun?", "Moona exist\n\nPekora: Hey Moona~", "HEY MOONA !", "very nicee", "HEY MOONA", "PekoMoona is justis!!!!!", "Hey Moona", "today in pekonglish we have:\nreary (really)\npanpkin, pampukin (pumpkin)\nwaowaowao (wowx3)", "I love that on the way Pekora is practicing being a good senpai “WOW, AMAZING”, but it then just turns into her being genuinely impressed.", "It's nice to see Pekora becoming friends with Moona, especially since Iofi and Risu don't play as often.\nAlso Moona feels the most isolated among the HoloID girls in the Hololive Minecraft server since she can't speak Japanese.", "I'm supposed to be working on my side-project, but I kept tuning on to this stream lmao. \n\nThis is certified to be one of those Pekora's (and Moona's) best moments in holoserver.", "Both mona and pekora is introvert \nPekora said she prefer working along\nAnd mona with language barrier, she also working alone\nBut after the fateful trade (kinda unfair for mona XD) ", "Usada Construction + Moonarchitect", "I had so much fun watching this stream. I'm glad you manage to complete the Rashomon gate/gold automatic miner. You and Moona are a good combo for building things. Hope there will be this kind of stream later, be it planned or spontaneous like this one👍", "Japan and Indonesian construction company working together to achieved World wide landmarks in Hololive, Colourized.", "Kinda have feeling Moona streamsnipe here so she didnt get pranked by the rabbit.\nTensai", "if you look from far there  is TNT  in the roof . how can moona didnt know if it was a trap,", "that sachou always try to killing her worker, what a black company", "No safety protocols here", "I like the way she called Moona. Certainly not just me", "Moona: what else you want\nPekora: firefire", "I can't stop laughing when moona fall ... Hahahahahaha\n\nWhen your senpai fall, then a good kouhai must follow that senpai....\nThat's a good kouhai for you...", "pekolish love", "Very fun stream!!", "25:22 that laugh! LMAO", "Story of moon and the rabbit", "What she say about the Subaru incident ? :’(", "Pekora has already addressed this topic before back when Aqua had the accident at TTT--Pekora doesn't mind accidental destructions at all and had a good laugh at Subaru's fire accident.", "Moona and pekora always bring good contents", "this is GOLD", "the gold trap is working then...", "For me this one is legendary streaming from usada pekora", "Oh, Moona so cute~", "The first stream that i watch till end", "SSR CEO", "nice invention pekora", "17:50\nOh my, how lewd", "I imagined moona laughing the whole game hahahahhhahahahhaa", "19:13 pekora speechless 😂", "Man i'm getting triggered by the comment section on the live chat,this indonesian saying the R word and just keep spamming the word even the other viewers already told them to stop sending the forbidden word.\n\nIm really sorry for my fellow indonesian. Such behavior cannot be accepted. Please accept my apologize nousagi tachi.", "truly one of the best minecraft stream", "Do they have enderman pearl?", "So... she watched Gantz", "FALLINLOVE", "草 🥕🐇🌛🔥 2:57:50", "Hey moona!\nOKOK\nCome\nYes!", "Nonono", "blessed collab", "The best Pekora's minecraft stream so far", "Pekora’s elated behavior may suggest she is a true sapiophile", "Moon n Rabbit best match", "Amazing stream", "First ?", "Romusha all over again.", "ROMUSHA ZAMAN SEKARANG 🤣", "is this romusha content?", "I laughed bro. But please delete this. It might hurt someone", "Stop it dude no need to bring unrelated stuff to this archive delete it please don't be ignorant brat", "Delete this", "yeah I'm fine with this but people might take this seriously", "Delete bro", "なんでこんなに客入っとるん？\nもこたんだって同説2万ぐらいよ"]