["みこち無事に戻ってきてよかった😊肝心な時にいないのうさぎには笑っちゃったw  続きも気になるね！！", "BGMにノリノリなぺこちゃん可愛くて好き。\nライブ応援してるよ！！ファイト！！", "★編集中★\n独断と偏見の時間割。\n00:03:40 開始。寝起きボイス。今の声はやばい！？\n00:07:00 鼻歌。", "I may not be able to understand you...\n\nBut thank you.", "@Atavistic Hills \nIt's mostly an automatic translation, but there's also an English version, so you might be able to understand it there.\nYou're welcome.", "谢谢史官", "https://youtu.be/uzPbt1G6XP4 Pekora says San San uwu", "English Version.\n00:03:40 Start. Sleepy voice. Now that's a bad voice!\n00:07:00 Humming.\n00:07:38 Poem.", "Thank you!", "absolute madman", "You have my high respect mate", "英語＋長いw", "https://youtu.be/uzPbt1G6XP4 Pekora says San San uwu", "2:52:43  流石にぬれせんべいとハムサンドは爆笑不可避だろww", "お疲れ様でした(,,・ω・,,)", "ライブも楽しみだし続きも楽しみだぁ", "ペコちゃん大好き", "今回はサムネ通りな感じののうさぎになってしまった…\nゴマ探しでレベル上がったかと思ったけど、レベル上げが必要なのかな？\nそれともみこちがいなかったから火力が低かっただけなのか…", "I remember this. I remember beating this game when I was young.", "やはりリンゴは有能", "ぺこーらのセリフを読み上げるときのダミ声とテンポの小気味の良さが好き", "いい感じで進んだねぇ。\nBGMが良い曲だらけだからそれに合わせてノリノリなぺこーらがホントにかわいい！\nライブ前の緊張緩和のために配信してくれてありがとう！\nちょっとでも力になれたなら嬉しいな", "3:25:40ここ回復してるように見えて実際は回復してなかったの草", "アイドルとしてのぺこらも好きだけど、配信者としてのぺこらが一番好き\nRPG配信楽しい\n\nRPGをグダらずに楽しく実況できるのは才能と思うから、これからも色々やってほしい", "もしかして野うさぎいらｎ... \n緊張ほぐれたみたいでよかった～\nライブ楽しんできてね！！", "今回もゲーム内ののうさぎとコメント欄の野うさぎがリンクして\nチャットとのやり取りも多く面白いMOTHER２配信だった！", "(*'へ'*) ﾝｰﾎﾟｹﾓﾝﾔﾅ!", "楽しかったー！名前しか聞いたことなかったムーンサイドも見れたし\n攫われたみこちを救うための戦いもぺこーらと二人で出来てよかった！（のうさぎの活躍は…）\n忙しい時に配信ありがとう！緊張が少しでもほぐれたならよかったｗライブ楽しみ！", "停電の時はとんだ失態を見せてしまいましたね…もっと強くなって守れるようになりたいものです👼…\nカレーメシ買って待機！ライブ頑張れー！！", "自己評価は中の人が多いってことか", "ウィンターズ行ってたこけしマシンを使えばゴヂラのバットが買えますね。", "スマブラDXのopでトンズラブラザーズが出てくるんですけど、ずっと悪者だと思ってたｗ\nでも、初めてマザー2を見て凄い良い人たちだったとわかったよ。", "この象徴的なゲームをプレイしていただきありがとうございます！あなたがプレイするのをとても懐かしく見ています。あなたは私の日を作った、PEKO！", "今日も楽しかった！マザー2は昔クリアして大半忘れてたけどムーンサイドは印象に強く残ってて思い出した～\nのうさぎ大事なときに倒れてるｗでもぺこみこてぇてぇで生き返るぺこ！みこちおかえり～！\n配信で緊張ほぐれたって言ってくれるの嬉しい…夜のライブ楽しみにしてるね！がんばれ～！！！", "24:30 IQを上げられるのうさぎ\n25:20 ちょけんちょけん\n58:00 自然な「知らなかったー！」\n1:10:20 「のうさぎならいいよ」", "おつぺこー！今回はサムネ通りのうさぎ虐回だった…不甲斐なくてすまぬぅ…でもみこちもまた戻ってきたし、良い感じに進んだねー！それにしても敵も強くなってきた…。ライブも頑張ってねー！応援してるー！！！！", "だれかカプセル使ったりスーパーエアガン売るように伝えて欲しい…", "ムーンサイドの不気味さが凄く良かった！マザーはBGMもゲームシステム？も新しい感じでほんとに面白いぺこな！次回も楽しみー！\n\n20時からのライブも頑張ってねー！", "鉴于最近木口的事情各大DD的普通粉丝群都变成了战场，大家过得都不开心。所以咱自己建立了一个避难所，想开心讨论，不被炮火波及的大家就来吧，大家一起建立新的乐土。 hololive避难所 1160249827", "1:52:30", "ぺこーらはあんなに優しくしてくれたのにデパートでは足引っ張ってしまってごめんなさい\nいつか守られる側から守れる側になれるよう頑張って強くなる！\n今回もＢＧＭにノリノリなかわいいぺこーらが見れてとても楽しかった！\nライブ前なのに配信してくれてありがとう！", "25:39 戻ってきてる！？\n1:03:03 「ペットじゃねぇぺこだよ」\n1:07:28 「マリンか？ あいつは売ったぞ」\n1:14:57 最強の子供を生む", "Her morning voice is too adorable xD", "This is my favorite game ever :D I am so happy to see Pekora-senpai play it <3 even if i cant understand most lol", "<3", "Thanks for the streaming peko!\nNousagi had a rough time there.. XD\nOh yeah,, Ganbatte for Live Concert tonight!! Can't wait for Spice Love 1st Live Concert.. :D", "For a second I thought you meant me and I was like what? Lol", "🐇", "", "We need more of the hololive members to play the mother series", "her sleep schedule must be upside down", "hopefully my posting game script didn't come off as spam.  I do not understand Japanese, however I figured I'd try to help others follow along and get a little bit of exposition.  To people who actually translate Vtuber comments and game dialogue thank you.", "Denle paracetamol a ese conejo v,:", "i can listen to the bgm intro all day long", "i wanna see a pekora/watson minigame collab\n that or a kirar/pekora collab", "KONPEKO KONPEKO KONPEKO"]