["English version.\n00:03:41 Start. 2nd live. I went to the throat hospital.\n00:08:43 Poem.\n00:10:00 After the poem. Chatting while starting up Minecraft.", "You are a saint. Thank you.", "There are some people who use the Japanese version of the site for translation, but please refrain from using it for translation. There is a possibility that I will get in trouble for the comments that are translated into English, so if I want to make an English version based on the Japanese version I made, I will make it myself.", "Thank you!", "I must say; I love you for these. \nBig thank you!", "@わんさねこ I have informed that person about your wishes. ", "Thank you for this you legend", "Can you timestamp the Frustrated Pekora? 😆", "@Zetsumei Zetsubō \nIs this the part where you go crazy around 2 hours and nineteen minutes?", "@わんさねこ Yes it is! Thank you!", "WOW.. Thank you so much!", "Thanks man. I really wondered where is the place she was talked about", "Thank you bro", "社長ダンジョンの時間です！独断と偏見の時間割。\n00:03:41 開始。2ndライブの話。喉の病院行ってきた。\n00:08:43 ポエム。\n00:10:00 ポエム後。マイクラ起動しながら雑談。", "@わんさねこ okay I'll delete it", "@앟리 Thank you.", "助かる！！遅くまでお疲れ様です(*｀･ω･)ゞ", "Thank you as always! おつぺこ－！", "圧倒的感謝", "まったり雑談をしながらHalloween建築・・！\n想像以上の出来に利用者の反応が楽しみだ！", "ダメ出しされて発狂するぺこちゃんめっちゃ可愛くて好き。\n最終的には内装も凝った良いものが完成して良かったね！！\nこりゃみんなの反応が楽しみだぜ…！\n喉はほんとお大事にね。", "完成おめでとー！トーチにカーペットでいい雰囲気になったねー！引っかかった人の反応が楽しみだ！\nぺこちゃんの声大好きだから喉早く良くなるといいねー", "第3のダンジョン完成おめでとう！雰囲気いいし仕掛けすごくてめっちゃ驚くと思うから反応が楽しみ♪\n喉お大事にしてね！", "また煽り看板書かれるぞｗｗｗ", "ぺこちゃんのノドが心配やから、しばらく休んでみてもろて・・・\n寂しいけど、アーカイブで紛らせますんで・・・", "迷路作るのもなかなか大変なものだね\nでもいい雰囲気な第三の間が完成してよかった！\nあとは上手くいくのを祈るのみ！\nまだ次も考えがあるみたいだしそれも楽しみ！", "本当にぺこら…可愛いぺこぉ\nハロウィンの帽子をかぶるぺこらもかわいいぺこ！\n                      ᕱ      ᕱ \nお゛お゛〜(　＾ω＾)", "これはかなり良い物ができちゃったねぇ...！ 反応がどうなるか楽しみすぎるよ お喉お大事にね！", "帽子似合っててかわいい\n喉には気をつけてくれ", "子供は泣かないけど大人は泣いちゃうイタズラこわい\n喉お大事にね！", "みんなで考えながら作っていくの楽しいねー！どんどん凝っていってクオリティ上がっていくの面白かった！\nみんなの反応今から楽しみだ！\n薬ももらったみたいだし喉は早く治るといいね！早く治ることを祈っているよ", "A trap masterpiece by Pekora, even making a well-thought maze just to distract the actual trap. Impressive.", "スライムトラップに羅生門、ぺこダムにThe sorrow…沢山色々作ったねー！ぺこクラはまだまだ止まらない！これからの建造物も楽しみにしてるねー！病院の話も聞けてよかった！お大事にねー！", "赤ちゃんも泣かない迷路\nサメちゃんも泣かないとは言ってない", "ハロウィン準備おつかれー！\n思ってた以上に雰囲気のあるダンジョンが出来て良かったね。\n楽しい楽しいハロウィンに期待ぺこ！\nでも、まだまだ何かあるぺこよね？そちらも期待！", "カイロプラクティックか〜", "いいアトラクションだね。\nスバルに仕掛けたタイプの花火トラップ部屋も欲しいね。あと最近国際化が進んでるからなるべく看板は英語で書くことに挑戦してみて欲しい。", "ぺこら発狂する 2:20:00 2:20:52", "これは助かる", "寝る時に鼻詰まってると口呼吸になるから、寝る前はなるべく鼻の通りをよくして寝よう！", "ほんとに喉大丈夫か？\n\n割と普通に心配になった。", "ブルスクはシャレにならんて。。。\n年齢バレる。2段階で顔真っ青", "Dam subs shot past 820k in mere days. Pekora is on the roll this month", "おつぺこー！！ハロウィントラップならぬ【ザ•ソロー】完成おめでとうー！海外ニキの発想とぺこらアレンジでいい感じに出来たねー！他のメンバーの反応が楽しみぺこ！やりたい事も多いし無限にマイクラを楽しめるねー！それと喉もお大事にねー？ぺこちゃんの元気な声が聞けなくなるのは寂しいぺこ…", "3:25:15 i found it, peko singing this is halloween", "おつぺこ～\n雰囲気たっぷりのダンジョンができちまった\n\nどんなリアクションが見られるか、今から笑いが止まらないねぇ！", "1:19:44 HEY MOONA!", "久しぶりのハロウィンスキン可愛かった～\n第3のダンジョン完成おめでとう！\n赤カーペットにレッドストーントーチは雰囲気出ててすごく良かったね\nどれだけの人が気づいて入ってくれるか他のホロメンのマイクラ枠からも目が離せない！", "ぺこダムの台座みたいなダンジョンでしたね", "最初はどうなるかと思ったけどだんだん雰囲気出てきて洒落た施設になっていった…！ブルスクの発想いいなあw", "does anyone know why they dont have elytra? is dungeon generation off?", "2:36:10 ビックリしたよ", "全くぺこ言ってないじゃん", "Lo~ve~", "Hilarious how Gura, Amelia, and Moona went through this trap on their tour stream. Bet Pekora never saw that coming.", "迷路作ってるぺこちゃんの顔が真剣そのものでかわいいぺこ〜", "富豪の息子は、逃さないよう\n良いコミュニケーションとっていきましょう", "クレカ高校生が使い過ぎてやばい事になりませんように(｡ｰ人ｰ｡)", "絵の隠しドアもいいね!", "First one to test were Hololive En members and they were successful!", "ブルスクから迷路作りになりそのままお化け屋敷風になってとのうさぎ達とアイデア出しあっての完成お疲れ様でした！\n季節のわかり目長ものうさぎ達も体調に気をつけて下さい！\n次の配信も楽しみにしてまーす！", "It would be great that last spot (empty room) if Pekora build \"Jumpscare\" trap that on that..\nShe mention it couple of times in earlier stream, but while build the trap, she seems forgot. Well, 1 material seem missing (creeper head) but I think she can change it with Pumpin Head (jack o lantern).\nThe labyrinth quite spooky tho,, so I wonder whose gonna be 1st victim.. ", "gura/watson came for 1st JP server tour. they went to the blue screen trap.", "これ、薬服用したせいで鼻声治って、ぺこらの声自体変りそうじゃね？w", "辛苦了 晚安~", "2:09:30\n2:20:03\n2:20:52", "これは助かる", "Is good to know that her health is fine and it was nothing serious. Even Marine was worried about Pekora working too much.\n\nMother2 gameplay is just a few hours away, I guess I won't sleep tonight.", "上にTNTでもおいて置けばスバルあたりが芸人魂を魅せてくれると思う", "2:20:05, 2:20:55 LMAO another clip for the Pekora compilation", "Incidentally, this was also how I felt live watching her initial crappy maze design that drove my OCD crazy. Thankfully, her final result turned out pretty nice!", "Since no one likes gatekeeping during live chat, I'll remind folks here: please stop spamming \"Hey Moona!\" meme out of context or intrusively bringing up Moona's name over and over in Pekora's live chat. When Moona logs into the Minecraft server for the first time (NOT when Moona's simply relogging to avoid sleeping at night) or when Pekora and Moona greet and interact with each other, feel free to shout \"Hey Moona!\" all you want--I do it, too! When Pekora's stuck on some complicated redstone piston automation concept, feel free to suggest asking Moona's help, but if Pekora is not responding to that recommendation and intends to solve the problems herself, please respect that. I'd like to believe most of you guys are simply having fun and \"harmlessly\" memeing, but frankly the spam has become bothersome.", "It has literally gotten to the point where it's becoming annoying seeing the spam. \n\nThat said, what you or I say matters little in the end, for as long as the streamer in question, Pekora in this case, continues to respond to such calls, validating the aforementioned spammer.", "@Amadeus Aye, that cool-off is ultimately what I'd want to avoid seeing, because I actually enjoy Pekora and Moona's interactions.\nMoona has also hinted it on Twitter that she only wants to hear \"Hey Moona!\" when it comes to Pekora herself, not from Moona's live chat spams:", "Is it really that hard to get new jokes? Like it's just so tiring with this and like how much you see \"ara ara\" and all the other garbage that we''ve already seen before plenty of times.", "@AHHHEYGAO yes, those Hey Moona spam is so annoying, i started to report and block them. They are just going to ruin the natural interaction between them and ultimately lead to the cool-off as you said. The funniest content is the natural interactions, not the forced one.", "@AHHHEYGAO Of course, Pekora could easily embrace the meme like how Rushia does with her pettanko spam, but judging from her self-conscious greetings to Moona - erasing the hey and replacing it with hello - just screams social awkwardness (and the discomfort (?) of having to fulfill her fans'  expectations).", "You are not gatekeeping, THEY ARE backseating. I believe their exposure to english audience have reached the kids. It's very common on twitch, number one cancers in all streaming platforms.", "@Amadeus  yea...The Hey Moona is so forcibly that i almost found it not funny anymore...", "@Tyjones D Lol, twitch chat at least knows what's going on and stays on topic most of the time. And the emote spam is better than the constant \"boing boing\" and \"hey moona\" spam.", "@Amadeus Moona already got tired of the spam and told people that she only likes it when Pekora says it. But her relationship with her audience is different, but not necessarily a bad way\n\nBut Pekora is very protective of her  audience, she only lays the hammer when it affects other people like nousagis spamming Peko in other streams or that nasty prank, tricking her into  believing that flare was injured", "@Eduardo Hernández Not to point fingers, but most of the Hey Moona-ing came from users with roman characters, meaning they were more likely foreign viewers (of course, I might just not be able to recognize Hey Moona in Japanese - if so, please correct me). Thus, the additional language barrier might also play a non-insignificant role in whether Pekora were to actually decide to do something about this - after all, being the person that I think she is, I doubt she could easily scold her audience, moreso when differences in language might cause unwanted misunderstanding.", "Dammit, I was in the \"stop telling people what to do\" camp, but people are really overdoing it. And it's the same with Rushia's pettanko joke. It's been overused to the point of being annoying, when literally EVERYONE constantly spams a meme, with complete disregard to the content on screen.", "@Amadeus Normally I'd use something like the text (and usernames) as a rough indicator of demographics, but in this specific instance I don't think that's reliable since the original meme was in simple English and that even Japanese viewers would be typing it in English.", "The chat asked her to make a maze to throw off suspicion, she made a straight up horror dungeon crawler.", "I hope Moona knows about the trap at 1:42:45 because she's taking a couple HoloEN girls on a tour tonight.  This could get REAL funny REAL quick.", "Yeah I'm hoping Moona will lure them to all the traps in the server lol", "aaaaaaaaand they got caught in the trap lol", "She did fall in the trap with the holo EN members lol it was a fun trip", "@sunnyDlight123 I see you guys also just watched the stream lol", "@AYAME'S GIGGLE VIRUS yuuuup! as soon as i saw the building I instantly remembered this comment xD was a fun stream", "I wonder if in that last dead end she will decide to put a jack o lantern to extra spookiness", "52:00 poipoipopi", "Thank you for the stream Pekora! Tensai Usagi!!!", "I wanna see ENGLISH SUBTITLE :>", "Does she have any creeper heads? She could make an armor stand with a creeper head and green armor for one of those tight corners to add another scare.", "build yesterday and today already claimed 3 victim", "1:21:24 ??? How can a livestream do this? Edit: The stream crashed apparently.", "Her trap & contraption sure are evolving. From pumpkin cake house to this.", "That was a beautiful prank trap house build.\nBut her poor voice.", "Looking foward victim compilation  ", "Her hat is floating just like tree", "The best candidate to test the trap would be Subaru...", "Essa música de fundo nunca muda kkkkkkk", "💖🐰💖🐰💖", "2:20:55 aaaaaaa", "1:42:38", "01:19:44 Hello Moona", "The vid is broken? I cant start from the beginning. Can only start at around 1:55:20", "Little Guide for new viewer who seeking about *Pekora Story*\nhere some keyword you can search for her **mischievous clips**:\nUsada Construction, \nPekora Halloween trap,", "ちなみに人は「発狂したから声をあげる」のではない。\nストレスに耐えきれなくなったときにストレスから逃れるために声をあげるのである。本当に発狂しないために。", "Happy haroween peko", "The subtitle auto-translate isn't working for English, and I have no idea what she's talking about. But she's so cute, I still enjoy watching her. LOL", "Smort Peko", "That hat tho 🎩", "Selesai", "wheres moona! xD", "Anyone know the full context and reason why her voice is bad? Is it just cause of the singing yesterday\n\nIs something wrong with her to have to go to the hospital", "I hope Moona will lure the HoloEN girls to this trap.", "They all got lured in", "1:39:07 Italian ~faq~", "Uh why is she wearing a poo hat?", "Jkkkkkkķkkkkkkkkkkk manooo que issoo", "Hey moonaaaaaaaaaa", "Who else came here when Ame, Gura, and Moona fell into the trap?", "https://youtu.be/2q82bGtujFA v", "しかしなぜ強襲突撃型トーマスの動画を…？", "Moona first victim", "She's becoming from being bullied to the horror itself. Im scared now ", "это точно Сатоко 2.0, если вы понимаете, о чём я...", "PEKOORAAA Senpai, Moona Gura Amelia, yararetaa the sorrow dungeon. they stream this morning!!! yey!", "i came here beacuse moona, watson, and gura was got trap"]