["English version.\n00:02:14 Rats start.\n00:03:14 The song.\n00:03:55 Apple pencils, which I bought by mistake, as a present for my mother.", "Thanks!", "Thank you Good Samaritan", "Arigatou , one of the only things that I know in Japanese.", "You are good person", "Thank you so much !!! You are awesome !!!", "Holy cow nj", "ちゅーちゅー言ってる長がかわいいのでもう一回観ます\n\n対よろ", "ねずみランドの刺客。独断と偏見の時間割。\n00:02:14 ねずみスタート。\n00:03:14 お歌。\n00:03:55 アップルペンシル間違って買ったやつ母親にプレゼント。", "いつも助かるぺこ！", "最初から最後までネズミになり切るために\nちゅーちゅー言ってる姿がめためたかわいすぎた・・！", "なぜかゴミ箱で無敵状態になってるのシュールすぎてめっちゃ笑ったぺこw\n逃げる時のちゅちゅちゅちゅちゅ〜もかわいかった🥰", "ふざけてるけど面白くて\nかわいいぺこーらもいっぱい見られる素晴らしいゲームだった", "ちゅーちゅー言ってるぺこーら可愛すぎたからアーカイブで2週目も見ようと思います。", "楽しかった～！良いバカゲーだね～！\nちゅーちゅーぺこーらかわいい！流暢に使いこなしててさすがぺこーら！ぺことちゅーの語尾渋滞面白かったｗ", "おつぺこー！ちゅーちゅぺこちゃんがただただ可愛い配信だった…！！こういう謎ゲーもいいぺこねー！！", "ぺこらちゃんサムネ最高に可愛い好き", "おつぺこー！ちゅーちゅーぺこちゃん可愛すぎて無限に見れる！\nぺことちゅーのコンピレーションが素晴らしい！", "ネズミが毒はいたり駆除人が魔法使いだったりボスの動きがすごかったりで楽しかった！\nちゅーちゅー言ってるぺこーらかわいかったしこの調子で街を制覇して欲しい！\nクラバン案件もおめでとう！\n明日が楽しみ！", "いたずらしたり人間にびびり散らかしてるぺこら面白かったし可愛かったw", "ちゅーちゅー可愛すぎた…!!沢山笑わせてもらいました！またこういったバカゲーやれるといいね！", "長の「ちゅーちゅーちゅー！」という語尾が可愛かったw\nいつもと違う語尾が聞けて楽しかった！\n\nにしてもこのネズミ…とんでもないなぁw", "可愛くて面白かった！！\nまたこのゲームやってほしいです！", "ちゅちゅー、ちゅぺこ言ってるぺこーらの可愛さとは裏腹に、やってる事が結構えぐくて草\nぺこーらのイキり、命乞いが久々に見れたからこれは間違いなく良ゲー！\nぺこロードをガンガン広げてこー！\n楽しい配信ありぺこでした！", "00:05:25   これ渾身のダジャレだと思ってた", "ネズミに倒される人って・・ｗ", "この人相変わらず新しい名言言ってるなぁw", "ぺこちゅめちゃかわいい！", "語尾のちゅうが可愛かったから「ぺこーらげんきでちゅう」というちゅうちゅう言うぺこーらとマイクを通して会話するコミュニケーションゲームを出してほしい", "天才か!", "ねずみぺこらいいなw チーズ食べるにぇwww偶にうさ耳取り外してもろてネズ耳つけてもらいたいwww", "ねずみになったと分かっているけど、チューチューと聞いてドキドキします。", "自ら見つかりに行ってるの草", "ちゅちゅにゃぺこ", "サムネ最高にかわいい", "18:45毒にんじん", "こんにちわ！", "ちゅーちゅー可愛かった！\n確実に見えてるはずなのにゴミ箱が安置になってたり、見えてないはずのベッド下にいるのに攻撃されたりと謎の行動が多かったｗ\nボス戦？は戦い方がわかったらすぐだったね～", "🐰こんちゅうちゅう", "にーんじん", "おい！人間出てこいぺこ！", "ちゅーちゅーぺこー😄🐰🌟", "The way she rolls her R's is a joy", "ペストはやばいですよ…ペストは！！1人だったらなかなかやらないようなバカゲーでも、長の配信だと楽しいwクラッシュ大好きなので明日の案件期待してます！！° ✧ (*´ `*) ✧ °", "ふわ！ふわ！", "ぺこら、そんなに俺とチューがしたいのか!嬉しいぞ!!", "神ゲー", "ド・アーモンド・アモ", "東京の下水でコロナウィルス感染したねずみが~飲食店を徘徊するぺこにゅ🐹?", "卯🐰、丑🐮と来て、子🐭…\n十二支コンプ目指してるぺこ？", "She had a lot of fun with this game", "Ogey, rrat", "8:08 Ratto Shimurator", "Pekochu for Smash.", "Crazy rat chumedian", "Where's timestamp kun", "give him time", "Hang on", "or become one yourself", "8:07 rrrrrrrrrrat", "Pekochu suprisingly turned out to be too cute lol", "A NISMAN LO MATARON", "This was a great stream !", "こんにちは ダイスキー hehehe😊❤", "rrat", "ogey", "ogey", "ogey", "ogey", "ogey", "Ogey", "ogey", "ogey", "Ogey", "I luv her~♡♡", "The guy in the beginning of the video \"hello!?hello!?\"\nPekora \"parrdun?\"", "1:14:23 XD", "This is THE UNIQUE CONTENT we alllll want to see.\n\nA smaller rabbit.", "Nothing lat, human", "Not gonna lie, Chukora was way cuter than I expected.", "pekorat :)", "1:13:41 XD", "I like the parts when she said \"Chu!\" and \"Peko!\" :o)", "That was an amazing experience. A perfect blend of pekochu. There was action, suspense, comedy, ecchi, and even drama (ie. rescuing the little sister and everything)", "pekochu!", "2:02:59this is the power of HKD$8", "Voice acting from exterminators is hilarious", "Pekora laughing everytime she poisons a human tho\nLmao", "Thank for the fun stream, Pekorat.", "Pekochu sounds like Warechu from Nechunia series, chu.", "She did it, she played the rat game", "Pekora playing rrat Simulator? Ogey!", "konchuchuchu~", "Sadly no more onscreen chat..", "Thanks to CCP", "This year is working extra hours to make things worst", "This is named metamorph from Rabbit to Rat", "I will never get over the security wizards casting flames.", "Therapist: pekorat isnt real it cant hurt you\nPekorat: ORA!", "i never know there's a ratatouille prequel movie where the rat is fighting avatar and fire bender army", "I OVERSLEPT SO I MISSED THE STREAM NOOOOOO", "Came for the R.rat stayed for the chuchu", "I love way she drags the r", "ogey", "rrat", "Ogey. RRrrrat!", "Dang i missed this.", "Ratsada Chucora", "Yabai Chuu: A rat like rabbit pokemon.\nSpecial Ability: Smug rabbit - 1000% boost to confidence, courage and smugness, \nas well as taunting every creature within the immediate vicinity.  \nSide effect: Decrease in intelligence and incur Divine Punishment.", "Guys i like the fact...\nI really not good at japanese i just know a bit from some animes\nBut whenever pekora saying something i think for no reason i understand what she says\nI have no idea but it works", "ITAI PEKO CHUU", "Acertado pekora", "I was watching from the beginning. After 30 minute of stream, I feel sleepy and decide to sleep. When I closing youtube, Pekora ended the stream. Silence for moment... First thing i thought was \"Pekora stream kinda short today\". Hate how I love my way of thinking now 😭", "Venha no meu trenzinho,também estou atrás de comentários brasileiros:^", "ogey", "rrat", "Ogey", "rrat", "Pekorat", "ogey", "Tarde pero seguro", "", "ogey", "rrat", "rrrrrato", "Rrrrrrrrrrrat", "rrat", "I just love life.. . . And vtubers 🤑", "Pekorat", "Ogey Pekora", "ogey", "rrat", "Hi", "Pikachu comedian rat cousin. Pekochu", "Noice-peko"]