["I was lucky enough to join, I played Pac-Man.", "English version\n00:02:34 Start of the tea spill. I am confident this time!\n00:04:38 Ohoho.\n00:05:00 Poem.", "Eiyuu", "A few mistakes:\n\nJosie -> We also call him \"Yoshi\".\nRuffle -> We call them \"Robin\"", "@Anton Namtet Actually Robin's name depends on the localization (not all western countries use the same name), the Spanish localization change their name to \"Daraen\" ^^u", "@Anton Namtet \nThank you for pointing this out.\nThere is no end to the amount of detail that can be corrected, so I'll spare you the correction itself.", "Thank you for the this!", "秒速のぺこら。独断と偏見の時間割。\n00:02:34 お茶こぼしスタート。今回は自信あり！\n00:04:38 おっほっほ。\n00:05:00 ポエム。", "ありがとうございます。\n\n中でもスタート時間が助かります。", "@プルプルンゼンゼンマン \n次までの時間なくて雑っぽいTSだけど、こちらこそありがと！", "53:33\nCan’t believe I was blessed enough to play against Pekora on stream; GG - I was the Isabelle :)", "you got a nice isabelle", "still that one lost of the stream :/ , not bad tho", "@LopoloEleven H Ya well, these kind of things happen, especially with Hero", "@daniel vu Thanks!", "今回強敵揃いの中、一勝できた時の喜び方がかわいいのなんのって…！！\n長はもっともっと強くなる…優勝狙っていこー", "前回のスマブラ配信は予定があって来れず\n今回は入れたと思ったら部屋落ちて2回目入れたと思ったら直前で終了…\nさすがに心が折れた", "She's lucky there was no 'Steve' players.", "たかが一勝されど一勝！\n負けたときの悔しがる姿はさることながら、勝った時の喜びようはかわいいの一言！\n実力に関してはまぁ…うん\n大会まで1週間(かな？)、猛練習すればまだチャンスは！", "1勝を勝ち取ることができたし、前より確実に成長してた！ただ今回も相手が強すぎたねｗまだまだ練習の期間はあるから、少しでも最強に近づくことができたらいいね！", "長のこそ練の成長を感じられた回！\nぼこぼこにされがちだったけれども勝ったは本当に嬉しそうに喜んでて\n可愛らしかった🐰", "30:20 イキリからの唐突の自殺", "ボッコボコにされててもすごく楽しそうにプレイしてるところ好き", "めっちゃわかる", "練習の成果はわかるぐらい出てたよ！…でも相手が悪いねｗ\n最初より最後のほうが上手かった気がするから戦いの中で成長してるかも！？\n3期生大会も楽しみだしまたスマブラ配信あれば嬉しいな！", "すばるの歌と同時に始まって迷った結果すばるをBGMにスマブラ見てたけど\nすばうの歌声と選曲、ペコラの絶叫とか雄叫びが相まって時々「めちゃくちゃ合うやんけ！！」って場面があって新鮮だった\nワイに動画編集の才能があればMADにしてみたかった", "おつぺこー！前よりも上手くなってるし良い感じー！！この調子で3期生大会も頑張ろう…！1勝おめぺこー！！", "00:58:45 のゴデアです。\n対戦ありがとうございました！\nぺこらちゃんとは初対戦だったのと配信のラストだったので何か変わったことをしてみたいと思い、電気技なし縛りで戦ってみようと思いましたが、さすがに無理がありましたｗ", "やはり野うさぎは強かった\nでも前より戦えるようになってるしぺこーらもどんどん上手くなってきてるね！\n勝った時の嬉しそうなぺこーらがたくさん見たいから応援してるよ！\n練習頑張ってね！", "だいぶ上手くなったよ！練習の成果が出たね！\n勝った時の喜び方すごく可愛かった！\n3期生大会楽しみにしてる！ファイト！！！", "一勝が練習の成果の証！3期生大会までに仕上げて行こうぺこ！", "見事な一勝おめでとう！！！楽しかった～\n県大会のみならずワールド大会まで…野うさぎつよつよぺこｗ\n3期生スマブラ大会がんばってね～！", "48:55 アップロードしてて草", "46:17\n挨拶はしないよ\n強者感", "スマブラ練習おつぺこー\n前回より明らかにうまくなってたし三期のみんな相手ならワンチャンあるで👊\n大会では幸運うさぎの力見せつけてほしいぺこー！😄", "練習したのは伝わってきたよ😊もっと練習を重ねよう！まだまだ強くなれるよ！！", "練習おつぺこー！\n前よりずっと上手くなってた！\n野うさぎの壁は厚いけど、練習相手になってもらえば大会優勝も絶対出来るぺこよ！\n勝っても負けても楽しそうなぺこちゃんだから、大会も全力で楽しんでね。", "ぺこーらのスマブラは毎回最高に面白くて相性が良過ぎる！！", "回避とシールド忘れてて草", "最後のかわいい", "ばいばーいエンディング！あっもう終わってるわじゃね〜\n\nかわいいぺこ", "ぺこーらの喜び方可愛い", "3期生大会はよ！！", "勝ったときに大喜びではしゃぐのかわいい\n1勝おめでとう！", "オゥラの言いかた好き", "今回の配信も楽しかったぺこ！\n長とスマブラやりたいけどスイッチもスマブラも持ってない、、、\nライブのチケットと物販も欲しいし、、\n頑張ろう", "県大会並みのリスナーさん達と戦って一勝出来たのはとても大きいと思います！まだ時間もありますのでこれからも練習ファイト！", "対戦開始\n13:00", "2～3分のタイム制にして、いくら落ちても大丈夫なようにしたほうが良いと思う。\nあと、もうちょい動き練習させてやれｗ\n何もわからずストック削られるだけじゃあ、何をしていいかと考えるまですら行かないぞ。", "やっぱシソニキのプレイ好きなんだワ。\n大葉ニキ出てこなかったのは残念だけど、、、\nいつかぺこーらも大葉ニキ出せるように頑張ってください（笑）", "ぺこ虐たすかる", "愿天堂没有脱轨的独轮车", "目の前のアイテムすら取れないのかい・・", "魔界村クリアできる割にスマブラはあんま上手くないんよな\nちゃんと練習すれば強くなりそうだけど", "タイプワイルドじゃん", "ぺこぺこぺこ", "ガノンは、弱いよ", "3期生スマブラ大会頑張ってくださいね！\nあくあ氏普通強いので鍛えてもらうといいですよ。", "関係ないけどカレーメシ届きました。\n美味しかったし良い曲でした！", "長が着実に上手くなっててスマ勢ワイ歓喜の涙を流した…\n勇者は逆転のチャンスたくさんあるキャラだから取れ高期待してる\n\nもし読んでたら参考にしてください！", "どなたか「うーぺー」の由来を教えてもらえませんか？\nネットでも調べたのですが見当たりませんでした（ ;  ; ）\nにわかの野うさぎですがお願いしますm(_ _)m", "うさだぺこら→苗字と名前の頭文字とってうーぺーなだけでぺこらがゲームするに時によくつける名前なだけだったかと", "@おっ ありがとうございます！！", "34:48 OREE", "Doing gods work.", "ogey", "兔书记，爱了❤️❤️❤️❤️❤️❤️❤️", "Despite being wrecked every match she keep going, i love her for that", "When you couldn't make it to the stream so you watch all the ads to support future war crimes.", "I missed my quiz bcoz of this stream but I don't care!", "NOOO I MISSED A SMASH STREAM", "Ain't no one going to tell her to go for ledge?", "The spilled tea is legendary", "Pekora spamming PK Fire like a true Ness main", "1:02:13 damn!!!", "I'm kinda sad no one picked Steve but it was still pretty fun!", "bruh why is everyone so sweaty", ".-.", "Sugoii look 1:00:33 Pichu is so op lol", "So i think why peko-chan lost cuz this is pain peko indeed!", "I don't know how good are the others Gen III girls at this game (there are too many VTubers in Hololive that you can't follow them all, the day has only so many hours...^^u) but if fighting CPU is the only training Pekora does for the tournament... I'm worried about her performance and results ^^u\nOh well, I hope that at least she can give her all and feel proud of herself afterwards.", "Aqua is the only other Hololive Vtuber I know that plays Smash. She's been using Steve since his release, and she's surprisingly good."]