["Okayu : kills Pekora\nFBK: reports\nOkayu: OH NO PEKORA! (monotone)\nPekora: The Audacity", "this only cements that okayu is an absolute chad", "Okayu has the personality of a perfect impostor", "@Fossil Fountain her demeanor doesn't change AT ALL whether she's a crewmate or impostor which is awesome", "Whats the time stamp?", "41:58", "@BillMaxPG. Weeb legend", "Okayu is good in speaking her way out as usual XD", "English Version.\n00:02:11 Start.\n\n-Introduce yourself.", "An absolute hero", "Careful, he's a hero", "Ur a god", "King, you dropped this 👑", "What an absolute chad", "E P I C", "Thank you kindly, strangah!", "the legend himself", "The chad of chads.", "I am in tears right now", "Why do they not use the Japaneseization patch?", "@Alex Hong whats a japaneseization patch? \nIs it the 日本 language?", "@UMR navY the comment's trying to say why they didn't use the japanese mod of among use", "@Hello, This is my opinion: ohh i see, i didnt know there is such a thing. i thought the game is updated with Japanese languaghe", "Talos bless you", "@Alex Hong Probably because of what happened with Nijisanji?", "@Otaku One What happened with Nijisanji?", "Pekora Crewmate: Dies or gets bullied by the others in round 1\nPekora Impostor: It's suspicious that Pekora is still alive!", "It is so easy to blame Pekora! Even when she argues her case, she still sounds suspicious, no matter how convincing her words are!", "@Rurika Adachi that chaotic personally will pray up later if they keep playing", "@Abel Guzman I would love if Pekora becomes the next Pikmin 4 or similar wildcards. Tough she may do it accidentally.", "Most of the prediction before the game, \"pekora will be voted off 1st\".\n\nShe did got voted off 1st, lol", "dude, botan and so many others were right beside pekora when the first vote began, she had like 4 people, but she still got most votes. RIP pekora", "And Towa still do task when being an impostor", "ahahah yeah I was think the same", "@AYAME'S GIGGLE VIRUS As expected", "I hope they will play again in the future.. This stream more like practice stream, because they are 1st timer and still confused with the overall control. (Even Pekora find hard to swipe the card and report the body. LOL)..  \nIn earliest match, they still indecisive with the vote, still Yes Man mode..  But the peak of the fun was the couple last match, when they tried to eat each other.. Like Pekora blame Towa instead Okayu.. LOL", "i hope they dont talk with each other during the gameplay and only in discussions", "@Link3000XD did u have watch full stream?", "@Egie Erland i did not catch the stream, i skipped a bit through it. as far as i heard it is a test stream, so maybe thats why they talk", "@Link3000XD only the first match is a test, the rest is pretty much standard.", "@xelasneko ah nice~", "It's gonna be chaotic once they got used to it....they are even polite on this stream lol...they didn't vote at all on the first half....they only just reporting and not throwing any blame", "pekora said she want more at the end", "Can't wait to translate this!", "Kamisama", "This madlad", "Thank you uwu", "Please", "LETS GOOOO", "ありがとう 神様", "Please do!", "Careful he’s a hero", "Translate full video :v", "Yes", "I need it badly youre a hero", "KAMI SAMA", "I click on your channel and I see that that I’ve already watched quite a few of your videos. \nI should just follow already >:)", "❤️❤️❤️", "THE PROPHET HIMSELF SAID IT", "KAMI SAMA", "Pekora can't seem to wash her hands of past sins. Her reputation echoes across time.", "Flashback of PekoMiko's MC wolf game antics", "One must pay for the sins committed", "that one guy : YAGOO sus", "Okayu was born to be an imposter.", "今日の兎は狩る側か狩られる側か！？独断と偏見の時間割。\n00:02:11 開始。\n\n-自己紹介", "Congratulations man you're fast", "タイムワープしてきた？", "ありがとうございますぺこ！", "JP Bros are speed peko", "Thank you very much as always!", "👍", "リアタイで見れなかったから助かります！", "トワ様がついてきてる感じがしてまさかね〜って思ってたら本当にやられて笑ったぺこ\nみんなで圧をかけながら話し合ってるの見るの楽しかったw", "Today's going down in the history books, boys. These archives are a content gold mine and this is just the beginning. \nThanks for this Hololive, and to all the clippers/translators in advance. Multi-perspective clips are no small feat\n\nI had 4 streams per screen open for this using holotools, but it was impossible to focus on everything happening. Time to rewatch the others' perspectives!", "14:51 wait... The meme was true? XD", "It became full circle. She is the first and the last", "it was practice, and who is the best person to bully? pekora of course", "Always has been", "Lol", "Pekosus xD", "Era la impostora", "@shiro kuro no lo era xD", "Pekora almosttt won at the end there , so close ! \n\nwish they would play this game again peko", "I knew when Pekora killed Okayu that she was gonna lose. Noel and Nene seemed like they were together and Pekora is the only one unaccounted for in that scenario.", "What she could have done was try locking one of them out and try to claim it was a self report.", "Exactly, the girls arent good at mind game, they need to play w/ Suisei", "@Hikku Rikku I don't think they're not good. Its just that this is the first time they've played so they're still trying to figure things out. Sometimes you don't think too much when playing new games, Pekora basically killed Okayu instinctively.", "Now we need a hero to translate the whole stream", "ぺこトワの絆も3期生の絆もしかと受け止めました😂😂", "いかなる状況でもまずぺこらが疑われるのホンマ草", "I saw this pop up in my feed and immediately said \"Uh oh\"", "33:19「タスクやってましたペコですぅ」\n何か違和感すごくて笑った", "Finally, they decided to play this. Please play again, this is fun!!", "1:26:09 とかたまにギスギスするところすこ", "ミュートにした途端にいつものテンションで喋り出すの可愛い", "神回！！長、トワ様、参加してた方々お疲れ様でした！！皆それぞれの圧があってドキドキしたw第2弾期待！", "33:19\n可愛すぎるだろどうした", "Damn, I missed it... welp, time to watch the vod", "heh I missed this stream too", "狼じゃないのにチャットでぺこら怪しいって流れるの草", "Looking forward for the Part 2 😭", "単独行動危ないといいつつすぐ一人になるぺこーら面白かったｗ\n生きてる時も幽霊になってもせかせか動いててかわいかったよ\n人狼の時あとちょっとで勝てそうだったのが悔しいね\nまた次があれば嬉しいな！", "24:53 何故か団長の声のトーンですぐわかるww", "最後にねねちを味方に出来ない\nあたり絵に描いたようなぺこ虐\nみたいでめっちゃ笑ったw", "みんなから狙われやすいの笑える…w", "くっそ面白いwww\n第2弾待ってます！", "Even she was killed peko still sus", "団体行動といいつつも単独行動になりがちで犠牲になってたり、やたら疑われまくってるぺこちゃんが不憫でかわいそかわいかった！w\n最後は3期生の絆とは？とバチバチしたり後輩を巻き込んだりでめっちゃ面白くて笑ってました。\n次は生存で勝てるといいね！", "Mission Failed, but we'll get them next time peko\nAll in all, great stream though", "待ち時間にウロウロしてるのも可愛かったです！", "面白すぎ！シリーズ化求む❗️", "みこちが作ったサムネでぺこらがセンターなのホンマにてぇてぇ…\n拝んどこ…(-人-)ﾅﾑﾅﾑ", "(みこちが全員分サムネ作ってて枠主がセンターになるように配置してるだけだよ)", "@ああ \nマジレス飛ばしてきてる…\n分かってないんやなぁ…(´・ω・｀)", "おかゆのセンスがありすぎる", "AmongUs見るの初めてだったけどテンポ良くて楽しい！\nトワ様とやってやり返された後の組み合わせとかぺこーら団長の3期生バトルに巻き込まれるねねちとか色々面白くて最高だったｗ", "トワ様の先輩だぞ！は腹がよじれるぐらい笑ったｗｗ", "幽霊になってからも面白い！良いゲームだった😊ぺこらの独り言よかったで…", "純粋に楽しんでるぺこら良きｗ", "団長、かっこよ", "笑聲真的好可愛www", "バチバチやりあったすぐ後にワイワイ話せるのって良いなあ", "アクアとの試合で彼女を見たことがない。", "When in doubt, always blame Pekora", "Literally Among Us but with cute anime girls .", "That one yellow guy\n\nRN about flexing to his friends how he appeared on a livestream", "33:18 「タスクやってましたぺこです( ˙-˙ )」", "人狼での勝利惜しかった…\nぺこらと団長の圧に挟まれるねねちゃん…ｗ\n団長はどっちにいても強かったねぇ", "神回！", "最後のはやるタイミング悪すぎたｗｗ", "ぺこらvsノエルの最後のバチバチは熱かった\nヒールを演じきったぺこらに拍手だよ！", "ぺこーらも楽しそうだったし、視聴者も楽しめたし、\n良い企画でしたね。\nぜひまたやってほしいです。", "Waiting for jeh 1 debut", "1戦がそんなに長くないのにしっかり推理や人狼してて面白かったー！！\n楽しかったしまたあると嬉しいな", "面白かったけど最後惜しかったぺこな。おかゆん釣りたかったなぺこなー", "このゲーム面白いねー！\n長もずっと楽しそうで、こっちも楽しかったぺこー", "みおーんの名前がムーナにみえてて？？？ってなってた", "Among Usすごく気になってたので見れて本当に良かったです！みんなでワイワイやっててとても楽しかったです。\n長も最後惜しかった！またやってくれるのを楽しみにしてます！", "面白かったぺこー🐰💪", "コンパクトにできるゲームなのか、長の真っ直ぐなところがみれて面白かったよ。またやってほしいな", "くっっっそ面白かったぺこ", "ぺこーらの人狼ゲーム面白すぎる\n最高", "新しいねね虐？？🤔", "Wish the devs would add a Japanese language option tho so they would understand the game much easier.", "トワ様を身内切りしないでおかゆに擦りつければ勝てたかもだね\nあるいは身内切りがリスキーということを盾にすれば最後ねねちを味方に付けられたかも", "あー、最後は団長に罪をなすりつけるしかなかったけど、ねねちも一緒に居たから詰んでたなこれｗ\nやっぱ、あのタイミングで○るのは悪手だね。\nどうにかタスクで勝つしかなかったわけだｗ", "最後惜しかった～！ちょっと焦ったね！\n初めてこのゲーム見たけど、みんなでワイワイやるの楽しそう！\n見てるだけでもすごく面白かった！", "人狼になった時、惜しいところまで行けたねー！やっぱり狼系の役職のぺこちゃんが生き生きしてる…！コラボ最高だったぺこー！", "Chances of winning as impostor dropped to 0 as soon as Towa was ejected.", "人狼勝利まであと一歩…!!惜しかったー！でもぺこちゃんのプレイングにはめためた魅せられたよ！楽しい時間をありがとうー！", "38:36", "En internet hay muchas momentos épicos\nEste es uno de ellos", "I was wondering why they not playing this tho\nOmg can you imagine if they played phasmophobia in an English only stream lol", "I saw some vtubers play Phasmophobia and they ruin it by using the discord audio chat instead the ingame audio.", "@Junmitis damn.. what a waste.. it'll be fun to watch if they play in game voicep", "Probably because of the rumors that this game use peer to peer which reveals their ip address which is dangerous but there's no proof of that and just a streamer mistake", "@Just EIJI so i guess they just take the save way", "@Junmitis whats the differents when using discord and ingame voice while playing phasmophobia?", "@DherizDo in Phasmophobia, voice chat is a very important tool that heavily affects gameplay.\nFor starters you have proximity voice chat, that gets quieter as the person moves away from you. \nTo talk with people who are far from you, you have to use the radio. And the ghost in the house can disable that funcionality, which makes you panic if you are alone and no one is answering you.", "@Junmitis oh i see i see, its the same like among us then but with more horror oriented", "I need more Among Us peko", "Good luck for translator, we counting on you...", "The best among using comes from South Korea.", "noo i couldn't make it in time D:", "It sucks man! I woke up at 4 to catch it, but I am paying for it now at work. Oh well", "Too bad Miko elite wasn't here...", "She will be, some day", "soon™", "we willl see in some day... still waiting for her elite comeback", "And suisopath", "PekoMiko as imposter?oh everyone ia dead", "she was in spirit. the thumbnail for the stream was made by her :)", "1:12:46", "When Noel fakes Hand scan reactor... RUN RABBIT RU-!!!", "YOO POGGER!", "I love the game among us i hope they gonna play it again and stay safe you all", "Can someone translate this whole stream?", "I wish they increase crewmate's vision because it's hard for the crewmate since impostor have 1.5x vision in this", "No, 0.5 vision is more ideal so that Impostors can be sneaky.", "@Hashimoto Syobai Yeah but they're only playing with 8 people. Impostor only need 4 kills to end the game. That's already an advantage for the impostors. Plus they rarely vote off person first round. They're making it too easy for the impostor", "Lmao. They got defeated by a sabotage in the 1st game.", "ha!!", "Our home computers could only play up to 4 windowed videos before chrome starts to eat RAM. \nGood thing, we have 2 of those", "Who... asked??", "@OmegaLUL no one", "Pekora always get suspected by other members😂", "1:27:07 Rap God Pekora", "Damn what time do they go live", "個人的に雪山の方が好きやなぁ", "Suisei next plss.......", "圧倒的に最初に疑われるぺこらと、人たらし力を最大限に活かすおかゆ。\n基本清廉潔白なぺこらが疑われるのがぺこららしくて逆に好感持てる。\n中身自体は面白いけど、疑わしいのは釣らないと勝てないよね。ゲームとしての下手さは目立つかなぁ。\nでも、ホロライブの可愛い子達がキャッキャ楽しんでるのはそれはそれで楽しいから良い。", "Imagine not being sus of pekora lol", "。　　　　•　    　ﾟ　　。\n　　.　　　.　　　  　　.　　　　　。　　   。　.\n 　.　　      。　        ඞ   。　    .    •\n •   pekora was an impostor　 。", "The girls aren't good with mind game yet. Skipping too much and they don't find it strange that someone is jumping to conclusing and blaming other ppl. Bring Suisei in and play with her <3", "Merah keluar ventilasi didiemin jir wkwkw", "Man it's so short I was expecting 4 hours and I wish this game can handle more people so we can have more people in the game", "Not the yagoo virus", "If it allowed more, it will be chaos.", "I wonder why Miko is in the description of everyone's in this collab.", "She made the thumbnail", "She created the thumbnail", "It says she made the thumbnail of this stream", "I was wondering about that too", "Miko the one who create ALL the thumbnails", "I think she did the thumbnails", "she's the one who make the thumbail for each participants", "She made the thumbnail.", "She was made the thumbnail.", "You might not know this but she did the thumbnail", "She made the thumbnail", "Thumbnail made she the", "The thumbnail made she", "tombunel miko do peko", "tbh, its hard for human to have 2 impostors with only 8 players", "How to add a English subtitle pls", "Pekora is always sus no matter if she's a crewmate or impostor.", "Poor Fubuki didnt even get a chance to be the imposter and Mio dies immediately her only imposter round  after getting framed for her partners kill.", "lol", "That was pretty damn fun!", "I hope there is more soon ahahaha its so fun. I ll see from other friends perspective ahahah it will be interesting to see their reaction", "Is this live or recorded?", "Was live", "@WWfire aight thanks", "最後苦しくなりすぎて普段の団長なら～っていうメタ読みを理由にしたのがアカンかったですなぁ～。\nあくまでもゲームの中でのことで弁明できる人狼が強いんやなってトワ様とぺこらを見てて思いました", "36:09", "Sad Pekora no win at the end.\n(why is Miko in desc.)", "She made the thumbnail.", "@WIROSASONO ah thanks", "clueless peko is cute af im dead.", "Man, it was a perfect setup to accuse Okayu of killing Fubuki and Pekora and Towa totally blew it!", "Everyone gangster till Susei and Miko joins", "\"Fubuki contribute nothing but anime voice.\"\n\nActually she might be a strong impostor tho... (Project Winter flashback)", "1:02:45 Towa sama will remember this\n1:06:20 Towa sama payback", "They could've won that in the last one xD", "Lol", "Here comes the clips", "PEKORA AUTO IMPOSTER\nBUT IF NOT IMPO: THROWN OUT OR DIES..", "Pekora and towa can win instantly  if they faking okayu as impostor. But this crazy rabbit for her friend.", "How to have trust issues among hololive members 101", "Faq I missed the long awaited among us stream cuz of school", "They bullied peko 😂", "That last noel vs pekora court room drama", "On another occasion .. I hope all Hololive members play this game again ... because ... I read from your fan club and said \"when can we play together with our idols ..\" .. and only this is game or another game also some can play together ... and for the fan club .... give the other fans a chance too ... Okey ...", "It's not going to happen*. Hololive is aware that playing Among Us with other viewers or open server will bring western or overseas 'cancer' culture and *inviting ANTIS TO HACKING THEIR IP ADDRESS AND DOXXING THEIR PRIVATE IDENTITY. \nALOE TRAGEDY WILL HAPPENING AGAIN IF THEY'RE TO CARELESS.\nHololive already made a rule for member vtuber only play on private server.", "@James White True. Even Coco already mention those issues. \nI'm so glad that they play on private server only.", "on other occasions ... why not live streaming solo and play with the fan club?", "@シャンカイザー even fan club can't be trusted. There an antis pretending fan will expose vtuber.", "just bad idea, also i hate big western exposure", "@Terminator 2 polka did one of those just the other day though", "This game also needs Suichopath, that would be fun.", "among us rewards you a lot less for being good at killing than project winter though", "@David Yang Still. Also, it needs Watamelon so she can say  Watame is not at fault here, right? The great thing is Watame seems to love that line as much as her viewers.", "Also, the Duck would be awesome as well for her reactions.", "Her ping is 75 my ping if i play the game 500 lmao", "I played everyone's stream on separate devices because I could not stand missing any of you. I love all of you!", "Pekora's reputation precedes her. Instant ejection with no evidence from the stat.", "Funar o ser funado EL JUEGO", "50:49", "and now im waiting for hololive id, hololive eng, coco and haachama to playing in english", "Waiting for phasmophobia", "i missed the stream .. i will regret it for the rest of my life", "Best part you all been waiting for 38:40", "Jeh1 tasted the ban hammer of towa-sama", "girls being crewmate", "Fun fact : Both first and last vote during this collab was owned by Pekora.", "I´m interested to see Suisei  as an impostor in this game!", "Watamelon should also play Among Us. Then, she could say Watame is not at fault here, right? And that's how she would win every game because who can blame the sheep after she says that?", "CLIPPEES, ASSEMBLE!!!", "Can't believe I missed this!", "We need more among us Hololive.", "Pekora: Hey towasama let's kill someone in the electrical while somebody's fixing the lights. \n\nreported", "Why they not betray mion!?", ":D", "That ping tho", "Pekora laugh is the best", "Imagine suisei in among us", "Instant Sus", "1:20:15 Pekora pro-gamer move. Kills FBK, self-reports like a boss and throws Towa under the bus", "By ANY MEANS NECESSARY", "https://youtu.be/aj8IQ8lwEfs おもしろい", "The time has come....", "1:20:20 bruh moment", "Game 1\nImp : Botan, Noel\nVictim : Okayu\nImp wins", "(This is 0:00-1:14-24)\n\nR.I.P to Okayu in the first round 😔🙏🏻\nR.I.P to Pekora-Senpai in the first round😔🙏🏻", "Ptmr me perdí el directo mrda", "Gold", "Anyone notice the godlike ping 🤔", "35:25 lol, someone clip this", "Pekora cool peko peko cool", "FINALLLLYYYYY", "Someone give me the time stamp where pekoras the impostor pls", "Around 1:20:00", "7:01", "the impostors are suisei and sora def", "UyeAh that Cat kinda sus", "I want to see a game where Pekora wins as an imposter, cause you know the Smug levels will be off the charts.......sadly, I doubt that will EVER happen.", "pain peko", "She was so near to victory at the end", "Pekora always sus no matter what she does.", "I don't know man Pekora looks kinda sus..", "Asia server is the epitome of lag...i advise come to EU server", "Jeh1, a lucky chad", "1:20:21 la carita de Pekora 😋😋", "Yab", "Do not understand Japanese.... 殘念", "Why noel always impostor here hahaha", "So happy Pekora was an imposter", "hiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiii pekoooooooooraaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "Pekora sus", "ししろぼたん、なんか先輩を友達感覚で見てる女みたいであんまり好きじゃない", "ぺこら最後が下手だったなー。常に殺害現場にいたおかゆだけは絶対に生かしておかないと話し合いで絶対ぺこら吊りの流れになるのは明らかだし、逆におかゆさえ生きてればどんなに堂々と他の人殺したとしても第一被害者の殺害現場にぺこらが居なかった事からやっぱりおかゆのほうが嘘言ってたんじゃんの流れになって話し合いで大体勝てる。人狼力が足りない"]