["Kiara got to be the imposter a lot today; looks like the game's trying to train her to become bottom right!", "So she wants to be like Ame?", "@Unknown Channel next she'll be making jokes about ground pounding our mothers! ... wait, Kiara's the momma bird of us hatchlings... Oh no", "Bottom Left Kiara: No luck with Calli\nBottom Right Kiara: HAREM WITH ALL HOLOLIVE GIRLS", "37:00 \"Don't leave me alone with the white dude!\"\n-Takanashi Kiara, 2020", "Yeah lol", "yabaiiii", "Man... she’s such a ball of positivity and cuteness\n\nLittle reminder for myself at 2:34:40 she talks about her education and struggles", "Oof thanks man", "thanks this was nice", "It is going to be a big shame if I fail to finish my studies and I am afraid for that to happen but at the same time I just wanna enjoy some things and yah Im easily distracted", "@Rasha Mew mood", "@Milo Look what the hecc am doing rn catching up to streams after those days with no electricity", "trade school is what it is called in the US. I had a professor tell a class that college is only for people that want to learn. He said if we really wanted  to make money, college is not the way, and that people who finished some kind of trade school are probably making several times more money than he was", "@D jm hmm naruhodo I kind of get it but I'm still oblivious to some things so my main goal is to learn for now", "@D jm that’s literally one of the best things imo if you hate college but don’t wanna just stop after highschool and find a skill I’d trade school. You can find just as well of a job out of there as you can staying in college for years", "And look where’s she at now. She knows 3 languages (that we know of), and is living in Japan, doing a job of her dreams. Shows what you can do even without college.", "@Smirky Smirkington and she deserves all of it 😁", "@Smirky Smirkington that’s very true she’s also very lucky that it’s worked out the way that it has. Many aren’t as fortunate but you gotta roll with what you got usually.", "Some more lewd/wholesome ship stuff 2:13:23", "21:50 shes so happy lol", "Oh my god that's cute", "That is realy cute laugh not gonna lie", "Sounds like the most chicken thing I had ever hear lolll", "That's happy.....and batshit insane. This woman is a danger to society", "lmao I got killed first while being named PAIN PEKO\nI hope Kiara got a good laugh out of it, love you guys and Kiara~\n\nEDIT: 52:23 for Kiara's reaction, god I adore her", "Are you also the same Pain Peko that was Imposter Kiara's very first victim last stream?", "Pain peko", "o7", "This has been my first and only time playing with Kiara, sorry ^^", "I didn't know there was someone else who used that name the round before, that's why everyone reacted so weird including Kiara\nThanks for telling me, now I feel way less happy about her words\nAt least 49:56 was genuine", "Kiara, you don't have to be alone with someone to kill them. It's an ideal scenario but if you don't have alternatives and you are with two other people you can kill one and try to blame it on the other. Also, always look for the opportunities where you and your buddy impostor are with two other so you can kill them off at the same time.", "Hey Eggo's y'all hatchin? Can't wait for the chicken bucket hahaha", "Where's YOUR egg? You're looking pretty sus right now...", "@NotAGoodUsername360 I am a  lurking predator, waiting for the eggo's to be a chicken bucket HA↑HA↓HA↑ HA↓", "44:15 I love how her German made her confuse \"vent\" and \"went\"", "8:20 Kiara Fans: \"I am speed\"\nSamaritan: \"I want my revenge, but no\"", "Also Samaritan: becomes Kiara's partner", "I wanted revenge, but instead got redemption. Glad I was able to help her secure her first win as imposter!", "@Samaritan the true hero of this stream", "@Jkhmonkey KFP IT Hardware Department #2 I'm just happy to have been a part of another memorable Among Us moment. (o´▽`o)", "@Samaritan hell yeah", "when the pre-chat SCs have their own dense lore", "The way it start is out of the blue tbh , but that's the way of prechat", "@wolfz KFP Health Department Advisor it's like when I hear people talk about Dark Souls lore or something, I don't understand it but it sure is a thing that exists lol", "Where do imposter go shopping? Traitor Joe's", "Found you 🧐", "@wolfz KFP Health Department Advisor you did =)", "@Casual Filth see you in the next one , I'm catching you  😂", "So I've been wondering.... Are you secretely Ina in disguise? So many puns every video!", "@Jkhmonkey KFP IT Hardware Department #2  No... humu humu", "Zing", "@Casual Filth We may find out ina nother stream humu humu.", "Not to be super negative but both in both games you hate people meta gaming like crazy. First stream you had people counting how long she did tasks and now you got people throwing sus for her not doing keys.\n\nThis kind of meta gaming only works for experienced players, please don't ruin the stream. Pretty much people who watch to much toast, but has little game experience themselves.", "Well ya, meta gaming might be annoying, but if people call her out now, she could be able to use this in later games against people.", "Why do your tasks when you can simp for Kiara?", "because a real simp would want to make her happy and she wanted to play the game normally which involves doing your tasks ^^", "But Kiara doesn't like playing the game normally... She even openly told everyone to murder her.. :0", "In the first game, I was green!!! It was an incredible pleasure to play with you, tenchou, but I've gotta be real: you did me dirty there. Maybe I was blinded by love and overcome by the simp inside of me, but you absolutely took my vouching for you and ran with it.\n\nIn the end, it was an honor to be the final kill of your first imposter win o7", "21:55 we got psycho kiara already.\nalso.", "NOOO", "Ive avoided every trap possible to rickroll me today was the day I lost", "@The Doc BOI You’ve done well soldier, it’s time to rest  07", "Kiara be jinx-ing herself saying she wants to be crewmate in the Polus map but ended up being impostor 2 times in a row instead. LOL", "Damn I was hoping they'd win that game where I let them eject me. I was the red kfp hr dude.", "Well was working during stream. Might aswell watch it now.", "Same here but i watch it", "Woah, in my big brain, it never occurred to me to leave a comment to help with the YT algorithm, well better late than never lol. Congrats for hatching eggs friends, and for those who are still waiting, soon you too will be cutie little chickens 🐣", "Thanks for the stream Tenchou. Also o7 again to all my hatchling senpai!", "o7", "sorry kiara i was kidding abt leaving the membership 😼. i will forever give my salary to you (i dont have salaries just savings) love ya!!!💅", "If you don't have income you probably shouldn't be simping on a membership basis...", "i have cash from my previous part time job and i saved too much money lmao. i honestly dont spend much since i have all the items i need! so its ok to simp heh", "Let this be a lesson to know that comments don't always transfer the feeling/meaning unless you directly say it.", "@Akemisan - yes!!!", "Don't spend too much kiara will be sad if your broke", "@Ganue26 dont worry i wont!", "2:25:30 You heard her. Get this girl a dirndl!", "Hey kiara, the smiling face is iconic... Truly adorable.", "Her Japanese comes out so fast, I'm afraid she's gonna hurt herself.", "Hey Kiara, in future Among Us streams would it be good to try hiding the code and posting it in the chat instead? As is it's only people with crazy-fast internet who can join because they get the least stream latency and see the code several seconds before others do, so it's only really the same people each time who get a chance to join. Thought that might be one idea to get around it?", "Agree , I've been trying but internet-san doesn't help .", "my internet isnt that fast, i've got like 40mbps, sometimes less. not sure what's causing your latency", "@Graydenn Maybe it's how good your connection to your router is then, not really sure. My networking knowledge is borked. But you'll see if you watch the stream on different devices they'll be out of sync with one another, sometimes a few seconds apart even, and there will be people with less latency than that who get a head start on the code, while people who get latency on the worst end have pretty much no chance of joining", "I agree with that idea. It went too fast for me to even join the game.", "@Hælendleof Loc, KFP Scrub idk. im on wireless even", "@Graydenn Ours is 100kbps maximum lol", "@fakrahpet127 well in that case no disrespect but you have zero chance of getting in. rip", "Love the panicked \"where is everyone?\" while Kiara avoiding going into any of the rooms where everyone definitely was, for a solid minute.", "2:09:52 i wish jim could see this lmao", "Nice game deshou , literally imposter practice 😂.\nAlso ~\nWanted : Albedo (The KFP Janitor) \nReason : Treason ( By opening JFP)", "2:14:40 Kiara Thighs Episode V: Never Forgotten\n\nNote: It's been like 3 weeks since I got to make a Kiara thighs count.", "I've noticed one of the player Blayde was in FBK's play through too.\n\nLucky him.", "And he's too tryhard. A toxic gamer.", "That was so much fun! I came for revenge, but I'm glad I was able to help get Kiara her first imposter win! I forgive you, Tenchou!!", "Just leaving a comment to help with the Youtube Algorithm, one day I will send a superchat!", "My internet sucks and I've given up trying to get in, I think I'd rather try my luck in Mario Kart 8, it feels fairer lol", "You gotta remember 12-30k people are all trying to get in. You'd have a better chance in a members only stream.", "Sorry for mentioning another Vtuber. I don't know if it's coincidence or not but Pekora used the egg costume in her latest Among Us stream. I just think that it's really cute that Kiara and Pekora are wearing it. I mean she didn't use the egg on her first Among Us stream so... Or maybe its just me lol.", "Ehh i don't think it's a problem to mention other Vtubers in the comments, however it is against the rules to bring them up during the livestream. They don't seem to mind when this happens, but won't pay attention to it unless is something \"important\" (like that one time when both Kiara and Nene were singing at the same time and chat told her about it) or if they find it interesting and worth answering.", "Missed the stream. It's good to know you still doing things.", "Shout out to Haribo gummies and Kinder chocolate, my uncle was stationed in Germany as a USAF officer and would send me and my siblings big shipments of those candies (until Kinder eggs were banned from import in 1997). I still love Haribo gummi bears.", "\"Why are you mixing in Japanese?\" after mixing in Japanese.", "\"Harribo macht Kinder froh und erwachsene ebenso\" I thought it was so great when you said that \nAnd when you had briefly promised yourself and said chocolate instead of chocolate \n\nI wish I could be as good Japanese as you and also English. (im from germany by the way XD) ", "Evil Kiara just feels wrong.", "Also 1:38:23 - the legendary saga of the Albedo JFP rebellion begins. God bless the pre-chat, I love you all", "Since I don't follow too much pre chat what/who is Albedo and what are this JFP rebellion?", "@Warudo1 Albedo (KFP Janitor) want to start JFP ( Janitor Fried Phoenix) to fight against KFP , that sum up what happen , and the hunt for Albedo begin in the prechat", "@Warudo1 Albedo is the self proclaimed Janitor of KFP (we're allowed to give ourselves positions and promotions at KFP). He tends so send a lot of fun sassy SCs to Kiara, which tends to get him \"fired\". Last time when Kiara was pretending to eat us at the end of the stream, he sent a SC saying her breathe stinks, which led her to firing him. Again.", "Thanks for the replies guys!", "Stream starts at 2:35", "Ahhh, Kiara spending so much on the chocolade is so adorable, because it is so relateable. The chocolate here is sadly freaking good... xD", "Ah yes finally a streamer speaking the language of the Fatherland", "I'm so sad that I missed this..", "Sad I couldn't get up early enough to participate before work. Glad to see she's improving! Don't know if I\"ve hatched yet either since I don't think I was able to catch the original membership live again due to those pesky time zones. Keep practicing Kiara, you'll keep getting better! All your chicks love you!", "I don't know why but if she collabs with Kiryu Coco in her Meme Review, I'm really gonna laugh my ass off. I can already imagine the shitposting that they will see and their reaction.", "It wouldn't work nearly as well. The whole point behind the meme review is the comedic cultural exchange between the reddit people and the JP talents who are generally unaware of the memes. That's kind of pointless with Kiara, who speaks fluent English and is quite aware of memes from EN bros.", "@J ジェイ I guess in that respect it would be more like a typical pewdiepie/jacksepticeye like meme review", "Oh man when Kiara is impostor the games become more chaotic and SPEED than ever.", "Although JFP is tempting, there was fine print to the KFP contract that binds me to this enterprise for life. Sorry Albedo, my salary stays with KFP.", "I love kiara reaction when she got imposter each time 🤣", "45:53 that change in tone LMAO", "She laughing manically  like a actual psycho  21:55.\n\nAlso, the good part of this game is that it actually help you to become smarter.", "Every time I hear Kiara's prestream theme, I can't wait for the hololive-themed pokemon game it comes from", "I think this might be some of the most wholesome stuff I’ve ever seen. U deserve all the growth u have gotten and great achievement so close to 400k!!!", "Kiara I don't think you read it but my cousin gave me an idea of how you could fool Calli and tell you I love you, it's simple to ask her if she knows what it means (ILY)", "omg Kiaras guilty laugh is so delightful", "Love seeing you interact with the audience, thank you for the content", "Ame x Kiara 2:11:17", "kiaras second impostor round the purple dude was legit streamsniping", "Yay!!! That first round was amazing", "The among us character she made for the thumbnails is adorable.", "Chat too speed for me to ever get in but great stream", "When ever Kiara gives advice:\nMe: She didn't graduate high school but she knows 4 languages, owns her own fast food corporation, is a successful streamer and a big inspiration to a lot of people. Bird brain = Big brain.", "Remember boys to screenshot those candies for the scavenger hunt so we can put them together!", "I don't religiously watch the other members' videos like I do with Kiara, so I might miss a few pieces. Although, I'm sure y'all would piece it successfully anyway. Good luck hunting for the puzzle piece! ", "I have finally hatched around 1pm EST :O", "Her reaction to killing someone is priceless", "1:15:01 Kiara: Im almost 400k  youtuber.......ALMOST\nI see what you did there. Sasuga from Chiken", "1:32:08 that reminds me of the puzzle map from heroes of might and magic games and I'm pretty sure I've seen something like that, maybe it's just the type of art style..", "Kiara singing the old Haribo jingle is one thing I didn't know I needed in my life.", "Has anyone noticed how in the thumbnail for among us she doesn’t have her hat anymore", "I like your stream kiara~! I believe you can be a good vtuber just enjoy every game and people will see your special point!  you can do it!! keep going!! like you~!", "Why do I feel like these games they mostly skip because no one has the courage to vote anyone out? Or it's just for fun XD?", "no leads most of the time. rando voting is exactly that, random, does no good", "randomly voting without any evidence will likely result in voting out crewmates, which lowers your likelihood to win the game.", "@2 cheetahs eating a pumpkin oh kk", "1:03:03 Kiara Deep Fried Phoenix", "Egg check, since I missed the streams.", "Helping Kiara with the algorithm", "10:55 - 11:03 moment was Bottom left once again", "I knew Kiara would end up in the Lower Engine if she ever played this.", "my favorite vtuber ever since i found out she's german", "I unfortunately slept through the entire stream", "Sadly I missed cause it was too early but will watch the archive kiara~", "Kiara spent $70 on chocolate.\n\nThat's one phoenix with her priorities in the right order.", "You're just awesome, Kiara! I know you know it but I just want to let you know again! 🐔❤️✨", "When ppl skip when it is known that 1/3 of the lobby is impostors I question their intelligence. You're literally forfeiting the game assuming the impostors understand the rules.", "It's good to be hatched", "2:08:03:\nDon't give us hope.\nIt's better to let the Lion alone in the room than starve it by putting meat past arms reach beyond it's cage.", "Excellent stream, glad we got to hear some psycho kfp laughter lol", "Thx for the stream at least you got a win as a imposter and crewmate xD", "Spoiler (kind of?)\n\nCongrats!\nYou got your first imposter win", "Kiara I suggest you play around with the vents for a bit it's really helpful!", "And thus, the training arc continous", "Chat says \"it's obvious\" but names 3 different colors ww", "Albedo: Down with KFP!! Viva la JFP!!\nAlso Albedo: pays his ex-employer", "nope , Blazuchan is not found today .", "2:14:28 worried about her skirt but we know she wears pink 😏", "Ti's the season to od on candy", "I was eating chicken from KFC and I remembered you :)", "Dat first game, Happiest Birb xD", "You are my favorite german chocolate <3", "When is she doing another 1 of these again?", "She's 400k youtuber now", "Show stream to your friends.... Eh what friends", "Supporting in the archives", "i can't wait till kiara does some big brain moves when she gets used to the game", "Nooo I missed the stream", "Fun stream 😂", "why is kiara playing an older version of among us. tell her to update her game please", "So sad, didn't get notification.", "What a wholesome stream", "Mommy!!!! HAHAHAHAHA", "EYY KIARA YOU'RE  A WHOLESOME", "Almost 400k lets go!!!!", "I'm just helping the algorithm I don't got weird fetishes 😏", "46:46 yellow and white flirt", "Great stream!", "27:21", "2:34:42 education", "She's so sweet", "Me and my homies love Kinder Chocolates", "man, if they just voted out white in the second game", "when she wants to be crewmate, she gets imposter lollll", "What a good gameplay!", "Cutest thumbnail", "no way we won that lmfao", "Puns 2:21:18", "kiara should use vents more, it helps with quick kills and quick escapes.", "most kiara's fans are actaully quite chill lol, in this stream", "Obligatory comment", "Just 6k till 400k! 🥳", "Did Kiara seriously do an ojousama laugh?", "Kiara is becoming one of my favorites", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Nice win on the 1st one lol", "it is called trade school in the US", "2:00:09 At least the guy gives it to someone who deserves it like Kiara and not those twitch thots, just sad that she only gets like 20~30% of that", "What happened in pre chat?", "Probably chatting about Albedo's betrayal lmao. And so ... the lore deepens ", "True lol", "So much for what happens in pre chat stays in pre chat lol", "@Syrak - KFP Wörker Drohne With the pre chat SC, it's bound to leak anyway. It's hilarious either way ", "prechat  o7", "Just wanted to say im proud to be a KFP hatchling ", "The laugh feels a bit off, it's not psychotic laugh right?", "Calli and Kiara ship :)", "Great stream Kiara", "For them clips 2:11:19", "Where does she say she's our mom?", "@Jimb00 xX She's the mom because she watched her subscribers hatched in stream just before this one. Hatched as in their member icon changed after a month and a half or so of being a member since the debut. And now the icon is well hatched chicken as she's the mama phoenix. Just pretend ok..", "@DVDwr i think he was asking for the timestamp where she says \"im your mommy now\"", "Hatch check!", "LET'S GOOO", "Why its hard to think that if oxygen  sabotaged, then one must go to O2 room and one must go admin room, why must rush to the same place.. Zzz", "Day 10 of commenting on Kiara's vods to help her with the yt algorithm", "♥️ Viva la Kiara ♥️", "Love you mom", "Step on me mom", "Kiarimpostor.", "lol , the real reason Kiara moved her stream is probably because she wanted to watch the Pekora Among Us stream herself.", "Miss Kiara, I think its better (approach) if u should practice crewmate instead. Speed tasking really helps.", "I just love the fact that the game's kind enough to let Kiara be the impostor for a few rounds, exactly on the stream where she wishes to practice as one  There's definitely still a lot to learn. But, fret not. Kiara's got that BIG BIRB BRAIN  Another fun stream and yet another wholesome round of SC reading  Her words of encouragement never fails. Viva la Kiara! ", "I’m a chicken now", "Mmm a men of culture as well i see", "Woo", "1:05:28 That was such a low move and everybody should have voted red\nYou don't do that to beginners", "Hatch test. Lets see if i hatched", "Hatching test approved", "Hatchling Senpai ,  Nice o7", "Love your video.", "Woooo", "hatch", "🐓", "Kiara is a bird so she lay eggs right?", "Hatch check", "I Hatched", "Nice , Hatchling senpai", "Kiara is getting better the more she plays.", "Hey there, had a lot of fun in today's stream. You've certainly grown as an impostor! I hope to see more progress in the future.\n\n~Blayde", "Thanks for giving Kiara the really helpful tips dude!", "@fakrahpet127 I do try to be helpful.", "左足を伸ばし、悩みを乗り越え、右足を伸ばし、悲しみを蹴り飛ばし、ロープを見つけ、健康を守り、檻を見つけ、幸福を逃れる場所をなくしてください，あなたはそれを行うことができます!*\\(^o^)/*\nStretch out your left foot, trip over your troubles, stretch out your right foot, kick your sorrows away, find a rope, fasten your health, find a cage, let happiness have nowhere to escape, come on!", "I just don't think Kiara is the killing kind.", "I see Blayde everywhere, appearing twice in Kiara's stream, and once in Fubuki's Among Us stream, and maybe more 🤣 that dude is a legend", "Why is there only ONE (1) comment other than mine?", "Oa uwu", "A"]