["All of Kiara's streams are 11/10.", "true.", "I want to get into the fanclub but idk how, help", "Yes, I try to never miss a stream of her", "@Legless Raptor If you can't see the join button next to subscribe then just type in /join after this channel's url and see if that works.", "@glizzy I'll try it thank you!", "Or higher", "SIMPPPP", "All of Kiara's streams are full of happiness but also so much PAIN .", "You are all simps", "Kiara volunteered to showcase the bed trick even though she originally wanted to troll Calli with it. What a wholesome birb", "She took one for the team", "It would be funny to see Calli sleeping in the nether, but no, the chat have to kill Kiara's joke", "@Julius Zeppeli The Chat was split between Good and Evil was amazing", "I love how chat was so supportive when Kiara died but did a full 180 when she mentioned chess😂", "Papa huke: BOTTOM LEFT", "That’s how it goes with us KFP members, we get supportive and wholesome, and the next second we call her ", "I can genuinely feel the way she brought up the chess topic just to cover her pain tbh. I wish her the best.", "@Zeke would explain about Botton left refference? Idk if it is something about Kiara itself", "@Cizar159 oh u must have missed it. She explained in her collab with subaru actually. Basically there was a meme chart of intelligence and “seiso” or purity as a meme. With most purity and most intelligence on the top right. So the farther left and down you go, you get less pure and less intelligent. And papa huke is saying kiara is bottom left. Not pure or intelligent. But as a joke of course.", "what chess? we dont talk about chess around these parts\n\nmuh braincells still hurtin", "@Cizar159 if you want the source, the chart was created during the second HoloEn collab. Starts around 1:03:30 when they start discussing where Kiara should be on the chart", "38:48 explosive chicken\n1:42:39 deep fried chicken\n1:45:01 drowned chicken", "1:45:03 Kiara_HOLOEN was slain by Drowned", "Poor Kiara,dying a couple times.\nThat one with the drowning tho,Gura is like “Yup,that’s normal”", "She needs an iron farm ASAP to supply her armor demands!", "no\ngura is the only one noticed\nshe just dont wanna do it on stream", "Saddest part is that Kiara died at the end because she jumped into the crafting table that she asked Ame to make for her. \nShe wanted that crafting table so she can make more gold ingots to do Gacha with the pigman villagers. \nConclusion: If there were no Gachas, she would've lived. Don't do Gachas kids, or you'll end up jumping into lava and losing all your gold.", "Gacha will rob you of everything you worked so hard for.", "It depends if you're doing it in the nether you'll die faster than the piglon can drop you stuff🤣🤣", "Calli: \"Nonono. I'll mine my own stuff. I don't want you guys to do everything for me...\"\n\nGura: \"No. Help. We help\"\nIna: \"Yes... We help each other\"", "Actually ame: \"I'm mining gold, hold on...\"", "I felt so bad for Kiara at this part!  Hearing everyone else be all supportive for Calli but no one consoling Kiara when she needed it most really made my heart sink.", "Timestamp...? Pllssss", "@CupOfWhiskey starts at about 1:42:30", "american kinda rude", "Love how chat constantly asking if Kiara was tired and telling her to sleep when she was just being considerate of the others speaking, that's how things work in big groups.\nAlso she lives in Japan so it was about 2pm for her.\nBeing considerate is good but think about things before you parrot what chat says :p", "This is the same chat that spams twitch emotes in YouTube chat, don't expect them to think at all", "@厶尺卂丂丂 Yeah, it's really tiring.", "People are estupid and thoughtless at times\n\nPlus, even if she WERE sleepy, we'd get to watch her sleep", "you are so fucking cool", "@metal gear clitoris ok metal gear clitoris", "16:48\ngura : where do i get feathers?\nina : chicken\ngura : oh i need to kill chicken", "that should be clipped lmao", "This is actually a great idea of adding clips of these type of reactions", "Kiara is forced to sleep in the nether\nChat: KIARA NO\nINA: KIARA YES\nNo one ever suspects the top middle tako", "I'm sure she knew she'd die like this.That's why she is ready to give ina her armor.But ..Lava ？？？？She wasn't prepared at all", "She didn't even think of it", "@夏天andy Pardun?", "Is this a dbza reference lol", "1:44:51 \"why are we still here? just to suffer?", "why you just watch", "That name XD", "Did she fall asleep here?", "@sonofsueraf nope, our lovable little chick here got PTSD", "Everyone in chat: PAIN PEKO! CHEER UP KIARA!\n\nPapa Huke: BOTTOM LEFT", "Best Papa", "Huke is a moderator only on Kiara's chanel? I can swear I heard that name before", "@El Fido huke is Kiara’s papa. He drew her. Tho he might have been on the other girls streams watching. Idk.", "@Zeke 1460 Ooh I see, arigathanks gosaimuch", "kusa", "@Zeke 1460 Beyond that, he's the artist/character designer for Black Rock Shooter (which has a pretty famous song by Supercell, and spawned an OVA, anime series, manga, and PSP game) and Steins;Gate (a visual novel by Nitro+ and 5pb. that has an anime adaption and is available on Steam). His art is amazing, and it's no surprise that Calli said she was a long-time fan of his back on one of her early streams with Kiara. It's actually wild to see him as an active part of the community. He's kind of a big deal. At least I think he's kind of a big deal.", "@Zeke 1460 He hangs out on some holojp people's streams, I forgot who though", "What an eager phoenix. She keeps burning to death to be reborn anew!\n\nAlso Kiara, we need to talk about your gacha addiction", "The gacha ultimately ended up being her demise...", "@xDewritos certain gacha addicts in HoloJP: 💥👄💥", "I absolutely love how much of a team player Kiara is for showing the bed explosion in the nether. She is so wholesome and nice but I just wish she had more confidence in herself. She is so nice and wholesome but I feel like she is too hard on herself and can be a bit quiet during collabs when she is normally so energetic during her own streams. Idk I may just be reading too much into it tbh and she may be fine but I just hope she can open up a bit more in the future in collabs with more than one person. She is such a cool person and it would be great to hear more from her new collabs. I wish her the best in the future as it is still early for HoloEn and there shall be more great streams to come in the future! <3", "I think she realized she was dead to rights when Calli said \"You're lying.\"\n\nHonestly I can't wait for Among Us with HoloEN, because as far as I could tell, she sounded 100% genuine when trying to get Calliope to use the bed initially.", "What?If anything,Gura was the most quiet out of everyone this time.", "@MY NAME IS GYOUBO MASATAKA ONIWA I though ame was the quiet one, she focus on building stuffs all the time", "@Ez Plasma no,i actually watched guras streams,she was definitely the most quite this time,Ame was with everyone else,talking while gura was doing some other thing", "i think gura the quit one in all of their collabs lol", "When Kiara fall into the lava I suddenly had this urge for some fried chicken 🍗", "I just wanted to say Kiara actually is a pretty good combatant. I mean she handled that skeleton trap pretty much all on her own. Real proud of our fire birb for learning so quick.", "She is the DPS", "So if they're going to build a chess board I expect a full Minecraft chess match between Kiara and Amelia.\n\nBut please, put a timer 😭", "Like the timer will help. Practice will, though.", "Or just have that rule where fifteen repeated moves makes a stailmate", "Kiara: Drowning herself out of sheer sadness of losing all her stuff 1:45:00\n\nGura watching: Kiara?\nEveryone else simultaneously: KIARA??", "To be fair... It happenned right in front of her house...\n\n.... Imagine u coming home from work and someone just yeeted on your front yard.", "Well that's pretty dark as fridge 😱😱😱😱", "@lissaleigh mercado I just came back from gura POV... Yeah..\n\n\"What was I supposed to do?!?\" was an understandable response.", "@SoulGundam, KFP Mobile Suit Wait, I should watch it as well\n\n\n(After watching) Ok it is understandable", "Gura makes it sound like she was watching the entire time but in reality she came across Kiara just as she died", "@imp360 yeah lol i noticed that too", "I thought  she fell asleep", "1:45:04 when they said Kiara? at the same time was too cute", "Da... da vinky?", "@2 Ranzige Brote lmao 😂yes!", "I watched a different member's stream live, so I'm here in the archives... I was curious about what happened to Kiara when she started screaming. And the reason was 7:51 huh.\n\nAlso, the other members are busy with that one skeleton while Kiara is here being a warrior and killing 3(?) skeleton horsemen. ", "Hahaha I thought she'd fallen asleep for a little bit while still holding the button", "It's a shame the rest of the girls effectively ignored her after pulling off a pro gamer move, it's understandable though they were more concerned about that one skeleton they had to deal with", "Kiara: <drowning>\nGura: Hmmmm. Interesting", "That death at the end hurt a lot. You need to be more careful while jumping like that Kiara. :( Anyway, excellent stream as always, it was very entertainment watching on your pov. I love all the girls, I'm a member of all of them but you always will be the priority. Let's go KFP! ", "She's just continuing the apparent hololive curse.\nSeems there's almost never a minecraft stream where someone isn't dying in lava.", "Kiara being Dream for a second and fails 😂😂", "Don't worry Kiara, all you lost was some gold and iron, nothing really that important - a single mining session and you'll have more than what you lost. You didn't even have much XP or a single enchanted gear.\n\nWhat's worth crying over is enchanted diamond gear and other irreplaceable stuff like the Elytra.", "she thought she lost her pulls. its why she got sad while looking at the arrows", "Honestly, depending on how experienced you are at the game even losing things like elytra only sets you back an hour or two at most.", "imagine losing ur redstone shulkerbox that have 6 stacks of dispensers... the nightmare keep me awake..", "@Gigih Condro Alright finally found the comment which describes true pain.", "Kiara told a story without uttering  a single word 19:38", "Aww, she really wanted calli to room with her", "Pain peko", "oh...", "Kiara are you feeling right?? You did not flirt with Calli once and you even said that you want Amelia in front of her", "Everyone talking about her drowning at the end but kiara died a fourth time when she saw Calli exploring the cave and talking about how she was going to make a house for herself and she just looked back at the house they made together in despair", "Today's adventure was such a \"blast!\" The whole Nether journey we have witnessed was \"fire\" today. KFP", "Ya, it was so funny I was \"drowning in water\"....wait", "38:41 Dante: Rest In Peace little chicken", "Lol", "Kiara: mentions chess again\nMy sanity: \"Haha, I'm in danger.\"", "Lava . Pain. Chat ruined the fun of the beds smh", "19:25 sad birb", "1:48:03\nKiara: Can I sit on your lap Ame?\nchat:", "That seppuku at the end. F for our little chiken's gold.\n\nPD: AME MVP!", "Kiara: swim in lava and dies.\nMe: impossible.", "well, someone had to tank the lava curse and take a hot bath in nether eventually. Poor kiara, all we MC players have been there atleast once too :(", "\"kiara took a hot bath\"", "I'm only feeling Kiara drowning herself differently after a hiccup because I've seen that 180 in real life a few times. Glad she bounced back though!", "This stream don't have that much kiara energy compare to the other colab\n :(", "For a Phoenix, there are happy deaths and there are sad deaths. They were all portrayed in this stream.", "me: Drinking a cup of tea\nKiara: \"It's always difficult with 5 girls at once...\"\nme: choking on tea\nWording Kiara... wording....", "When did she say that?", "@Dante Alejandro 1:51:48 ish...", "The fight against the skeleton raid in the beginning was great.\nKiara is a warrior after all!", "Even though we sometimes tease you for being bottom left, you will always be on top in our hearts <3", "That suicide near the end, I felt that, I feel bad for Kiara :(", "I love how the highlight of this stream is that they literally went to gacha hell.\n10/10 would reroll again.", "1:42:39 pain peko", "Can we just apreciate that moment when Gura and Calli where freaking up over a single skelleton and needed Ame to go and save them while Ina dealt with a single spider and Kiara faced a full horde of skelletons?", "Those feelings when kiara starts jumping at home,happy she have so many gold and u see the hole over there u u just scream STOP!!!!", "45:50 \"It would be Pain Peko\" I had to rewatch to confirm it", "18:07 oh man Kiara is over her head XD", "1:42:37 she was so devastated, poor chicken", "1:42:38 Hearing Kiara scream in Ame's vid made me look at Kiara's POV. That was amazing hahaha poor Kiara", "F for Kiara at the End", "1:42:30 Kiara tried to swim in lava :(", "Kiara you are loved and cherished. Everything will be okay. Please continue to bring such positivity and hype. Have fun with everyone.", "Thanks for the wonderful livestream! You were brave and took one for the team by sleeping on the bed in the Nether realm. I didn't know it would explode like that. Really sorry you lost your gold and items towards the end as well. Looking forward to your future activity in the coming week. Thank you very much, Colonel Kiara 店長! 🐔❤️✨", "Replay button for the bois: 1:42:39", "38:30 is Kiara's moment of Glory.", "chat just had to spoil about beds in the nether. thanks for taking one for the team anyway Kaira.", "Ikr, they can't enjoy a funny meme moment :/", "It's hurts too see they didn't mine those quartz", "5:09 haha she’s so evil that her laugh is reflexively showing her nature", "Suicidal Phoenix - as expected", "01:42:36 we love you, Kiara. \nsuddenly, I got some feeling and recalled memories at school when I was young.\n\nI falled at street when biking but my friends just seeing without any help or words, suddenly I just realized whats meaning of friends.", "I've seen different types of Chicken throughout this stream lol , and also I don't know which ship I need to support : PANIK", "For anyone wanting to troll their newbie friends with the bed trick in the future. There's a much better way of trolling than saying that sleeping in the nether gives stat boost. It's kinda like those trolls that say \"Press alt+f4 for free money\" like, obviously that's a lie. A better way to trick your friends is to not mention it at all. And then just randomly pop out a bed and tell them to set their respawn in case they die. I bet even veteran players might accidentally fall for it if you are quick enough that they don't have time to realize that setting your respawn is the same as sleeping, which is a no-no in the nether.", "Lol its pretty pointless anyway cos their chat will provide the obligatory backseat gaming and lo and behold prank foiled.", "Watching kiara break the wheat with her sword hurt my soul", "Kiara just NTR'd Calli", "for the fourth time too\ni swear calli is into it", "I am a newer fan of Vtubers. Myth team is my favorite (I am a bit biased as I only speak English.)\n\nLove your accent Kiara. You seem to have an energetic personality. It is amazingly cute! I wish you the best in your Vtuber career.", "Kiara's running and jumping reminded me of back when I played Morrowind and did the same thing almost everywhere I went.\nI do worry though, I hope she's okay. Amelia's gift at the end was nice.", "27:45 hey thats hell your walking into", "1:45:05 \n\nWho painted the mona lisa", "HAHSSHHSHAHAHAHAH THATS SO FUNNY", "9:13 the foq is that\n13:53 deu\n18:34 disappointment\n24:31 ziup", "1:02:26 If you're looking for the part where no one was listening to Gura except Kiara", "33:20 you can SEE the internal struggle.", "I like how she died right after she said \"let's go home and store our stuff before we die\"", "bird being considerate, awww how cute!", "Kiara reminded me about \"Burung Apa Tu Man....?\"", "hopped in and it just ended", "Everyone play on bottom right. \nMeanwhile Kiara \"Bottom Left\" \nSasuga Kiara-sama", "This stream is finger lickin good.", "Please stay strong. I'm concerned...", "Bro I love Kiara so much her and the other hololive girls have really made me smile so much thank you guys❤", "WHEN YOU DIE IN RAID BUT YOUR TEAMMATES STILL CHATTING HAPPILY", "Kiara's BGM sounds like an OST from Pokemon BW or B2W2", "I fell asleep and missed the stream life just isn't fair anymore man 😞", "1:50:41 can’t wait for the pekora collab", "Calling it right now, It's a Nene collab", "Its gotta be a Sora collab I mean come on its obvious", "No its Marine collab, what do you mean", "@A smoke detector yo imagine", "It's clearly going to be a roboco collab I mean shes been hinting at if for a week now", "I fucking called it", "@Keeys wait what?", "@A smoke detector I called Kiara's collab with Nene", "@Keeys damn, was expecting peko", "hiding gold for the gacha, birb's an addict too I see.\nedit: and then falling into lava for it, that's our birb alright!", "Gotta start making those automatic farms to become a provider, huh?!", "1 hour mark. Kiara demonstrates how important it is to clear the lava around any loot you want to mine or acquire first and then take the loot.\n\n:P", "The phoenix always be resurrected!", "I watched live, you did a great job Kyara.", "Dang it I missed the stream 🍗🍗", "1:42:30 watching all that go down was really funny but I felt saddened at the same time", "1:42:38\n\nYou know what it is.", "I’m so mad I missed it!!", "When they suggested to have Kiara keep blowing herself up to dig a tunnel I DIED", "Tbf, the drowning part is somewhat relatable in some parts of life. I wish Kiara the best!", "And I’m not a fan of those making jokes bout it but well they are inevitable. Pain tako.", "Yeah I was kinda shocked when I saw it. I know she is a Phoenix but still", "LOTR anime adaptation looks so great!", "kiara suicide got me in the feels😭😭😭", "1:42:39 Top 10 anime tragedies 😆", "The part where she fell get to me really hard. In my world I was gathering material in the nether and fell a lot of times because of me being careless (in one of those I lost all of my iron). Don't worry Kiara, it happens even to the best of all", "According to my youtube app, this was streamed 11 hours ago... Wtf?????", "1 dip in lava from hero to zero.", "KFP KFP KFP!!", "抱抱火雞\n辛苦你了…", "I also once took a arrow into the knee", "okay, gotta ask. whats up with the cape that she gets near the end? just appears out of nowhere and it only shows up for her lol", "マグマダイブ助かる！\n落ちるとは思ってたけど面白い落ち方だった！", "I gotta subscribe now, have no clue about vtubers but we share the same name, this must be fate😂", "oh the exploding bed? its just her\n\nNATURAL RESPAWN", "The phoenix burns for the sake of the group! She returns in flames!", "Kiara dying and losing all of her stuff right as they were leaving, and then just silently drowning herself was pure entertainment.  I want fifty memes of this.", "Tbf it was somewhat relatable so i wish her the best", "@Acer Shaw I was more hurt that Ame shot her down. Friendzoned by a fellow bottom dweller.", "Kiara got soul sand on first try..Giara says she wanted that the whole time", "Little does she know she could tame those skelly horses", "1:44:30 Kiara's mishima moment", "1:42:42\nKiara once again, forgot that she's not a phoenix", "I was dual-screening and saw that coming out of the corner of my eye, too.", "Are you ok? Kiara....I know it is sad to lose everything...", "1:42:30 DESPAIR", "me being like a danganronpa fan and seeing this comment", "1:45:50 I’m sorry that makes me think she’s using her infinite lives too sparingly", "火雞辛苦了\nTake a rest", "1:48:26 Gura Contemplates \n1:48:32 Gura Has an Idea\n1:49:11 Gura Shoots", "Love u, kiara", "RIP Skeleton Horses", "I couldn't join the stream because online classes.", "link to the KFP fan server please?", "understandable have a nice day", "calli is fawning over the baby piglin and kiara is gambling with its parent. truly they are meant for each other", "Am I nuts? Where's the 5th collab?", "Here the 5th collab https://youtu.be/NS3_sNTwIRw", "Why does her textures look so different yet better than everyone else’s ?", "Another Holo JP collab? I wonder why she can't tell anyone. It wasn't a secret with Subaru. I don't think it'll be Pekora already. Seems too early.", "Your Nether RTA took a little longer than expected, but good job anyway.", "Gacha addict...", ":( pain peko... 1:42:30", "Kiara is best chicken :D", "54:49", "Kiara big bottom. Mori big top. Match confirmed", "1:42:33", "The chicken was willing to sacrifice for her friends", "heheh skeleton horses", "50:50 CALLIIII", "It can say sleep with blaze of glory", "If your wondering, the timestamp is here 1:42:38", "PLEASE NO CHESS..", "Petition for Kiara to build Calli a house", "She really is a firebird.", "baines man", "Kiarinky?", "kiara, don't be sad.\nThey don't understand how frustrated you are......\nIt would be okay...\nlove u fan", "Anybody know what shaders Kiara uses here? How do I get them myself?", "Sildur lite ver. she also used optifine so it'd run smooth on her pc ^^", "@What a Simp KFP Navy Admiral Thank you so much!", "↙️↙️↙️", "Kiara post gacha: Pain peko", "TwT", "Poor Kiara 1:42:40 just enjoying herself, made to suffer again. Minecraft is bad for health IRL", "Kiara Tsukihi?", "What are the most popular goods in the underworld? Under wares", "Poor Kiara she lost everything.", "Even Minecraft has gacha now. What has the world come to?", "Ganbare kiara", "pog", "pain peko", "Hi Kiara, for EN server I suggest you to start a wheat or potato farm to feed yourself and maybe start to breed cows pigs and chickens", "And maybe ask your company to give you a more decent outfit but not a lol turkey suit, you got nice hair and face but with the lol outfit that seem wasted.", "Lava-2 kiara-1", "You mean:\nLava: 3\nKiara: 1", "Kiara is the only one who plays with shaders", "Kiara should sing German Los! Los! Los!", "A", "Pog", "Saying \"kicky ricky\" in chat makes you look like a child, just sayin", "'full member collab' is like rubbing salt on the 1st and 5th gen and holostars", "It's HoloEN members you genius.", "What is wrong with you?"]