["Kiara : \"Sora is an idol. She should be in Hololive.\"\nMe : But you literally have Sora the idol in Hololive!", "Any more Soras in Hololive and we'll have to start calling it Kingdom Hearts.", "@PixelleHearts lmao", "@PixelleHearts We could use Asacoco as Sora and Coco Caine as Roxas, the Idol Sora would be Merlin because she is too OP for a playable character", "@PixelleHearts nice ref", "@Cachorro do link so I guess Subaru is Donald then", "@Cachorro do link which nort are we talking about?", "\"For me, D tier is for all the dudes.\"\nAh yes, our flaming lesbian the phoenix.", "As a man, this gives me mixed feelings.", "@Vgamer311 there is a chance if you are hot", "GredyStar RIP me, then.", "I mean she said herself as clarification: It’s a WAIFU tier list, not a HUSBANDO list, so no dudes getting placed well", "@WATAME VIRUS can't argue with that logic", "역병으사 SpeedWagon is a Waifu or Husbando?", "@Chip TH He's Speedwagon, he's his own category", "@WATAME VIRUS \"Sometimes it takes a real man to be best girl.\" -- G", "(puts silverash in A tier)", "Well, all men have the D anyway", "@Redan Dinata everything makes sense now", "Ah yes, top tier Waifus of culture rating gacha games Waifus. I'll be waiting for Azur Lane and Girls Frontline next.", "\"flashbacks to marines azur lane stream\"\nthats tiptoeing on the line of what youtube allows", "Damn, I'm interested what is Kiara's finest pick in Azur Lane will be", "M4A1, ST AR-15, and Thunder better be high up or hands will be thrown\n\nJust kidding, I’ll respect their choices. But I’ll still be very sad", "Do they even play that lol", "@DI4K0 ina is a gacha goblin, so it would not surprise me", "@Demyx lol gacha goblin", "@Sanguine sopmods cool", "@Muh Fatayat she made a joke that she isnt a whale, she is a leviathan because of all the gacha", "what about FGO?", "hopin she puts Prinz high", "Better do fgo next 🔫🐳", "wachan S tier or riot", "If i had my old pfp you would see me as a commander with 9A-91. I think 9's would be SSS tier. I'm not biased though if its the truth.", "FGO: 💥👄💥", "@DI4K0 I think I heard Kiara say that she doesn't play any gacha besides AK so we'll see", "I just started GFL last week, game is really good, f2p friendly, and I wish it got as much attention as Azur Lane/Arknights/FGO. Also helps that the story has a REALLY good translation.\n\nK31 is bae", "There is a game that is a Tank version... though only available in JP", "@Lil Roach Dogg lol, prepare your echelon for next collab dude", "I love GFL but I'm pretty sure it will always be underground", "@Lil Roach Dogg cool if you need friends for 10 batts heres my ID 467235", "@Tashad maybe it'll be popular on exile if mica didn't mess up, just hoping that will less bug than gfl 1", "Let us all have a moment of silence to all the fallen brothers who got yeeted to D-tier", "I dont have any Bros in Arknights, but FGO, you bet your ass i got some S-Tier Dude picks. Cu Alter, Billy, Rama.", "@Thewisemanoncesaid Understandable, Cu is the broest of the bros", "maybe they're in D tier for another reason?", "They need to show off more thigh", "@Shinseph rated D for DUDE", "“The only dudes to escape their fate were silverash and hellagur, for being hot”\n\nBOIS TAKE NOTES THEY BOTH HAVE WHITE HAIR AND MUSCLES", "And they're older dudes.\n\nWell... I'm one of those three things at least.", "Proceeds to age myself", "I guess I'm gonna pull a Kaneki and have someone torture me to get the white hair", "Ansel with his summer skin is SSS tier", "We now know Kiara's favorite kind of BL.", "@Ausdrake Chicks dig the silver foxes", "And so we must ally again... Bleach", "\"WRITE THAT DOWN -- WRITE THAT DOWN!\"", "Every male operator\nIna: Explains why he's on that tier\n\nKiara: DUDE TIER (Except SA and Hellagur)", "Kiara is like me: no dudes", "HELLACHAD still sad B tier :(", "tbh the male ops in AK arent really that eye catching or big yet compared to summ like FGO\n\nSilverash, Hellagur and Thorns are the only notable ones really", "@Holden Makok that's a big achievement compare to ... well, you see, the rest of the dudes. they didn't even have a chance.", "@dekhadmai Yeahh lmao, Hellagood's the only living dude i'd simp for tho", "D for dudes...", "@ϟ Flamebringer also ranks super high in Chinese fan polls, he's got a sick design too bad he's worthless in game", "@ϟ I think Phantom and Elysium are up there, in terms of popularity and meta", "Elysium literaly the current dp printer meta Vanguard", "@ϟ are you disrespecting Ace?", "@harute wakurata nah it's still Myrtle for sole dp printing. Other than that, yeah he has a more useful S2. Bring both for double meta printing.", "@ϟ Bruh have you seen E2 courier? Dude makes you want to call him daddy", "But greyy thooooooooo", "Am I the only one who really likes the Ina + Kiara combo? The quiet one and the energetic one fangirling over waifus?? \n\nThere's also something about an enthusiastic Kiara trying to make a sleepy Ina do the KIKKERIKI! The balance is just so perfect.", "And Kiara is right:  Ina German is cute.", "Kiara x ANYONE is a cute combo, mainly because of how great Kiara is at being the perfect counter to most people when it comes down to personality.", "@ValorGlory She's actually showing so much talent for hosting HoloMyth colabs. Her energy just keeps everyone going and gets everyone to be more relaxed and open.", "@Jr Pelayo That is kinda what I meant too, she lets everyone be themselves but still helps keep their head above the water of \"pure chaos\", she has this natural charm and charisma that disarms and reassures the people she collabs with and it lets them feel like they can play/joke around more even though they are \"in character\" the whole time.", "@ValorGlory Oh, fo sho Calliara Kiarope ship is the best one and the one I'm willing to bet every one is on board with too. \n\nA mythical being that doesn't die and for a lack of a better word, \"respawns\" + the grim reaper's protégée in training. ", "\"For me D is all the men\"\n\"Next is a guy, so goodbye\" \nShe's speaking my language", "Kiara it's fine to have different tast of waifu, we will always love you!", "卑鄙的外鄉人 BOTTOM LEFT", "Bruh can't believe my dude Ace just got killed a second time in this stream", "This stream makes me extremely concerned about Calli's safety whenever Kiara's around..\nTenchou is intensely passionate about her waifus\n\nI can't quite judge her, though... such a birb of culture!!", "16:35\nKiara almost loses her future carrer just by placing exusiai to the B tier and literally the whole chat goes crazy while people that didn't know about the game just watching with \"this is fine.\" expression", "That was me, I've never played this game lol", "I play this game and i said it's ok lol", "Exusiai on B tier is just sad\n\nEdit: S Tier waifuhhh", "B Tier is just saddddddddddddddddddd\n\napuru pie", "*Looks at my Level 70 E2 M3S2 Dobermann\nYeah I wonder who uses her", "https://i.imgur.com/yeb1kVr.gif", "I respect you brotha", "Kiara going feral for Shining thighs is a huge mood tbh", "Gotta respect Kiara's hard stance on \"You are guy, so goodbye\". D is Dude tier from now on.\n\nAlso I've never heard that much thirst for Shining before. Give the girl some H2O!", "Trully, a lesbian icon.", "Imagine if the Summer skin of Platinum, Nearl, Provence, Utage and Skadi is released. What will happen to this self-proclaimed Phoenix then?", "Kiara: “All guys are bottom tier except for Silverash, cause schwing”\n\nMe: “I’m sorry Hellagur... You don’t deserve this...”", "Each stream with Ina just confirms more and more that she is one of us. ONE OF US.", "Part of the crew, part of the ship.", "she the one.. the chosen one", "@Alex Radostev Is that a Dead Man's Chest reference?! xD", "She will bring balance to the Force.", "@The Asterisks Yup, but also promoting their ship, if you know what I mean", "#JusticeForAce", "I agree but also.\n#JusticeForAce\n#JusticeForMatoimaru", "wanna learn what this stream is about?\nit’s about Kiara roasting everyone’s Waifu/Husbando\nKiara putting Male Operators in D\nIna having Biases", "You forgot Kiara going full BOTTOM LEFT for Shining swimsuit skin", "イズル oh oki,I’ll put it on there", "Don't forget the \"poor is cute\" thing lmao (you don't have to add it just saying ahah)", "Inas \"auf Wiedersehen\" was so cute 😭", "イズル what does bottom left mean?", "@ERi her first collab stream look at the chart she did", "Chat when Kiara said she doesn’t care about the dudes: Understandable, have a nice day\n\nChat(and Ina 1:34:27) when Kiara put Ace in D tier: Ace, NOOOOOOO [1:33:35]", "looks down\n\"D-tier\"", "D for Di-", "Kiara, she likes da ladies. But we knew that. Calli CERTAINLY knew that...", "1:54:52 like if you want to see more collabos with Ina ", "I'm obsessed with FFXIV so I would watch every stream they do of that game. And really really hope they end up joining Primal so I can visit with my main. I'll make a secondary, I dont care.", "I don't play Arknights, but after this heated and insightful debate of the highest culture caliber, I have to admit the subject sparked my interest.\n\nGood job, Kiara and Ina, on holding such an educational discussion!!", "I loved this stream, you and Ina really are a great pair, I hope you do lots more together...\n\n... But I'll never forgive you for Ace.", "When you have 12 sanity potions that all expire on the same day:\nSanity: 1390/129\n\nI AM COMPLETELY SANE", "That's a mood right there.", "don't you mean OVERSANE", "Too bad you can't get it over 1000...", "some of them maybe missing (Operator\nOnly)\n----------- Ina Tier list ----------\nAPPLE PIE: Exusiai, Mostima, Texas, Lappland, Project Red, Nian, Saria, Grani, Magallan, Skadi, Shaw, Angelina, Schwarz, Ceylon", "Jeez", "Madlad", "Both lists are very respectable", "@Marz Productions thanks", "holy hell\nits 2,350 characters\nmy longest comment ever", "RIP PC-kun\nMan you legend,compiling their tier-lists", "RESPECT", "You're doing a God's work", "RESPECT", "There's no such a thing as Vulcan or Indra", "Put it backwards, Ina HAVE any single else those three. Dayum, she is Cthulhu level of leviathan.\nI have Indra and Vulcan but obviously not everyone.\n*Tho i think she said she doesn't have Eyja?", "I don’t play AK but Blue Poison is the big cute so I agree with both their placements", "I'm just glad to be alive after this dude slaughter", "Kiara and Ina: \"I don't really use Gitano much.\"\nMe: I force Gitano into every map.", "CDawgVA and Gigguk: \nONE OF US! ONE OF US!", "Waiting for Hololive collab in Arknights so I can roll for KFP", "I wait for a second AL/Hololive collab.\n\nI hope it involves Rainbows.", "I will spend my POs to pull for a fast-redeploy watame to fight alongside Eyja.", "I wouldn’t mind getting fubuki with her gamer/arknights operator outfit. I would also like Coco since we don’t have enough Draco waifus, and Towa since her design just fits the aesthetic", "It's sad but.... True True Silver Slash is the only dude I use..... others are waifuu!!!! Tenchou  I am with you on this one!!!!", "No Courier?", "@GeorgeMonet early game but then texas and zima and siege shows up", "I was able to wake up on time for this at 9am but I can’t wake up for my 11am classes on a normal day... something is wrong", "Priorities, Major.", "It's very simple, one thing you enjoy, the other you do not! :P", "Nothing is wrong. All is as it should be", "Welcome to the hole.", "Thanks guys", "Kiara is sooooooo hardworking with these many vids! Hope our Warrior Pheonix gets enough rest in between.", "kingofsapi a boss never rests", "So Ina's codename is confirmed to be Deepcolor right?", "14:16 \nTakanashi on Sora: \"She should be in hololive\"\nOh but she already is.", "Kiara : \"can someone have a youtube channel that able to put promanix place in every map? \" \nKyoStinV : contents goes brrrrrrrrrrr", "Come on Kyo make our favorite lesbian pheonix proud!", "Cant wait for the fgo waifu tier list", "Arknight so biased on operator performance/skill tho lmao\nFGO we could more on story/personality", "It would definitely take so much time, since they have to talk about their personalities and qualities. Gameplay wise could be a factor too, but personality strikes more", "Rating waifus in fgo is a Holy Grail War in itself, but Kiara said she only plays AK sadly.", "Joke: D for Dude Tier\nWoke: D for Daddy Tier", "I came here thinking Deepcolor would finally get the love she deserves. :c\nStill a fun video though!", "i wonder if tectone would approve of this....", "The fact that Kiara put Scavenger above Zima hurt my soul.", "Same. Zima is the better vanguard but I can agree that Scavenger has her uses as a front Vanguard.", "Even if i didn't know much about Arknights this stream was tons of fun to watch, i hope they'll do something similar for FGO too one day.", "We're gonna need a Fate Waifu list soon now.", "I don't play arknights but damn I kinda wanna see you do more tier list streams. It's really entertaining to watch you guys discuss about the characters even if I have no idea who they are 😂", "Gravel is A-tier in both of their list.\n\nAll is good in the world.", "I'm gonna guess these two we're friends before hololive, and if they weren't, they do sure act like it. \n\nI hope there's more Kiara+Ina collabs", "“Swing Swing”, an Operator whose one of its con is literally making the game too easy.", "1:05:42 I would like to make videos on where to put SilverAsh, Cliffheart, and Pramanix on stages here and there but I don't have the space to do so. This just makes me sad. And I also don't have Pramanix at E2 but maybe I can work on that.", "Putting Blue Poison next to Ptilopsis in a waifu tier list - BOLD.", "57:25 This would definitely make you a lesbian if you didn't have a crush on ya boy Mori.", "Mori feeling the heat already: https://www.youtube.com/watch?v=bRYzW77m8To", "Man I love Kiara's bright & uplifting personality.", "I got pretty lucky when I started. I got Hoshi, Silence and Red. They've got me through everything", "Same i got really lucky.  I got silverash, exiusai, and angelina", "I tried to make a Hololive tierlist once, but I ran out of space in the S tier. :(", "When they do this for Granblue, i'll be all over it.", "Next time you do a gacha collab stream. Collab with Subaru senpai!\n\nIf do gacha pull collab. Don't collab with Aqua unless you are an M or don't mind a lot of salt. Aqua will take your luck away and add to hers. Still wouldn't mind Kiara suffering noises. Ina I would feel sorry for.", "Why must you hurt us this way Kiara 😭", "This is my line “I’m not a simp, just enjoying watching vtubers”", "Ina putting all the ships together is one of the many reasons I adore her", "I need an arknights collab with Kiara. simillar to  cardfight vanguard zero's collab with Suisei", "I missed watching this stream live because I didn't want to watch this without context. Today I spent 6 hours getting into arknights, now that I feel settled in, I will watch this stream.", "Welcome to gacha hell", "@JeanJacques Lafleur As someone whose done a lot of cocaine, I can say with absolute certainty that Arknights is waaaaayyyyyy more addicting than coke", "Damn. I missed the stream cause of work. Gonna have to watch the archive after the commute", "Tbh the male operators in Arknights are severely lacking compared to something like FGO \n\nThere is only like 2 good ones", "If I had to be honest here.... I only played FGO, but not Arknights.  So I was neutral about this but  the male operators  are really that weak compared to FGO's and that there is only few good male ones then I take that as information for myself. Still...OOF.", "FGO is on another level no doubt", "FGO also has the advantage of having been around longer, with a prepackaged fanbase behind animes and VNs. Except where both are gacha games, the comparison is unfair.", "We biased so much in skill/performance in arknights. We could focus more on story/personality in fgo tho", "I mostly agree with Ina's rankings.", "Amiya is my favorite, probably because of the story and i love cute bunnys, she is best character. \nMy strongest is Siege and Ceobe. If i were a character in AK i would be Vanguard or Specialist. \nKO KO DA YOOO I love her, ive her mostly because of that X'D\nShaw the cute Tanuki, very usefull in some missions, especially when you dont have any one else who can push heavys of the map, Shaw is i think the easiest to get of that sort.", "We need Ina speaking in German,it has struck me that Ina is cuter when speaking other languages", "Best waifu for me..is Blaze. She's one of my favorite units..plus her design and weapon is amazing. But if I were to think of my favorite theme..is Eucentas's theme. Machine Evolutionary..sorry if I got that name wrong.", "I love how Ina knows the deep lore and cough the suffering", "Waifus rating waifus. We really have hit peak culture.", "I can't believe I missed Arknights content. Damn, well thanks for being amazing as always Ina and Kiara!\n\nEdit: KIARA LIKES BLUE POISON SO I LIKE HER (MORE) TOO", "tectone will be reacting to this", "they did my husbando SilverAsh(our lord and savior) dirty, same with courier(smell's good tier)", "One bird can't finish a bowl of Fruit Loops - but Toucan.", "Many said that SA VA also voiced Diavolo but for me, he is Kamina first... ANIKI!!!!", "this was a total joy to watch. i love arknights and my favorite bird and octopus rating the operators was awesome!", "This was very entertaining. Making a tier list of characters is always very subjective. It's good to see both Colonel Kiara and Ina'nis even if PC-kun died for Ina towards the end. Thanks to both of you! See you in the next livestream! 🙏❤️✨", "I don't want hoshi to step on me, I would like her to princess carry me though", "Well I guess I'll pick arknights back up, lol.\nI always found the game to be fun, I just didn't have time to play it.\n(Just did the first pull on this phone and got exu. gg early game)", "I wonder if they are gonna play Girls Frontline", "Iirc during Ina's debut she said she does", "Since you love Gacha I highly recommend Honkai Impact, it's by the same people who made Genshin impact and is of the same quality with fantastic animation and story. Also it's really easy on your wollet/great for free to play. I highly recommend.... Again", "I'd love to see you 2 do an arknights stream. ( i would be the jet pack guy falling into a hole in Annihilation 3)", "42:23 me i like the design of Doberman!!", "Loved the stream ladies I would watch more wiafu rating videos with other games definitely ❤ with gameplay or just talking either would be enjoyable", "I wish to truly see any Hololive member as an Operator, I would skip so many banners in order to roll for her/him.", "Watching Vtubers doing waifu tier lists is super mind blowing haha. I enjoy this content", "I love Kiara and Ina they are so amazing <3", "I'm in love with Perfumer!", "Watched most of the video expecting Manticore to get no love since most people never use her, and was very pleasantly surprised. Manticore is the best and deserves all the love. Also, she's pretty useful as a damage dealer in general if you use her S2. I tend to use her on almost every map, though obviously there are exceptions.....", "Is it just me? Cuz I hear Pekora in Kiara now~ XD (Especially when she laughs)", "A shame neither of them rate Estelle or Mousse that high.", "Love Live or Idolm@ster tier list when?", "When kiara put yes label\n\nJohn seed : yes", "Arknights : people try consume all their sanity to 0.\n\nOf course Ina loves it.", "I would love to see the 4 hour long fate/GO version of this!!", "These are some incredibly cultured waifus, exactly as I expected. SOOO sad I missed this stream.\nKiara’s experience is closer to mine - didn’t get Exu for awhile and got Hoshi SUPER early (literally first 6-star).", "wait what!!!", "Who else didn't get bagpipe?", "Not even the tierlist didn't get bagpipe", "I totally fine with just Utage", "I dont get her, thinking about whaling a bit but I have to hold it till W banner", "I was playing the game religiously for 8 months, but when I didnt got Bagpipe I got so sad and empty I havent touched the game for more than a week now.", "You’re almost at a 250k subs! Keep up the good work!", "This was great, thank you Kiara and Ina! ❤️ Next will be gameplay, right? It'll be fun!", "After such a long time...\nI finally found a fellow Astesia kinsman...\nI agree with everything Kiara said here", "FFXIV collab streams hype", "This was so much fun! I hope you ywo can do another tier list if your waifus from other games or series. Like the Tales of games or FGO!", "It is interesting how opinions can differ by a huge amount for some characters, depending on when you get them.", "KKDY 33:59 And it sounds so like her~ XD \nNicely done Kiara~ XD", "HEyy Kiara! You want some arknights character music?! You should check Isaak Wolf.\nHonestly he is so talented, he should have more recognition >_", "She should try playing love live w", "I missed this, but I'm glad is 2 hours long", "see Ansel in D tier\nI can't believe you've done this. How could you betray me. Ansel is literally best girl, just look at his gorgeous summer skin.\n\np/s: jk, I respect your tier list, Ansel still best girl tho. I wish Arknights has grail mechanic like FGO so I can promote him more", "Kiara's love of Ptilopsis made me happy", "Had to catch the archive, but this was a cool idea for a collab (even if all the males sadly got relegated to D tier).\nThanks for the stream!", "1:31:40 That is the correct placement for Shaw", "Thx for the stream it was fun seeing you guys rank this", "yay finally someone loves plume's hat", "The lack of 'defenseless' memes on Skyfire confuses me to no end.", "Poor Sesa, forgotten by all :(", "Arknights Banner Pull stream when?", "Kiara is the cutest majestic chicken. I would love to see her get permission to play Tales of Berseria or Zestiria since she loves Tales so much.", "Ina could be a mage with the magic book.", "Now I want an arknight collab with all five Holomyth idols as units.\n\nGura would be a vanguard with an auto skill that causes her to go into a shark frenzy when it triggers that boosts her attack speed and damage", "i made the background music a bit leis..  quieter :)", "Love to see some Arknights gameplay", "can't wait for Hololive-En x Arknights Collab! Fingers cross!", "Ina almost loses her sanity when Kiara put Exusiai in B", "She needs a KFP employees outfit and id die laughing.", "Want to play Arknights...but I am playing Azur Lane and my phone has run out of space.", "Kiara is not wrong, the dudes are \"D's\" xD", "Hopes for another wonderful week for HololiveEN", "Red above S tier women of culture ^^", "howwwwww did i miss this stream nnnnnooooo", "Tea-Apple-Sauce the Best \nKiara is a Bird of Culture aswell\nTectone would be proud", "As long as Saria's both on their top ranks, I'm gucci.", "Waifus making waifu tier list.\nA surprise but a welcome one.", "アークナイツ面白いよね、ちょっと難しいゲーム！", "言葉はわからなくても好きは通じると感じたアークナイツ語りだった", "Watching this despite not knowing anything about ark knights", "Lancet-2 best waifu", "Please do girls frontline next!!!", "Part time warrior(in the vid description) is that a steins gate reference?", "All the men got D.....\nI kinda jelous 😂😂😂", "Thanks for the stream", "i missed the live broadcast by 2 hours... i failed...", "where is the intro music from?", "I havent watched yet and I'm gonna be very disappointed if Silverash isnt top tier on at least one of their lists.", "I thought Ansel was a girl for the longest time!!!!", "1:34:40 Kiara's got a type hahaha", "I don't even play AK, just GFL, but I just like to listen y'all talk about things you like.", "My man", "Well at least the dude tier got their own waifu", "Hoping these girls play Epic Seven. Lots of great Waifus and Husbandos there, plus the story + gameplay is great IMO", "installed arknights because a lot of holoEN operators at least mentioned it in their debut videos. \nif I get hooked by the gaccha I blame the lot of you!", "Turn back now unless you plan to spend some cash", "Kiara is like me: no dudes", "kikkerikiii. Nice tierlist kiara, dont be disheartened that your list differs from majority of opinions. To be honest its similar to how i think in Arknights where all the guys go to the bottom tier 😂😂 (*stares at my e0 lvl 1 silverash n hellagur*)", "Gatcha Games are a Culture in and of itself!\n(I play Azur Lane, Arknights, and Fire Emblem)", "Kiara: sorry m*n, D tier. Quite fitting.", "@Kiara since the audio delay seems to only affect Ina, shouldn't you let her do the countdowns and then match her timing instead?", "Exu in B? Hand over the kneecap privileges", "Tenchou is strict on her opinions and I respect her for it!", "awesome stream, keep up the great work Kiara and Ina ! <3", "JUSTICE FOR ACE\n\nBOTTOM LEFT KIARA", "I love that Ina likes characters based on the VA as well, mainly because I do the same thing.", "would be nice to see one with girls frontline", "Techincally there IS a guard with a sword and shield but as usual he ain't here yet\n\n~~also durnar is an aoe guard, no exceptions~~", "thats why Ina drains our sanity, its to grind more arknights", "I tried to watch but passed out.", "Ina put Ceylon in top tier, I approve.", "34:00 for KO KO DAYOO", "Wait a minute! Now I know why Table-kun's suffering!! It's to protect Blue Poison underneath!!! \n\nDoes that mean all those Vtubers are getting...... OH GOD!!", "I hope they all have poisoned tongue resistance EX skill!", "An FFXIV collab? 👀 yes", "Why Ina's part more blurry than Kiara? Idk for sure, but I'm feeling that way.", "Tea Apple Sauce? \nDid Kiara watch Tectone?!", "Me who simp for every operator", "ニコニコ動画のきりぬきを見てきました！\nいっしょうけんめいがんばってるんですね！\nおうえんしちゃうぞ！", "damn why you gotta hurt ansel like that", "“Exu came into my life so late”\nHonestly same, I was also relying on Blue Poison till I got her lol", "I have Metor maxed out and she totally underrated. She not as good as an Exu. She does hit really hard with and armor break so easy to get tanky targets. Exu just kills everything.", "I honestly still use BP Over Exu most of the time...", "@129das Ye meteor is underrated", "@Soulblitz same", "0:02:40 AO-chan~", "Ina skin for deepcolor when?", "What a kind Dokutah Ina is!\nJust wanna say it.", "アクナイキャラでこんなのやってるのねウケるｗ", "this is some cultured stuff", "I like not knowing the context azure lane. The discussion of apple pie", "Arknights Hololive collab pls", "Such Fun!", "kiara is the wlw representation we, the gays, deserve,", "Something I gotta said about deep colour, is that her regular art is nice and a C is understandable, but her E2 art is one of my favorites, on how her personality changes in that E2, and for that I would put her in A at least, is just that good her second art", "Same. Never used her, but her art is just sooooo good", "They forgot to add Fubuki in there.", "Completely agree with Kiara. Waifus for laifu! My tier list would almost look like Kiara's except- ", "even in English, i don't know whats going on", "Ina's taste is supreme", "Sora is a good support i use her as one of my supports", "\"Something something... Voldemort bad blah blah blah... The point is Harry, is that a PHOENIX is just a GLORIFIED CHICKEN that cooks it self\" - Albus Dumbledore to Harry Potter talking about a snake in the sewers", "Kiara would be a guard with a revive skill, perhaps a second skill that heals herself/close allies like Gummy", "Sniper class for me", "Ptilopsis best girl, she is soooo cute.  And I'm glad the nuclear family is on the highest tier all of them", "I haven't played in months (about half a year), but ApplePie and Ablublublu are my favorites. Exusai and Shaw are just so cute and strong!", "fgo tier next pls", "Surprisingly cute and fun duo. I like all 5 of the english hololive but I usually like the game related stuff so I didn't see too much Ina and Kirara compared to shark and amelia. \n\nBe nice if Ina was a little louder though. Every other member is so much louder and sometimes I can barely hear her.", "Ah but that's part of Ina's charm", "@The Funk I mean more that her mic volume is a little low. It's different than having a quiet voice naturally. \n\nI'm kinda like that too, but I have set up mics to work with it. It's doable but I don't know what position she is actually in while streaming either. ", "@YuyuHakurei Oh yea I see what you mean.", "The most cultured idols I see", "I don't even play Arknights but I'm still watching this", "FGO waifu and husbando tier next", "Ifrit belongs in the KFP employee tier. She can grill up some Kiara and Yagoo burgers.", "Ina is actually Deepcolor", "Good tastes girls, also Kiara putting the boys below lol", "Came here again to hear Kiara's Schwarz pronunciation", "Takanashi Kiara describes herself as a fast redeploy defender with a phoenix as e2 art: exists\n\nArknights devs: WRITE THAT DOWN!", "The tier list that i agree", "S for Silence? YES.", "Don’t really play this game but I saw siege artwork a while back and loved her design. She also reminds me of botan who I also like so only came here to see where siege gets placed. Was not disappointed.", "Thank you for this delightful collab stream, Kiara! We would also like to thank Ina for coming! Watching both of you rank and discuss Arknights’s vast cast of operators was wholesome as it was interesting to hear your respective opinions! This ebullient discussion was lovely and we’re glad that you two had fun with these tier lists! It would be a pleasure to see you and Ina play the game together sometime in the future! :)", "BOTTOM LEFT", "Ina = Watame 2", "Ina is Based , Kiara is Biased ... still love you both ... hope for more Arknights and Other Gacha content on the Future", "Waifus ranking waifus... We reaching peak entertainment right here bois", "D-BOIS!", "Hope they at least play the game", "If you really think about it, Ina'nis is just Deepcolor.", "Rate the Project QT girls!", "Arknights Hololive collab", "I don't play AK much but GreyThroat is SSS tier for me.\n....Especially after I accidentally called her Greyhound.\nDarn it, Tom Hank's movie.", "BEST TIER LIST", "Can someone explain for me the significance of bottom left", "Call me a lizard furry but yes I’m so glad ina agrees. I heard 12F’s voice and was liek wait- that’s kinda hot", "Kruus is a reskinned Pekora", "Is this the first ever stream of tier list content for hololive? I don't see the previous member did these type of content at all or am i wrong?", "Yes, the tierlist ranking streams are done mostly by western content creators i think.\n\nAlso, the hololive JP girls DO play gacha but they play different ones, the only gacha they play in common might be Azur Lane and it's only Marine and Fubuki.", "@Ivanator The Great oh wow!  They're making history to introduce this type of content to Japan audience. I wonder what they're reaction to this?", "Kiara could be one of those guards that blocks 2 cuz of the shield", "Lmao", "12F is a good boy, don't disrespect him", "Ina has good taste", "In another gacha game, Kiara the Alter Ego is super effective against Foreigner class, such as Ina...", "It was fun to see their different options of the Operators,\nPhoenix of culture indeed", "Time for my daily dose of fiery cannibalistic immortal chicken", "I've never really gotten into gacha games, but hearing you guys talk about this stuff has me wanting to give this a try. My wallet will probably hate me, but it'll probably be worth it!", "You can play for free, that’s what most people forgot. Or they are afraid because they have an unstoppable gambling addiction. Which you have no one to blame but yourself, since all gacha games always gives you a warning and term of service...although no one like to reads i guess lol", "you can play arknights once a week and still be fine. But yea better if you play every day.", "Ricky Kicky", "I love you Kiaraaa", "If Hololive JP had Azur Lane then HoloLive EN should have Arknights for collab units.", "Que delicioso pollo y pulpo", "1 brain cell and a birb brain", "Starts 1:05.", "🥳🥳🥳", "Takotime", "PENGIUN LOGISTICS FTW", "フブキちゃともアークナイツコラボして欲しいなぁ…通訳はココ会長で", "I agree with Kiara about Exusia, cause I’m a F2P and Been playing this game since launch, but still Exusia still hasn’t come to me. My friends just show her of in their accounts and I promise myself I will never use her as a support operator until I get her myself.", "There's a lot of insight to be gained from listening to people talk about a game over simply reading an article.\nSure, I could read about Arknights on TVTropes or somewhere, but listening to players passionate about the game tells me more; I have no clue how it plays, but I'm getting clues as to what's important.\nI've not played it, but it sounds like a fun game, and I hope we get to see them play it on stream someday.", "Arknigts is a tower defense game\n\nAnd they actually make their own type of td...\nWhere most td game are just putting tower to kill enemy before they reach the goal", "Nice", "I would whale for kiara if she was in arknights lol", "Hope that they'd do a fate waifu tier list too 😳😳", "i think that would be an endless stream", "Would be too long to try out. Too much to talk about like deeds, past, lorewise, fateverse wise, gameplay wise, voice, personality, etc. 8 hours I bet.", "アークナイトを長い間プレイしていて、レベル9に達しましたが、なぜアメリカ人はwaifusを愛するのですか？", "Texas is top tier", "Where is tachanka? The Lord does not deserve this.", "Lmao Ina made a top tier Blade runner reference 2:32. M", "A surprise...but a pleasant one to be sure", "and this is a free advertising ???? the game should do a character only for you two because this is a big advertising of the game serious i start to play because of you girls, maybe a collaborating", "Base on the tier list Ina is a furry.", "... they even rated the male guys ...", "Ina'nis better do Fgo next", "KOKO DAYO 👍👍👍👍👍👍👍👍👍👍👍👍👍👍", "FGO TIERLIST when bossu Kiara?", "ina is so quiet...", "Poca Poca Pola", "aww, i was asleep and missed it", "kikkerikiiii!!", "I have no idea what Arknight is, but I'll happily watch you girls regardless <3", "the bird with garbage taste", "Coco will be broadcast live at jst at 10 pm, and I hope everyone can come and watch it", "Matoimaru in C!?\n\nBooooooooo!", "Matoimaru is definitely top-waifu tier. Of course, that might just be my bias for tomboys, tall women and in the case of monster girls, Oni women.", "Wait but Misha is a girl .", "But alex is a guy\n\nSo which skull shatterer", "Can someone explain me,is Exusai that good of a Character for people to reroll to get her?I do play arknights,and got her on the beggining,but she doesnt seem THAT good for me :/", "Not particularly, but she's definitely a beginner friendly operator... Most stages u need a good single target sniper but any single target sniper can cover her role with enough investment she still deals the most damage though.", "@Soulblitz oh,i understand now thank u", "@Moon Yuushi Personally I use BP more since she does more consistent high damage", "Moon Yuushi She’s considered 1 of the top 5 strongest and useful operator in the game, so there’s that.", "Ina is def a supporter summon dps", "And yes there is a guard with a shield - Sharp", "I hope Hololive does a collaboration with Ark Knights like they did with Azur Lane. Would be so cool to see Ina and Kiara As operators someday", "Having played through the AL/HL collab, I wonder if another one would come.", "I love Kiara, but if she wants more viewers/subs/etc she needs to do actual gameplays so viewers can get involved and be entertained, rather than constant talking streams/thank you super chat reading streams", "🤔 she's definitely done at least two game streams", "she did several super mario streams and that chicken game and fall guys...wait i think she played as many games as shark and detective! i think the rapper and ina played less games or at least the same amount", "It's worth noting that out of the amount of Gaming streams at the time of your comment, she was just below Gura in the amount of streams (5 vs. 6, though now Gura has 7). She even did a gameplay stream hours before this stream.", "I don't mind but I like she's honest. I respect her opinions on her taste.\nBut man,  that D-tier; it is kinda brutal. She did not give guys a slither of chance. I know it's an arknights waifu tierlist but. . . . . .\nOOF for the guys especially on Ace but also Ina's PC.", "tbh the males arent all that great compared to FGO where the top 5 grailed servants in JP are 4 males 1 female", "@ϟ  True true.", "It's off topic but, is Astolfo a waifu or a husbando?", "@Aydın Öğrenci  Waifu I guess or maybe both.", "@Aydın Öğrenci both", "Personally I'd make separate tierlist on likable characters, character designs and operator usability for arknights", "Is arknights the best gacha game in your guy’s’ opinion? I don’t hate gacha and have been sucked into a few in the past, but there’s only really enough time in the day to keep up with one. Is Arknights the best one out right now? If not, feel free to reply with your favorite.", "If you don't mind spending money play ak, if just want ftp waifus go gfl or al", "It depends if you like tower defense games.  It's probably the best gacha game in that genre.  Other games have different types of gameplay.  Ina is a gacha whale, so if you follow her, she'll probably introduce a few of them, especially FGO.", "GustaveXV FGO?", "@Vgamer311 Fate/Grand Order, the King of gacha games.  FGO's main selling point is probably the story and its connection with the rest of the Fate (and Type-Moon) universe.  Players can go into FGO without any background knowledge of its universe, but it does make it more enjoyable.", "Grani should be garbage tier for all the times she couldn't block a more than two enemies.\n\nGod I hate you so much Grani, it may look unreasonable to you but I really detest Grani's existence."]