["Two extroverts clashing is truly a terrifying sight to other more introverted holos, no wonder Coco said she's afraid of Subaru's outgoing energy.", "It's also Subaru doesn't show other emotions other than that, in a way it's like someone who always keep a straight face, we can't really tell what they are thinking for real.", "It's a binary star system, and each of them is feeding energy for the other.", "@Distinct Loafer ...I dont get it?", "I legit never seen any awkward collab when subaru is in it. Her energy and contagious laugh just brought the atmosphere up.", "@ZeWorld Someone who’s always bubbly and cheerful is just as good at hiding their true feelings as a quiet and somber person.", "@Prodigi50 same goes with kiara, this is like her first time letting out this much, it was unexpected.", "@Alvin R \nThe two are shining like a nova.", "Same energy\nScary", "If the hololive resistance was led by this 2, they will be really formidable. But if kiara joins the holo police with subaru, the resistance won't stand a chance.", "There is so much energy in this stream you could power the world for an hour.", "Her voice is really loud, this is really scary, more for introverts, but actually she is really nice and easy going, the only problem is her voice", "just can't wait for coco inviting subaru to her meme review... what it could be?", "ASSERT DOMINANCE", "@ZeWorld  See, I think Subaru has a nice personality, I loved her, but because she wants to maintain composure, we will be less likely to tell if she have negative emotions, Im not saying it's a facade, I believe she is really mentally strong to have a bright personality like this. But on the other hand, I personally am a person who people think Im super calm and composed, that's a good thing, but it made me reluctant to show my emotions after time has gone by, because I thought it's out of character, so no ones really knows me. ", "@Distinct Loafer well good explanation but maybe I just dont get it cause its not related to my comment", "@ZeWorld  Oh Im just saying why Subary might make introvert or sensitive people afraid or pressured. Cause I saw you say even Coco are afraid of Subaru.", "@Distinct Loafer oh ok then", "@Distinct Loafer As an introvert, I love people like Subaru. I need someone with her sort of energy to get me talking.", "This was probably one of the best collabs that I have seen. The only bad thing it's thats it was too short :(", "Leaves you wanting more, just like fast food. Hmmm...", "@Serpent XI Welcome to KFP, Can I take your order", "They said at the end they plan on completing the game so we have more holobirds to look forward to.", "Feelstrongman", "Agreed", "@Farid Abdurrahman ah yes, I’ll have 2 number 9s, a number 9 large, a number 6 with extra dip, a number 7, 2 number 45s, one with cheese and a large soda : )", "I can't help myself but laugh at your profile pic.", "Dont worry its just the first one, there  will be a lot more specially as kiara is fluent in japanese so she will probably be the one of the bridge to alot of HoloEN and JP collabs", "@Sethh h agree", "you call and hour and twenty mins short?", "@SEANLHIL xboxone You gotta eat to keep your strength up", "確かに......！まぁ、可愛かったからOK！", "I was so excited for this to happen since day one!", "@Serpent XI leaves u wanting to learn japanese... damn", "The only bad thing is that it was japanese, guess it wasnt made for us that dont speak japanese yet", "@Zurugashi but you can also enjoy it, its like watching Tom and Jerry i think", "Agree", "What the hell, she isn’t the bridge, she’s the only entrance. None of the girls can speak Japanese or English fluently enough to make it like this stream. They would need kiara or a google translate for like, every word they say.", "@Chua Jocrafter23 well I used to watch korone before, even before she started to make en only stream to gather more fans, the dragons lair stream was my favorite \n\nI enjoyed understanding very little of what happenened, when EN came I actually knew what they were saying LMAO", "An hour and 20 minutes of high octane energy is absolutely plenty. Too much more and either they'd wear out, or we'd wear out. It was absolutely insane.", "Of what I saw, collabs are usually like 1 hour in hololive more or less, so I was expecting something like this", "2nd biggst thing to happen to hololive  probably.  Kiara pretty much broke the ice for  holoen and holojp to start really collabing together.", "@-普通 Yes. Yes I do", "@dd dc There's one with only her eyes, so yeah lol", "I saw your comment before I watched the video and was like: \"what is he talking about, 1h 22min is plenty long\"\nNow after watching it: \"I totally agree\" and \"give me more\"", "@Zurugashi I used to can't understand japanese at all, thanks to a lot translators on YT, I learned more little by little. Sometimes I tried to catch up (JP)streams hopefully I can understand, after then I find some translations out there to be sure I won't understand to a wrong way. Now I getting more enjoy than before( though still su*k at it).....sorry if my English is bad", "You're toes are too short. Roasted.", "I think with them be so hyper like this, it must be very tiring. So maybe they’ll want to wrap up early.", "The first of many! One can hope", "Too bad I can't understand Japanese", "@ShunkenOne thank god i MISSED IT the stream so im gonna watch the vod now \nLooking forward to the next stream", "@Zurugashi well if you watch a lot of anime sub, you might understand a thing or two about what are they saying, like me for example", "@ShunkenOne holobirds? subaru is a bird?", "@Random Guy Oh I do, but it just isn't the same anymore. Before I wouldn't mind only understanding some words, now I can't watch it if it's not fully in a language I understand. That's why I'm studying japanese, I miss watching Korone streams hahahaha", "Agreed. Such a great collab. Amazing chemistry between our two birbs.", "コメ主の名前クッソw", "Ogey", "Both of them felt like slightly different persons today. Hyper energetic, full of laugh, not a single moment of silence or a pause to think about what to say. They must've really clicked hard. Very funny stream, can't wait for the translated clips.", "They were sure nervous for this collab that reached trending Twitter and 50k people live.\nAlso Kiara was at Subaru's House so it's understandable be nervous the first time in a new house with a girl you only chatted online and it's not native Japanese (even tho Kiara is very fluent)", "can't wait aswell.", "They blossomed into beautiful swans", "Kiara's strength is her ability to bring people out of their shells and make a fun atmosphere. This is 100% her using her talent.", "@Warudo1 was just till the start tho. they were in theire element while streaming", "@Warudo1 Didn't know her (and the rest of HoloEN, maybe?) were also based in Japan! Enjoying this stream for sure (Y)", "@bravo201 as far as holo en, just kiara and calli in jp", "@CupOfWhiskey how do you know that?", "@bravo201 She also say \"off collab\" at 4:45\nRest of Holo EN is in America/Canada", "@Warudo1 not nesscasary, only information we know is that 3 of them are in jp while the rest in the West. I won't be surprised if there's European ( minus Amelia ) or south east Asian in EN too.\n\nJudging from ina's stream time I think she's not in jp, every time she streams it'd be about 4 am in jp, unless she's a very early person.", "@Galaxy Swirl kiara and calli went on a friendly date yesterday and confirmed on calli's stream that they both live in JP. And gura ame and ina all stream towards EN viewers times since on east and west coast of U.S. you can catch all their streams in the afternoon or late at night and they dont know as much japanese", "3? Only Kiara and Calli are in Japan.\nNo one are in EU because I'm there and their stream start late night usually (like 3/4 AM).\nFor what I know reding people guessing and listen how and what they talk during their streams:\nKiara & Calli: Japan", "@Warudo1 yes, you can count it easily. \n\nKiara jp ", "I had always assumed Ame was somewhere in EU (her accent doesn't feel thick British though), and Ina somewhere in the 'mericas. Very interesting, bros, thank you all for the information.", "As a fellow EU, can confirm that when they stream (ina and Gura) here it's usually 4-5am. No way they're from here.", "Ame never stream at good EU time always from 1AM to 4AM, she's in America and her time zone is evident for me.\n\nGura is always hungry it's not a good way to predict their location.", "@Trucked As a fellow EU too I know how none of this girls are here", "@Warudo1 if I count with your time, I'd agree that Ame is probably in America and ina too. \n\nMy opinion about gura still hasn't change tho, unless there's concrete evidence she isn't in jp her interactions with Marine is waaaay suspicious.", "So here's my guess based on live chat, twitter and comment during this month:\n\nCalli & Kiara: Japan, 100% confirmed\nIna: Canada (at least the way she talk) east coast", "@Warudo1 don't forget about gura's interaction with Marine and also many comments saying there 3 of them in jp.", "@bravo201 Amelia according to american have slightly southern accent, for me it's sure not british English", "@Touch Meたちみ From what we know Gura know very few japanese, it's hard to think you can live in Japan without good JP knowledge", "@Warudo1 3 of them either never spoke Japanese or speaks too less to identify so how can that be concrete evidence? \n\nAnd to counter your argument of her not having good Japanese, she spoke with a Japanese and she's called marine. If you tell me you can't live in Japan without good Japanese and then proceeds to tell me interacting with Marine is different from interacting with other Japanese then I'd really face palm you. ", "Bird brains together strong", "@Touch Meたちみ To be fair Gura is mostly mistery for me about her location.\nBut I'm pretty confident about the others", "@Warudo1 also, Calli doesn't speak fluent Japanese either and are still living in Japan, so your argument sounds empty to me.", "@Touch Meたちみ you can hear guras tummy rumble when she streams and also we don't know how much they really spoke, and the fact that she doesn't know as much jp just gives signs that she's not in jp, plus look at her streams times, 9pm est usually, that's 10 am jp and she's usually tired and hungry and what not", "@Warudo1 southern???? Nah, idk where people got British from either lol, but she's definitely in the states, someone mentioned ina could be in Canada which could be true not sure though", "@CupOfWhiskey she did a British accent the first few seconds of her first stream which seems to still be confusing people but she is 100% USA", "@atariDC_ lol yeah but it was clearly a joke, not sure how someone could think she's been doing an American accent on purpose for a month 😂", "I'm not sure why people are saying Ina is East-Coast - judging by time-zone clues, I believe she's in West-coast Canada. She also took Canadian Thanksgiving Monday off, which supports the idea that she's in Canada, although there's nothing stopping her from streaming on Holidays, of course", "@Warudo1 Ina and Amelia have both shown the time on their Switches (Ina during Animal Crossing and Amelia when she ragequit Mario Odyssey). Ina is PST and Canadian so almost certainly in British Columbia somewhere, and Amelia is CST which narrows it down to 20 states lmao", "Ina is almost certainly western NA and my guess is Canada. When she posts her schedule for the week, PST is the only time shown and her pronunciation of 'z' as 'zed' is a pretty big Canadian tell. And if she's not from the west coast, then she could absolutely blend in as her vibe is undeniably chill.", "@tomacas i completely agree with these, makes the most sense and its nice to know that at least some of the girls can hang out together irl like calli and kiara, mad wholesome", "Two birds goofin'", "Guys stop  speculating about this, just wait if the girls confirms about real life topics.", "@richterlonewolf ain't nothing wrong, we just speculating, not claiming these are facts, its not a big deal relax", "@CupOfWhiskey speculating gives antis like 4chan and 2chan the tools to search  personal info about the girls, that's why, there's already posts like that which fans have already reported following Hololive guidelines to protect their talents.", "@richterlonewolf if you go to any of their streams this stuff is there, we aren't making things up so idk how any of this is private or unsafe info, anything we have said in this long chain of comments under 1 video among thousands, is from their Twitter and streams and we are basing our thoughts on that, pls stop tryna police people outside of streams because people are going to talk about this stuff regardless, don't make this seem bad", "@Touch Meたちみ didn’t shion say on a stream she was talking with gura using google translate? Gura interacting with Marine could have involved similar methods, like a speak to translator.", "@Vayate yep being personable is a natural given talent, not everyone has. Being able to be personable goes a LONG way, even more than words can do.", "@Touch Meたちみ Ina is Korean, so I wouldn't doubt if she is still in Korea. However, speaks as if she lives either in the US or Canada...with a slight accent.", "@Dynamic Jae Thought Wait what Korean ? Sauce bro", "@CupOfWhiskey The offline collabs really do have special energy and it's great to see how much the girls support each other. I think Kiara's confidence will go way up the more JP collabs she does. \n\nI hope none of the other EN girls feel too isolated. Maybe when traveling is easier again they can do a big offline event or something", "@Warudo1 Ina is Korean. I wouldn't doubt she may live in Canada, it seems more likely...but she is definitely Korean.", "Btw not having good Japanese doesn't mean you can't live in Japan, so don't take it for granted.", "@Touch Meたちみ Calli may not be exactly fluent, but I can pretty much place a huge wager, she speaks high school level Japanese. Same with Gura, even if she may not live in Japan. Ina is Korean, and speaks Japanese very well...even if not exactly fluent.", "@Engurd in either her debut or early streams she mentioned it a couple of times", "@Engurd Source? The girl herself. She has repeatedly stated it.", "@Vayate I completely agree. Remember when she was sad/worried about not bringing as much to HololiveEN as the other girls? This. This is what she brings that no one else can do.", "@Dynamic Jae Thought Yes, a lot of canadian say she probably in Canada after how she pronounced \"Zed\" instead of \"Zee\" in CTRL Z.\nAlso this same people say a lot of korean origin people live in Canada, so it's not strange if it's a korean-canadian girls according to them", "@Warudo1 you can", "@CupOfWhiskey you don't even need to know that much japa", "@Touch Meたちみ Ina lives in West Coast America or Canada based on her animal crossing stream - as that's what time zone her clock was in.", "@Reggielacey 223 Sorry but what of my many message here you quoted to reply \"you can\"?", "@Touch Meたちみ Ame's accent doesn't sound British at all, what are you on about?", "@Touch Meたちみ Ame's accent is absolutely not British. Even Gura's British accent is better than Ame's. I'm actually glad Ame keeps the British accent to a minimum. I wouldn't be able to watch her if she tried doing an entire stream with it.\n\nKnowing how fearless Senchou is, it wouldn't surprise me if they attempted to meet halfway, speaking a mix of Japanese and Maringlish. I don't think there's enough evidence for speculating about Gura's location.", "@Warudo1 I'm pretty sure Gura is east coast, because of a little slip up she did in a Karaoke stream.\n\nThe stream was held like around 9pm on Sep 30th (EST). During the stream, she was talking with chat about the song \"September\" and was joking about singing it as an \"End of September\" thing. But then she said something like \"Wait, it's October...\" then looked at her calendar and said \"No wait it's the 27th.\" ", "@R3 big brain time", "@R3 damnnn mentality 1000 % wow", "@CupOfWhiskey That's weird since Calli said she went to the \"Asian Market\" to get the snacks they had on the collab stream. If she was in JP, wouldn't she have just gone to the market? She also said in that video that she was really far away from Kiara.", "@KaylaKaze she tried to by anonymous about her location till recently, its for sure they are both in jp is because it was confirmed on twitter and on calli's recent stream", "@R3 I mean Gura has a very obvious east coast accent, sounds kinda New York to me", "@bravo201 ame-chan is definitely west coast and so is gura. her and ame-chan guerilla stream together in minecraft all the time and ina... I think ina-chan is still in school and living with her mom at the very least and that's why her stream schedule is always during what I consider the conservation streaming hours test way she can run her stream and then still have time to study and get to sleep early for school during the week  her weekend streams tend reinforce this theory since her weekend streams tend to be in the early late night around 2200 to 2300 and run way over time if it doesn't disrupt aby other hologirl's stream", "@Touch Meたちみ why would Shion need Google Translate to chat with Gura if Gura is good with Nihongo tho...? I still think Gura only knows a few common words and phrases.", "@bravo201 As a British guy, Ame sounds like a British girl who's been in America for a long time to me. You can hear the British in her accent, but the American is far more prominent.", "Months ago, if you told me Hololive was about to have an EN branch, I wouldn't believe you.\nMonths ago, if you told me Hololive JP-EN was going to collab, I wouldn't believe you.\nMonths ago, if you told me such a pure and wholesome community existed, I wouldn't believe you.", "I feel ya mate.❤️ \n\nWe do be lovin’ all of this wholesomeness.", "oh damm", "Sry about that guys. Just wanna get it out because it's been such a long time that I've ever felt so rejuvenated and happy. I guess many of us have become jaded after everything that has happened this year. I'm so blessed to be able to be part of this community.", "\"pure and wholesome community\" That's a bit of a stretch, but okay.", "Well, Coco announced it months ago so I wasn't suprised, I just waited~", "It's too good to be true and yet here we are. Truly a blessing to behold isn't it?", "@mulligin75 just let 'em have it, friend", "Pog", "♥️👌", "@mulligin75 shhh~ don't ruin the moment. Let our brother have this one ♥️", "your name kinda familiar but yeahhh...............I feel you", "Once you go inside the hololive rabbit hole, there's no way back.", "I just hope that Hololive will grow more and also hope to have a Hololive International", "Yes but kiara is like Coco living in Japan with known English. Kiara could have just as easily joined hololive jp they likely where she sighed up in fact but hololive suggested she join the English branch as a go between", "The community as a whole isn't pure and wholesome, but I get what you're saying", "@Moonlet well, the fandom has extremes on both sides of the spectrum, but the positivity I’ve seen definitely outweighs the negativity.", "Yucky", "They probably had it on works for some months already \n\nYagoo landed a goldmine with holoEN", "If you told me an immortal phoneix and tsundereaper would get married I wouldn't belie- actually nevermind. Sounds like the plot to an anime.", "Cringe", "@Fleshy Potato let 'em have the moment", "@buggs bunny The moment is cringe", "Wow you really have trust issues, those would be very believable things to me if you told me in 2018", "@Fleshy Potato what's cringe having fun?", "LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL.", "LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL.", "LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL. LOL \"WHOLESOME\" COMMUNITY LOL NOPE BRO LOL JOIN 2B2T(.)ORG ON MINECRAFT, THE OLDEST ANARCHY SERVER FOR JUST $20/monthly LOL.", "Top comment 2020 for me, touching and true", "Wholesome", "GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN.. GET FREE WIFI ANYWHERE YOU GO! WIFISTEAL! Hol' Up... AH THE PIZZAS HERE... AH.. MY EARS BURN..", "@forcexjr I feel sorry for you", "bioshock infinite reference?", "This stream can be fun cuz of everyone in it. The livers, the staffs, and also the audiences.. So, thumbs up to you guys too for making this stream really fun to watch", "Pure and wholesome community? Now have any of the Hololive members say in a video that they have a boyfriend and the entire community tries to burn the Idol down, same as with Aloe when she got doxxed and abused by the community so much that she was too afraid to come back.\nIt's pure and wholesome when the community lives in a bubble that their idols are uncorrupt, perfect little angels only meant to exist for their personal viewing pleasure, but in reality, they're actual people with their own lives to live, and that's what the community doesn't want to hear.", "Months ago, I wouldn't have believed you  if you told me I'm gonna watch these girls everyday.", "Yeah, seriously! Iwouldn't have guessed such a wholesome, hilarious and fun group would have ever existed!", "A chicken and a duck pretending to be a goose has never been this teetee... and BRIGHT!\n\n\nI had to put my sunglasses on to watch this stream because they're too bright. It's totally worth it tho.", "I willingly burnt my retina for this stream.", "Maybe Hololive is gonna make a turkey vtuber, boom turducken trio", "@Luke dela Cruz the turkey... might be an onee san or christmas cake", "Subaru's Engrish and the Chicken's translations,both make for funny collab", "BREAKING NEWS!\n\naccording to world statistics, there had been a massive increase of diabetic patients all over the world and at the same time the depression rate lowered!", "Can confirm. I have type 2 diabetes now.", "well.. it's fine it's worth it", "If the depression won't kill you the diabetes will\n\nDid you also know murders increase at the same rate I've cream consumption does?", "\"Insulin, insulin, buy your insulin here\"", "@Wil Han Ch. 2 please", "Even depression doesn't have depression anymore!!", "Welcome to the Crazy Carnival!!", "@Gora Bora sure mate, here ya go", "I have now switched to my new artificial body, and I needed a replacement immediately", "Hello,there fellow diabetes patient.", "As an person with actual type 1 diabetes, (Auto-Immune) I can confirm this, but you are 2 Years Late. I was diagnosed in 2018 so.", "Also insulin shots are better than insulin pumps imo, more accuracy.", "It's like Kiara is unchained/is a new person speaking in JP. Really wouldn't mind more heavy JP streams in the future", "I think that’s more because she’s got Subaru to talk to rather than because it’s Japanese", "I started watching vtubers to help with my Japanese studies, so I'm all for them. My understanding has been increasing more since.", "Kiara is like the bridge between hololive en and jp", "@Rueblie I don't know man, personalities can change drastically depending on the language they speak in", "@Firetribe nice keep it up", "@Vesica Piscis They also change depending on the people you’re around and since Subaru is very high energy Kiara rose to meet it. Being an offline collab also probably helped.", "@Firetribe Me too! It's also helping my Japanese listening skills a lot thanks to them.", "I would mind", "@FaFaFa Fooey got it you're one of those chinese antis.", "@Glitch Radius  @POI VIRUS  Thanks, they have also been a major motivating factor on top of that.", "@Firetribe yeah true.", "I've got the impression she's more comfortable with Japanese than English, not that her English is at all bad.", "@Glitch Radius Don't do that to me man. Im just saying I don't enjoy listening to a language that I don't understand, unless there is subtitles.  And if most of her streams were Japanese, I wouldn't be able to understand jack.", "Hololive en is too introvert for kiara", "@FaFaFa Fooey I agree with you, I dont mind a few japanese streams here and there but she's HololiveEN for a reason.", "@David Caine @FaFaFa Fooey I disagree, I feel that it should go both ways, if the talent is making the effort to try and learn/speak other langues for their viewers, we should also put forth an effort to also try and learn their langue as a sign of respect to them.", "@ValorGlory yeah like I said, Japanese streams as collabs or here and there is ok, but she's a part of hololive EN, theres Hololive JP for japanese viewers. \n\nHeres an example. ", "@David Caine Nah, still disagree, the talent should be able to stream how they want, if Kiara wants to do nothing but JP spoken streams next week she should be able to do that. Beside your analogy doesn't work in this context she isn't a teacher, she is an entertainer and they can, and do, speak a multitude of different langues. Your whole view is only based on how you feel, what about all of her Japanese speaking fans or German speaking fans that feel like they might be getting pushed to the side by the English speaking fans that are pretty much saying \"this is American, speak English\". I personally feel that if someone actually enjoys the talent they would put in the effort to try and learn the langue that the talent speaks, this goes for everyone. Take me for example I am seriously a complete potato brain when it comes to other languages and I have still been struggling to try and learn Japanese so I don't have to wait for a translation team to get the 37 different clips they are going to make done, because I enjoy the talent.", "@ValorGlory shes an employee that has a contract with an agency, do you think CoverCorp put her in HololiveEN for her to heavily stream in Japanese?", "@David Caine Uh oh, got him there. Was that a argument ending good point I heard? It sure was.", "@David Caine Of course, what would be wrong with that?? All jokes aside though, if she had permission to stream how she wants, like how it sounds like she did from the start seeing how it wasn't the company telling her to \"...not self translate...\" or \"...don't stream heavily in Japanese...\", I don't see what the problem there would be other then just it being an inconvenience to some portion of her fan base. Let me just say that we probably won't see eye to eye on this subject so lets just drop it and agree to disagree, ok?", "@David Caine it is something she's notably self-conscious about. I feel like she'll fair better in the long run if she eventually learns to dual speak similar to how Pikamee does it.", "@David Caine heavily stream in Japanese and Japanese heavy streams are different. I'm saying on the occasion  like the other girls Japanese study streams, JP heavy streams are fine.", "imagine the energy of a kiara marine collab", "@TheLucidChiba Yeah, I'm pretty sure she is more comfortable speaking Japanese. Maybe because she has actually lived in Japan (and still does), while she may have never lived in an english speaking country.", "@Low IQ Individual the shear level of Ero would be so high you could detect it around the world.", "Same", "@Rueblie Yeah, Kiara is at her most powerful when she has someone to play off of.", "Sorry, but I agree with the ppl that would rather keep the base of most videos in english, not to say anything is wrong with collabing with hololive jp, because all of them are really cool and cute too, but unless it’s subbed, I don’t understand Japanese anywhere near fluently enough to enjoy a whole video just in Japanese, which is why I enjoy there being a Hololive EN in the first place. Again though, I do enjoy watching hololive jp when there are subbed videos/clips because a lot of them have really grown on me.", "@Silverwind X So before I see myself out of this conversation for good let me make my stance on this whole thing clear.\n\nBasically if the Talent wants to do it and the company either doesn't tell them to stop or expressly tells them they can/should do it I honestly won't care what langue it is in, I have a problem when it is any group of fans that only speak one langue acting like the Talent shouldn't, or in some cases, are not allowed to speak other langues at all. ", "that means more collab with hololive jp", "I think its okay whether she wants to do heavy JP stream or not plus we all can see her foreign language abilities, right? Doesn't need to be everyday tho, once in a while just fine", "@Jey Kritov In the recent Minecraft collab, she mentioned another JP collab soon", "Despite being in Hololive en, she kinda appeals a lot to the JP fans what with her late streaming schedule and generous live translations.", "JP bros\nOverseas bros\nWe're all bros\n...", "That's bold of you to asume only bros consumes hololive...\n\n\nbut who cares we are all united to this lols.", "@SHUT IN well I do apologise for that, it was just the common term used. 😅", "We all bros! Every fans of hololive are bros", "NO there's only en fans and jp fans according to many Reddit users", "@Luchador Parrudo I'm an spanish fan lol But we're all overseas bros!", "@Mika Girlx yeah, but we spanish-talking fans are know only for spamming on Korone's chat cuz that's what our community does most of the time with everything that's fun, spam it till they burn it.", "@しろまぬええる Probably. I always talk english because of that", "@Mika Girlx same here, kinda hate spanish community most of the time.", "@SHUT IN that’s literally what we refer to eachother as regardless of gender & ethnicity \n\nIt is universal", "@EETV amen", "Though I didn't understand half of what they're talking about, seeing Kiara from HoloEN laugh with Subaru from HoloJP for basically the whole stream, really made me realize:\n\n\"These girls really have come so far\"", "indeed, also miku best girl", "All i hear was avian noises, also nino best girl", "\"I told you there could be a girl out there who'd fall for you....  Sucks for you that girl is me....  \" - Nino...", "Ichika gang", "Very true, 8 months ago when I started watching vtubers I'm still overwhelmed by the fact that we have an EN brach for Hololive and how vtubers have become widespread. I just feel like smiling because of how everything has been", "Also I see Bagpipe not Nino", "Wait, bagpipe is nino?", "@Findy Anderson She's like the fusion of Coco and Nino to me", "Miku best girl,change my mind", "Timestamps from Kiara's Fan Discord - Please join us Discord info below\nPart 1/2\n1:54 Giggling birds\n2:35 Stream Start + Bird noises", "Part 2/2\n42:39 Canadian English, Subarish\n43:35 Birds make poor kid trip over and steals his glasses\n44:05 BEST BIRD TEAM EVER", "The Kiara fan discord is discord.gg/kfp", "If you want my twitter for some reason it's @CaptPepperjacks my door is open", "GOOD LUCK CAPTAIN!, o7!", "there's a fan discord?!?", "@TheLobitzz One of the main fan discords, Holofans, open their invites every 1 week, and closes invites on the next, basically on alternating weeks", "@TheLobitzz Yes discord.gg/kfp", "doing gods work, captain!", "Yo pepperjacks, good hanging out during the stream. Thanks for the hard work timestamping", "@TheLobitzz discord.gg/holofans\n\nNot sure if invites are open this week but here you go", "Nice one captain , o7", "oh Kiara is in japan?", "@Artudela 00 Nice meeting you see u next stream ", "It kinda surprises me that she traveled all the way to Japan just like that for a collab.", "Nah, iirc Kiara and Cali are currently in Japan while the rest of the EN grils are in North America, thats why she got to go on a date with Cali.", "Thanks again Captain Pepperjacks.", "Stream start is wrong", "@Alan Thank you. I fixed it", "What a legend", "I’m so sad I missed it live, thank you for the highlights!", "40:12\n\"とりあえずさ、メガネはさ、鳥アイズ\"\n\"SHADDUP\"", "so like all of hololive EN is living in JP?", "@I Don't Want To Do My Best Only Cali and Kiara.", "@Captain Pepperjacks you didn't have to go over every thing that happened, but I appreciate the effort 🥚🐔 🦆", "Great to see both EN and JP bros enjoying the stream. The extroverted Kiara and Subaru combo is too strong", "As an introvert, I have one thing to say: I fucking love this", "Ngl, it was extremely wholesome to see EN and JP people talking in chat at the same time. Makes me even more excited for future collabs.", "Sepon's Bilif Rushia & Rushia boing boing", "genki energy is big and getting bigger", "I didn't understand much of the JP dialogue tho, waiting on subs", "JP bros: it’s time to learn English\nEN bros: it’s time to learn Japanese\nAnd that’s how world peace is achieved", "@Ng Gerald we are called oversees bros by japanese", "50K viewers: Chicken + Duck = PRIME ENTERTAINMENT\n\nAlso", "Now over 200K views, crazy", "Peak BIRD WATCHING", "He was laughing the entire time, he's really loving Kiara's streams.", "Now we just need a turkey and we can then have an entire turducken stream.", "@Lugia21 his Twitter Profile changed to Kiara’a “SHOCK FACE” since her debut\nHe really loves (trolling) his daughter", "The chemistry between them is amazing that first timers wouldn't think this was their first collab", "I agree", "They're bird after all", "The power of double extroverts", "And it's offline collab", "This was an incredible collab. Don't feel bad you weren't able to translate too much. <3", "this comment needs to be higher up!", "Live translators were there to back up Kiara, that was awesome.", "even if i couldnt understand alot this was pretty entertaining", "I never really realised how much Kiara's tone changes when she's speaking in japanese", "Just like pikamee", "@Daniel Yudistira Well actually I feel like pikamee is one of the few people who can naturally change languages mid sentence and still sound exactly the same. Even others like hana macchia and kiryu coco sound a lot different when changing from English to Japanese.", "Everyone's tone changes when they speak japanese", "Your tone changes everytime you change language, my english sounds deeper than my spanish. Or maybe it's just my perception.", "Yup, when someone speak in different language, the tone of we speak will change", "Yeah, I only noticed the shift when Kiara herself pointed out she's less of a perv while speaking Japanese. Although that may just be because Calli isn't around. She still did indirect-kiss Subaru and strut around calling herself a Sexy Bird, so it wasn't totally absent :P", "@Asm_T453 Pikamee's situation is pretty unique. She grew up in (virtual) Texas long enough to acquire the accent but left early enough to still have Japanese as a first language, then relearned English to the point where it sound uncannily native.", "It unironically happens to anyone who is multilingual, your attitude also changes depending on the language, for example, I'm a bit more rude when speaking English with others however when speaking Spanish I'm not rude at all.", "@Lugia21 me too, i don't very good with English but i think when i'm speak in English my voice is higher, when i speak Japanese i become chuuni....", "I really love it.", "She sound mostly the same to me, except of course for the physical pitch differences between English and Japanese, and weirdness that comes along with speaking a language you're still learning.", "@Nagi Chwam Professional Belly Reviewer no yeah i also feel that my tone also gets higher when I speak Spanish compared to my English", "@McDucky She's fluent in Japanese. As far as I know, she can read and speak Japanese perfectly, and what most of us are agreeing with here, is the fact that she sounds more relaxed and natural with Japanese, over English.", "That's normal. Your \"base tone\" is just as characteristic of how you learn and practice the language as your accent. It takes a whole other level of practice to keep the same base tone on all languages, and even someone that learned both in early infancy will show some difference if those around him/her also speak in different tones.", "I feel like whenever someone speaks a different language there whole tone changes", "She is completely fluent, they rate her as dumb but to pick up a language as completely as this suggests otherwise.", "The stream started with laughter, and it instantly turned my anxious excitement into joy\n\nKiara spearheads the Holo language barrier! If there's anyone who can bridge the foundations of JP-EN collabs, it's her\nSubaru was the perfect pick as well for every reason I can think of yes also because birds", "The farmer was probably Calli in this moment lol", "The farmer was like \"NO LEWD ACTIVITY\"", "Don't forget about Coco, she's still around.", "Holobirds forever!\n\n(Also who knew Kiara could randomly transform into a low battery message?)", "The wonders of pheonix reincarnation powers!", "BIRD TOGETHER STRONG WHEN THE CHICKEN AND THE DUCK COLLIDE A NEW BIRD WILL BE BORN AND ITS CALLED DODO BIRD(σ≧▽≦)σ", "As you may wonder. This collab is an off collab stream and yes, Kiara is now living in Japan and they streamed at the house of Subaru. If you want proof, Kiara said it after their introduction. This stream had 51K and this is the first and the best also a legendary collab. And someone said this stream was No.1 trending (idk if it's worldwide or JP only) but ye. Congrats to Kiara for 330K subs and first collaboration with your senpai. I hope for more Holobird and ENxJP collab, this was a success. Uniting The Overseas bros and JP bros fans. Also ", "Probably just a troll you should have ignore it, now you're gona spwan more troller to do the same thing because they crave attention", "@Volks Grenadier ye", "@Volks Grenadier ok it's edited now, tnx for the reminder", "I wonder if all the HololiveEn girls live in Japan 🤔", "#holobirds is trending on twitter in the US as well as Japan. Dunno if worldwide, but combined that is over half of all of twitter.", "@Dennis woah, good to hear though", "@Not_A_Bot only Kiara and Calli", "Amen", "Also found out that Calli lives in Japan too. She wouldn’t be studying Japanese so diligently if she didn’t live there.", "@Sam Hopkins Yeah, Calli even invited Kiara for dinner yesterday", "@Sam Hopkins I see I see I see", "@Sam Hopkins I don't even know that Kiara lives in Japan.", "Kiara made this announcement on her FE3 stream also she said she won't be in Japan for too long because she'll be moving again to her home country in 5-6 months :P", "@What a Simp KFP Navy Admiral I see", "@What a Simp KFP Navy Admiral she isnt native japanese? damn thats amazing! so what is she natively?", "@Persapius Austrian Phoenix", "@Persapius When I found out that her native language was German I thought she'd be from Germany but she is from austria I assume", "Hopefully the holojp can get their fill of this chicken while she's still in japan!!  Though it would be fun if kiara was included in the fun and games they do!~", "The easiest proof was the Nintendo Switch controller configuration part that they both did before they started the game, so Kiara really was at Subaru's place :D", "@Robinstheles she is from austria? I thought she doesnt like reading dialects so i just assumed she is from germany", "That was lots of fun,KAIGAI-NIKI！\n#Holobirds bring us together to this loud and funny stream.\nFrom now on, so many HoloJP and HoloEN collab will awaiting for us, I'm so excited！\nSee ya next collab stream！", "分かるよ！", "Your English is great no apologies needed", "きみのえいごうまいいです👍", "楽しいね", "I tuned in for a bit in the middle of the stream and not joking, within one second I already had a huge smile on my face.\nNow I am watching it all.\n\nCurrently losing it laughing at subaru being romantic with the rose.", "Was waiting for Calli in the chat to go \"WTF\" XD", "ホロライブENとJP初コラボをオフで。\nスバルの人間力スゲェ、尊敬する。\n\nあ、もちろんキアラさんの人間力もヤバい。", "first calli, now burger king got NTR'd", "Honestly, a wholesome but legendary crossover. It had reached the highest amount of viewers with 50K. Which is quite amazing. Really enjoyed this stream. Loved the dynamic of this duo.  I hope this is not the last time though. ", "I only joined the vtuber related content for about a week, and subaru is my fav, is this really is the highest live viewer count for hololive history? Or just holo eng ?", "@Respati Renggabuana I think it's the highest viewership count for Kiara. In Holo EN I think Gura had the most viewer engagement in her unarchived karaoke with around 70k at one point.\n\nEdit: typo", "The most amount of viewers for Hololive EN were the debut streams. I think the highest one was around 80,000. I don’t know the highest in Hololive history, but the highest I’ve personally seen was Botan’s debut stream with over 110,000 viewers.", "@Gabriel Rivera thank you for the explanation 👍🏻👍🏻", "@Matt Dorn thank you for the information 👍🏻👍🏻👍🏻", "@Matt Dorn I think the highest was Coco's 3D debut livestream which  peaked at 111k (or was it 112k?). Definitely more than Botan's debut.", "The chemistry between the Holobirds was off the charts! I feel like I saw a different side of them that I didn’t know existed. So glad I was able to witness the stream live!", "Achievement Unlocked!\n\nBirds of a Feather: Subaru Team-Up\nBreakout: First JP Collab", "Kiara speedruns the achivement nice", "I’m pretty sure Kiara and Calli have done off-collabs. They just didn’t mention it at the time.", "HoloEN girls really be speedrunning tf out of everything lmao", "@Andrew Adelheart Kiara’a the Trophy Hunter in the lead rn", "Pretty sure Amelia has done the table 1000 damage% in like... Less than a month", "切り抜きからやってきたJapanese。\n日本人ホロ推しニキの誰もが待ち望んでいたENとのコラボ嬉しく思います。\nこれからも頑張って。\nfight、kiara!", "実はfightは「戦え」って意味で頑張れって意味じゃないんです、、\nまぁたしかにキアラは戦ってる気もするけど…ww", "These two birds being the brightest and most energetic in Hololive. I smiled the whole time. Duck and chicken turned geese are very strong", "Whenever she says goose game it sounds like 'GOOOOSEEE GAANNGG'", "That 20% Warning Ruined it all", "スバルとのやりとりが自然すぎて草\n流石の日本語力だな", "I'm Japanese , but Kiara's Japanese talk is better than me.", "Late to the stream gang, Who's with me?!\nI hate myself", "Dw brother, I share your pain #LateGang", "Yeah same. It really sucks especially since I know I could've made it", "Yup. Sucks but what can you do?", "If it makes you feel any better I had work lol", "Same", "I slept in 30 mins. of it #LateGang\nWhy are we here, just to suffer?", "I had online classes", "My WiFi was down the whole time :(", "i can't watch it live due to how slow my internet", "dude fuck me I woke up at 6am because I needed to take medicine, saw the notification for the stream just starting and decided to sleep because it was to early and mostly in japanese, worst decision ever", "I was asleep cuz all this week has been hell for me and I didn't heard the alarm... I came late to work anyways lols. Sad kusa.", "Bruh i slept 20 minutes before it started", "Man, you were just late! I missed the whole thing, damn you sleep!!! After watching the archive I shall atone for my sins of missing the stream by committing eleven star Sudoku.", "I got called in for work last night and feeling the pain of missing another stream ", "Me: Sees that this collab is FINALLY happening, going: YAAAAY!\nAlso me: realizes that my work shift starts at 1:50pm (Finnish time): FFFFFFFFFUUUUUUUU----!\n\nNow FINALLY enjoying this collab to its fullest, even though I was not able to be part of it. :)", "初コラボでいきなりオフコラボ 国の壁もゼロではない中こんな相性いいことある？\n面白すぎたわ", "ホロENの事詳しく知らないけどキアラ日本語無茶苦茶上手に喋るね", "Will there ever be english subtitles in JP Main Streams of HoloEN? \nIts quite fun to watch this stream also without understanding japanese, but it would be much better with subtitles", "As in on the official channel? Maybe in the future, but there are so many talented Japanese translators from the days of bringing Japanese language content to English language audiences, that I can't imagine this not having translations for long", "最初の予想を遙かに越えるシナジーを生み出していて最高でした。\nEＮの子は語学の面でコラボ遠慮がちだけど、言葉とか関係なしに雑にコラボししてもろて。", "Wow I expected this to be a bit awkward at times, but they were in complete harmony. I hope they will collab in the future as well :)", "Subaru saying that she can't keep up the \"tsukkomi\"s with Kiara lmao she's so high tension today\n\nTheir dynamic is so good i love it. More please!! ", "what r tsukkomis sir please explain or else i will cry daily", "@GoodSmellingPieceOfShit it's a japanese comedy term.  According to Urban Dictionary: \"The act of pointing out that something is ridiculous or silly. Usually this is something another person (known as the \"boke\") says or does. May involve violence towards the boke, such as hitting them on the head with a fan (esp. in anime) or slapping them on the forehead.\"", "@GoodSmellingPieceOfShit In Japan there is a style of comedy called Manzai in which involves 2 performers. One, the Tsukkomi, acts as the straight man to the Boke, who acts as the funny man. In most of hololive's comedic dynamics, Subaru acts as the Tsukkomi.", "@Adam Malloy yep, and in this case, Kiara unleashing the bottom left jokes and then Subaru saying something like \"KIARA?!\" haha", "@kohi san what does bottom left mean? Low smart x low purity reference?", "@Joshua Dela Cruz yes", "@Joshua Dela Cruz yep, she even explained it to Subaru lol.\nMore context:\nhttps://twitter.com/takanashikiara/status/1307505846922870785?s=19", "It's the Japanese term for the straight man in the comedy duo lol they answers you got are needlessly convoluted lol", "Bless my classmate for bringing me to this rabbit hole, if he hadn't I would've had an appointment with truck-kun.", "Hololive is the cure to this world's evil. Welcome to the family!", "Welcome to Hololive, where you can get a lifetime supply of happiness!", "Oof", "What if Yagoo is Japanese Jesus and envisioned this to save the world? Being an idol is just a cover!", "Isekai land tho", "最初のJP-ENコラボで緊張したと思うけど、とっても面白かったよ！！\nキアラの明るくて楽しいキャラクターと、素晴らしい語学力でホロライブをつないでくれたら嬉しい(๑˃̵ᴗ˂̵)", "Me before the stream: \nOH MY GOD ITS HAPPENING, EVERYBODY STAY CALM!", "面白さの原液飲んでるみたいだった。高速でボケとツッコミを返し合うの堪らない。\n\n52:15 ｢なんでっすか！｣", "This was a very wholesome stream and thank you TL for translating.", "Kiara is every day closer to perfecting Pekora’s laugh", "When I heard their laughs before the stream even started, I knew this was gonna be legendary.", "And they definitely did not disappoint us; rather, they exceeded our expectations!", "First ever JP/EN Hololive collab. Fantastic way to start imo!!", "my face hurts from smiling for an entire hour!\nthis is exactly what i expected and wanted from 2 explosive personalities in the same room\nthanks, kiara and subaru for this greatness!", "I was waiting for this collab so much and it didn't disappoint me\nLegendary birb duo", "Kiara : \"I will test your English\"\nSubaru : *PANIK", "To anyone who had diabetes, you're welcome to get treated in my WORLD", "\"Prepare for trouble\"\n\"And make it double!\"", "A Duck, a Chicken and Goose walk into a Bar, they are asked to leave. It´s a Crow bar- This was honestly really fun, thanks to the both of you. Seeing you having instant good chemistry with each other was really cool. The japanese to english ratio was perfect imo as Subaru didn´t feel left out and we got what was going on. Even if things were a bit unclear for me at times we have an amazing fanbase that will 100% translate clips of this gem. So again a big thank you for this Avenger-Level Bird Crossover. P.S. We heard the Shishiro Button Line.", "This was indeed a avenger level threat", "There were at least 10 live translators in the live chat as well heh.  I feel like I know exactly what they talked about through the whole stream.  Extreme thanks to those guys!", "@Scipio Massimo Yeah big kudos & thanks to them!", "@Taylor Birds Assemble!", "@Casual Filth Lol", "今までの人生で一番笑いました", "TRANSLATORS ARE MVPs!!! ", "#HOLOBIRDS BEST BIRDS", "@KIARA VIRUS I hope KIARA’s VIRUS spread all over the world.❤️ \n\n,o7 see you in the next Pre-Chat.", "*0/10*, I was lied to!! \nYou promised me a Chicken and a Duck, but I got a Majestic Phoenix and a Graceful Swan!! 🐔❤️🦆\nJokes aside, lovely, LOVELY!!! I'm so damn happy!! Thank you for the wonderful time! Your energy was contagious, my face hurt from smiling for 1 h straight. I hope to see more of you, it's exhilarating to see you both getting along and having fun!!", "Im so fing glad i caught this, east meets west makes me so happy to be apart of such a supportive community.", "For EN bros\n\nOzora Subaru/大空　昴\nthis name mean", "I can’t be the only one who felt bad for the old gardener right?", "\"There are two of them now, this is getting out of hand\"", "EN and JP collab: Yay!\nIt's an offline collab: WOOAAAAHHHHH!!!", "Yeah that was the biggest surprise, I figured it'd be using steam remote play, guessing they couldn't figure that out or subaru just said not to bother", "Kiara live in japan?", "@Shiranui calli and kiara lives in japan", "This is why I love Subaru and Kiara never a  dull moment when they're around!", "BREAKING NEWS: An emergency meeting has been called by the UN to discuss sanctions for the global noise pollution created by two birdbrains being together in one house. Reports are flooding in that the two could be heard from Australia, Antarctica, and were even picked up by microphones on Martian rovers.", "Went to sleep early just to wake up at 4am to witness this blessed collab.\n\nEven if it was mostly Japanese it was really fun watching how energetic both of you we're.Truly the best bird duo.", "everytime subaru speaks english\n\n*deep voice mode on*", "The crossover we have waited for. Thank you Kiara and Subaru. That was a fun stream.", "めっちゃ面白かったー！\n伝説の配信になりましたね🍗\nまさかのオフコラボでびっくり‼️\nまたやってほしいです", "One of the best collabs can't wait to see more hope Kiara will collab to Pekora soon tho", "Amazing from start to finish! Their chemistry was explosive", "This is how you achieve world peace. 👏👏👏", "二人が楽しくやってるの見て、なんだか嬉しくなっちゃったよ", "My cheeks hurt, can't stop smiling, this is too precious.", "Alfred Hitchcock would be proud of you.", "Kiara confirms my suspicion: real-life Shuba is heckin' cute.\n\nAnd the collab was hilarious. I haven't seen this much energy in a hololive collab in a fair while.", "Me watching the archive: Finally the collab is here! Hoping it all goes well.\nKiara and Subaru: Begin by making a bunch of duck noises.\nMe: ... dis gonna be gud.", "[Stand Name]: Subaru\n[Stand User]: Takanashi Kiara\nRush Attack: SHUBA SHUBA\nI got the stats from stand generator which makes this funnier", "Range should be a B for Scythes are pretty LONG like REALLY LONG", "@Shplooshie Mind you the stats are from Stand generator I merely copy and paste.", "now this is peak entertainment", "you mean beak entertainment? gonna show myself out...", "@TheLobitzz take my like.", "@TheLobitzz take my like and GET OUT", "Truly, a blessed stream! I didn’t understand a lot of it, but fun transcends language! Thank you to the translators in chat, and congrats on the first ENxJP collab!", "Now I know why they clicked so much in this collab:", "...stick together 🔫", "The synchronized \"NAI DE\" at 35:21 is so powerful\n\nKiara is saying there's no particular deep meaning to the phrase \"double trouble\"", "Kiara : \"I'M NOT A CHICKEN\"\nAlso Kiara : *cluck cluck", "the chat being full of both EN and JP makes me really happy, i'm glad these birds can bring us together like this ", "This is there world we live in. Two virtual girls, representing a phoenix and a duck, playing a game where they play as geese.\n\nWhat a wonderful world this is.", "I woke up to the Intro. Then get to immediately hear the ringing of laughter. Never woke up so fast in my life. Great Stream! Thank you for your hard work!", "This was a great collab, it really shocked me how much chemistry Kiara and Subaru had, it's amazing really!", "Kiara's fluent speaking in Japanese is finally really shining in the collabs with Hololive JP. What an excellent first collab between EN and JP!", "\"TORI-aezu...\"\n\"....SHUT UP. Shut up, Kiara!\"\nLMAO, Best quote I've heard in the stream so far, these two are hilarious together.", "I can understand 2% of the Japanese because of anime.", "YAGOO: This is gettting out of hand. Now there are two of them!", "The energy from this stream kept me alive long enough to finish all my homework. Gonna sleep now, thank you Kiara and Subaru!❤\n\nEdit: The energy still lingers and I'm still awake. Which means I get to rewatch this wonderful stream again!", "These two have such great chemistry together. Maybe a collab with Marine next time?", "Pekora x Kiara when?", "They're already havin fun at the start, That's a sign that the stream would be legendary! It was adorably fun and entertaining. But it was way too short! I'm looking forward to all of the HoloEN to collab with their senpais too!", "Wait Kiara is at Subaru's house, meaning that she's actually from Japan or currently living there 0-0", "She's living there at this moment yeah and she's German I think since that's her first language.", "She's talked about it in previous streams.  She intends on moving back to Germany (or somewhere nearby, not sure on her actual home), but is currently in Japan right now.", "@Pez Dispencer Austria.", "Fahmida Ahmed she is from Austria, 100% Austria. At a young age she became an idol and moved to Japan, then retired from being an idol and moved back to her country. She sometime in 2020, probably before quarantine moved back to Japan.", "@Aoi Yozora WDYM moved back? She’s literally in JP right now", "@SahiPie in the last sentence of their post they said she moved back to japan.", "Such a blessed stream, they both seemed to be having a fantastic time, laughs and smiles all around, hugely enjoyed it even if I was relying on JP translations, good job guys!!", "I don’t speak Japanese but I can tell that they have a really good dynamic. Good stream.", "配信が終わると、嵐が去ったかのようだった", "This was such a blessed stream. As much as I enjoy HoloEN, I did miss not being able to understand a word.", "35:21「特に深い意味は「ないで」」「スバルのことも見てよ！Look at me !」「グ恥ずかしい(*ﾉωﾉ)」\n39:43「私いじめられてるからいじめも上手」「先輩何やってんスか集中してくれよ！」\n44:32「ちゅ」「間接キス」「てぇてぇ」「ん”ん”～～～～～」「え笑い方ヤバ」\nI haven't seen such rackety & relaxing stream ! こんなにやかましくて落ち着く配信は初めてだ！😂 JPN🗾", "約　束　さ　れ　た　神　回", "Calli joining 40-50 mins in to witness the utter Kiara x Subaru TeeTee might be one too much for her heart lol. Especially when they started doing the signature Calli \"GUH!\"", "Honestly one of the most legendary collab can't wait for the future collab", "When you have zero % of what is going on but you find it diabetic. Ah I'm too fat now.", "Tell gawr gura\n\"I found you\"", "These two as Geese have the same energy as the Seagulls from Finding Nemo.", "清楚で行こうと思ったけど…が草やった", "45:00 \"What your Subaru is evolving?!\"\n45:07 \"Congratulations! Your Subaru has evolved into a Kamonegi!\"", "I watched the stream even if its lagging xD THEY ARE TOO FUNNY!! THIS IS THE BEST COLLAB!!!", "Animal Planet, Nat Geo, and Discovery Chanel wishes their animal documentaries are as interesting as this.", "Put a guest on the trash can? This is not how I envisioned Japanese hospitality. Goodbye, have a nice day.", "This stream was pure chaos , laughs and Tee Tee and in one nice pack ,hopefully the first of many .\nAlso i for one welcome our new chaos birds overlords ", "tension was strong in this one, hopefully we see more en jp collabs lol", "This just makes me so happy to watch. I'm so proud of the HoloMyth girls", "35:21 この一致してるところ好き。", "Oozora's family: wow our house is so lively this month XD (so many off-Collab) Thank You Kiara and Subaru for the stream!", "such a cute and high energy stream, kept smiling to the end. holobirds ftw!", "i like how they are just as loud as the gooses when they speak together", "\"So the table turned again, huh?\" \n\n-JP bros, probably", "I'm proud of how much I did understand of this, just from recognizing snippets and going 'oh, if they're saying this thing, in this tone of voice, with this happening on screen, it probably means...'", "Is this the first EN-JP collab?", "They have really good chemistry", "Angry calli noises*", "You should know by now that Homolive's more of a romantic free style this close to an outright øřğý.", "@NullLex00 yeah øŗğÿ", "I missed this... darn. But now I am watching this and I am literally stress-free now. Good stream.", "What a great stream! The two of them have excellent chemistry together! I can’t wait to see more! Keep up the fantastic work!", "Kiara has manifested her stand, 「DISCO DUCK」", "I wanna give a huge shout out to all the translators for keeping us up to speed as much as possible it was really fun and this just goes to show how good kiara is with people, there was never a dull moment", "This collab's too bright, I can't see anymore even though my cp's brightness is low, both the sun's and phoenix's brightness is too strong. Congrats on your first collab with the other branch, Kiara.", "ちょっとこれはおもしろすぎますね", "This entire stream:\n\n“BIRDS OF A FEATHER STICK TOGETHER”", "Man, i would love to see Kiara and miko collab \nMaybe miko would start talking in elite german", "Or even better a Kiara and Coco collab, talking about ways to teach their fellow members swear word as inconspicuously as possible( I know they both tried already on their own). Next thing we hear would be \"Hey there Motherf*ers, verdammte scheiße, yametekudastop\"", "WDYM THAT'S CANADIAN ENGLISH I FEEL PERSONALLY ATTACKED", "Can someone please cc this 😭 I wanna be more able to understand the shuba shuba and kikiriki!\nAlso just started and I can hear them laughing in the background", "此処が鳥籠ですね。\nThis is bird cage.", "The most anticipated crossover of birbs! XD", "ahh shoot i missed the livestream cause of class, oh well at least i can enjoy our favorite duck and chicken collabing on a archive", "what i think is amazing about this collab is that 2 bottom left birds somehow equal a right middle. partially pure and almost ame-chan smart... that's the real question of the ages", "Can't wait for subbed clips of this. Their energy/chemistry seems out of this warudo!", "KIARA, WE WOULDN'T MIND IF YOU STREAM JAPANESE ONLY. ACTUALLY WE LIKE IT❤️", "It was an amazing collab. They have an incredibly synergy. Also thanks to all live translators.", "This was an offline collab!? Does that mean she can meet all of the Holo JP members too? I CAN'T WAIT FOR OTHER COLLABS!", "Kiara with other Japanese vr tubers make me way more happy than seeing her with holo en. Hmm I wonder why", "This collab was an absolute blast to watch -- mostly because it seemed like you two were having such a blast doing it! Looking forward to more #holobirds in the future!", "I couldn't forgive myself to fall asleep during this stream but..hey technically I watch the whole stream😂...😭", "Stream hadn't even started yet and that laughter already set the awesome positive tone, most excellent!", "Oh, this collab stream is very amazing and enjoy, i'm so glad that see kiara collab with subaru-chan\nit make me feel so proud, so i hope their japanese and english talent will be more streamed together.", "Fanart request - chibi subaru and kira wrecking the merchant woman’s goods while laughing / mocking / smug face", "lol this was the funniest collabs I've wholeheartly enjoyed. I really hope to see more! 面白いかった!!", "Normie : Avengers was the most ambitious crossover \nKiara : hold my drumsticks", "Just found out the collab finally happened yay!!!", "The blessed Birb Collab has finally happened!\n\nI knew this would be where Kiara would unleash her full power, just look at how much fun Subaru is having! I am glad Subaru finally has another Holo that can match her bright energy.", "Kiara is amazing \n\nShe is proficient in speaking Japanese.", "When you have Weeb Japanese and English as a second language so you can half understand it!", "鳥コラボ面白かったっす", "They seemed to have a really good time troughout the collab, i really wanna start studying japanese soon so i can start understanding what they are saying tho.", "I didn't understand what they were saying most of the time but I enjoyed every single second of it", "Not even two minutes in and you can hear them laughing over the intro. It's great seeing  them have such a good time.", "Finally the bird collab, this became one of the best collabs I have seen.", "I love Subaru's energy and how she's always so excited to participate in things. This was such a wonderful collab.", "I literally forgot every depression while watching this stream. thank you holobirds.", "This stream was a blast, hope to see more craziness from the bird duo.\nAlso, thanks tk the army of translators.", "I loved this one, my god, and I love Kiara's Japanese, it is sure my favorite :')", "Congrats Kiara! I'm sure you were itching to get out there with these collabs so it's nice to see you being able to play with your 先輩!\n\nYou guys are doing great. Keep up the good work! ;)", "AAAAAAAH!! This was an amazing collab, I LOVE!!!", "Kudos for ESP&ENG live translator to help us understand what was happening\n\nKiara, Subaru, I really loved the stream and made me love both of you even more!", "This was an amazing collab! The viewer count today seemed to have agreed as well (broke 50k). Thank you holobirds for the stream, and here's to looking forward to more in the future!", "What an amazing stream! I felt so happy seeing Kiara fulfilling her potential as the bridge between JP bros and EN bros. It felt like she was so much more comfortable and able to be herself in this stream and it made me so excited to see her just joke around with Subaru! I can't wait to see the clips because I don't speak japanese. KFP!!!!!!", "I'm so sorry that I didn't watch it live! This stream is so good! Kiara actually came to the home of her sempai and they seem to had a lot of fun during the steam.\nSubaru is awesome!", "16:41 (´・ω・)つ🔋", "16:43 LMAO", "2020 starting to redeem itself.", "First collab is also an offline collab! Kiara is the real player of Holomyth", "I can only say, Bless this stream 🙏🏻", "うちのスバルがお世話になりました😄", "18:47... kid me not, i actually thought it was subaru talking.. \n\nSasuga Tori Nakama...", "\"Two birds in one stream\"", "Just two birds playing a bird game,nothing strange", "鳥族うるせえ(褒め言葉", "this stream is beautiful. I've watched this on replay for hours now", "This was fantastic, I can’t wait to see future collabs with overseas Hololive and en", "I was hoping to see you two stream together, I'm so hyped it happened already. It really makes me happy seeing you enjoy each others company❤💙❤💙.", "Bro I didn't know they were making an anime adaptation of Alfred Hitchcock's \"The Birds\"", "the opening giggling is all it took to make this collab legendary.", "sees Subaru and Kiara collab stream\nMe: i gOtTa GeT iN tHeRe!", "I like seeing some happy birbs. I want more of this.", "This is the most mega epic collab i've ever seen!", "Im glad I understand japanese because that entire part of explaining was a trip.\nFun collab, cant wait to see both of you team up again. Subaru!", "I'm so glad this collab happened.\n\nNow I can't wait for Gura+Marine stream.\nANCIENT FOSSIL COLLAB WHEN", "I wake up to this!!!? Omg this truly great timeline. Congrats Kiara for being one the first to collab with HoloJP! \n(Also mind you I woke up extremely earlier than normal)", "Probably my favorite collab ever. Subaru is my favorite japanese member and I would really like to understand her more. It awesome to see her with an EN member, especially you. You really help with the language barrier and you motivate me to learn japanese.\nCan't wait to see your futur collabs. \nThank you for the stream.", "Started with laughter, ended with laughter.\n\nI am kinda crying right now, so proud.", "This stream was just pure joy and happiness! Thank you holobirds for this perfect bird/10 collaboration and to all the translators that help bring this community together!", "This is the literal embodiment of “get ready for trouble, and make it double”", "So much energy, bird noises and laughs! A pleasant surprised they synced so well so early!\n#holobirds is too strong of a combo!", "Birbs. Strong. Together. Too bad I couldnt see this live but my employer refuses to let me simp at work (TT A TT)", "You know it's a good time when the stream starts off with ridiculously contagious laughing. ❤ This was one for the ages.", "First Hololive EN-JP stream recorded! They grow up so fast 😭", "Love how full energy this two has, keep it up", "So an Idol Duck and Chicken plays a game about terrorist Geese, what a time to be alive", "Waiting for translation is hard 😥\n\nEdit: Happy though that JP and EN is bridging relations!!!", "I understood almost everything! Amazing! :D", "ok, I mean, maybe 80% ... but that's still pretty cool ^^ - For some reason, it was easier to understand than most 'fully Japanese' streams :D", "2:35 Stream Start", "Love the new Angry Birds 2 update", "bruhh🤣🤣", "Sad that I missed it my mom took away my phone when she saw me stay up late to watch the stream", "haahahhahaah THIS COLLAB IS SO CHAOTIC. I love it!! The talk at the end is funny af hahaha", "Subaru's and Kiara's brightness together made a new sun. Very funny and energetic combo. Great teamwork. Hope to see this Holobird team again. Thank you ShUBA SHUBA SHUBA", "this collab was awesome!! you and subaru has so much energy!!! i wish it could have been a little longer, been honest, you two pick up the perfect game", "海外勢のホロメンとのオフコラボ初じゃね？w", "最高だった！\nシナジーを感じまくりの一時間だった。\nもっともっとコラボしてくれーーー！！！！！", "I'm already Watching this Again~!\n will be posting fanart of this Stream soon~!", "FANART POSTED ON TWITTER~!", "Is it just me or do both of them look so similar in both looks and personality", "So much fun, it's nice to see Kiara with Subaru, they make a good team.\nI haven't played this one before, but I've seen someone else stream it and it looks like fun; they were clearly having the time of their lives here.\nHope to see more of this in the future.", "Man this cured my anxiety instantly 😳", "Just got through watching the archive and smiled all the way through, such an amazing stream!! The future is bright, I am soo excited!!", "Im so proud of Kiara, SHE IS LITERALLY DOING HISTORY, Love Subaru so much", "I'm halfway through the vod and there has already been at least 2 JoJo references from Kiara. Sorry Calli, Kiara is my new favorite en member", "10:48すするタイプ\n16:40バッテリーないなった", "I loved.... LOOOOOOVED this stream... so much! Subaru my favorite and lovable idol and the great and adorable kiara! Best bird duo ever!!\n\nI hope the best for you all!", "I literally thought it gonna start out awkward but nope, it's quite the opposite really", "I wished I could had seen this Live but congrats on the Collab! I hope that its one of many XD", "I love Subaru man she's honestly the best I wish she be wife <3", "I see my 2 favorite vtubers collab, I click. \nI then enjoy all of it, ありがとう", "The energy of these two birds is too much for an introvert on low battery.", "This was a stream I couldn't miss. I stayed up past 6 am to watch! Even if I couldn't understand what they were saying, it was very enjoyable.", "Damn this was an amazing stream! I look forward to seeing more collabs Kiara! :D", "Lovely collab! Worth staying up for! Hope to see this duo return! Kiara is always a ray of sunshine~", "I really had a lot of fun watching the stream. I hope to be able to see you play more games in the future. Viva Subaru and Kiara!", "I barely understood anything said in this stream, but these two having fun really helped me today. Can't wait for translated clips :)", "This collab was beautiful. One of the best EN collabs/streams I've watched very nice thank you.", "Such a great stream. Someone needs to draw them both in a Team Rocket outfit but isntead of an 'R', it's either 'H' for Hololive or 'B' for Bird", "Ngl Kiaras voice/tone in Japanese makes me feel some type of way 😳", "We need a turkey girl next so we can have a Turduckin collab", "The was so good that i just want it to be more longer.", "amazing collab, love every minute of it", "I really loved this collab and just look at the likes 42k! So much love.", "The hjonking, it never ends 😈", "Loved the colab hope we can see more in the future <3 Auf Wiedersehen", "This is the collab we've been waiting for boys. BIRD UP", "Now we got the chaotic loud birbs collab, when's the seiso calm ASMR mamas Lamy x Ina collab???", "My heart is having palpitations from this. I love it.", "This stream will be marked down in hololive history", "16:37 神回", "We need more of this, more EN x JP collabs.", "I catching about everything fifth word and from on screen context I basically understanf", "I love this stream! The most unexpected collab and they are both birds! BIRDS TOGETHER STRONG", "面白すぎるわww", "Really awesome collab, I hope to see more of Kiara interacting with other Hololive members, she seems right at home with them... literally in this case :P", "\"Birds together strong\"-Za Birdo", "Hell yeah. \nBird Buddies.\nTori Tomodachi.", "This was fantastic!\nWould love to see you two collab more in the future.", "The battle of the birds has begun", "This is so exciting. Looking forward to familiarizing myself with the Japanese vtubers as i only got into this with debut of EN", "Actually amazing. すごそう！！", "I didnt know that this was what i needed the whole time", "I had prepared for this stream and was waiting for so long, just to have fallen asleep when it started T_T", "It was pretty funny not even knowing Japanese, hearing Subaru say \"Yamete,\" whenever I presume Kiara was saying something ecchi.", "Birds of a feather, stays together!!\n\nLove the chaos between you two!!\nAlso rip Calli being NTR’d. Oh well. ", "Just imagine: enemies a little over eighty years ago are now united through cute grils", "Go watch Barefoot Gen", "Oh no, i missed the stream! I was really looking forward to it too :-(", "i missed the stream!!!! AHHH!!!! gonna watch the archive~~", "This stream:\nHappy bird noises!", "Damn, I missed it! Well, there's always next time", "Sad that I missed it but really looking forward to it watch it later. The few minutes are already so good. Immediately had a smile on my face. The energy is unreal ", "I dont understand a word of Japanese. And yet i find myself smiling and laughing along with them. Such contagious energy... i love it", "The gardner looks a lot like my dad. \n\n\nTwo loud birds keep bullying my dad!!!", "What a blessed stream. Kiara and Subaru have great synergy together and seemed to be having a lot of fun. Can't wait for possible future collabs between EN and JP.", "Can we give a huge thank you to those who translate live in chat? I dont remember your names lol but we appreciate you", "The first EN girl to collab with one of her JP senpai's. Congratulations Kiara!!! Your stream with Subaru senpai was a joy to watch.", "AAAAAAAA IT HAPPENED\n\nIt's like Subaru's voice is tearing through the fabric of reality, uniting two different worlds.", "I messed :( ✨. I DIDNT SIMP HAR ENOUGH!✨", "We want more EN-JP collabs! That was awesome! Subaru paisen was so excited that sometimes she was speaking in out of character voice. Lol \nDont yamatekudastop please! Collab with Pekora next time!", "The Duck and the Chic... Phoenix! \n\nGotta love these two, infectious personalities", "I never would've thought this was actually an offline collab lol wonderful stream", "何も違和感なく見終えたあと、大発見をした！\nスバルって人じゃん！\n..", "I'm only a few minutes in, but this feels like they're a manzai kombi. I love it. I can only pick up bits and pieces, but their banter sounds like they're having a great time, which is awesome! Subs when!?", "I wish I could've watched this live\n\n\nOn a side note suburu's neighbors must've been like \"oh no she multiplying\"", "We ride togetha, we fly togetha", "1:00:11 Animal services I've got 2 birds and they are frantically prancing in front of my store as if they were 2 drunk old man having a sexy contest", "Couldnt watch it live but the loading screens still up and I can already tell we're having fun. #Holobirds", "God I hope this whole thing gets English translations. This was one of the best Hololive collabs I've watched. Absolute comedy gold.", "Amazing colab, waiting for more.\n\nP.S.: Subaru's english is pretty good, it's just a bit of lack of confidence, same as Pekora.", "The ammount of energy from this stream could power an entire city for a year", "The birb power on this stream was so strong", "Best collab ever! Hope to see more of these in the future!", "Even though I can only understand like 5% of what they are saying in Japanese, I can't really overstate how perfect this collab was. So fun, it felt like Kiara and Subaru were old friends. I really hope we see more Kiara/Subaru collabs, and I'm excited to see all of the future EN/JP collabs!!", "That was a great EN/JP collab!\nKudos to both of you!", "Its incredible how you guys were laughing the whole stream, and how you get along, feels like you known each other already. If you were nervous it didnt show. Congrats on your first collab Kiara! It was chaotic fun, thank you!", "gaaaAAAAH THIS IS THE BEST. Can't wait for translated clips", "SubaruxKiara Bird Collab : Exist\nUntitled Goose Game : It's like.. I was made for this.", "Subaru: Prepare for trouble!\n\nKiara: AND MAKE IT DOUBLE!!", "2:38 nothing to see here, just a duck and a chicken talking to each other", "I love this collab stream! Looking forward to see more Untitled Goose Game and SM64 collabs between Kiara and Subaru! 🐔❤️🦆", "Blessed collab! Loved you two together! Glad i woke up for this. Genuinely loved it.", "They speaking Japanese where's the subtitles 😂😂😂", "Actually pretty hard to tell this is their first collab.\n\nThis was really fun to watch, despite me only understanding small bits and pieces of it.\nI really should take more time to listen lol.", "Wonderful stream. Two birds of a feather, high octane energy, 51k viewers yet chat was quite well behaved.\nWe really couldn't have asked for more. This was everything it needed to be, and more.\n\nLooking forward to more collabs.", "I love this pair, it was so fun! Lmao", "The Day has come", "It finally happened\nThe ultimate combination", "まさかのオフだと…？！", "13:35 Please don't mind me. Im just time stamping for myself to continue watching later", "I just arrived home, I was late :(", "This has been the best collab so far and I could understand less than half of it!\nSo much energy and good vibrations!", "This was amazing, my thanks go to you two.", "Loving this new hobby of bird watching! Can't wait for more of it. 🐦", "2:35 Start", "めっちゃおもしろかった！またやってねー！", "開幕動物園で草", "If you didnt become a fan of Kiara after this stream, then I dont know what to tell ya. This stream is up there as one of the best collabs ever.", "For me this was the best collab ever ❤❤❤", "Fun and very high energy stream. It was really enjoyable! ♥♥♥", "Couldn’t make the stream, so I’m watching it now. I don’t think I’ll understand anything, but it’ll be fun to watch none the less.", "My years of watching subbed Anime has paid off.", "55:49\nsu-masen suimasen sumimasen", "Birds together strong.", "まさかのオフコラ！？すげー！！", "I'm so proud of our chicken breaking 50k live viewers, damn KFP employees cutting onions.", "The only complaint I have is my smile made me squint a bit and so I couldn't witness the stream in all its glory", "\"Birds. Strong. Together\"\n-War for the Planet of the Birds (2020)", "1:07:42\n\nI just want to express my gratitude to clipper and translator that make this happen", "That's what I call a collab!", "What time do ducks wake up?\nAt the quack of dawn!", "Thank you for The sudden Off collab didn't expect you would do Off Collab this Fast.", "i missed the stream", "I feel you I accidentally overslept. It's a bummer but no biggie, there's always the archive. We'll catch the next one!", "21:40    なんかここ　スバルの声がちょっと変じゃない？", "Keep up the Good Work Kiara! I adore your energy, makes me want to try my best", "Oh my God, she really does like sound Goku.", "Grandma Goku.", "That was the cleanest rake in the lake I've ever seen aside from speedruns", "This was everything I needed and more", "Damn it missed the ending of the streme", "I love both of you! I hope you two build a great friendship and have good luck in your futures!", "Duck, goose and totally-not-a-chicken in a beautiful bird collab!", "Aaaah!  I just missed this!  Curses be to working retail...", "This collab really shows how amazing both Kiara and Subaru are. Here's hoping this video explodes (in a good way)!", "I wish I knew japanese, crycry. Lovely stream though!", "NOOOOOO I MISSED THE STREAM :(", "i just missed it rn 😭", "Such a high energy, chaotic, fun, and full of laughter stream  The KFP holobirds gang have been blessed with the best bird duo in the world  Thank you Kiara Tenchou and Best Tomboy Subaru 🧡", "Subaru's \"yataaa\" is so satisfying", "was a really fun stream to watch, ty for the much needed entertainment", "お二人ともおめでとうございます!!! \nThe very first EN and JP Collab is a massive success!!\n\nit was so much chaotic and fun and i can't wait for more!!", "I cannot believe that I missed this stream, I’m so sad but happy that at least I can see it now", "much energy, much cuteness xD", "even i watched the archived  i can feel how happy they are at that time xD  HAPPY KIARA", "Cannibal Chicken and Tomboy Duck play as Delinquent Geese. \nBIRDCEPTION", "The time for Kiara has finally arrived! I knew the moment Hololive EN was allowed to make collabs she would show her true skill!", "Subaru has a great laugh though, regardless of broken English (which is adorable to hear! XD).", "This stream was lengendary!", "Best Torillabo ever", "I missed their collab, NOOOOOOOOOO", "Finally, congratulations Kiara!", "鳥×鳥　やるゲームも鳥\n鳥小屋コラボって言われてて草\nキアラさんとスバルの相性抜群で面白かった", "ARE YOU KIDDING ME. I MISSED THIS STREAM BRUUUUUUUUUUH. I JUST MISSED A MOMENT IN HISTORY I CANT BELIEVE THIS.", "I only understood little bits of the stream but hearing them laugh makes me laugh too uwu", "めっちゃ面白かったー！\nうるさかわいい鳥コンビの今後に期待！！\nholobirds forever!!!", "😁Thats so damn funny！！", "My face hurts from smiling so much XD", "IT PAINS I WASN'T ABLE TO WATCH IT LIVE BUT THIS IS TRULY WHOLESOME.", "Such a blessed stream.", "I can't believe I was reading the chat replay and tried to comment too smh", "Subaru is such a good senpai two collab with two EN members back to back. First she chased a shark around for hours then she bullied people with a phoenix for an hour.", "Congratulations on the collab, it was great! Holobirds are powerful wingmates!", "How the hell did I miss this stream.", "I just loved this even though I didn't understand most of it", "I overslept and missed it I am soo pissed", "Same :(", "I love this chemistry so much!! Good job Kiara!", "Two birds to rule them all! I love this collab so much", "二人の相性が良すぎて困るwwww", "1:12:05\n\nキアラこわい\n21:29 39:33 1:15:15", "This was amazing! I’m really sad I missed it live. But, as a Canadian,  can confirm our English it totally like that ahaha not", "The reason she jokingly called it canadian english is because Subaru spent a few weeks in Canada as an exchange student.", "Oh, I didn't know that. I just thought it was funny but now it makes more sense", "this is so WHOLESOME AF", "oh god i love this ;D", "海外ニキみた感じ大絶賛でなんか嬉しい", "いやここの場合俺が海外ニキか", "More JP EN collabs please.. This is a great start!! Good job Subaru and Kiara.. 🐔🦆", "I love this 3D collab stream. 😆", "Muito bom essa live pqp SUBARU AMO ELA", "鳥コラボやん笑", "Ngl, i was kinda nervous that this stream would be kinda awkward. Im glad i was very wrong", "Thank you for the stream!", "dude this is just adorable to watch and hear damn", "I... WISH I knew how to speak Japanese because from the sounds of your laughter tone of voice you had with each other, it truly sounded like you two have been best friends forever and you just decided to stream you two having an amazing hangout session while playing a game. I love this! And I love you guys!!! This stream was Awesome! Never change Kiara and Subaru!!! ❤️❤️❤️❤️❤️❤️🥰🥰🥰🥰🥰🥰🥰🥰", "Omg I expected at least a little awkwardness at the start but it’s like they were already best friends 😳 as expected of our Phoenix and the ultimate Duck 😳😳", "Man... it was a fun stream. I love seeing Kiara and Subaru having fun. 😆", "I can feel the extrovert energy", "What a collab! <3 \n\nPowerful quack quack quack", "I'm now waiting for them clips with possibly two subtitles", "I feel asleep before this stream started, so I could only catch the archive, but oh boy was this fun. I couldn’t stop smiling, they’re just so happy the entire time, my soul is healed.", "Two birds with lungs of steel collabed and it was cute.", "I only get about 10% of the Japanese. But atleast the birds seem to get along really well together :)", "This was great!  Love you two", "Oh I was waiting for this so much", "おもしろかった", "We love to see it", "THIS COLLAB IS A DREAM COME TRUE. SUBARU IS MY FAVORITE AND KIARA IS MY FAVORITE EN MEMEBER IM SO HAPPY", "とても楽しかったよ！\n日本語本当にうまくてすごいね！", "You know 3 languages!!!! You are the most smart of the 5🖤🖤", "Absolutely fantastic would love to see other Hololive JP collaborations with you in the future!", "20:11 Battle cry of Phoenix \n21:35 Tenchou asserted her dominance over her senpai lol\n27:14 Birb Discrimination", "Great Stream, The power of the #holobirds is real.\nI hope they have more collabs in the future", "はつ先輩とコラボ配信楽しかったです！", "WHAT AN AMAZING EXPERIENCE! And so cute! :D #HoloBirds2 when?", "I want to give thanks to the translators in the live chat giving live translations and context.", "Chaos birds. This is a terrifying concept that needs to be made into an action/shooter game.", "Ok. I normally don't comment. But this episode, was legendary. Subaru-chan so cute. Kiara-chan so .. umm.. kakkoi.", "damn! i missed the stream again...", "Kiara’s sub count on the rise. You love to see it. Thanks for the awesome stream!", "5 AM Stream before a class day smh my head.", "They're the same person just in different format", "this stream will become spoken of in legends", "Very fun collab hoping for more EN-JP collabs in the future\nおつかれさまでした\nストリームありがとうございました", "This stream : HOLYNOVA!!!!!!!!!!!!!", "I am ALL for Subaru's botched english\nIt gives me life", "初コラボでオフコラボおめでと～。めっちゃおもしろかった", "if u simp hard enough you can almost understand them", "LMAO", "The one collab smash bros couldnt top..", "Just finished watching the VOD. \n\n店長！めっちゃよかったっす！", "キアラちゃん日本語うますぎ！！", "Kiara and Subaru goin' quackers.", "Alright clippers... Get to it!!! This Legend has come alive!!!!! PHOENIXES UNITE.", "ゲームが謎過ぎる", "Awwwh . . . I missed it . . . \nWelp, the archive is still nice :)🐔🦆", "They're like a couple of little firecrackers. lol", "8:15 スバル「どっちがリーダーガチョウになる？」\n         キアラ「お前だろ」 \n\n＿人人 人人＿ ＞ お     前 ＜ ￣Y^Y^Y^Y￣", "how the hell did i miss this collab...", "まじで面白かった\nこの二人シナジーえぐい！", "38:39 assert dominance", "Perfection.", "That was so wholesome!", "most blessed stream. thank you kiara and subaru!", "This was a spectacular first collaboration.", "I missed it live 😭 noooooo 😭", "How is Subaru not in my feed?\nCORRECTED!", "NOOOOO I MISSED THE STREAM", "This stream was blessed", "i wonder if the translations are out", "1:00:30 Every bird in the world at that moment felt the need to simp all of their seeds and worms to Kiara.", "I hope we can get this stream fully subbed.", "HOW DID I MISS THE STREAM", "Best birds duo ever 🦢✨<3", "Best Birb Collab WOOOOOOO <3", "スバル…いつの間にゲーム化されて…？", "oh I love this moments jp collap en", "Aaah~ Was good", "ホロ鳥コラボめちゃくちゃ面白かったので、またやって欲しい！\n他のENメンバーも一緒にコラボしたら、皆仲良くなれそう", "Bird is the word", "This is awesome on so many levels.", "The synergy is so strong... TOO STRONG!", "めちゃくちゃ面白かった。鳥コラボ最高。", "店長可愛い…", "So happy to see the collab~", "I fell asleep MINUTES before this collab ahhHhHhhhhHHHHHHHHHHHH", "BIRDS. TOGETHER. STRONG.", "I’m so mad I missed it lol", "面白かった！！", "Way too much fowl language used in this stream.......", "The 2 birds chose to play the game with Geese as the main characters lol", "Missed The stream :(((", "1:00:16 Sexy Time!", "This was super TeeTee 🥰😂", "I missed it D:", "Woke up at 6am est only to realize it was at 7. Got more sleep, and then enjoyed watching two birbs having fun and just enjoying themselves. 10/10 would do it all again. Can’t understand Japanese, but “Fun and Wholesome” are universal languages <3 and these days we need as much of both as we can get. Great stream! reengages YouTube lurk mode", "I’m just mad I couldn’t wake up this early", "God, i missed the stream", "We need translations again!", "4:52 bruh off-collab", "YES ! Duck finally met the Chicken !", "32:41 Abyssal Scream XD", "え〜、そうですね。\n端的に申し上げますと、最高の配信でした(°∀° )/", "im am waiting for clips to come out of this stream I am seriously considering learning japanese so I could watch the colab with the japanes members of hololive", "Since this stream was sooo huge I’m sure there will be a full stream translation soon enough", "@Fax'd  that'll be nice let's hope a mad lad does it", "Watched 2 birds in one stream.", "うるさくないときが1秒もないくらい、うるさいww(褒め)\nすごく楽しそうでみてる方も面白かったw", "Two unrestrained extroverts shouldn't be allowed to spend this much time together.", "this was a collab made in heaven", "10:10 LOL", "Great stream, Subaru and Kiara! Lovely ", "THE STREAM WAS AWESOME!!! Two of my most favorite hololive vtubers. #holobird together strong!!! ", "Blessed.", "I cannot hear their voices over the honking  XD", "I MISSED IT NOOOOOOOO", "Bruh if I was thrown into this kind of energetic conversation I would probably actually die", "What a fantastic stream!!!", "Even tho i don't understand japanese but the stream was really fun. \nThank you for your hard work. And thanks a lot to all of you who translate it in live chat\n (*・ω・*)b♪.", "This stream was soo much fun lol", "Blessed stream", "2:15 humming the intro so cute", "Now we just need a turkey V-tuber, and then we can have a turducken stream!", "1:45 start laughing , 2:35 stream starts", "We're blessed!", "K.I.A. Tries It™: Bugged Weight Loss Mechanics (Trash Can Edition)", "英語上手スバルさん :^)", "Nooooo, I miss the stream", "thanks to all the translators for constant translating! this holo   community is awsome", "What would be Calli's Reaction when she sees this😆", "She reacted with \"wtf\" live on stream.", "@Felingus wait,She did??", "This is the first time I see two birds play bird game", "Best bird watching I have done in ages", "YO YOU'RE WATCHING BIRD UP THE BEST COLLAB ON HOLOLIVE \n\nDUN-DUN-DUN-DUN-DUN-DUN! Shuba", "Did I just watch a livestream or go to the deli", "i love this duo", "So this is the secret to world peace ✌️", "Gracias a todos los traductores que aportaron al stream\n\nThanks to everyone who help to translate the stream", "キアラちゃん念願の日本の先輩とコラボするという夢が叶ったエネルギッシュな配信だった。\n\nキアラちゃんは自分の事を「日本語が流暢に話せるだけで他のENメンバーみたいなすごい特技が無い」と嘆いていたけれど、今日間違いなく「日本語を流暢に話せることがキアラちゃんのすごい特技なのだ」と実感した。", "The fact that you two spoke both languages is a testament to the loving attitude surrounding this community, To help Both Sides of the fandom enjoy the content. We are no longer Japanese Bro's and Oversea's bro's, WE ARE ALL HOLOLIVE BRO'S", "Too cute, too wholesome", "That was a lot of fun \nKiara japanese was amazing", "This stream is what pure happiness looks like.", "ARGHHHH I MISSED IT WHYYYYY", "This was fun but it was too short\n:(\n hope there's more collabs in the near future!", "17:08 chicken screaming", "Chikin and Duck roleplaying Geese. what a time to be alive", "damn iam late T____T", "More callabs with the senpais please.", "Kiara living in Japan the whole time was the plot twist of the century", "I slept halfway on the stream\nGomene LoL", "We seriously need captions 😅", "Nooo I missed it :(", "Damn i missed it", "1:21:09 Best Auf wiedersehen...", "1:00:13 A P P E A L   T I M E", "日本語本当にお上手…", "does anyone have a translation of this yet i am learning Japanese i am not very  good at it yet and i feel like this may help a bit", "I didn't understand a damn thing, but TEE TEE STREAM", "キアラちゃん日本語うますぎる", "Missed it by two minutes!!! Aaaaarrrrggg!", "They had such blast together, and so did we.", "Ah this is a good progress kouhai senpai relationship.", "1:48 unmute\n2:36 start", "I didnt understand it but it was such a good stream anyways", "35:25～　てぇてぇ", "Learning bird language was worth it", "Kiara something you could do os add captions in the video post live stream or open up community captions", "WE NEED A GOOSE AND A EAGLE IN HOLO LIVE", "You two killed it.  Amazing collab.", "1:00:18 = Sexy Time!", "This stream made me hungry", "Props to translator. Thank you", "Birds together, strong together.", "Birds of a feather how nice", "BIRDS OF A FEATHER.\n\nBULLY PEOPLE TOGETHER.", "Even though I understood mostly nothing I couldn't help but smile the whole time I was watching.", "Extrovert Energy too strong", "まさかのオフコラボwww", "I love Subaru's laugh", "Ah, here we go again\nInjects insulin", "not 3hs long?! SAD ;_;!", "damn that was pure chaos", "First EN JP collab?", "SHE NEEDS TO MEET THE OTHER HOLO MEMBERS", "10/10 stream", "👏👏👏👏👏 たのし", "This was super fun !!!", "33:50 ここキアラのキス音", "A chicken and a duck turn on a stream. \nSounds like the start of a joke but it's not.\nWhat a wonderfull timeline we live in", "NO! I missed Duck X Chicken!", "Birds Gone Wild :-D", "Kiara also should collab with Pikamee from VOMS", "There is a bird called  holoholotori in Japanese.", "思った以上にてえてえじゃねえか…！", "Forever KFP! KFP! KFP!", "This perfect big kusa", "Most EPIC STREAM EVER", "welp youtube gonna recommend me Russian, American, Japanese, Ukranian, some Indian, some Arabic, some British, Chinese, and abit of French content now\nMr. Worldwide", "Happy to see eng hololive with japan hololive no metter from what countries the are always suport themselfs", "ya know who's da real MVP of this collab? THE TRANSLATOR !!! ARIGATHANKS GOZAIMUCH DESUUUU!!!!", "Duck + Chicken = Goose?", "スバルより日本語上手いの草", "I hope someone ENG Subs this.", "Chaotic wholesome", "the most anticipated event of 2020", "So sad i missed it live. Damn work ", "Bottom left 🤣", "04:05 Subaru Memo\n06:15 See her face\n11:58 You are beautiful\n12:53 Now", "What is this a crossover episode?", "Special combo, chicken and duck deluxe with extra soda, sir.", "dang missed it", "This is the best thing ever", "Next collab will be the detective and her dogg", "BIRDS TOGETHER STRONG", "Sorry Sub channels, going to need to you to translate the whole stream plz and thx.", "So you're telling me she's a chicken and she's eating her ancestor ", "Calli really do be getting NTR'd by Subaru smh", "i am once again asking for translation", "Sounds real fun but too bad I can't speak Japanese. I guess gotta start learning now", "Good Collab ! Exellente コラボ", "Synopsis : Two bird , a duck and a chick.... Phoenix , try to become goose and attacks people in game while Vibing 😂 .  #KUSATORI", "I’m happy.", "its so cute and fun collaberation. i Hope other holo myth will be collab soon at hololive Jp.  🙏🙏🙏", "Both are best birb, can't decide 😍", "Infinity war is the greatest crossove-", "Most epic collab in Pangalliformes natural history", "This is peak content right here and I love it", "Stellar example of what they mean when they say 'birds of a feather flock together'. ...I'll see myself out now.", "The Adventure of Holobirds begins", "最高", "peace was never an option", "#KiaraSacanosDeLatam onegaishiplease :3", "I have not watched this stream yet, but I'm sure it will be awesome.", "Kiara: To present the world in devastation! \nSubaru: To unite all trolls within our nation! \nKiara!\nSubaru!", "Subarashii collab!! See what I did there?", "This was an off collab?", "10:11 a rose for Kiara", "ah yes\ncute tomboy duck and boing boing chiken", "LOVE IT", "Canadians: Do we... sound like that?", "Oh wow... Kiara is at Subaru's place in this stream off-collabing so that means Kiara is in Japan and can do off collabs with the other Hololive JP members. Nice...\nI'm almost certain the others are also Japan-based as well since their YT location is in Japan. Correct me if I'm wrong.", "Only Cali and Kiara are 100% Japan based. The others seem to stream at other timezones. Plus I think Gura mentioned needing a translator to speak to the others on discord.", "Never imagined I'd want to watch a chicken and a duck play a video game. Guess it's time to learn how to speak bird.", "1:12　くそわろたｗ顔芸おもしろすぎだろ", "Looking forward to the eventual \"teaching Korone English\" stream", "Peko vs. God Doog English Battle! But Kiara would probably coach Peko in that one.", "Ah yes a \"Korone teaching English\" stream.", "The byerd / tori summit was a success.", "Kiara gonna get these girls speaking English in no time!", "So much respect  for kiara. 3 languages is insane. I’m in the process of learning my third right now. Japanese is really hard", "This game has Co-op now?", "Kiara may not have started off as strong as the other girls, but damn she's got that collab game, both this one – peaking at 51k viewers live, and the \"miracle\" karaoke collab with Nene – this girl is going faaaar.", "That collabs with nene can u give me the link ?", "@Rhag Sure, that's the one:\nhttps://youtu.be/AIK6fyh1AP8\nMerely seconds apart, not intentional at all, just a coincidence", "Birds together. Strong.", "えっと、めちゃくちゃ気になってたんだけど、ホロENって日本在住なんか？\nオフコラボってことはそういうこと？\n他の外国ホロは現地だと思ってたんだけど", "Calliope and Kiara live in Japan", "@yuukafu I see.\nI feel Kiara and Cali collaboration has done many times.\nIt has this reasons.", "Cali be sweating a river seeing this", "Bird Collab is the best thing ever", "Loved how much TeeTee we got this stream.\n\n\nBIRB TOGETHER STRONK", "When u gonna collab with 3rd Hololive member Wild Rabbit Usada Pekora ????", "Today..! I am..! Berry Happy! 1:19:23", "If this is offcollab \nProbably Kiara and Calli based in japan --- ???", "Yea it's been confirmed a few times now, that both Kiara and Calli live in Japan. Kiara seems to have to leave in a few months though, likely because her visa runs out.", "Birds of a feather cause mayhem together. Bird is the word! KFP!!!!!", "Commenting to help out best birb with the algorithm.", "I don't speak this language but the girls are cute so its okay", "おもしろかったよ。がんばれキアラちゃん！おうえんしてます。", "wasent first colab with holo id also subaru?  nicely done. have a nice day.", "まごうことなき神回である、異論は認めない", "OH YEAHHHH DOUBLE BIRDS", "Bro why didnt i come to this sooner", "スバルちゃんACのCM知らないんか...w\nキアラちゃん日本語めっちゃ喋ってくれて嬉しい\n可動域マウントw", "#ホロ鳥", "we need gura collab with other JP hololiver, such as coco,tallest and shortest", "Where subtitle ;-;", "Nooooo i missed it!!!!!!", "2 birbs bullying farmer Yagoo", "Can someone explain the bottom left meme?", "Calliope:look my wife can Japanese\nHow can my wife so smart.", "This is great", "I wonder how's Calli doing", "We all know Calix Kiara is a thing but when it comes to the jp like Kiara and Subura who do you all think will get along really well?", "Kiara should do a Japanese/English study stream", "I'm in heaven?", "Two birds playing a Bird game:)", "Holobirds, Holy Birds.", "Do all of HoloEN live in (or visiting) Japan currently, or just Kiara?", "Calli does, the others do not.", "@Rueblie Ah, thank you! :)", "Who do I have to pay to get this english subbed", "So this is what they call Bird watching...", "キアラ海外なのは知ってるが\n日本人説を言ったリスナーに対して\n必死に返信してる奴がいて笑ったわww", "逆に言えば、日本人説出るぐらいキアラちゃんが日本語堪能で、日本語堪能って言うことはそれだけ日本を好きってことなので、僕はキアラちゃん好き。", "Watching this again cus it's soooo gooood. Can't wait for you guys to collab again ", "鴨そして鶏のコラボ。すごい", "Kiara and Subaru are having a lot of fun doing their first collaboration", "can subaru understand english and cant speak very fluently or cant understand english well  and  speak fluently ? \na bit confused", "Wow your Japanese is super cute Kiara. Almost as cute as the two of you making weird goose noises.", "#ToriNakama has gotta be so much brighter than the sun. These two leave no dead air between them. Makes everything super lively but would be the bane of most other members. I look forward to more collab between the HoloBirds!", "History was made today", "KIKIRISHUBA <3", "birds together stong", "How should we call them? Birdbrains? Birds of a feather?", "Duck! Chicken! BEST MATCH!\n\nBirds of Burning Wings! DuckChicken!", "鳥ライブ", "初めて見たけど日本語めちゃくちゃ上手いね！！", "Most ambitious collab of all time.", "I think it's cute how Kirara speaks Japanese with a German accent.", "BIRD UP", "スバル先輩も世界的な鳥なので\nフライドチキンにしてもろて", " Duck and Chickin, Delicious", "鳥魂ってゲームも2人で是非やって欲しい", "Does someone have a timestamp of when Kiara makes the TORI-aezu joke", "40:10", "@RayZhaTV thank you i needed that SHUT UP KIARA", "Blessed and Wholesome Stream!!!!!", "Kiara's Harem so far:\n1. Calli\n2. Burger King\n3. Subaru", "You forgot:\n5. Us", "you forgot pekora xD", "In a world where crime and corruption are NOT running amok...\nWhere injustice and terror do NOT grip the streets in fear...\nTwo birds of a feather will stand together and change everything.", "TOP 1 Bird video on YouTube", "16:41", "特に、深い意味は \"無いで\" のところでこの2人は完全に完成してると思った", "I thought subaru was a raven", "Brighter than the Sun !", "Two birds one chair", "海外ニキ海外ニキって言ってたら俺たちは日本ニキって呼ばれてたんやな…", "And so it begins.", ":D", "スバルは色々な人とすぐに仲良くなれるの凄いよな〜", "Englishと日本語が入り交じってるコメント欄ほんまlove and peace", "20％↙️", "QUACK QUACK QUACK intensifies", "Barely understood anything but enjoyed it nonetheless #Holobirds", "こんなにかみ合うとは思わなんだ", "Now Subaru is aware of Kiara's bottom left lmao", "Thanks for stream ", "Japanese + English = englishese", "8:18", "Truly the best Combo menu", "Hello Kiara,\nWould it be possible for you to post another video were you teach us japanese? If you could translate this video, I think it would help us learn more japanese. I would love to watch you breakdown, explain, and translate some other japanese hololive videos :)", "😂 awesome", "Wow.", "3 ducks and 1 chicken walked into a town and wreaked havoc.", "Interesting", "Birds of a feather", "日本語上手すぎて驚いた\nホロライブEN,,配信時間が日本向けすぎると思ったが、日本居住者多いんかな", "So Gura and Kiara both did a collab with Subaru. keekeekee", "8:20", "this was too much fun ajajja ... wholesome as ........", "HONK.", "Hide your kimds \nHide your wife\nHide mum\nHaha h-hide your family hahahaha", "16:40 , 1:17:29 \n\nKiara true phoenix form", "Just 2 birds vibin", "Honk and Quack", "Pure chaos lol", "Wait...if Kiara is in Subaru's home, Kiara works/lives in Japan or something? i honestly thought she lived in an english speaking country or germany XD\n\nThen again, she is a pheonix so...plane tickets are a non issue for her", "if this was only 20% how the collab would look line at 100%? hmmmm", "I think Alfred Hitchcock made a movie about how 100% looks like ;) .", "omg the shy jp viewers are flooding in chat", "Double the trouble half the brain cells", "Prepare for trouble!\nAnd make the honking double!\nTo annoy the people to devastation!\nTo eat all the bread within our nation!", "すごいなキアラさん　日本の芸人が二人いるみたいだ", "Ente und Huhn ist das beste^^", "All the English speakers only watching this video... I totally get what they're saying.", "OMG so cuteeeeeee", "Ever wanted a phoneix and a goose playing togheter? Here it is!", "du, du hast, du hast mich!!!", "This stream was mostly in Jp, but not until recently the only way to get into hololive was Jp streams. From my experience laughter is one of the things that transcends even language barriers.", "We stand united as brothers under the big 草", "This is a holobird, the unstoppable force who bright us all together", "Japenglish is good. Lol", "Did I misunderstand? It was mentioned a few times in odd ways. Was this an off-collabo? Is Kiara at Subaru's place?", "Yes! She was also at Calli's place for dinner earlier this week. They both live in Japan right now.", "@Isabela Salvador The lore deepens! Thank you.", "Amazing collab", "BIRDS 2 STRONK", "so Kiara was actually lived in Japan right now?", "Aren't the same but one simps for a grim reaper and speaks english, and the other speaks Japanese and doesn't simp for a girm reaper?", "スバル～", "Why did I go to sleep... I missed the collab of the century.... アカイブありがとうございます", "This is some top-tier entertainment. Two birbs playing as another birb doing chaos birb stuff.", "日本語ペラペラじゃん。", "Truly beautiful", "anyone else see at 33:45 the guy swinging at kiara?", "Wholesome birbs", "ame haachama english only when", "Oh the chaos", "The birb collab", "Wait, why are these birds talking to each other using human words?", "HOLOLIVE EN CROSS HOLOLIVE JP!!!!", "Wait does this mean Kiara and by extension Calli live in Japan? Or did Subaru live somewhere other than Japan?", "from what i've heard, they both live in japan, iirc kiara have already been in japan b4 hololive EN", "Bitte gib mir etwas von dieser Fähigkeit ab :c \nIch will auch fließend Japanisch sprechen können, und so eine gute Aussprache in Englisch haben.\nplease teach me senpai.", "The chicken and the duck playing the goose game", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK I LOVE YOU❤❤❤❤❤💯💯👈", "1:00:15", "HONK", "恩赦不可避", "CLASH OF TITANS...", "Birb, together, stronkk!", "草", "A duck and a chicken impersonating geese", "AHAHAHAHA", "No se porque pero lo del pato y el pollo me recuerda a \"friends\"", "You live in JPN?", "Calli and Kiara both currently live in Japan", "How are there no comments?", "てかキアラちゃん予想以上に日本語上手いなw\nコミュ障こじらせてるあくあよりもペラペラしゃべれてるw", "DO A FLIP", "pheonix and duck collab", "4 noisy birds.", "Kiara are you in the same room with Subaru? \nis she pretty?\ndo you love Cali IRL?\nHope Pekora is watching", "Kiara was at Subaru's home, yes. Subaru even treated her to dinner. Kiara went to dinner with Calli yesterday.", "KIARA＆SUBARU is very cute!!!!", "I have not been this excited for a crossover since the Avengers.", "キアラ日本語めちゃくちゃ上手いわぁ。今後のホロライブ ENと他のホロライブ のメンバーのコラボに期待！", "7 comments", "S E I S O", "What a cool colab. Peace is now an option.", "I love this gameplay", "Kirara you are a good goose", "Pi Pi Pi Pi, Shuba Shuba Shuba Shuba", "Hello", "Tori squad is great \nthx for the colab kiara", "Did Calliope Mori show up?", "いやキアラペラッペラで草", "So does this mean all the EN members are living in JP or just kiara?", "Kiara and Calli", "Yes I like very much do more", "🐔🦆", "all i herd is duck noises", "ホロ鳥＝漫才コンビ？", "they both have such cute hats", "😀", "Yes", "Did they do it?\nme: \"yes...\"\n\nWhat did it cost?", "Cuando sus modelos se mueven eso quiere decir que están en la misma habitación???", "Sep, fue un offcollab en la casa de Subaru", "@Kliphnir  entonces kiara vive en Japón o Subaru en estados unidos", "@Francisco Sanchez Parece que Kiara se mudo a Japón... o no se si ya vivía ahí", "In traslators we trust", "Why are burbs so wholesome in a flock", "Successful collab nice", "Chicken&duck", "Gracias por todo chicas", "Undertana taikang japana", "まさに「カオ«スバル»ド」やなｗ", "キアラ……実は英語ネイティブの日本人なんじゃねぇか……？\nそれくらいナチュラルなやりとりでびっくりしたわ", "!!!", "Ausgezeichnet!", "It has begun", "Is it just me or Kiara has better Kansai-ben pronunciation than normal Japanese pronunciation www so cute", "A duck and a chicken play a game in which they are both geese", "Hol'up... Duck and a chicken doing a goose game....", "subaduck and kusotori . I can die in peace", "haha birds go brrrrrrrrrr", "Didn't understand more than a handful of the times Kiara translated.  Didn't care, the energy was too fun and delightful to look away.  Looking forward to  another #holobirds collab~ ", "Nice bird collab", "Kiara slicing through language barriers like a knife slicing through butter.", "Kawaii KFC x duck collab", "🐔🙏🦆", "見てるだけで元気を分けて貰える配信だ", "SHUBARIKI!!!", "Haha kiara cute shuba shuba shuba", "This is not looking good for cali", "w8 is subaru in US or is Kiara in japan?!?!!", "they're both in japan", "Shuba shuba\nBokk bokk", "Am i the only one that noticed the audio crackle", "Nope. This is on video for first 12 minutes. Then just a little crackles time at a time", "How many of you are new to hololive  because of holoEN", "Hell is here", "Calli is super jealous rn", "Surprised no one noticed the little bird kisses at 15:12. No one tell Cali.", "A duck and a chicken play as geese", "My Donald Duck and Colonel Sanders Can't Be This Cute", "Very nice stream\nArigadanke gosaishun", "So a chicken and a duck enter a gardener's house...", "Hitchcock's movie the Birds would have been a lot cuter if the birds had been Subaru and Kiara... I'm telling you, he missed an opportunity by not timetraveling into the future to make that real. Because I wouldn't mind an even scarier version where suddenly countless Kiara and Subaru fly throughout the sky going kikkiriki and shuba shuba... everyone would have died of diabetes, because man would that be sweet.", "If it wasn’t obvious before, this stream confirms that Kiara and Mori both are currently living in Japan. \n\nIf I had to guess, Amelia is the only one living either in Europe or America. Ina I feel probably lives in Korea. Gura is the only one hard to guess.", "It’s a hail mary to the dark but I think gura is in the US or Canada since both her and amelia are always together and Amelia is in the US", "It's currently Kiara and Calli living in Japan whereas the other 3 are probably in north america since they mostly occupy the evening timeslots in the US.", "@U:R? can’t be too sure until confirmation though", "pog", "So sad , couldn't catch this live. But still blessed ", "KACHAU", "Kiara can speak bird, German (her accent felt like from the south...maybe Bavaria or Austrian tho), Japanese and English...REMEMBER LADS, BUSINESSMEN/WOMEN/BIRDS MUST BE FLUENT AND EXPANDABLE!", "She is Austrian I’m pretty sure", "I understand not much but it was fun ", "Kusotori and Kusoduck", "GRANATA", "????????? first stream is an off collab that means Kiara isn't in NA", "You just figured that out? lol", "@scooby yubi doo yeah haha,  although idk if that would mean trouble if they ever do 3D collabs in EN", "@Andre Kiara is only going to be in Japan for a few more months. I don't think any of the EN girls will do 3D since they're scattered around.", "Cool", "Shubaru", "God I loved this collab so much, Holobirbs forever\nCan't wait to see Mori x Rushia in a future because Boing Boing", "CONFIRMED\n KIARA FLEW TO JAPANTO MEET SUBARU", "Tenchou, Next time you do a Collab like this don't be scare to go all out with your Japanese, we don't care if we don't understand, we just want you to have fun with your fellow Hololive sempais :D", "Its such a shame there are still \"rude fans\" in the chat.... :(", "Kiara I hope in the future you learn that translate too much kill the fun of the stream, I loved what you did today, learn from it and translate less in the future unless it's superchat time double translation is awesome. I'm ok with full japonese streams remember this is a show so above all things I want you have a good time so you can delivery genuine fun for us. I love kiara and Subaru.", "Kiara don't tell the other Hololive EN members but i like you the most you are the best", "I really wish there was more English. The language barrier is the biggest reason I didn't get into this community until recently. Still, this was nice. I hope there are challenge streams where everyone has to speak English all the time.", "About self dubbing to english in collabs. It was ok for the most part for me but the conversation at the end got hard. Obviously I don't expect you to self dub every line but I would appreciate if you could at least say what are you talking about from time to time. I'm learning japanese and knowing the topic helps me immensely in catching keywords and overall understanding. Sure, there are translators in the chat but they are delayed a fair bit. Often by the time I knew what you were talking about the topic changed. ", "i think the biggest problem with that is that it disrupts the flow of her conversation shes having with whoever shes talking to", "@Alex Lombardo Nah, One or two sentences from time to time should be ok (every topic change for example). I've seen other multilanguage collabs and a little self dubbing never disturbed much.", "Give her time to gain experience in streaming and balancing with the dubs. Coco and many other multilingual streamers had to go thru something similar.\n\nWhile giving your opinion is fine, it is better to not expect anything of content creators and just enjoy their content for what it is.", "@EpicZ Dude, I'm only giving my feedback. It would be pretty hard for streamers to improve anything without it.\n\n> Give her time to gain experience in streaming and balancing with the dubs.", "NGL, I didn't enjoy this.", "The one time she actually needed to translate and didn’t do it", "Don't expect Kiara to self dub. Let her stream comfortably and let her choose when she self dubs.\n\nYou can always wait for translated clips or learn the language yourself.", "I really wish this collab was translated a lot more than it was.  Kiara is almost 50/50 EN/JP in her regular streams so I was hoping it would go the other direction too with collabs.  Without translations it's not really any different to just  watching an JP Hololive streamer, which is something I really don't do since I don't speak the language."]