["Stream ending in a tie proved that the only loser here is chat.", "Well I was here wasting 2+ hours watching a cute anime Phoenix and detective duke it out between each other just to have no victor. \n\nSo all in all", "@SpyderTek :D I guess it's not a waste of time if you enjoyed it", "Chat were the only winners. They both lost. 🙃", "@NuDimon Chat won... But at what cost?", "@Zeron Xepher Amelia clearly won but Kiara managed to stretch the stream by 30mins", "@notkiller56 :p She won the battle but the war was a tie", "Zeron Xepher severe headache and lost a ton of brain cells", "This comment is gold", "The real losers were the friends we made along the way.", "@AltheMadman thanks I hate it", "@Zeron Xepher our sanity", "It was only two hours but fell like five years", "these young kids with this handy and hipi hopi", "That chess battle was legendary... kinda like dragonball", "@Zeron Xepher i must got only the fillers", "2- are you kidding me!? I thought decade has passed!", "That's a win", "I think I cried a little when AME finally won the chess game", "Its like itachi's tsukuyomi. My brain cell are deas lol", "I cant eben speel rigth", "I swear my life span went down a couple years", "@Zeron Xepher we could have been in the hyberbolic time chamber", "chess is the worst game for streams, I don't understand why the chat say yes. Why are we still here, just to suffer.", "@Julius Zeppeli Its even worst when two brain cell are playing it😂", "Pepperidge farm remember", "Hipy ti hopy ti your braincell will sayonara baby", "pain", "I feel like I had lost five years", "@KFP Mei Mesaki I cried. Finally, thanks god", "@KFP Eggu san \nDragonball Z fights drag on anyway.", "@Zeron Xepher it was like those “five minutes” in the goku vs freeza fight", "Felt*", "the chess match took 1 hour 10 minutes and 54 seconds", "The chess game was so painful, but they were so innocent that I didn't know what to feel", "Just laugh and cry at the same time, that's what I did", "@Notchmeister I guess that explains the insanity xD", "Chess is not a good game for streams and is worse when two smol brain are playing it lol", "@Julius Zeppeli It was fun to watch until we realised Ame had no idea how to checkmate.", "Someone recorded the game on lichess, played through it fast, and put it on reddit. That made me laugh while dying a bit inside. \n\nIf I had to watch the VOD, I’d probably die inside without the laughing part.", "@Notchmeister same", "@Julius Zeppeli >Chess is not a good game for streams\n\nHave you been on the internet this year? Chess is so popular on Twitch right now.", "I can't fault them, but I did lost a considerable amount of braincells watching this.", "First half of the chess match: \"haha fun.\"\nSecond half: \" Why are we still here? Just to suffer? Every move, I can feel my rook...and my queen...even my pawns. The pieces I've lost...won't stop hurting. It's like they're all still there.  You feel it too, don't you?\"", "\"Watson... I am already bottom left.\"", "Ame wasn't that kind of detective", "I want Amelia to travel back in time to uninvent chess so nobody else has to suffer the way we did.", "When Ame promoted to a rook...", "@Nils Jonsson please. Please. I don't ever want to see chess ever again.", "\" Why are we still here? Just to suffer?\" LMAO.", "@Notchmeister And she did it twice", "The part when Amelia is trying to checkmate Kiara. Watching it is physically hurting me to the point where I would just jump into their game and finish it by myself. But nonetheless the whole stream so fun. No regrets here.", "SHE TURNED HER PAWNS INTO ROOKS INSTEAD OF QUEENS. Doctor I need some horse tranquilizers, I gotta forget today ever happened.", "God that was painful. Never again am I watching them play a 51 game. Not these 2. I can't do it. I'm gonna die.", "@Aqua Freesh Some day we will look back to this moment and we will say, I don't remember what happened... on September 11t- I mean October 14...", "@Zeron Xepher 10/14/20- never forget the pieces lost that day", "In the end, she played us like a damn fiddle.", "I wanna add, thank you guys for making the top comment and all the replies Metal Gear Solid references", "It was pain, peko", "To the top !!! xD", "@Aqua Freesh SHE MISSED TWO CHECKMATES that hurts more", "This whole thread is gold hahaha", "It was a game to surpass metal gear", "to bottom left with both of you", "I just started metal gear solid 5", "@Dimitry Low good game, still play it every now and then.", "News: Over 27.000 people in chat had lost all of their brain cell due to the battle of the bird brain and defective brain\nThis even worst than Pekora and Aqua BGM combined", "My soul left my body", "Help me my brain is still burning. End my suffering.", "@BlackFriction Do you know what Ame said at the end of the battle: \" it's only take a while \"", "Bruh I have like 4 alarms and they're pekora and aqua's bgm, and I swear to god everytime I wake up I lose 4,000 brain cells", "We all went the steins;gate 0 path.", "I've only gotten 30 E tanks and 7 lives, now I only have one life left", "Worse than Aqua and Pekora's bgm combined? That's a very strong assertion to make, but I am inclined to agree anyway.", "It's fun but suffering match.", "I suffered a major brain leakage.", "As someone who played chess since 6 yo and in a chess club for 4 years😂 it really hurts my brain", "The amount of times the both could win so much faster in the beginning hurts me it hurts me so fucking badly", "Pekora's BGM is FIRE THOUGH", "Big brain: listen to both Pekora and Aqua's BGM while watching this.", "Hey Guyz I just analysed the game in Chess.com, here's the analysis:\nGame Type: WILD — A chaotic game where both players had many chances to win. (LOL)\n--------------------------------------------------\nMoves:             Kiara, Amelia", "Wouldn't have expected it to be that positive after watching that trainwreck.", "you know, on paper this doesnt sound half as bad", "1 ... Instantly off book\n\nPerfection.", "Yeah this is what's known as a trainwreck but somehow actually high", "Bruh, I also did a self analysis, seeing a hell lot of missed obvious wins", "Honestly 1:23:21 Bishop G7 to D4 instead of G7 to F6. This move hurt me as it would've taught them a lesson on checked for pieces.", "I'll feel bad if this gets lost in the sea of comments", "Yo this comment is gold XD", "full PGN if anyone else wants to run an analysis\n1. c3 h6 2. h4 a5 3. f4 Ra6 4. e4 Rc6\n5. a4 Na6 6. b3 b6 7. Rh3 Bb7 8. Nf3 Re6\n9. Ba3 Bxe4 10. d3 Bf5+ 11. Kd2 Re4 12. Nd4 Bxh3", "it was getting really close to the 50 move draw. Would have been soo funny if it happened and they couldn't figure it out.", ">book leaving move: 1", "Aww, Kiara acted like such a mom at the end there. ", "Calli in shambles", "NTR", "Okay that was unexpected good one", "Bruh 🤣 reading  this caught  me off guard 💀💀💀", "...", "Bonk, you are bottom left as well", "@Ivanator The Great 👉👈", "@Ivanator The Great Oi, I'm just stating facts.", "Oh no", "It’s fine they’re all her girlfriends", "GROUND POUND", "GROUND POUND ^", "I wish I was a mom...", "\"Nothing beats a ground pound!\"", "I don't know the reference please educate me", "@buddermonger2000 just search amelia ground poud", "@KH2B I was watching a few of those streams for didn't I know?", "It was an invitation.", "Ame's Pawn gets promoted\nKiara: Since when does that rule exists?\n6th century I believe.", "...Well, it's in-character for someone who's lived for millenia.", "\"I don't see the issue with the chess game that everyone has.\"\n\nKiara jams her Queen right next to Ame's king", "Her goals are beyond our understanding", "Turned a win into a loss and secured her position as a bird brain. XD Though Ame coulda won like 50 turns earlier if she just stuck the queen in the space guarded by the knight. xD", "Botez would be proud", "Chess start at 53:32. End at 2:05:06\nHave fun y'all all", "The part when our detective is trying to checkmate our bird is so painful to watch and yet at the same time  it's so hilarious, I love it.\nThe whole stream is so fun to watch.", "lolll it's like half of the stream.", "Omg what did i missed lmao , wtf is this??", "It’s 1 hour long?!?", "Ya know I'm at 1:41:05 I don't even know how this match could take longer, I mean there were many possible checkmates but this time I don't know how it could take longer", "@Josue Cuentas Jave you'll be surprised or I guess in this case, we're you suprised?", "HOLD UP. i saw people commenting its long, but literally over an hour for a match??? and i even heard the game ended in a draw even though i saw a clip where ame was obviously winning. wtfff i have to watch it full.", "@USADA KENSETSU VÌRÚS did you enjoy it? Now's my turn. Wish me luck", "@Josue Cuentas Jave When I saw the duration and got that far, I thought, \"Oh I guess they play two games.\" And then all was suffering.", "Since the start of the chess game someone could say that something is wrong lol\n\nThanks for the timestamp, thought", "I thought u were kidding so I went to 2:05:06 and discovered it was true", "I like when Kiara does small talk with the rest of the group. She’s a good conversationalist and I can see that bringing the group closer and closer over time.", "Congrats, You Got Hearted", "This video should be added on WikiHow “How to suffer” page", "Good one", "Pain, peko", "That chess match was like watching two full-grown adults self-lobotomize. PLEASE MAKE THE CHESS TOURNAMENT HAPPEN!!!", "Despite how infuriating that chess game was, I would still drop everything to watch a hololive chess tournament.", "@Buffed_Puff Saaaaame", "I would love to see who actually has the biggest brain among them even if I lose my brain cells.", "I would still watch this despite probably will begging Calli to come and take my soul already watching it.", "Wait, you watched that and now you want to see more?", "@Buffed_Puff Yes, would love to see a serious chess tournament. I wonder who from Hololive/HoloStars play chess.", "As long as these 2 don't take part. I will watch.", "I tagged Aran, the tournament organizer for Tournament Arc (chess tourney for anime youtubers) in a tweet. He noticed it and liked my tweet, so the vtuber chess tournament might not be too far off. Kiara and Ame expressed that they wanted a rematch in chess too in twitter.", "Fucking time stamp please", "@Buffed_Puff Include Holostars lol watching this chess match reminded me of the Izuru Robel chess match where they have no idea what they are doing lol", "I would love to see more Hololive EN chess games happen.", "@Zach hololive+holostars chess tournament would undeniably be even more hype, I just did not bother to mention holostars because I know that collaborations between the two holo groups are few and far in between which makes a concept like a hololive chess tournament, which is already long shot, seem nearly impossible.", "@Buffed_Puff yea.. I wish they could collab more between the two groups.  Just a wish for now haha", "Ches tournament wth Hikaru Nakamura analysis", "Pain, peko", "I hope they play shogi, it is an advanced chess game, it will be funny and fun to watch them playing shogi, japanese chess", "This wasn't a stalemate.\nEveryone lost.\nKiara. Amelia.\nThe viewers.", "I missed this stream cuz of school, what the hell happened. This comment section sounds like a hospital after a war. I can FEEL the depression. How.", "There is only pain", "Honestly I am confused halfway if amelia is torturing kiara or us. But no, turn out she torturing kiara, us, AND herself!", "Pain Peko", "@imagine being a mouse Calli has described the experience of watching this perfectly.\n\"If I wasn't death, I'd wanna die guys\"", "That`s why I`m here", "@imagine being a mouse bro if you understand chess...Boi just you wait", "@Namikaze Nara I was so into the game I missed that comment. Got a timestamp for it?", "It starts around 53:00", "@BlackFriction ah no, she didn't say it in the comments. It is her quote in one of her videos, I think the debut stream? I kinda forget. She did watch the video with us though.", "@Atis Yosprakob I meant the calli comment", "@Namikaze Nara ahh gotcha lol. Makes sense.", "@imagine being a mouse An hour long chess game because Amelia doesn't know how to checkmate and Kiara doesn't know how to concede.", "@Namikaze Nara while she was there. I can only assume she tuned out. Please Calli say this is true and you didn't put yourself through this", "The Chess game was like watching No Game No Life chess but Two Stephanie Dola", "you mean STEPHANIE DOLLLLLLA?!", "It's like that coin flip scene, but pain", "XQC vs Cr1tikal but both are XQC and have goldfish memory", "@Frozen Lettuce you mean xqc versus himself", "Oof", "B-but muh Steph........", "This is such a perfect description I can't even.", "That chess game\nExpectation : Kiara promoted to bottom right\nReality : Ame demoted to bottom left", "@UCiTtQQoig-GVsKANc0uvFrQ I'm sorry, but when you promote and not pick the queen, there is only one place for you ", "@Notchmeister I’m sorry to say but she choosing to pick a rook first and a queen with the second pawn is bottom right, you are bottom left.", "@Notchmeister What kind of logic is that lmao, cringe...", "@Alizoneto Rocha Amelia was able to promote a third time. She fucking chose another rook. Bottom left all the way.", "@Indiexanna what do you mean! A queen can do the rook and bishop's job at the same time, why won't you pick that. A knight has something going for it atleast. (And also don't take this too seriously, both Ame and Kiara are newbies I was just meming that both of them are bottom left)", "@Notchmeister Oh alright, didn't quite clicked to me that you were refering to Kiara and Ame. Must've been the exhaustion of watching that game taking the toll of me.", "@Indiexanna it's all good! I was replying to someone anyway and they deleted their comment. We all deserve some rest after that clown fiesta game", "@Notchmeister Alright cool. Still, although queen is the best option of all, nothing's actually wrong with not picking queen though. Just make sure you actually know how to end your opponent with what you pick XD", "I remember while live kiara contesting she is not bottom left etc but chat just straight up (even sc) that “no, both of you are bottom left”", "In Ame defense, she didn’t know the queen was an option", "Warning:  DO NOT WATCH THE CHESS MATCH unless you are extremely masochistic.  You have been warned!", "Not even a masochist could enjoy that. I CAN hardly type, I may have just gotten a new migraine trigger.", "You know, I used to say joke I wanted to be tortured and dommed by Amelia. After watching that match I have had my fill and I don't think I will be saying anything like that anymore.\n\nThis video should be tagged: NTR, Mind break, Torture, Harem, Pain and Suffering. ", "Everybody should experience it at least once. To cull the weak, leaving only the strong.", "Jokes on you I came for the chess\n\nEdit: I immediately regret my decision", "Warning? More like invitation!", "Yagoo died again today but not because of the usual coco haachama things but because his brain was fried", "This game was such a trip. It was nail-biting tension from beginning to end. Nevermind the fact I lost at least 15 points on my IQ.", "Unluckily for you, ame has made me into an m because of how much she scolds us in her streams", "It's tooooo late. Because I watched the whole chess match with fun and yes pain in my head.", "All of you guys have clearly never watched the legendary Roberu vs Izuru chess match. At least the girls knew how to move some pieces.", "What if I don't know how to play chess on the first place?", "I'm gladly a masochist.", "Fucking time stamp before warning plz", "I hate that I didn't dislike it. It reminded me when I used to play in high school and absolutely get beaten by my friends but I had such a great time. Also I'm a masochist, so that might have influenced this too.", "@George Arce I actually enjoyed until the queen rook knight end game attacked", "I came here because I missed the match xD", "@MTmango I accept that challenge!", "Aside from 1:22:53 and 1:23:21 Bishop G7 to D4 instead of G7 to F6, I found it enjoyable.", "@K MURALI KRISHNA same here", "This is a legendary stream, especially for masochists. Ame and Kiara have made this stream ridiculously entertaining. It's also a perfect example of the comedic potential of two beginners who barely know anything about chess.", "Reminds me of Roberu and Izuru chess match, they eat each other's pieces until only left the king's for DRAW. While first time ever playing", "Man two newbies really make chess games amazing! But this is something special", "The rook was in the pawn's line of sight for far too long", "1:00:35 Ame moved the bishop so the rook have a discovered check \nMe : \"Hey, that's not bad\" \n\nAme : Eh ", "Eh he te nandayo?!", "If anyone of you miss the stream the chess match is a must watch. Never a dull moment", "Satan why are you on your alt today?", "the highlight of this stream", "I second to this, it was very entertaining for me. I was laughing the whole time.", "Persona 2", "@Renzo Fire Emblem Thracia 776", "The vast majority of us can agree that that chess game had us in pain, peko", "That one really feels great! After all of the repeatedly watching the chess i began to stop feeling anything at all and that give me peace in my inner soul! It's a must watch for a newcomer", "The chess match was really great until it came to the end game.... they just didn't want the other to finish first ;)", "The only dull thing was the pain in my cranium", "“Why’s everybody freaking out? It can’t be that bad”\n1 hour later\n“God is dead. God remains dead. And we have killed him. How shall we comfort ourselves, the murderers of all murderers? What was holiest and mightiest of all that the world has yet owned has bled to death under our knives: who will wipe this blood off us? What water is there for us to clean ourselves? What festivals of atonement, what sacred games shall we have to invent? Is not the greatness of this deed too great for us? Must we ourselves not become gods simply to appear worthy of it?”", "I would like to ask where this reference is from so that I may also use this in the future good sir", "@Canary It’s a quote made by a guy named Friedrich Nietzsche", "@Daniel Hartmann thanks, I've heard of the guy, he's pretty popular, I just don't know much of his works nor have I read his books yet.", "Wad the chess match really that bad? I haven't watched it yet", "@Elías MG so, did you watched it ? And how was the experience ?", "This chess game is far more frustrating than Holostars chess game", "It'd be interesting to see the Holostars reactions to watching this one", "The Holostars need someone modeled like Lelouch who is a genius at strategy games and especially chess", "@Icetea 2000 so CdawgVA?", "@Rebalanced I’m sorry for I have to confess my sins for not watching Holostars", "@Rebalanced cdawgva was defeated by gigguk....", "@TG 125 well he is the protagonist after all", "NGL... I felt exactly how you feel lol", "i came to this video just to watch the chess game after i saw the holostars one yesterday... i thought that was painful enough. what exactly is going to be worse??!! well i'll reply to myself after i see it", "@Rebalanced wait someone send this to CdawgVA and make him do a reaction video to this game", "@Khang Tran holy fuck yesss", "instead of kiara moving to bottom right, i just think this stream moved amelia to bottom left lmao", "The holostars chess game was brilliant because neither of them knew the rules.  It gave me an insight into how the new DeepMind project works.", "Broke: Horse\nWoke: THE PEGASUS WITHOUT WINGS", "\"Why are the comments too harsh on the chess match? Maybe its not too bad\"\n\nsees Kiara sacrificing the queen instead of the free knight kill", "And it's a fucking hour long", "1:23:21 Bishop G7 to D4 instead of G7 to F6, this was the only point that got me.", "1:00:26\nAme could’ve taken the knight  on F3 with her bishop, also attacking Kiara’s queen with discovered check.\nKiara could just protect both King/Queen with the light-squares bishop, but Ame would be up initiative, a knight, and totally winning.", "It was a draw for Kiara and Amelia, but a big loss for chat...", "Why are we here...Just to suffer", "Never have I ever been so infuriated by a game of chess.", "It took so long that I was able to play among us, be imposter, and win while they're still having an epic battle. It was worth it tho", "Everyone: *confused screaming*\nMe just waking up: What did I miss?\n\nMe after watching:*confused screaming*", "I feel my brain cells committing suicide, \nONE BY ONE.", "Rook by rook, queen by queen...", "Me before: I love to watch people play chess... It allows me a deeper understanding of their psyche. There is something about chess that reflects the player.\n\nMe after: Why are we here just to suffer?", "Anyway, what is your analysis?\nIgnoring the suffering, that is.", "There is anything else besides suffering and torture?", "As an archive watcher\nSeeing that livechat suffered bring me nothing but joy", "Yeah, was more ticked off by the chat than the chess match itself. While watching the archives, I'm glad", "Ah I see you guys are also man of culture", "My feelings during the stream:\n1. Happy\n2. Wholesome\n3. Sadness", "\"Everyone talking about the chess game, how bad could it...\"\nMouse over time line\n\"...that...that's not all a single game of chess, right? ...RIGHT?\"", "it do be like that", "That Chess game was the embodiment of suffering for all who watched, unless they have no idea what Chess is, like these two, apparently.", "I bet 99% in the chat know how to play chess lol, at least very basic", "You'd think so, but you never know.", "I didn't know how to play but in that same game I could have played much better than those two", "Nah, I only know how to do a valid move", "I know the basics of movements and some things about the flow of the game, but even with my limited knowledge that match was painful.", "Right when the match just started, the chess enthusiasts were already like \"what was that opening move???\"", "@Zeron Xepher it's still entertaining to watch 2 people fuck around at a casual level in chess but this was beyond painful for anyone who has ever played a single game of chess in their life.", "Can you explain i didn't see the problem, and why they don't eat multiple pieces when they in the same line", "@Huy Hoàng it like Fire emblem but without the anime", "I barely know how to play chess buy I could spot the fact the took could have won the game at the start", "*Kiara can't Chess to save her life*\n\nByleth: *chuckles* I'm in danger!", "\"She's about to make a move...! Save us chat\"", "Fun Fact: Stockfish says that both players made 21 blunders that game!", "Both? As in each for a total of 42?... was... was it all planned?", "That actually seems low compared to what it felt like.", "@masser4555 It does but Amelia was already poised to be fully winning since Move 59. For some reason she didn't know how to do checkmate since she missed it so much. Stockfish doesn't count those as blunders as long as Amelia didn't lose a piece.", "@Cy3qi That's what Lichess's Stockfish analysis said ( https://lichess.org/study/amxhTxVQ )", "@gristCollector even if she lost one of the major pieces in the last like 10 moves, it probably doesn’t count as a blunder. \n\nI’m more surprised (and slightly disappointed) that it didn’t end in stalemate tbh. That would be more entertaining, a final blunder to end things.", "@The one who has a bad name Oh yeah it would've been really hilarious if it ended that way", "yes there was about 800 missed wins", "21 blunders that stockfish can even quantify lol. This is beyond stockfish.", "Chat during chess game: \" STOPPP NO MOVE THE QUE.....NOOOOOOO THE ORTH...AHHHHHHHHHHHHHH\"\n~1hr later\nChat: \"pls make it stop....\"", "I go from cheering ame to just begging Calli to end all my pain", "Kiara: I should dominate you Ame!🤤\nAme: Oh~I didn’t know you were into that...😳\nCalli: Dame Dane~ Dame yo~", "This chess match is one of the best moments in history of Hololive.\nCan't wait for more chess.\nOr even 24 Hours chess tournament arc.", "That chess game was absolutely infuriating, but I would happily drop everything to watch an entire hololive chess tournament.", "They should play 5d chess (yes, it seems to be a thing, its on steam)", "You should see the chess match between Roberu and Izuru from Holostars. It felt like my brain was being turned inside out, but also very amusing.", "24 hour chess MATCH arc", "I'll commit genocide if there will ever be one", "I cannot wait for some chess games.", "@degenerate_SCUM they were so fucking commited to moving their knights", "This was the most scuffed chess game in all of existence but they still managed to keep it entertaining lmao", "I love Kiara and Amelia, but they both deserve a permanent bottom left designation after that chess game. I am going to be forced to drop out of college due to braincell loss. The stream was still entertaining regardless, Kiara and Amelia have good synergy.", "What's bottom left?", "@Blue Gunner During the second hololive EN collab, the girls rated themselves on an intelligence/purity chart. The top of the chart represents purity while the bottom is a lack of purity. The right of the chart represents intelligence while the left is a lack of intelligence. Both Kiara and Amelia have cemented themselves at the bottom of the chart in past streams and the chess game they played pushed them as far left as they can go.", "@Buffed_Puff Lmao. Now I  get it.  So where was the rest of them rated?", "@Blue Gunner https://youtu.be/GQI4yf7ZgHU?t=4035\nHere is a timestamp that takes you to the point where they finish the chart, but the chart may be a bit outdated at this point. They will probably make another one at some point in the future though.", "Results of this stream: Kiara gets forever locked into bottom left. Amelia gets demoted to bottom left. Also both are banned to ever playing chess again for the sake of sanity.", "Today's result:\nThe chat(or the viewers) loses.", "This comment section become a hospital after war,", "Lol the PAIN is everywhere XD", "GMs couldn't play a game this entertaining", "If you didn't get frustrated with the chess match, or you was laughing a lot or you were so relaxed.\nAlso, Amelia really have an incredible luck XD\n\nBut Kiara, you can learn from mistakes! I know you will win in a future rematch", "I was definitely on the laughing end. I don’t know that much about chess other than a few basic rules from watching people play but man seeing the tables turn and Kiara freaking out and Ame laughing evil-ly really made it so much fun HAH", "Can u spot how many blunder they have made? \nIf only i can shut down my poor chess knowledge when i see dis kinda stream.", "All I felt was pain, peko", "All I really know about chess is how each piece moves and that promotion is a thing honestly.\n\nBut that's all you needed to know to feel pajn", "YOU FOOL, I HAVE NO CLUE HOW CHESS WORKS SO I HAVE NO IDEA HOW PAINFUL IT IS", "This was the longest worst/best experience I've ever had", "53:33 An important battle begins that will be set in Hololive history.\n\nTop 5 Battles in the ancient ways with some brilliant minds in command.", "Was there ever a battle where both sides, including the spectators, lost?", "For the first time to make Kiara's stream Timestamp,I will try my best.....\n \n02:15 Start\n02:21 Kicky Ricky", "27:48 Second game:Dots&BOXES\n28:52 Kiara first(blue)\n29:33 Toxic Kiara\n29:55 big bird brain", "53:27  Fifth Game:Chess\n54:10 Kiara first(White)\n54:26 like chocolate....(Ame must be hungry)\n55:03 LOL(need review the Chess rule", "2:06:34 Sixth Game:Matching\n2:07:00  Kiara first\n2:08:15 ez(for Ame\n2:09:41 LOL", "Thanks a bunch for these!!", "Did you camp the comment? XD", "Good work you do here , 🔥👌🏻", "You're the best", "You actually made a timestamp for the chess game. You're my hero.", "Very epik", "u deserve to be on top the comment sec", "I always look for you in the comments lol. Thanks as always", "I love how in your timestamps you also suffer while watching", "The game wasn't telling you it's a draw, because there was a really easy way for Amelia to win the whole time.  A draw would mean you both win/lose. Ame places the rook so it doesn't put the king in check, but places it in lane adjacent to putting the king in check, then let Kiara move king, then Ame places the king in check to force Kiara to move to one side of the board. Continue doing this until Kiara loses.", "POV: Your brain surgeon is a quack and her last patient became her a assistant.", "Daily reminder that being good at chess isn't related to having high intelligence & vice versa. Chess is about logical thinking, memorization, knowledge & experience of the game. The more you study & the more games you play, the better you get, but obviously you don't get smarter.", "Sounds like someone who just lost a game of chess.", "@The Noodle Pincher Go ask any super grand masters if chess is related to intelligence, & all of them will give you the same answer. Even them are suffering from people assuming they are smart & could do anything, & in turn expecting a high result from everything they do.", "@Kyo it does have to do with intelligence because for example memorization is a type of intelligence and how fast your brain can act is a part of your intelligence sure being good at chess doesn't mean your smart and being smart doesn't mean your good at chess but when someone who is smarter plays chess they will definitely have a better starting point then a normal person", "Your chess club had coaches? I feel deprived.", "@folklore19 coaches help so much im sorry that you had to experience the pain of either having no coach or a bad coach", "Did someone get mad & deleted my comment for saying men are better than women in chess at high level? lol. That's just the reality. There are separate championships & titles for women chess for a reason. It has something to do with how different men & women brains are evolved, not their intelligence.", "@Kyo i didnt say it would help you get better i said it gives you a better starting point", "@Septic sorcerer Still no, your starting point would be your basic knowledge & strategy of the game. What kind of starting point would you expect people to have if they don't even know they can promote their pawn, castle their kings, or any kind of openers to get out of the early game safely? Sure it may determine how their first few games gonna play out, but that's completely irrelevant once they put in a week of study.", "@Kyo yes but you just admitted yourself that having higher intelligence does give a better starting point even if its a weak if both people study then it may become a better and better advantage and may even shorten but if they both study then its very likely that the more intelligent one would be ahead for a long time", "I think its largely pattern recognition", "Would have figured that logical thinking is the main thing when it comes to intelligence, including memorization to some point - guess not.", "@Marco Rossi How intelligence is defined is still a big debate. But the simple fact is that the human brain simply get accustomed to what field it is trained in, but those skills hardly translate into other fields at all, so your chess skill will be irrelevant to your academic skill. ", "In order to be great at chess is to lose many and experience suffering and until you learn the right moves to counter every move that your previous challengers did do to defeat you.", "@Kyo basically what u saying is that anyone can be good at chess If they study the game,but inteligence makes It E A S I E R to study the tecs and remember them,so basically inteligent people have advantages over other players :)", "@Felipe Matheus Souza Zuba Sigh... I said intelligence makes it easier to understand & remember that a king is a king, the knight moves in an L shape, & the bishop goes diagonally. But beyond that point, it won't help you any further. Read my last post again, being good at chess doesn't mean being good at math or any other memorization/brain games. There is no chess grandmasters who has exceptionally high IQ, they are just good at what they were trained for. ", "@Kyo sigh....omg,chess is an strategy game,that means It has S T R A T E G I E S,people M E M O R I Z E these S T R A T E G I E S with their I N T E L I G E N C E,therefore inteligent people are better at the game", "@Felipe Matheus Souza Zuba Except memorization isn't the only factor to measure intelligence. That's why being good at chess alone doesn't indicate having higher intelligence, & having higher intelligence doesn't guarantee being good at chess.\n\nAlso typing words in cap won't make your opinion more validated.", "@Kyo you didnt understand yet did you?most inteligent people have a good memory,as you said ,thats one of the factors that make people inteligent,therefore inteligent people are good at chess", "@Kyo i love How in ur original comment you say chess is all about logical thinking complete contradicting what u said before in said comment,this is pretty funny", "@Felipe Matheus Souza Zuba Read my previous posts again... Having good memory of thousands of chess games doesn't mean being able to remember everything else outside of chess. Very few grandmasters can even do that, & they were trained at a young age. Also chess skill doesn't translate to other fields. Being good at chess is an indicator of being good at chess, nothing else. Being an elite scientist is not an indicator of being good at chess.", "@Kyo ok buddy,think this way:two people study chess till they are on the same level of knowledge of the game,one is smart the other is ordinary,who do you think Will win?that would be the smart guy of course,cause he is capable of doing better logical decisions,now apply this to a tournament where everybody knows the rules and strategies,basically the most inteligent guy wins", "@Felipe Matheus Souza Zuba Except that's not how chess work. The opening choices & being white or black alone can already affect your winning chance. Then there's preparation, which is learning every of your opponent's moves, & baits or tricks to deceive each other. Even if both learn the same things, they can not make the same moves on the board. Luck is also an important factor. Even a GM can still lose to an IM. It's not always 50/50 mate.", "@Kyo i like this comment where you bring luck cause It shows How people can get contraditory when trying to defend an theory thats clearly wrong,you literally Just said chess depends on intelligence", "@Felipe Matheus Souza Zuba You have been cherry picking my words for a while now. I clearly stated multiple things that can affect the result, & you picked out 1 thing & pretend like it's the most important factor. Why don't you just go & see a chess database on openings & check the winning chance of each moves, see if it's 50% for every moves then. ", "@Kyo its kinda disappointing to see such ignorance,as i said,luck is luck mate,u cant say the dumb guy is more Lucky than the smarter,also,AS I SAID the smarter guy is way more apt to be prepared,as he thinks more logically than the other guy.You have ran out of arguments bro,you are just contradicting and repeating yourself,Just give up and accept the fact:CHESS DEPENDS ON ONE INTELLIGENCE.Holy fuck are you a wall or something", "@Kyo also If tou think chess is such a simple game It can be decided in 2 moves u are dreadfully wrong,u can Just ask any Grand Emperor on Twitch and they Will clarify this for you", "@Felipe Matheus Souza Zuba I said there are many things that can decide who would win between 2 players of the same skill, & most of them being preparation. As in, which situations did they prepare for that'd actually show up on the board. Some players can simply be a bad match for each other, some are 1 trick ponies, others are jack of all trade & master of none, it depends on their playstyles. That's why your made up situation where both players memorized the same thing & prepared the same materials would never happen irl to begin with.", "@Kyo well If you dont wanna listen to me theres nothing i can do about It,have a good day mr.close minded", "Im only joking bruh.", "I didn’t read a lot of this but great chess players on average are really not much smarter, or at least as smart as people make them out to be. They’re great chess players, not world renowned physicists. Keep in mind there are tens of thousands of high level chess players; over 1,000 GM’s you wouldn’t guess were particularly “smart” to just by talking with them. There are certain things that may come to great chess players easier than others but that really goes for developing any talent, not just chess.", "@Kyo Dude relax you sound like a redditor talking to himself in a mirror. It's just a game...", "Kiara: \"I was in chess club\"\nlater\nAmelia \"What happens if you get a pawn to the end?\"\ngets pawn to end", "I thought the stories i heard about this chess game were an exaggeration. They were not, and by god.\n\nBy god.", "Thank you for the chess stream..\n\nIt may have been painful, but I honestly couldn't stop smiling lmao\nRest well you two!", "that chess game took over an hour, when their final matching cards game took 3 minutes", "Amelia was sleepy that’s my defense", "I've been hearing a lot about this legendary Chess game, but nothing could have prepared me for all the pain and insanity I endured. Is this what it feels like to be in the presence of The Ancient Ones?\n\nSuffering starts at 53:13...", "that was the most suffering entertaining braincell losing chess game I've ever watched.\nI love both these girls, but I have to visit an certain Tako Priestess for an sanity check.", "I bet she would crush these two on a 2v1 chess match too", "The chess game felt like watching Suzumiya's Endless Eight all over again. Jesus Christ.", "I rather watch that 8 episode again then to watch this for more then 1 time.", "You beat me to it, last time I felt the same was watching endless eight.", "1:48:43 Never gonna give you up\n1:53:08 villager noises", "Man, the chat is just suffering when the chess game. Lol😂😂😂", "Honestly, they deserve it", "I feel like I lost something in that chess game but I can't pinpoint what it is anymore...", "Everything.", "Innocence?", "Your Sanity", "All that's left is pain", "Kiara: \"I hope this shows I'm bottom right\"\n\nAlso Kiara: \"My mind is Blank\"", "Whatever you do, DON'T WATCH THE CHESS GAME!!!\n\nIt only brings insanity....", "But but.. that's almost the entire stream!", "@Mr Smiles It's a sacrifice one must take, some things are better not known.....", "this brings more insanity than the infinite 8......", "WATCH IT! it can awaken your inner M.", "too late bro.. my brain has committed sudoku", "Support group: chess watchalong veterans\nU are not allone", "lost my last braincells watching the chess game \n\n10/10 would wanna watch again", "\"Anyways I used to be in the chess club.  The tower moves in a straight line, right?\"", "That Chess game is like watching your teamate in Valorant in 1v1 clutch situation, where they're both spraying but no one's hitting any shot until they used up all their ammos. Then they start knifing.\n\nOr in Fire Emblem where both sides keep missing their attacks, and the few ones that hit only does 1 damage.", "Corona is the most painful thing in 2020 ", "If Hikaru Nakamura reacts to their chess game then I'm scared. Rabbit hole can swallow him.", "I thought Ina lore-wise made people lose sanity until I saw this chess match.", "If there's any silver lining to the suffering we have witnessed in that chess game, it'd be the new expressions Amelia showed us at the beginning of the stream until she realized it and changed it", "Kiara only has a king how is there tEN MORE MINUTES OF CHESS?!?!", "The chess game hurt me physically.", "Ame: How to even corner a king with a queen and a rook", "Blackrunestol 😭", "They're taking 5 minutes per move and the only rationale to them is \"occupy a space that isn't occupied\"", "Bunch of chess neckbeards in the comments.", "Not gonna lie, I pretty much enjoy the chess game much more than I expected. First Kiara stream I watched and this earned her a subscriber. Keep doing your best Kiara and Ame~", "I liked it a lot too, they made it funny and have good chemistry. So many people being overdramatic in the comments.", "@tootiredforthis1 okay but the second half of the chess game was just kiara running around and ame not knowing how to check her", "@tootiredforthis1 i think they just kinda of having fun too, cuz when they are playing chess the view actually increased", "@Su Su makes you wonder how many people are unconsciously m or enjoys the suffering", "@Canary omg never thought of it this way", "This collab IS MY FAV OF ALL cause of that chess match PLZ DO A HOLOLIVE CHESS TOURNAMENT", "Just make it fast blitz Chess plz...", "They'll have to name it HOLOCHAMPS and have Hikaru Nakamura coach them. They gotta play against Izuru and Roberu lmao", "@Browking oh god the pain. i can feel it already.", "Didn’t expect to see ame be “angry” at the start.", "Time travellers saw the future chess match and couldn't contain it.", "As someone who plays chess fairly well there match was truly agonizing", "53:06 \"Chess?!?!?\"\n\nThis is it. This is where it all began many years ago...", "Another great stream today KIKIRI-KIARA.... Pachi pachi pachi pachi.... Now if you will excuse me I am gonna burn my Chess-Board because I don't want to look at it for a long time... ⬇️⬇️⬇️", "Lol 😂", "After watching this, I would rather play with an ouija board than with a chess board", "I don't even know what is chess anymore after the stream 😔", "despite everybody feels pain,  I think chess is funniest. this normal for the beginner who against each other.", "This stream made me realize that watching someone else play chess is the most anxiety-inducing thing in the world\n\nEDIT: Just finished watching the rest of the match and oh man. The amount of times both of them threw away winning moves is impressive. Honestly, even though Ame won, I think we can all agree that she needs to join Kiara in the bottom left.", "i will never forget that game of chess", "39:40 - You're welcome. Sorry, Calli.", "Thanks, comrade", "We just kidding when commented. Dont take it seriously, although slighly salt  but stream is still fun. Good job 🤘\n\n*sorry for my broken english", "Best kind of pain I've had in a while, thanks Kiara and Ame! Have enough rest Ame or else the chess suffering will emerge", "This bird literally had checkmate five times & never made the single move towards it... I luv this bird", "The highlight of the stream : Chess ♟️", "Chess game:\nTop 10 anime fights. 10 outta 10. Definitely would watch again.", "Please give my braincells back by doing a chess rematch of the highest level!", "10 minutes: \"Ah, white really botched gaining a queen in that discovered check. Well I guess it's not so easy if you're not familiar with the game\"\n20 minutes: \"Oh no, oh no, my soul is leaving my body\"", "Amelia so big brain she managed to keep the chess game at a tie the whole match until the end.", "Start of Stream : Yessss, a stream of the 2 biggest crackheads of HoloEn, this should be really fun!\n\nEnd of stream : Life is an endless cycle of suffering and pain. We are powerless as we slowly await the inevitable doom of time.", "Just don't backseat, nobody cares how good you are. We just care about watching the streamers.", "its impossible NOT to backseat that chess match. the risk of dying was real. by then end of it my SAN point was literally at -10", "I've heard that there was a chess match  * looks at a preview * Oh god... EDIT: I've seen 5 minutes - OH GOOOOOOD.... I've watched it.. I'm empty...", "Well today I learned that checkers goes by a different name.\n\nAlso the rule about if you can jump, you have to jump, is dumb. I never played Checkers in my life with that rule. I always played where jumping over another piece is a choice and not an obligation.", "Yeah that rule is pretty annoying because it takes the choice away from the player, but it's supposed to help with game balance.", "That was fun and wholesome, I can't wait for more chess games in the future.", "Chess match was the greatest battle of wits of this century. I wish GM Kiara (elo 3000) the best of luck in the rematch.", "53:32 Battle of the bottom left where the only looser is the chat.", "Everyone talking about how painful the chess game was, I’m here ripping my hair out over mancala, did Ame even watch the tutorial?\n\nOkay yeah the chess was absolutely atrocious too", "I guess I now understand what it's like to watch two players who don't know how to play chess play chess.\n\nExtreme pain.", "oh my god that chess game hurt my soul", "my last two brain cells during that chess match:\n\nAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA", "I’ll give it to Amelia, figuring out how to checkmate your opponent can be really hard if you’ve never done it before, that’s why most beginner matches (if played following the rule that you can’t put your king in danger) end in draws, if they can’t resign.", "50:05 \"I'm not salty\" Amelia lied as naturally as she breathed", "\"It might be a sign of a serious illness but I'm fine\" - Ame", "Me seeing the potential forks and pins and what not.", "this is really \"Game of Throws\", bruh I really lmao when kiara get the queen and inmediatly lost it", "What a great chess game. I would love to see a Hololive Chess tourney lmao. It would be so insane.", "I expect Lion or Princess to came out on top", "1:35:57\n\nKiara: This should be ending soon...\n(No one realized that the suffering has just only begun)", "At first \"haha pawn go brr\" then later completely lost all of my brain cells\n\nEdit: Amelia didnt choose queen. Oh my god. Such a chaotic game lmao", "Isn't it amazing that like half of us both watch vtubers and a chess grandmaster Hikaru?", "Someone in chat said \"Don't do it Hikaru, you have so much to live for\"", "The chest game was fun and hilarious and very painful to watch", "I wonder how much of this was Ame punishing the chat for bad behavior in the Minecraft stream. And in general.", "Wait what did her chat do?", "@Papabootleg ame and gura kinda stream at the same time. Chat became disrespectful and break rule 4. Also excessive backseat gaming", "Title: \"[AMExKIARA COLLAB]\"\nTakaMori fans: pain", "Any person who has played chess before: PAIN.", "Kiara: So the queen can go... anywhere\nAme:yes, she can do the knight, bishop,... yeah\n\nYes, calm before the storm", "The chess game was incredibly frustrating....\n\n10/10 would gladly suffer again", "53:00 is when the Chess experience begins. I’m currently catching up, though I did get to see a good bit of the finale of the Chess game, I am leaving this time stamp here for others who wish to be tormented.", "My profile represent my emotions when I'm watching the chess game.", "1:43:12 this is my favorite part Lmao", "Now this is what i call torture.If you can watch the chess game fully without suffering ,man you have the strongest mental strength.", "Okay so, I hadn’t had the time to see the legendary chess game until now. Good lord is it a mess of mythic proportions. No pawn walls, no center control, unguarded pieces everywhere.", "I want a T-shirt that says: \"I survived the Kiara & Watson chess game\"", "Me at 1:51:01: \"There's no way Ame could possibly lose this now....\"\nMe at 1:51:27: \"Well except for that move\"\n\nIt's almost like Ame was showing off decent moves before intentionally making bad moves she made, like how she considered a possible safe check at ", "38:20 Kiara speaking fluent french everybody! Merci Beaucoup!", "did yaago find these girls from kindergarden or something", "That was the most epic chess match in the history of chess.", "Watching takamelia play this game to settle a score and yet the biggest loser was not kiara or amelia, but chat watching that painful hour of chess. Blessed.", "What did Kiara do when she was losing in chess? She took the knight off. Also wanted to make: \"Why is the British Detective so good at chess? Because the queen never dies\" joke but Amelia´s Queen died like instantly... but hey she returned to her Harem. Thanks this was chaotically funny, as expected of the Bottom Middle Duo", "Oh I sorry for not responding fast was watching doggo sip", "@Taylor NP Hope you can hold your cup with a few yubi´s less Slurp", "@Casual Filth It does hurt a bit but it's all worth it Sip", "@Taylor are you sipping a drink, or are you slurping the yubi's???", "@Zeron Xepher Both are fine Sip", "Where is the the Bottom Middle, Bottom Left refs from? Did one of the Hololive girls Rank the EN girls?", "@Jeffrey Bogard Hey Jeffrey, its from one of the  full group collab streams, there was a graph where top was being a pure Idol, bottom being lewd iirc, right being smart and left being dumb. So bottom left for example means lewd dumb, they positioned themselves where they think they are character-wise. Don´t remember which coleb it was I think it was Kiara´s .", "@Casual Filth Well you narrowed it down enough. Thank you 👌", "I went through a roller coaster of emotions watching the chess game xD", "\"When does this rule exist\"\nBruh", "This was a fun stream, even the chest part", "This is the sequel to Uno: The movie", "53:34: \"Now this will show for real who is smart and who is not.\"\nSpoilers: It only shows who was not. It was both of them.\n53:51: \"I think we both know the rules, right?\"\nSpoilers: Neither of them know the rules.", "I think i pulled enough hairs for months, saved me hair salon trips", "Lol were they both trying to make the other win?\nAme picking rook instead of queens\nKiara letting herself get pinned and refusing to eat", "This blessing stream made me a person , who feel refreshed whenever the chat gets piss off , full of satisfied", "30:46\nat least in the states I've heard the phrase \"ears burning\" \nmore like in the past tense, saying it to some one right after you may have been talking about them.\n\"were your ears burning?\"", "I’ve never seen a video that took as many years off my life as this one", "If you guys do play chess again, you should try to pull off \"en passant\" with a pawn to really wow the chat", "50:28 memories of Vinesauce... almost forgot where I knew that song from.", "queen and rook vs king should've been an instant win ame why XD\ngosh what a game haha y'all crazy", "This going down as one of those streams that go back to after months when my depression hits. Just by the Chess match lmao.", "Pekora: pardun?\nKiara: Excuse moi?\n\n Its is escalating", "I want it to escalate faster", "ngl it's the very first time in my whole life I've watched a full chess game from start to end", "Lelouch suffered mild PTSD from that match", "I feel like that moistcr1tikal\n can defeat them  while blindfolded.", "That \"I'll do what I want!!!\" from Amelia at the end of the stream felt so relatable", "42:40 \"I'm rising like a phenix!\"", "For some reason the thumbnail makes me think of mother(Takanashi) and daughter(Watson) having fun", "Kiara: when we were flexing our po-pu-pets. I see what she was trying to say.", "Though in a completely winning position, black still took a couple dozen moves to checkmate white. Having watched matches of AlphaZero versus Stockfish. This was A Perfect Endgame.", "As a chess enthusiast I'm crying\nWhy im feel so tired?...\nREMATCH WHEN!?", "53:04 The beginning of suffering\n\nAlso, apparently Calli was in the chat but I don't have a timestap for that.", "the chess match took 1 hour 10 minutes and 54 seconds", "I haven't watched the match, but seeing everyone else suffer is pretty great.", "*Tien watches this chess match*\n*6 minutes later*\n\"Grrr.... I CAN'T TAKE THIS ANYMORE!!!!\"", "me thinking of strategic moves in chess and thinking how this will end\n\nMe while watching them: BRUUUHHH", "Good job Kusotori, you've somehow managed to bring down Hololive's #1 Detective to Bottom Left", "\"Hey, you. You're finally awake. You were trying to cross the border, right? Walked right into that Imperial ambush, same as us, and that thief over there.\"\n\n\"Damn you Stormcloaks. Skyrim was fine until you came along. Empire was nice and lazy. If they hadn't been looking for you, I could've stolen that horse and been half way to Hammerfell. You there. You and me -- we should be here. It's these Stormcloaks the Empire wants.\"", "Legendary chess game ever.", "2:30 Time to kick ass and chew chicken, and I'm all out of chicken\n2:57 Curious case of time-travelling WATson\n8:28  Re:Start\n10:10 Jokes so cursed, the game committed die", "I love them both but, the two of them are Bottom left↙↙", "the chess game was so frustrating lmao", "I'm so glad that I was here to witness this historic chess match live.", "Kiara: I'm big bird brain\nMe: But you're still bird brain.", "The end of that ches match was the most painful thing I have ever witnessed XD Neither can think one move ahead. aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "Kiara’s reaction was adorable when she lost her brand new queen.", "The chess match is amazing, I would love to see them play and learn more if they wanted xD", "1:16:10 speed up 2x if you want to hear some phoenix crowing", "Kiara : Chess?\nChat : Chess hype!!\n\nThey didn't know what gonna hit em", "Massive sanity check fail after Ame x Kiara chess game\n\nIna : All according to keikaku", "Epic chess match 10/10 🥴🥴🥴 ", "I love how everyone in the comment section is a chess competitor..", "bruh you can't even call this chess, this is just senseless butchery\n\nEDIT: it just keeps getting worse", "You guys see chess, what I see is that they're still on the checkers game but with chess pieces LOL", "Timestamps\nGames:\n18:58 Mancala\n27:41 Dots and Boxes", "3-1 for chicken. Or 10-4 if count as points.", "Thanks wey", "I couldn't watch it full but when I turned it on and saw a bit of their chess play, I turned it off", "Nah i feel like ame plays average chess i can feel it at the end shes just  s  i guess?", "54:00\n\nStockfish vs AlphaZero", "I am conflicted. On one hand, this makes me want to see a hololive chess tournament. But i dont think we could survive.", "That chess match was ten times more painful than Gura's Minecraft stream", "I love the chess game but damn that was a loooong game.\nI'm glad I seeing this in the archive.", "I never knew that chess could actually hurt my brain to this extent. I'd certainly watch another game, but I think these girls turned me into an M", "may be one of the EN members will try out genshin impact, its compareable to breath of the wild, f2p and gacha tho :X but a really great game and adicting", "I should've stopped at first few minutes of chess, especially after reading the comments, but I ended up watching till the end and suffering now.", "the amount of free real-estate given up was amazing. 10/10 would suffer again.", "Im losing my mind watching this seeing missed opportunities", "I don't know much about chess but seeing the live chat suffer during that looooooooong game was hilarious", "That was the most painful stream I've ever watched. I wanted to punch a hole through my TV. Ame is now lower left corner with Kiara after this.", "I can't believe what I just watched... masochists must love this stuff... why, God...?", "This chess match is literally giving me an aneurysm.", "Omg i was screaming half the chess match. At the end i was so mad i couldnt even speak it was just my blood pressure raising steadily. 😀💢", "Watched to the end.  I laughed.  I cried.  Truly this is what comes to mind when you hear the word \"Blursed\".", "@10:36\ni can hear a \"eh?\"\n...was that calli? lmao", "♟Lobbying for Hololive international TIMED chess tournament♟\nOkayu would win by timeout every match, but I wanna watch anyways.", "That feeling when you're at 1:36:00, and somehow there's still 30 more minutes to go :)", "1:14:06 She literally completely threw away the easiest checkmate I have ever seen in my life and it makes me so frustrated.", "This chest match made Haachama's cooking videos even more bearable to watch with my hair still intact.", "Kiara and Ame on chess: Doesn't know what to do on chess\n\nThe whole Chat: \"Existence is pain\"\n\"I have a question... For god... WHY!!!!\" Goes Full Suicidal Mode", "HAHAHAHAHA THIS WAS AMAZING. Glad I watch it live.", "me: open my laptop\n: streamed 1 minute ago", "I’m so glad I don’t know a single thing about chess", "This was the most painful game of chess I've ever witnessed", "\"Gesundheit everyone, see you tomorrow!\"", "That chess match was extra painful... where do I get more?", "what i thought would be paradise was instead HELL\nlmfao omg <3", "Finally watched the stream. This was entertainingly painful. But in a good way.", "I lost more brain cells at the chess game more than my math modules", "In Agadmator voice : and it is as of move three that we are in an entirely new position.", "As an archive viewer, I have to say that this was very entertaining to watch. Seeing a 1 hour chess gameplay of a detective and a chicken with a dying chat is a 10/10 god tier content", "43:50 0_0 omg Amelia knows about dofus i want to know more!", "8:16 oh god frowning amelia is kind of cursed", "Just watched the archive and boy oh boy I don't know how my last remaining brain cell managed to last the whole stream. \n\nThough, watching chat lose their mind was the only thing keeping me sane.", "I was gonna go into a peaceful sleep after the stream, but that chess game... it changed me....", "Didn't know amateur chess can be a form of torture. But really I want to see a chess tournament holo live.", "Each time i thought we hit bottom-left despair, we keep going further", "That was by far the most tactical game of chess I’ve ever witnessed 🧠", "I really hope you play chess again! I haven't experienced this much delicious pain ever since my finger got pulled into the meat grinder~", "I pulled so much of my hair watching this to the point that I won't need a hairdresser anymore", "Pain Peko\n\nAlso at 53:40 'Incoming 1 hour chess match' in chat", "This is one of the most painful experiences I have ever gone through. Please do it again.", "THANK YOU SO MUCH FOR THE STREAM TENCHOU!!!! Was really having a bad day during work. This stream made me laugh so hard that I forgot to work and now I'm.... anyways. ", "that was the most painful chess match i think i've ever seen", "I actually have and play this game, nice to see chicken kiara and DETEKTIVE Watson Amelia playin it, both u should get 1 mil subs 🐔", "Thats very cute at the end of the stream(2:12:50), i kept looping it as a painkiller", "Ok, I've heard this is hard to watch, but I think I've mentally prepared myself for pain", "I'm rewatching this for some reasons.\nThe pain is still here.\nHelp", "There clearly was a moment when Kiara threw away her advantage in the chess game. True bird move.", "Sometimes when Kiara laughs it sounds like Pekora and all the sudden I have ptsd", "The most legendary chess match of all time bringing all of chat to tears.", "It was a very fun stream! I've lost some brain cells in their chess game xD", "38:20 \"Merci beaucoup, voulez-vous coucher avec moi ce soir ?\" Takamori!!", "I was handling the chess game well until amelia started trying to go for the checkmate... Also the benjamin finegold superchat had me dying", "The last time I watched something a painful as this chess game was when I watched one man one jar", "What I've learned is KFP is actually a front for the KPA: Kiara Pheonix Army-", "Omg I cant believe they played 1hr of chess HHAHAHAHAHAHAA Finallyyyyy I lost brain cells hhahahaa still funny tho", "I thought izuru vs roberu chess stream has made me suffer enough,until i watch this lol", "The chess game has me screaming at the screen.", "Me: Take her knight.  TAKE HER KNIGHT!", "1:14:25\n\nThat move hurts... ", "I want to see penguinz0 react to that chess match.", "Since you guys enjoyed this so much, I asked on her last stream if she would agree to a rematch. She said yes, you guys are welcome! <3", "2:05:00 is when the pain ends", "I don’t know what hurt more, Kiara not taking advantage of great opportunities or Amelia just straight up throwing.", "That chess game should be a new kind of torture lol. But It was a great stream and I had a blast.", "1:17:49\nBroke: Bishop\nWoke: ＤＩＡＧＯＮＡＬ ＢＯＹ", "Ame is a true gamer\nAlways blame lag when at a disadvantage!", "Time for us late birds to watch the archive", "Hahaha , all the best 😂♟️", "My condolences to your brain cells my dude. We early birds will never get them back...", "My brain cells are gone , reduce to atom", "Save yourself while you still can", "54:04 this is what you came for. Take out your brain before watching.", "That chess match was so painful to watch and I love it", "2:02:11\nAme's King Piece-> You're approaching me?\nKiara's King Piece-> I can't end my suffering without getting closer.\n 😂", "1:49:30 Mercy, Sadism, or Incompetence? You decide.\n\nEdit: due to later comments made by ame she does not know what checkmate is", "This chess battle was legendary XD", "43:50 I wonder what class she played in Dofus", "I can't wait for Coco to cover the chess game on Asacoco News.", "I will sit here and watch every last god dammned second of this video stream", "I wanted to already leave when I saw the c2 pawn move to c3", "54:07 for the chess match of the century.", "32:30 get it checked Ameeee!", "Enjoyed the stream kiara and ame. I enjoyed the pain of watching chess haha. Hopefully we see more in the future, and maybe a rematch after learning a bit", "Please do more chess games, that was some of the most fun I've had", "It was intense and fun :)", "Indeed 😂", "I feel pain, but actually kind of liked it. Well I guess it’s obvious since P in KFP is for pain.", "48:10 shoulve been a comeback if she moved the other peace.... defective brain vs chicken brain, chicken brain wins", "This is it chief. That chess match is pure masochism and i loved every damn second of it. Never thought i would get second hand exhaustation seeing a CHESS game.", "Someone send that fugging chess match to a GM!", "This should go down in history as the chess game that made everyone lose their brain cells", "This match felt more like who wanted more to give away the match. Kiara did a great job 😅", "30:48 In America we have a few of these, too. I've heard it as if your ear burns then someone is talking about you. Another one I used to hear was if your palm itches then it means you'll get money soon.", "\"Ame is in control\" contemplating possible checkmate 1:49:30 and decides to let everyone suffer longer (Kiara's king wouldn't be able to take Ame's queen, since it would be her in check with the knight and Ame's queen would block all of the king's escape routes)", "That chess match made me develop a pair extra of chromosomes", "Ame's angry expression from 8:15 to 16:05 is something I never knew I needed.", "Kiara and Amelia is happily playing \nWhile chat is malding\n\nThis is great", "1:31:42 an actual good move, pog", "I fear no man\nbut that Chess match...", "Dang it i missed the second part\n\nNvm its the same as last night", "Hmm so \"Warcaby\" is \"Draughts\"/\"Checkers\" in English.\nI was recently wandering how this game was called in English.", "I don't know a single person who calls it draughts", "Just leave here timestamp for Chess Match\n53:06", "Sometimes I swear that I could put a \"peko peko\" after Kiara's lines and guess who her teacher was.", "She said she smelled like fry chicken , I was dead. 😂😂", "start of video; oh this is nice \ngets to chess game; ooh a game of chess between these two, nice!\n...\nmy brain is in pain watching these moves", "11:23 That is right, JOOSTEEN BEAVER. Man up! Play Minecraft at 3 AM with a Homie. No. I am not your Homie, JOOSTEEN.", "I've heard how painful this stream was. I'm just curious to see how much of a dumpster fire it is.", "I regret everything.", "54:02 Enjoy the suffering!", "no more chess please 😭BOTTOM LEFT DUO ↙", "The chess match remind me of RuberuVsIzuru. but on a whole another level. ", "1:49:26\nThe moment when Amelia wanted Kiara to suffer a little bit more. Lmfao.", "That chess match awakened my inner M", "Thank you for the stream, Kiara and Amelia!", "F for Kiara's queen And", "I'm sorry ame but I have to dislike I literally at the doctors now because the headache I got from watching the chess match hasn't gone away since I watched the video 5 hours ago", "This match inspired me to play chess now", "My mind was blowned up with these checkers. Damn, in our russian \"shashki\" you can eat backwards and kings can move for multiple squares at a turn.", "53:06 it was at this moment that chat's fate was decided.", "Well after that chess match, we have 2 bottom lefts.", "The amount of plot twist makes the chess game not so painful to watch", "53:05 Chess 🤔", "That chess match drain my soul", "A wise man once said that a true detective never asks how to checkmate someone in chess", "2020 in a nutshell: Kiara vs Amelia in Chess", "Ame has evolved eating sand to eating glass", "39:40 you're welcome", "First impression of any texture that is brown in color, first thing that comes into Ame's mind is food/dessert", "I don't know if I should laugh, cry, or do both after seeing the chess game", "1:16:08 KIARA WAS 1 SQUARE OFF CHECKMATE DANG IT! Luck 1000, Int 5 lmao", "I'm already in pain and it's only the first check... I thought Ame planned that.", "I am havin flashbacks to Winning Son's game of chess", "The real bottom left was the friends we made along the way", "53:33 Battle of the ages.", "I stopped halfway it's too painful for me to watch.", "i counted 45 moves after the pawn. So close to the 50 move draw. So sad it didn't happen.", "ame has played mancala but doesn't know any of the rules lol", "i really hope i just miss that knight and quenn part", "As someone who has played a lot of chess, that game of chess was a real pain to watch. lmao.", "Damn I cant believe ame became a bottom left along with kiara after this stream", "40:05 Ame a harry potter fan confirmed", "I came here from intercontinental ballistic missile chess strategy", "You're both Bottom Left in my heart 🙃", "I missed it by 9 damn minutes.", "チェスのときのコメ欄で爆笑wwwwww", "every chess master:I guess ill die.", "I like how Ame had angy face for the first ~16 minutes", "38:20\nS'il te plaît ne dis plus jamais ça\n\nEng : please don't say that any more", "The controller's vibration arouses me\n-Takanashi Kiara", "this game caused me excruciating pain", "1 hour chess stream.Yeah, Fire emblem channel now", "We need more board games lmao", "Hold up, did Ame actually wake up on time? Our girl is growing up uwu", "HIKARU HAS TO REACT TO THIS", "At 26:17, it was actually possible to get 5 turns\nturn 1 move the 1st marble into goal\nturn 2 move the 3rd marble into goal\nturn 3 move the 1st marble into goal", "1:13:24 love triangle lol", "I would actually watch them play chess again, chat was funny", "1:07:27 There goes a natural instance of Bird language.", "That Chess Match was both frustrating and entertaining to watch. It was like watching 2 Pekoras battle it out. Or 2 Aquas. Including the smugness.", "Bruuh the most painful chess match I saw\nHoly", "All chat had to say was \"Move Queen up\"", "They've been playing chess for over an hour now....kamisama nande", "The closest thing I can think of about that hiccups and someone thinking about you is that I have heard if your nose itches, then someone is talking about you.", "2:03:20 this was the moment I lost it", "The end of the chess was pure suffering, but everything else was very fun! Kiara and Ame are my the best!", "I was the one that said say yeet", "What happened in this stream?\n\nLaughter \nPain", "Oh no no no my dear Phoenix. A Hololive Chess Tourney would definitely be a banger of a spectacle. Especially if it's blitz.", "Day 2 of commenting on kiaras vods to help her with the yt algorithm", "Watching Kiara not take the knight at at 1:16:05 was just too painful.\n\nAt 1:19:08, Amelia should have taken the knight with the bishop.  Kiara couldn’t retaliate because that would put herself in check.", "Someone in the live chat said it, but this match was definitely a GAME OF THROWS", "They played chess for 1 hour and the stream was 2 hours. Bruhhhh", "53:05 That's Hell you're walking into\n2:05:00 The Salvation", "I overslept and I’m late to the memes nooo", "before this I always kind of wanted to watch some of the hololive girls play chess. now that I have I regret being born", "Agadmator must record their chess match lol", "Kiara has found a worthy opponent... Their battle will be legendarily damaging my brain", "they are both bottom left, huh XD", "Came back to this stream for angry ame, got to watch the painful chess game again. Worth it.", "as a chess player, i feel violated", "Bottom left, always has been", "Before stream: There will be Bottom Left and Bottom Right. Stream is gonna be very lewd.\nAfter stream: Ah, I see. Watson with her cape. So it was \"genius\" stream, after all.\n\nDamn, I wished it to be more NTR.", "ok watching the chess game waaaaas painfull... but theyre very lovely characters.", "I had to take a couple of breaks while watching the chess match. oof", "I cannot wait for the next chess rematch", "1:43:26 that last NOOOOOOO from kiara was just hilarious", "39:41 - SEISOU moment!", "And here I thought xQc getting checkmated in 6 moves was peak internet chess, but here we are. Sasuga tenchou.", "Lololololol Bird Brain vs Big Brain. That was WILD! 🧡💛", "Kiara you liar there wasn't any strip poker >:[", "Chess game starts at 53:40", "53:16 Guys Chess club. You know who else was in the Chess Club. Todd Howard. Todd Howard's daughter confirmed lol", "yes, I was in the chess club", "Reads all the comments about the chess match \n\nSurely it can't be that bad.", "After watching this video, I fully agree with the Bottom Middle Assessment", "God I wish I didn’t know how to play chess", "Chess: The Movie", "Am I blind or the chess game lasted an hour? lmao", "Thing is wonderful until I realize Ame have no idea for the checkmate", "I need Agadmator to commentate this chess match and my life will be complete.", "amea be developing her rook first lmao", "チェス一試合に1時間以上かかってて草", "Never let these girls play chess ever again or else it will become an addiction of mine.", "1:13:31  I need everyone to freeze-frame right here.  This, dear viewer, is where Kiara was 1 move from checkmate.\nAll she had to do was move the forward-most white pawn, and she'd have won.\nBlack king would have been unable to move forward (take the pawn) b/c then the knight would get it; can't move left or right, b/c then the pawn would get it; and can't go diagonal, b/c it's blocked on one side and the other side has a queen poised to capture it with a diagonal attack.", "Watching ame throw away checkmate like 5 times....", "The great thing about watching novices play chess is that it is absolute chaos, the frustrating thing is if you play chess seriously it gets a little difficult to not scream out all the things you see the players missing after a while.", "1:15:57 at this point just shoot me down lads", "boys , i'm going to watch it , wish me luck", "Well im off to rewatch the SM64 stream", "That proves watson have big brain boia xD", "This is so cute and devastating", "Sooo  the thumbnail \"AMELIA X KIARA\" ;-;", "8:22 angry Ame = best Ame", "1:14:04 I saw checkmate (I think)", "As someone who knows how mancala works watching them was certainly entertaining", "today's episode of the epic bottom left duo battle with chess", "I LOVE AME'S STORIES", "38:21 Kiara tried to sing Lady Marmalade by Christina Aguilera.", "Now. When I started this, I didn't have the slightest idea on how to play chess. After watching Amelia and Kiara, I now have a beginners level education of chess. At least I learnt something here today lmao", "Bottom left, sorry~\n... Both of you~", "Pain for Kiara!\nPain for Ame!\nPain for chat!\nPain for everyone!  :D", "2:12:40 you're one to talk", "Can't wait for chess rematch", "Watching the chess match is like playing getting over it. It will be worth it when you watch through to the end", "Watching this live must have been painful", "Eventually, everyone stopped thinking", "Even Cthulhu would have failed sanity check from watching that chess match", "54:00 chess start", "that chess game was so painful that no one even remember about Ame's angry face", "This was a very entertaining stream for me to watch", "Chess Stream In A Nutshell:\nPain Peko", "Iconic chess game. Lmao", "That chess game was so much fun. Even if they never play it again due to the oncoming Acute Stress Disorder, followed by PTSD, the suffering wasn’t completely in vain.", "this stream will play endlessly in hell", "Hi, can some chess whiz timestamp all the times the game was a single move from checkmate? I'm hurting.", "I thought you lot were exaggerating but hoooooo boi\nI ain't gonna rewatch this again, it was fun but painful", "55:08 prepare yourself", "Still waiting for that strip poker game!", "Kiara's laugh and Ame's hics are beautiful", "i seethed so hard", "2:01:32 LOL. Poor Kiara 😂", "I think I lost my will to live thanks to that chess match ", "1:15:52 Botez Gambit accepted", "Bottom left forever :)", "The chess is uh, it is certainly something to say the least", "everyone malding hardcore about the chess match, while im here like i dont understand chess and watching them go balistic", "2:12:30 This exchange was pretty good", "I came here because they said the chess game was AWFULLY PAINFUL\nThen there I was... literally laughing out loud\n\nGlad they had fun.", "To win is not to play. That didn’t went well on my end", "This is painful ;-; to watch", "This hurts to watch but it's too funny at the same time...", "Top quality content.", "As a chess player I just felt mentally raped xD", "the checkers match killed me how much more the chess match... I'm not ready for this.", "Hololive Chess tournament arc when?!", "Birb brain vs defective detective is one of the best yet most torturous things that I have watched", "Even though the chess game was a pain, most of viewers still hung around. The number of viewers barely changed until the end. Are we masochists?", "Ame's dream telling is next level...", "I have watched the Kiara vs Amelia chess match.\n\nI can now say I know true pain.", "Chess rematch when?", "Chess rematch when?", "omg, i took a nap thinking i wasn't gonna miss this, but i did. i got here 1min it ended.", "BRO I JUST GOT A KFC AD LMAOOO", "10:00 even Amelia said what", "1:12:00 Surrealism chess play", "Kiara will always be top right in my book. ", "In here for all these 0 IQ plays", "Heh.. Ame sure does have experience with BoTW.", "Did really no one see Ame blink in 1:47:25? Ame is playing Kiara the whole time lol.", "The chess match massacred far more brain cells than Bakaqua’s BGM alone", "Lmao the chat going insane", "1:13:46 Kiara couldve won at this moment", "I have experienced ALL of the 5 stages of grief in this one video... ", "Chess match starts at 54:00", "Kiara... and A-A-Amelia.... Heaven. It does exist...☺💀", "It may be a draw for them, but everyone lost today. 😂😐😔", "there is no bottom alliance, there is \"bottom left but mostly left alliance\"", "The pain stream", "There was a point in the chess game that the fun just turned into suffering w. I felt like I lost a chunk of my lifespan...", "I can see light.", "Let's wait for GMHikaru to review this", "I have never yelled at a screen more than in this chess match...", "Not gonna lie that chess game broke me I barely type in chat on the streams but I was baffled beyond belief my inner gamer rage surfaced and said some pretty bad comments came back to archive to apologize for my behavior next time I rage I'll try to refrain from venting it in chat sorry about that Kiara and Amelia.", "I unironically felt like I have to take some paracetamol after that chess match, my head hurts from laughing and also that 100 elo game. Still fun though", "When it's the King alone, you don't have to check the king to give a checkmate. Check is used so the enemy must move the king since the king cannot be left in check nor can it move into check, but when it's the king alone, only the king can move anyway. Checkmate is when the king must move but every move would move it into a check. So when it's the king alone, if you cut off every escape route, you win even without giving it a check since it must move into a check. You can do this with just the queen alone by cornering the king, which ame had set up way earlier.", "To quote amelia i feel that i lost 5 years of my life", "Now you know True Pain.", "Did I just seriously watch a 2 hour long chess match? My brain is now mush.", "SOMEONE GET JUSTIN BEIBER ON THE PHONE, TIME FOR A COLLAB", "I just realized if you combineアメリア + キアラ (amelia + kiara) you get アメリキア (amerikia)", "I never want to see chess ever again", "I get it now.", "I think I lost 30 years of my life....", "1:16:20 \n\nKiara. \nStill bottom left", "53:06 Chess match", "1:07:24 happy chicken", "Hololive Pogchamps chess tournament when?", "Kiara laugh really feel similar to pekora senpai.", "1:00:00\nCHESS.COM WHY ARE YOU NOT FUNDING THIS???", "The total number of braincells in this stream was 3", "That chess game was painful to watch.", "Me:kiara is sure to win\nSome times later!\nME! WTF!!!!!!!!!!", "Ame is purposely doing dumb moves because she knows Kiara won't realize xD\n\nIt's a galaxy brain move.", "I wanna see Hikaru Nakamura analyze that chess game", "The chess was suffering", "I’m here for the 100 ELO chess match", "This is P A I N", "Oh god... that Chess game. That was an oof. So many potential checkmates that were ignored. lol", "I lost my last braincell and got 56 years older. Still pretty worth it", "354 gang stay stronk!", "53:05～\nこんなに笑ったチェスの対戦は初めてだよ！\nI've never seen such a funny chess game.", "BOTTOM LEFT BOTH OF YOU!", "I'm convinced both of them were doing this on purpose as revenge for all the backseat gaming the chat has  done\n\ngood one girls", "@ 1:13:24 KIARA, AME, AND CALLI LOVE TRIANGLE MOMENT.", "The Chess match is when everyone cringed right? I wasn't there so I wouldn't know", "We need to ban Chess from every video game", "B O T T O M___ L E F T", "now we know the truth: both ame and kiara are bottom left", "This entire chess game is its own kind of hell.", "In Hungary hiccuping means someone is talking about you", "They should get a Chess GM to react to this absolute big brain match.", "2 pawns and 1 horse vs 3 pawns and 1 horse....35 minutes left 😳😳😳", "私は同じ姓を持っています;-;", "So this is the infamous chess game?", "I will totally die if they somehow get Hikaru Nakamura on.", "Turn back you archieve viewers, there is nothing here but pain and suffering.\n\nTurn back now before you lose all your sanity.", "God i need new brain..", "Perhaps the chess match was just the two of them fanservicing those with a masochist kink.", "oh no, chess...", "CHESS WAS MORE THAN HALF THE STREAM?!?", "Chess was making my big brain hurt", "U got a smooth brain now", "kiara wasn't playing bad in the first game...\n\nEdit: nevermind, she threw the game", "AH Yes a fellow rock collector", "mankala look's like congkak", "wish i could hack the system and move the pawns myself", "that was the most painful chess match I've ever watched", "Why did they call Checkers \"Draughts\" in the English translation of the game?", "need amekiara chess season 2", "Code Geass level chess", "Hi there. So uh, there was a lot of backseating in this one, which is understandable considering the circumstances. But I feel like it needs to be addressed regardless. I know they're both new to the game, but is it really necessary to give them the most optimal moves without them... you know... finding it on their own? Or rather, fucking it up and being bottom left? They didn't even ask for help, people just assumed they'd be fine with it, which I feel is really disrespectful.", "I agree with you, backseating comments are unsolicited and becomes intrusive to the \"immersion\" of a game", "Chess gave me chest pains...", "Just finished the stream, and while Kiara didn't become bottom right, she definiely helped drag Amelia down a few more notches to bottom left on the chart. That being said if it came down to being the other kind of \"top\" or \"bottom,\" Kiara would definitely be a \"top.\"", "Is Kiara just a pervert because she perves a lot from what I've seen of the videos, and on top of that she just suggested strip poker", "Horse i hope your not made into a burger, i believe in you 😂😂", "Why has Calli not claimed our lives yet after the chess match? Why can’t we be released from this pain?", "I have been begging. Again and again and again, for Calli to just take my soul already and give us the sweet release we crave.\nBut she didn't! Probably because she herself busy begging for it herself.", "I lost so much brain cells in the chess portion", "49:16 BURPING AMELIA POG?!?!?!?!", "Nah Kiara not getting out of bottom left after that chess game", "Why a Rook?", "This was a lot of fun, but the most entertaining thing was watching the panicky chat flying by. Seriously, just sit back and chill, watch more than talk.\nWatching the chess game was not painful or suffering to me; when I watch a game, I enjoy seeing unfamiliar players figure things out more than experts who know it all front to back, unless I'm trying to be an expert, too.", "never play chess ever again both of you", "MY BRAIN TREMBLES !!!", "AKA Kiara and Ameilia struggle over a game of Chess for 72 minutes", "I don't know anything about chess but when chat said it's painful why did I feel pain as well", "aka the worst chess game ever played in the history of the planet Earth", "The chess match is so painful way too painful to watch", "The legendary chess game of hololive history.", "Torture begins at 53:30 somehow they both lost that game", "As a fellow Pekora admirer pls accept your true calling as Bottom Left.", "Kasparov should watch this", "9:49 is peak comedy", "Ame mind game lol\nSadistic ame I love it", "Chess game is the literal bruh moment", "In the end. chat lost and became bottom left after that chess match.", "I don't know how to play chess.", "12:00 Do we really believe this was a dream, or do we think Amelia got whitegirl wasted with Justin Bieber in his penthouse?", "I both love and hate the chess game. I love it cuz seeing 2 newbies play chess is kinda sweet. I kinda hated it cuz it hurts my brain so bad that i fell asleep for 12 hours after the stream", "Lmao all these mad chess nerds >:b", "now i know why the chest team left kiara behind", "1:48:10 what", "Ame was so Angry", "痛いぺこ", "You might know everything I’M going to do, but that’s not going to help you since I know everything YOU’RE going to do!!!\n\nStrange isn’t it???", "I just lost brain cells", "lmfao", "Tenchou was close to being ascended to bottom right or middle left, she was this close", "and now that i think about it, this might be kiara's revenge for all the suffering she received in SM64 and now is our turn", "What's really funny to me, is that Amelia is clearly good at chess-like tactics in FPS.\nCorner the enemy with multiple units, watch for attack angles, force the enemy back into bad positions...", "The vibration of the controller arouses me -takanashi kiara", "That chess game was pure gold for the gratuitous amounts of cringe it unleashed upon the world. Eh, there's always a first time, as they say.", "Stay happy birdbrain.", "示範國際象棋如何從優勢變成劣勢再變成優勢，最後再變回優勢\nShow how to make advantage change to disadvantage, then disadvantage change to advantage, finally change advantage back to disadvantage in chess.", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤💯💛💛💛💛💯👈", "53:33", "It was a game of two, and no-one can count", "I didnt know the comments ment it was this bad, god the chess game, i thought itd be bad but this just is brutal to experience", "Markiplier, Game Theory, and Completionist: Gets beat at chess by a monkey\nAmelia: Gets beat at most board games by a fried chicken", "Why did I watch the chest game?", "Everybody’s talking about the chess game but nobody noticed Kiara saying “voulez-vous coucher avec moi ce soir?” before the checkers game", "Ame please stop, she's already dead.", "10:01", "she win, but at what cost?", "Kiara had so many chances to checkmate lmao", "Next time they should try a game of Hnefatafl.", "I wish they'd do chess championships", "Ame said she started reading the witcher, but which one, if she starts at the first. The last wish, first released novel collection, or Blood of elves, which is the first of the longer storyline.", "i c ant stand chess but this game was so freaking entertaining.", "1:48:12 mmmmm", "Let's be honest, it was Kiara that beat Kiara at chess. Amelia was just along for the ride.", "Dont lie to us ame, you did knew dont you????", "Someone get agadmator on that game.", "53:05", "Pain.", "53:00", "18:06", "Okay,  now I can see why people are so frustrated", "LEWD", "1:43:25", "Someone should make an analysis of their chess game and put it on youtube or chess.com or somth", "No strip poker? 😔😔😔", "God save the queen", "To be fair, Ame did a little on the beginner lv, not sure how to say to Kiara tho", "EPIC", "In today's stream, Kiara and Amelia wins while the viewers all loses their brain cells.\n\nPersonal timestamps:\n11:00 Ame's weird dream", "I enjoyed the chess game... by looking at the chat and 4chan threads. I didn't think watching thousands of people get frustrated to the point of insanity was hillarious, but I sure had a good laugh last night.", "They actually played chess. Epic.", "Actually, that chess game was painful to watch.", "That chess match was one hour????????????", "Before I get into this I need to know, is this worst than fuslie vs Nate hill?", "This is the dumbest, cutest and most adorable chess game i've ever seen...", "9:09", "CHESS", "Not sure what was more entertaining, the game itself or the occasional chatter who thought he was being smart while being wrong. Like when the backseaters were calling out the free knight on D4 (1:19:00 and 1:21:00) and some people be like \"lul but there's a pawn on C3.\"", "I will tell Hikaru on you", "Kiara don't forget to turn slow mode on for the chat. lol Anyone could spam all the time if they want to and a lot did, so active it next time to the chat get better. \nWith that said, fun stream all around. I was going to skip and watch the archive but I woke up early and it was very fun. You and Ame have quite the chemistry. haha", "1:48:07", "1:13:22", "Mah brain hurts....", "Please do more chess games if chat is backseating too much on other games to punish them lol", "Why.", "This chess game has certified both of you to be Bottom Left.", "As a chess player this hurts", "HARD BOTTOM LEFT. MUST GO MORE LEFT. I know nothing about chess but i watched this with my boyfriend who knows how to play chess and it made this 10x more hilarious. He was truly suffering.\n\nPLEASE FOR THE LOVE OF CTHULHU PLEASE PLAY YACHT DICE NEXT.", "There is 10^120 possible moves in chess... The number is larger than the nombre of atoms in the observable universe. And they still succeeding in picking the move that will hurt my brain... EVERY SINGLE TIME... But I enjoyed the stream after all", "The most painfull thing is the amount of times Ame could have won but didn't", "I'm glad that hundred of thousands people can share the pain in that chess game.", "Chess game was fun", "Hololive English: Eternal Punishment", "The comments did not prepare me for the chess match at all.", "Chess game was a struggle but the like to dislike ratio proves people still loved it and it will be referenced a lot from now on. I love it.", "Are the brains as randomly generated as their profiles?", "Torture device acquired", "Kiara was in a chess club.... let that sink in. XD", "信じられない", "AME NO!!!! AME NO!!!!", "I wonder why a gamer with great FPS instincts can fail so miserably at short-term strategy. Lack of sleep? Wrong context? Low stakes? You need strategic thinking to outplay opponents in shooters, and it's kinda the same in chess. Sure, that's still legendary entertainment material, so I'm not complaining, but still :D", "海外コメントニキがみんな、チェスで何かしらのダメージを負っていて草。\n自分？ アーカイブ勢だから 2:05:02 まで時間跳躍しました。", "Bottom left", "1:28:44  Black horse to force king in check and will get a castle for its trouble - a worthy sacrifice!", "Angery Ame is kawaii", "DO A FLIP", "My head hurts but heart is satisfied", "This hurts....", "English version pekora", "Can we only downgrade Ame to bottom middle?", "war chess is hell", "Okay, i'll be honest, I call bull on Ame being this bad.\n\nWe have seen her subliminal streams, we have seen her solve puzzles before we even fully processing the puzzles completely.", "you know what? you might be unto something", "I mean chess needs strategy not just solving puzzle like superliminal or fps games new player might be confused , tho what kinds of ppl have played chess before but didnt know the promotion rules", "@Yakksan She could literally end the game several times, but somehow didn't. Did someone who have good processing brain would not realize it?\nNot to mention she choose bishop instead of queen, twice. When Kiara ask she said she have her own reason but refused to disclose what is", "@Yakksan I got what you mean though. She might be not a master, but still her gameplay is so disastrously bad I really doubting she isn't doing that on purpose.", "@Namikaze Nara yea she probably didnt choose 3 queen because she feels bad for kiara but that just make our suffering longer lol", "That chess match literally hurts my mind considering I play chess my inner chess self is telling me \"No Please she can win already yet she can't find it, Kill me please\"", "I initially thought Colonel Kiara was winning everything and things were rigged but it was interesting when Amelia mounted a comeback and eventually tied! It was really fun! Thank you, Colonel Kiara 店長 and Amelia-san! 🐔🔍🔎❤️✨", "it was all fun and good and then suddenly it was only pain", "I get KFC, Popeye’s, and Chick-fil-A ads on Kiara’s videos... is this a sign?", "Amelia was wrong with how capturing works in Mancala, it's if you place a single marble in an empty space on your side, then you take all the marbles from the opponents side and add them to your score.", "It hurts", "@trashtaste TOURNAMENT ARCCCCCC", "C'mon all the miss move are rookie mistake. It's not that bad after all. \nIt is clear that they both know the rule but play for the first time.", "I’ve known nothing about Chess until this one game....I F’ing shouted and thought like a Chess Grand Master!!\n ", "Pain peko.", "Both bottom left", "Watson dream...\n\nThis is just a tidbit of 10:51", "You can't legally put yourself in check. The only time that would ever happen in a game is if two people who don't know the rules were playing against ea-...oh...oh yeah", "1:43:20*\n1:48:08*", "So cute", "your brain", "Mancala is like congkak in killer mode", "Hololives are just digital muppets...", "I was confused, I was under the impression that you were supposed to take out all of the opposing pieces in chess and wondered why Ame didn't just take out Kiara's last piece, but then again I don't know much about chess so I'm probably in the same boat as them.", "You have to make it so you can eat the opponent's king. If the king is in danger of being eaten next turn, it's a \"check\", and you have to make it so he can't be eaten. If he's in danger and can't be saved, it's a \"checkmate\" and the game is over.", "@Zanpa Oh I see now! So Ame had Kiara beat plenty of times jeez.", "@U:R? yeah, but when you're not used to the game it can be very hard to see how to get a checkmate. It's nothing unusual for beginners.", "I just realized Kiara has the faintest German accent. You can only hear it on certain words but its there", "She said in another stream that German is her first language.", "@Kevin H her debut. I know, but I never noticed the accent till now", "It is true that chronic hiccups can be a sign of a big problem.", "The only loser here is the viewer, this is the stuff hell is made of", "full PGN of the chess game\n1. c3 h6 2. h4 a5 3. f4 Ra6 4. e4 Rc6\n5. a4 Na6 6. b3 b6 7. Rh3 Bb7 8. Nf3 Re6\n9. Ba3 Bxe4 10. d3 Bf5+ 11. Kd2 Re4 12. Nd4 Bxh3", "Pain..... Only pain", "Not only Kusotori did not ascend to bottom right but also Ame descended to bottom let with this chess game", "Once you see Amelia's angry face a bad omen has come", "26:20 she had such an amazing move she could have done :/", "What do people mean when they say bottom right, bottom left etc. please?", "Essentially, bottom left means lewd and dumb while bottom right means lewd and smart. (So upper left would be pure and dumb like Gura or something.)\n\nDuring the 2nd HoloEn Collab (that is in Kiara’s channel), all the members were measuring themselves in those alignment cross chart memes like from reddit. It was like a coordinate plane measuring purity-intelligence where the vertical line is the purity and the horizontal line is intelligence. Very left is dumb, very right is smart, very top is pure, and very bottom is lewd. Bottom left is basically diagonal.", "@Gekie Xerion  Ah thankyou! You are an individual of kindness.", "Toxic gamer", "A hololive chess tournament sounds great, actually. Just maybe learn the rules BEFORE you play the game... please?", "Expectations: Kiara ↙️ Ame ↘️\n\nHalfway the stream: Kiara↘️ Ame ⬇️", "cheth", "I'm astoundingly happy Amelia's played Dofus.  Personally I'd go with Wakfu but it's basically the same thing.  Any Feca mains out there?", "A bit late but here is a report with a little to none analysis of the bizzare chess game between Takanashi \"Bottom Left\" Kiara vs Amelia \"Defective Brain\" Watson - the two beginners were the culprits in the mass murder of the poor spectators' brain cells (including mine). This report was made with the help of lichess.org.\nTimestamp: 54:14 - 2:05:03 (Duration: 1 hour 10 minutes 49 seconds)", "She may be a chess noob but she’s OUR chess noob", "In my five years plating chess, I never seen a chess game that tortured me.", "pain", "I missed the entire stream 😒😥 i need timestamp!!", "That chess match managed to expose /hlgg/ as chess experts while also having two entire threads where everyone lost their minds.", "I'm losing my mind. Amelia went super duper easyyyyyyyy. Props to her patience, Amelia is just too kind.", "I remember trying to ask Ame in a SC once if she'd be into playing 5D Chess with Multiverse Time Travel... after watching this I don't know if I would love to see that or hope she avoids it at all costs.", "", "At least Kiara isn't alone in ", "at 1:05:36 if kiara went 1 closer to her side with the bishop in front and the side of the pawn she could of got check making ame have to block with her pawn and then kiara could take that pawn with the knight putting ame's queen in danger which she either saves and kiara gets checkmate in one or loses and kiara gets check mate in the same turn. if ame moves the queen forward, kiara doesnt move the bishop or the knight instead moves the queen to where the knight was and takes the pawn diagonal left and then lets ame take the knight with her queen and takes ame's queen with the bishop.. checkmate. ", "at 1:13:44 the pawn actually could of been key moving one forward becuase the knight stops the king from taking it (cant move into check) and the queen stops the king from running then the queen moves all the way diagonal left and checkmate", "Bro, after Bb5+ just nd7. Still really bad position for black but it's better to just take the knight with the bishop.", "Stop whining about the chess, this is not Reddit for you to brag about how \"smart\" you all are smh", "The worst chess match I’ve ever witnessed. Amazing", "Tbh if I was on two hours of sleep, I’d probably make the same mistakes as ame", "2:05:22 here is your skip button, thank me later", "1:26:23\n\n??????", "Finds the chessmatch everyone's talking about\n\nMe : I mean it can't be that long if they both don't know how to play the game , one will lose easily", "Poor girl. Amelia is just not super good at normal games. She's a video gamer only", "1:40:00 imagine not picking queen", "ok she picked it the second time, good", "Ame knew what she was doing the entire time and just wanted chat to suffer for all of the times she was called toxic...I know it. Either way Ame is now promoted to Bottom Left now next to her Phoenix bud.", "The perfect payback.", "The pain started for me in the box game where Amelia kept passing over at least THREE safe lines, even STOPPING on them before continuing to look for a safe line.\n\nEdit: this is BEFORE the first box got filled in", "Thanks for the stream, Kiara. The whole chess game is painful to watch. If only you had move your queen to that black knight piece. Then it would have been done deal the entire game. Good job on winning the other matches though.\nGood game Ame.", "I had never yelled at my monitor before....", "I hate that electronic Checkers games make you jump even when it isn't to your advantage. I don't know if that's the official rules or not but it sucks.", "That's the rules. It's what makes the game interesting: you can force someone to take one of your pieces to get yourself in a better position.", "@Zanpa but in some variants (russian \"shashki\", for example) you can eat backwards with any chequer and this variant is so lame T_____T", "I am beyond triggered by the chess game\nBut it’s a good strategy to make people donate to ur stream\n(lol it’s a joke)", "you're acting like they knew how to play, not everything is about donations dude", "It’s a joke XD", "After that chess match I felt so much frustratiom that I don't think anything will ever get me frustrated again.", "From now on watson and kiara is both bottom left and no one can convince me otherwise.", "chat before chess game: yeah chest is fun. show us how big brain you are.\nchat after chess game: Never, EVER , do that to us again", "as an 1800 rated player, the chess match was something beyond my comprehension.", "i died", "Other than the chess match (which was painful for someone familiar with the game), that was a lot of fun! You can tell they're both pretty competitive, which kept it interesting. \n\nI'd definitely love to see more of these streams in the future!", "The Suffering you two cause has promoted you both to bottom left", "If you're a masochist who knows how to play chess, boy do I have a treat for you. 54:00\n\nMagnus and Hikaru? Forget that. This is truly the game of the century.\nI don't know whether to laugh or cry after watching that game. Still trying to find my braincells.", "I dont know what everyone is talking about, the chess game is about the best boardgames content i ever seen, never a dull moment, all moves are unpredictable, my stomach hurt from laughing an hour straight, bird brain vs defective brain is like watching Light vs L but in opposite day, this is pinnacle content lads", "I kept yelling \"KIARA YOU CAN LITERALLY TAKE HER KNIGHT WITH THE QUEEN\" around 1:14:30 SHE WENT FOR THE CHECK OSDBSOANODJDKDBDKA NOOOOOOOOOOOOOOOOOOOO THATSDA SASS", "Did kiara also get the world record for longest chess game?", "I don’t know what’s wrong with you guys lol, it was very entertaining... the chess... yea... ;-;", "They both need chess lessons.", "Tbf we should've been warned when Kiara couldn't say diagonal that it would be all downhill from there", "I think they know what they are doing playing the chesd. They are just torturing us Lol but if not then atleast they entertain us lol", "BOTH OF YOU ! \n\nWe all agree here.", "I mean chest is hard to understand I think", "As soon as they saw that opening move, the chat knew they were in for a thrill. After this chess game, both of you should be bottom left! Kiara could've been bottom middle worthy in my book If she had moved her pawn forward at 1:14:00 hahaha Call me a Masochist, but I would love to see more hololive EN chess games.", "I'm jk of course, I love you both and I understand you don't know how to play. But it was really funny and painful to watch haha", "I wonder if Amelia will back in time to fix the Chess match.", "That's another world line, we won't get to witness it.", "In the chess part there a re soooooooo many openings that could've lead to a mate, especially for Amelia because she doesn't scan the whole field and only look at the middle and this is the same for Kiara and if I'm the one playing against the two I would put my important moves to the side. Overall this is a fun and somewhat midly infuriating if you're good at chess.", "Watching Ame and Kiara play Chess gave me so much anxiety. As I'm really competitive in chess, I don't know what to say after watching two people repeatedly fail and miss advantageous positions such as Kiara's mate in 2. All I know is that it was extremely hilarious and anxiety inducing to the point where I found myself trying to backseat game and tell where each piece should've been.", "If a man of culture plays the switch over the playsation, what's a man who plays all four systems. Switch, Playstation, PC and X-box?", "Kiara we love ya, but plzzz don't play chess again.", "That chess game should be considered a crime pls do a tournament", "Kiara was in a position to absolutely dominate if only she knew about promotions.", "Whatever you knew or did know about chess, even the BASICS, throw it out the window before watching!", "Amelia tier S+ Chest Bully", "Yes, Kiara, I throw in the chat of what promotions are before seeing a promotion. I teach you the real pro chess rules. Ame shows a great example of Promotion at 1:40:01, the pawns have to reach the end unscathed to get a character or \"free\" a character. I throw down a lot of general and special chess techniques(The world chess federation) in chat as I do as a chess champion and a drummer. Thank you for the fantastic chess match with Watson, hope to see you do chess again with others. Nice promotion comeback Kiara at ", "✨✨✨✨✨✨QUEEN KIARA✨🐔🐔🐔🐔🐔🐔🐔", "This was probably the worst played chess game in the history of every multiverse, and I loved/hated every moment of it with a burning passion.", "I refuse to accept that you two are bottom center. You two are bottom left during the chess game.", "Pretty sure they didn't understand Mancala.", "I have a sneaking suspicion Amelia is better at chess than she let us to believe today. \nCan't quite put my finger on it, yet. But there some mighty sus moves she made.\nI think she played us like a damn fiddle.", "The only time I was suspicious was when she gave up the checkmate in order to capture Kiara's last knight. \n\nAfter that was 15 minutes of unnecessary suffering where I stopped counting after 5 opportunities to checkmate.", "i dont understand why amelia was shortened to ame... its a 1 syllable difference... i guess maybe the L is hard to say?", "I think it’s just a cute nickname.", "People with names over 2 syllables almost always get shorter nicknames.", "I'm not even that old, but zoomers playing Chess, calling rules \"new\" is so funny to me. They are so bad!\n\nMuch like many strategy games, there are moments where one could artificially  extend the game despite having no chance of winning. Lest Ame fell asleep, Kusotori had no way of winning and thus should have conceded before she was even down to only her king. That's how chess goes. People concede when they're in an unwinnable position way earlier than that. You cannot win against a Queen with just a King. Literally impossible. Thus you've lost, but haven't been check-mated."]