["12:23 Gura: \"Mom, dad please don't fight :(\"", "This, and the use of \"boy\" of Calliope, reminds me of a certain someone who has left.", "@Type Here Whom", "Amelia's late night mom pounding spree is starting to take it's toll.", "Lmao", "Must be hard pounding so many moms each night.", "😢", "Must've been tiresome pounding moms everynight", "If Amelia was a true big brain time traveler, she could have traveled to the past, pounded the moms, then came back about 2 days before the collab, get some rest and then she would be fine. Galaxy brain Time traveling", "@Shadow DeDeDe Time Traveling 101, you aren't allowed to meet your old self. So if Ame chose this Timeline to travel to, she can't jump back and forth without risking creating a paradox.", "@RexusprimeIX Slams Table DAMN! I thought I had a big brain moment for a second there.", "I bet santa pounds more moms since he has so many helping elves.", "@RexusprimeIX i choose to not believe that is a rule.", "Amelia ghosted the team.", "What actually happened to her? Overslept?", "forcexjr she either overslept or it was tech issues is my guess. Perhaps she was warped to another time line or accidentally got a dose of her concoction.", "@forcexjr Probably because they can't do four-player games because one member would be left out (in this case Ina). This is why the surgeon sim stream and the previous overcooked stream only had three players since these games can't accommodate five.", "Arc lieutenant Jesse pretty sure she got sucked into another dimension", "@thejuiceman18 Nope, Amelia just overslept", "@NushiSushi rip", "She updated her Twitter. Yep, she overslept.", "She needs some rest and that’s it :D", "too much investigation. needs sleep 😂", "@Jerry Dupo as expected from our gamer", "Most of them do not have good sleep cycles at all. Ameila probably woke up at mid day", "@thejuiceman18 that actually is quite a plausible reasoning.", "Damn, their talent seems to have a tendency of oversleeping", "Amelia also streamed the most out of the 5 so... overworked probably", "She got lost on the wrong time axis.", "Amelia was with my mom during stream", "@AJ Perreras this explains a lot", "@Jerry Dupo lolololololol hhahahha", "She said on Twitter she slept in https://twitter.com/watsonameliaEN/status/1313516366528352256", "Fuck you", "666 likes. Perfect for your pfp", "This stream makes me feel like I'm watching two girls who got married and adopted a baby shark", "I love it", "Amelia just got kicked out of a secret cooking society. She spilled the beans. Also she should probably unmute herself.", "Ultra Joke instinct", "Slurp", "@Taylor Sip", "@Casual Filth Looks like we switched our drinking methods Slurp", "@Taylor sure does  sip", "Amelia was actually there the whole time. she just simped for Kiara so long that she finally turned into a KFP bucket.\nEdit: oh and before anyone says that Kaira's membership hasn't been open that long remember Amelia's a time traveler", "imp360 Makes sense", "Oh boy 🙁", "Understaffed, lazy manager, raw food. \n\n5 stars out of 5", "Almost died of food poisoning. 5/5. Would recommend.", "Died to food poisoning, got to meet one of the chef's that then sent me to a friend's chicken joint after\n5/5", "Oh, I see. Amelia apparently have the highest loyalty badge. So, not only did she ground pound our moms but she out-simped us!", "Makes me proud of having my mom ground pounded by her.", "The married couple and their child", "Lol", "12:34", "\"My dear wife\" \"No i am not\" \"Even though we have been dating for three weeks\" \"No we haven't\" I love this.", "Timestamps for notable moments\nSchlampen Küche!? Featuring ...\nGawr \"a\" Gura as Shark Chef\nAmelia Whuutson as KFP bucket", "So... PP Reaper?", "thank you for doing phoenix's work!", "clippers: write that down write that down", "13:17 \"Hast dem probleme wist this?\" should be \"Hast du ein Problem damit?\" (Do you have a problem with that?) and she continues with \"Was willst du von mir?\" (What do you want from me?)\n\nAt 16:25 Gura says \"Eine gute Note bekommen\" which translates to \"Getting a good grade\"", "@Captain Cyberspace thanks German-knowing niki, imma update it 07", "Thank thank thank you! as a grad student I cant watch the whole thing, but as a loyal KFP follower I need these highlights in my bloodstream.", "21:30 Do you guys know how to say \"いただきます\" in German? \nGuras \"Mahlzeit\" is realy cute :D 21:44", "At 12:36 Gura “Mommy Daddy stop fighting” 😂", "@Shinano Yokosuka It's actually written as one word \"Schlampenküche\"", "you sir,   you are a true hero", "Amelia probably looked for Gura's lost loaves of bread", "Eyyy", "12:30 \"mom and dad please don't fight\" LMAO", "Amelia was there all this time, she was only invisible.", "So was she like Drax? 🤣🤣", "Quite funny how a time traveler gets late to something isn't it?...", "First stream where Ame didn't hic", "Nobody:\n\nGermans: teaches everyone German swear words.", "Isn't that what you teach first in every language?", "@Bombsquad85 everytime I see people teaching German to people it's >90% swear words, while other languages it's normaly <20% swear words. It's kinda getting to a point where it is a ritual to teach people as many swear words as you can in German before anything else XD", "Well the first thing i learned in english was swearing and here i am looking naturally at holo en", "Mama 1: Phoenix.\nMama 2 : Reaper.\nDaughter: Shark.", "Daughter 2: Bucket of chicken", "Daddy : Nurgle", "It's how I saw the stream, two mommies and their daughter", "NTR Harem protagonist: Detective", "Thats one Sweet aunt:Octopus", "Ame was there all the time, as a support technician behind the scenes.", "Next collab on Kiara´s channel: German quiz or german lessons\n\nWürde mich freuen ^^", "Dieser Kommentar ist nun Eigentum der BRD\n\nEdit: Danke für das Hinweisen auf den Rechtschreibfehler, Kamerad!", "@blueAwoo Diese*r* Kommentar...\n\nIch bitte dich.", "Ehre.", "Ich währe dabei.", "Maybe German collab with Iofi.", "Ich glaube das wird viele viewer abschrecken. Vielleicht sollte Kiara das Deutsch besser sein lassen. Aber natürlich wäre es a blessing hololive auch mal auf deutsch zu hören.", "I heard Amelia pick up Italian lately, so there will be some interesting collab in the future", "@Ryan Nguyen WW2 Flashback", "@Ryan Nguyen Amelia be laughing in switching teams.", "I'm learning german language(one of my highschool lessons) recently, want to be my chat friend?", "@Jan Oswald \nDM me if you want a chat partner ^^", "@Bakapeko ehhhhhhhhh naniiiiiiiiiiiiiii", "@AYAME'S GIGGLE VIRUS this. ☝️", "@Bakapeko I tend to agree, but maybe it's feasible as an additional (bonus) members only stream?", "Kiara uber alles", "Kommentarbereich schneller eingenommen als Polen", "@Bakapeko Kiara sagte in der 2. Full Collab Das sie einen deutschen stream geplant hat für nächste oder übernächste Woche. (also vom Zeitpunkt der 2. Collab her)", "@Decatur Ramsey do u have WhatsApp?", "@Jan Oswald yes I do\n\nproblem is how to exchange numbers securely, so if you you want to give me an email adress or smth like that I could send you my number (since YT dm's don't seem to exist anymore)", "@Decatur Ramsey instagram? Here's my acc name : @garry.x_x", "@Decatur Ramsey german language is one of tomorrow lessons :v", "@Decatur Ramsey do u have any other chat apps?", "@Jan Oswald I requested a follow on Instagram\n\nI also have Telegram, but that still needs a phone number I think\nOtherwise Discord, but I don't regularly open that one ^^'", "Man I wish I spoke French...", "Tip: When only some people have lag, it's either their own connection or youtube's stream delivery. If it's on your side, then EVERYONE has lag.", "Democracy", "I want Kiara to do a german only stream. I can listen to her speak german for hours.", "Honestly same I’ve always wanted to learn Japanese and German and I think kiara is perfect for that", "she's a self hating Austrian", "Honestly... same. I love how she sounds lol.", "@HAWAIIAN LOLO uh oh.", "@HAWAIIAN LOLO I hear that so often, did she ever confirm to be austrian? I do not hear an austrian accent.", "Poor Amelia. I think she overslept or something. Still a great collab. These streams are a nice break away from how soul crushing the world is right now.", "yea she did overslept, she tweeted about it", "Amelia really took a super long nap! Like wow! Ground-pounding chat’s every mother must be tough work even with her time travel powers", "She probably ended up flirting with Moona after the stream more lol", "Ame did say she will add moona on discord, so there is it.", "Judging from all of these comments, either Watson messed up or I'm in the Wrong Timeline....\n\nGotta get back so-", "This is it.\n\nThe Alpha Gamer Attractor Field.", "TIME STAMPS\n\n01:54 start (audio problems)\n02:50 Ame is missing", "LEVEL 3-5 Chicken Nuggets\n48:06 RIP food\n50:12 favourite chicken nuggets sauce\nLEVEL 3-6 Burritos", "@Holo TheWise Wolf Thank you~", "Ur a god among men thanks", "I can't believe Kiara turned Ame into chicken food!", "😏😏", "Kiara: * sudendly stops moving near the table *\nMori: -- Why did you stop moving, Kusotori?\nKiara: -- Where's the salt? I'm not finding it...\nMori: -- THERE IS NO SALT!", "59:23 Dont you mean.... \"Why did the Phoenix cross the road?\"", "To see calli", "Hope Kiara doesnt beat herself up over the technical issues, she sounded pretty stressed", "And here, we return back to the chronicles of the Bitchin' Kitchen. We have Gawrdon GuRamsay, the Far Reachin' Reaper, the Undetected Detective and the guest host for today, the one, the only, Schla Mpen Chicken!", "Kiara yelling out \"Zeit Abgelaufen!\" at the end of each round is just the cutest thing.", "It was like Amelia was never there.", "Who's Amelia?", "shingshongshamalama exactly", "Can someone make a kiara “UEH” compilation? Those mind blown moments are so adorable", "my favorite part of the stream was when Calli and Gura imitated her UEH in unison. I love this group so much", "Love how fast time flies with HoloEN collabs. I smell a time travellers work is in play. 👀", "She's muted", "Amelia Whereson", "Where?! cafeteria in my soul!", "Amelia Sleepson", "Ame was not there ao that way kiara could have some alone time with her wife and daughter", "\"kicky ricky\"\noh no, we're bringing THAT mori-bund meme back?", "+5 points for inventive use of the word moribund.", "I think we can all agree that Amelia was carrying hard this stream.\n\nIf everyone else bothered helping Amelia, they could of gotten 3 stars smh", "This was fun to watch; never played it before but it looks like a good time. Amusing that B*tchin' Kitchen could be shortened to BK.\nAlso, starting to get exhausted with the chat; I may just watch without it and keep quiet during livestreams. I wouldn't be surprised if the waiting for stream screen got replaced with a reminder of the rules for chat so that people can't miss them.", "Brandan Wilson What’s been going on? Is this about the ‘check time’ abuse?", "Amelia oversleept. She tweeted like 30 minutes ago she just woke up", "Amelia: oversleeps\n\nEveryone: so you have chosen... FORGIVENESS", "So I was wondering why Kiara had two hats for a week, it suddenly donned on me, Everyone but Gura has some type of hat.", "Hoodie notwithstanding.", "12:35 \"mom and daddy still fighting\"\nThats so cute", "\"I don't pay the KFP employees, they pay ME.  That's how we do it in the modern day.\" - Kiara\n\nObjectively true.", "Detective's sneak skill is too high", "Seems that Amelia's bad sleep habits finally caught up to her.\n\nI hope", "You hope?", "@breadbowl __ I hope it's not something worse!  🤢", "Hopefully next time you can fix the volume for ina and ame voices since ina was too quiet and ame was too loud", "And Amelia's model didn't move for the whole stream wtf", "I thought ina was always this quiet though", "Ame was late for almost a whole Shion. Probably a whole Baba even by looks of it.", "Did she ever showed up?", "the stream wasn't even a shion, it's only a polka and three watames. So, the conclusion is ame wasn't there.", "@Maicha Latté what are those measurements", "@• SEVEN when you've fallen too far into the rabbit hole, you'll eventually know it.", "@Maicha Latté eh ,nevaah,I already have my one only top tier Husbando", "@• SEVEN basically, it's the time measurement system that has a long history.", "@Maicha Latté\n(This comment was made begore your second reply)\n I have lot's of things to do,drawing unrealities , animation,technology, lot's things I need to change,lots of responsibities, and of course I also need to see him ,so lot's of things to do ,so I don't  think I will ever spend my time watching full livestreams", "@• SEVEN Judging by Maicha Latte's comment it looks like a Polka = 1 hour, and a Watame = 10 minutes. A Shion is probably 2 hours, but who knows.", "@• SEVEN 1 Marine = 4 hours \n1 Shion = 2 hours \n1 Polka = 1 hour \n1 Watame = 10min ", "@Technological Waste whare does these measurements come from", "@• SEVEN they all come frome being to late. Marine was 4 hours late for her stream shion 2 Polka 1 and Watame 10 min. Let me find the links.", "@• SEVEN \nMarine Shion https://youtu.be/DIutHGS7pkQ \n\nWatame ", "@Fuwafuwa Panda Thank you and everyone who replied", "@Fuwafuwa Panda Real MVP", "Props to Kiara Tenchou for realizing Gura's low volume mic and increase it. But Kiara teaching them germans is obviously the best part", "Kiara: \"it's in German, you got a problem with that?\"\n\nNo, in fact I love it when she speaks German.", "17:19 Wizard School? You're mozzarellara Harry!", "Ah yes, just some quality family time with Callie as the dad, Kiara as the mom, and Gura the baby.", "58:15 shrimp\nEnjoy, clippers", "My goodness, Gura turning German language cute is next level.", "465 gang held the line, congrats! And dang...Ame was super energetic and active in the stream!!! Thanks for the collab everyone~!", "This stream was so chaotic and so fun to watch! Thanks Kiara, Calli and Gura!\n\nAll hail the bitchin’ kitchen!", "16:17 Oh God my heart <3 <3 <3", "To check the lag or audio, the streamer could open Youtube on her mobile while streaming from her PC.", "So miffed I took so long to finally catch up on this. Gura saying \"Ich habe eine gute Note bekommen\" was incredibly adorable. Her German pronunciation sounds surprisingly natural at parts.", "Bruh we need moderators", "My info was used well, and I can only hope it leads to more German swears.", "When she speaks german she usually swears like a sailor.", "@Bombsquad85 Good. Though her English swear rate has also increased, so I'm starting to think YouTube's just chill with it now.", "Judging from the avatar sizes,\n\nCalli Mom, 20 year old daughter and a random 10 yr old kid they picked up front the streets.", "15:32 Delicious Meals? Perhaps the real salary was the friends you all made along the way", "the way kiara says \"zeit abgelaufen\" is so cute c:", "16:27 \nMEDIIIIC \nI NEED INSULIIINNN", "Start at 1:55", "I don't know why \"Welcome to wizard school. Today, pizza.\" hit me so hard", "Everyone just talking about Amelia instead of saying how much of a fun stream this was", "Even tho I can't catch these live recently, I still love catching up on the streams later! Always brightens up my day ", "Nobody:\n\nMy brain: Gawrdon Ramsay", "12:33\ngawr gura: \"mom and dad pls dont fight\"", "Don't worry Kiara, if you ever feel down, just 'hoocha!' everything that makes you stressed.", "I've got to recommend my friends to the B-chan kitchen", "59:45 an abso-f wording-lute riot. The most hilarious comedian of the 20th century.... To be honest, I already forgot the joke in the time span of typing this comment, but the cringe she felt from the joke not sticking its landing well was the essence hilarity itself XD", "Prior to this stream i didn’t understand any of the calli X kiara jokes (i hadn’t watched any kiara) and it only took 10 minutes of watching this for it all to become clear", "17:13\nwelcome to wizard school !\ntoday pizza ! \nXDDDDDD", "とてもかわいい鳥です!!!!!", "Kiara is my fav hololive en girl. Shes just too adorable bruh.", "12:33\n\nGura: ”Mom and dad is fighting”", "12:35 \"Mommy, Daddy don't fight.\" Gura is baby confirmed.", "Ngl, i feel like this is the only time german sound cute to me XD", "12:35 did Gura said \"Mom and Dad are still fighting\" when Kiara and Calli are having an arguement?", "This was a great stream. Wish I could have caught the whole thing live. I love hearing Kiara speak German.", "22:00 I was waiting for that lmao Kiara absolute Madlad! Hast du gut gemacht!", "12:30 - \"mommy daddy stop fighting\"", "31:09 perhaps the only ones she'll ever accept are the ones she made along the way", "Gura has \"a\", Ame has hic, Kiara has technical difficulties.", "Why does Gura always make herself so smol?", "Her model is legit a lot smaller than the other girls' I'm pretty sure. Calli and Kiara are pretty tall.", "Kiara started getting the hang of it at the end", "Ame was incredible this stream! Would love to see a duo collab with you and her 😎", "When Gura is the youngest there", "12:28 Gawr Gura: Mom and dad are still fighting :(", "I love how the Mystic Chicken Queen is in eternal state of Insanity. XD", "That chat was such a bruh moment smh\nAnyways, can I have one bucket of KFP with the side of Amelia tea?", "18:28  Hey thats me! \ntomatoes and ketchup taste so different", "Lmao people saying Ame too loud in chat.", "If i happen to passed you someday, i'll take you to a beautiful places. Imma make sure you feel happy even just for a moment. Keep your chin up, you are adore-able 🐣", "IS THAT A MAN RIDING A SHRIMP!", "みんな可愛い…！", "Man, it took me forever to watch the hole video. I had to pause so many parts of the video because it was too sweet or funny. Great job girls ", "12:11 Timestamp for the 'MOM DON'T FIGHT!' video.", "Around 12:37 Gura says “mom and daddy stop fighting” 👀", "So fun to watch! I love this series and can't wait to see you play more overcooked!", "Watson must've still been ground pounding our moms", "Playing the game in German is kinda funny haha\n\nEspecially if someone like me understands it all c:", "Funny how Ame just slept through it. Oh well! XD", "Lucky me, I was still asleep at this time", "bro when streamers have some disconnected sounds i always think it was mine what a troll lmao", "Oh no Amelia has been transformed into Fried chicken", "22:55 Kiara: \"The only restaurant owner that you know~! But I'm very successful...\"\nAlso Kiara, literally 0.1 seconds later: \"What the hell is going on\"", "Is it just or is amelia muted and lagging..... Maybe its my wifi", "Kiara missed an opportunity at the end to say part time lover.", "awwww gura's so tinyyyy", "We are witnessing the hololive's 3 oldest members of 9k year old!!", "Huh, I never know Ame spoke German so well. Seems a little different though...", "Missed the stream. time to catch up", "It would be cool to have some german lessons streams, I beat it will be fun to learn from Kiara", "Ame is awake!😂🔍", "Her alarm ...XD. Anyway good to see she slept well after hardworking on these days.", "16:12 the clip is here", "The graphics card is chuggin xD OBS + stream + game is killing it", "Probably more the CPU. She only has a 3200G. And I think rendering the live2d model takes a bit of performance too.", "After a long day, it is so nice to see that there is a new video out.", "Oh no I missed the streaaaaaaaaammmmm", "21:44 you can also say guten Appetit", "The game being set to German is so weird to me. On my own PC I went out of my way to change everything to English, since it makes sharing my screen and describing things to anglophones easier. So confusing 😆", "Amelia do be carrying doe😳", "I think there is something wrong about the way you talk to each other, but I hope whatever worries you're having won't get in the way of your comfort in talking to your EN mates❤️❤️❤️", "Nuestra Estudiante Detective Definitiva se quedó dormida :'v", "Looking back Kiara seems to be more comfortable using german. Loving it!", "5 simultaneous Mario streams were to much for Amelia", "Amelia needs to colab with Subaru and make Re:Zero memes", "Ame is the friends we met along the way", "you could say the stream was pretty", "I'm glad to see plenty of people in the chat made ONORE DECADE references after Kiara mentioned Kamen Rider.  This, too, is Decade's fault.", "I’m here ...this is my first...will I regret it?Ill check back in later", "Oh my god around 42:30 I just saw Kiara hijack the burger Calli was working on for the oldest ticket to make a \"burger she wanted to eat\" which fulfilled a newer ticket, I'm triggered", "Honestly it would be such an honor to work at KFP the reverse payment model is fine with me", "OOOOH BABY ITS PIZZA!!!", "I'm starting to think that by the time Kiara gets access to her stronger pc, she's going to be an expert at making games run well while streaming on weaker sytems.\nDon't give up, girl!\nI used to game on a CELERON with integrated graphics, you got this!", "dang wish it was longer. fun stream tenchou.", "Why did the chicken cross the road?\nBecause it craved the sweet embrace of death", "Ina is like zura...She's on standby", "Thank you, Colonel Kiara 店長, milady Calliope and Gura-san! Another frenetic Overcooked 2 session. I am glad Amelia was able to get a bit more of much needed rest. Take care, all of you and see you all next time! 🐔💀🔱🔍🔎❤️✨", "Kiara your German voice sounds A LOT like the German singer Selphius liek 1:1 the same.\n\nDid I just find out her true identity", "Haha did I hear Mori-chan say \"B**chin' Kitchen\"? xD", "Indeed, it was named the Bitchin Kitchen on the part 1 collab: https://www.youtube.com/watch?v=_HYTbLF_5eI", "@Markus Tanbeck Dang, yet another unexpected reminder of a webcomic I didn't realize I miss.", "@shingshongshamalama Internet culture is such a gift. We are very fortunate to live in this era, where most things are achieved and we can share across the globe!", "21:00 Indeed.", "I lowkey want to learn German", "1:11:15 MYTHICALBRITISH", "livestream starts👍 01:54", "Gura cooks with her two moms", "Kiara lowkey winning Calli's heart with her cooking skills", "i dont understand german but that was extremely cute 😳", "Lol Amelia~ see you soon~!!! ^o^", "12:35", "Amelia was busy... with your mom.\nHa.", "Starts 1:52", "Ja moin, mir fällt ja jetzt erst auf das kiara ihr Spiel ja auf deutsch ist :D ich finds ja einfach mega das es Englische Hololivers gibt... Ich bin ja so froh das Azur Lane damals dieses collab gemacht hat xD sonst hätte ich hololive wahrscheinlich niemals entdeckt :D ich mein die Japaner gehen auch aber ist schonmal schön das man versteht um was es geht beim stream.", "They look like a family.\nI LIKE THEM VERY MUCH.", "21:45 Alternatively to \"Malzeit\" you could also use \"Guten Apetiet\". Which of the two is used depends on the area", "also in some areas Mahlzeit is used as a greeting.", "@Zafran Orbian is that an Austrian thing because I've never heard of that?", "@Ceser Nope its a thing in Ostwestphalen. So west to center germany.", "Two immortals running a restaurant along with their 9000+ year old adopted shark child", "Amelia was time traveling?", "I wonder if any of them have Super Smash Bros. Ultimate...", "Ame be sleepin' lol", "I am happy, it would be the first Ames stream I lose, so no harm done by oversleep", "1:24:58\nSmol shork", "MVP Ame", "Teamwork make the dream work baby", "Did they replace Amelia with a bucket of chicken?", "I’m getting KFC tonight", "👩‍🍳🔥 CookBattle 👩‍🍳🔥", "Zeit abgelaufen^_^", "11:45 hmmmmmmm\n22:04 KIARA!! \n30:10 🍍🍕", "Two wifes and their daughter", "I have a question. KFC or chick fil a", "I read that as chick fil A", "Watson's probably is searching Gura's bread accompanied by Ina's tentacles.", "for a sec that KFP bucket made me think you mythical beings just bucketed Amelia lol", "love every time she speak German.. even though i don't understand any single word", "Lmao, does it feel like Gura is miserably stuck as a 3rd wheel this stream? Towards the start, she just felt ‘pensively amused’ at the antics of those love bird(s). (Doesn’t help that her animations make her look perpetually eye-rolling internally, like a parent with warm-eyes unto their children~).", "What did gura said when 12:35", "H I C", "BISMARCK IN MOTION!", "I wonder if Watson is as good at plotting and correcting hypothetical shell trajectories at speed whilst paying attention to maps and reacting based on data from them as she is flicking from random points of the screen to the heads of unfortunate enemies.", "Poor Gura just wanted to cook food why Cali and Kiara flirting with each other.", "Mori with the basketball reference and the Hella’s lol based", "Did we seriously go an entire cooking stream without a single Palms Spaghetti?", "Ki kiri ki hololive en 1st generation takanashi kiara almondo almondo HA↙️HA↙️HA↙️HA↙️", "I think the reason Watson was not here is because she busy distracting the heal inspector", "This entire stream : Where's Ame?\n\nedit : Amelia was trying to achieve Steins;Gate thus she could not be found in this timeline.", "I can't get over how small Gura is compared to the others.", "Gura and her two moms", "Aaaaaaaand Amelia just woke up", "Plot twist, Kiara turned Amelia into a KFP bucket XD", "Who's Amelia?", "Why is Amelia!?", "how is amelia?", "I s  Amelia?", "You Amelia", "Jokes aside, I came into the stream 30 mins before it ended, what happened to ame?", "She overslept", "Hehehe. Can't say I blame her. Odyssey is so laid back.", "She said on her twitter that her alarm didn’t work and that she overslept", "Ame must be busy zooming", "Hates tomatos but like ketchup? That's so relatable xD", "18:22", "ame became fried chicken", "SOMEONE DRAW AMELIA AS BIG BOSS", "At least Amelia was visible on the thumbnail.", "She’s there in spirit", "She's busy with special K's?", "Ich kenne Kiara nicht im Reallife aber ich muss einfach sagen, dass sie bisher die herzlichste von den Fünf ist. Sie hat so eine fröhliche und herzerwärmende Art, ist schwierig für mich zu erklären😅", "Sie füllt die Genki-Girl Rolle würde ich sagen.", "Oh...ame wasn't here", "Good game girls. I very enjoy it", "It was a fun stream. Kiara did her best. Gura was great on this one. Takamori.\nAme not being there...I guess the Mario Odyssey is the blame. Thanks for the stream anyway.", "Amelia Sleepson", "blame alarm kun", "Boy, Team Bitchin Kitchen is a really great 3-woman team", "Se disfruto igual, tuvolindo", "swag", "Amelia is not the first Hologirl to be late or miss a stream and she won’t be the last so I’m not worried about it.", "She overslept, she even tweeted about it lmao", "@Quewgirl A lot of Hololive girls do that. See that recent one with Marine and Shion where they overslept their assigned time by 4 hours.", "I wonder why there is a chicken bucket in Amelia’s spot. hmmmm", "Majestic chicken", "Gura is unironically good at this game", "NBA BOSS GURA", "I am always embarrassed because of mori In every video", "Still I am a fox boy", "BLEP", "o O O", "understaffed, food dropped on floor, order forgotten\n10/10 would come back again", "KFP Bucket best girl", "I missed this by a minute", "16:26 \"eine gute nutte bekommen\" xD", "🐔🐓🐣🐤🐥", "My god they replaced Amelia with a bucket of fried chicken", "Why do you exist", "a", "Little did anybody know. Amelia was in the KFP bucket the entire time", "Kiara + Gura are my favourite hololive idols. Fantastic job, well done you 👍", "How could i miss this :feelsbadman:", "Before watch this gura probably goona be the third wheel", "This i just Kiara and her Wife, playing with their daughter.", "Kiara defending her tite of Vtuber with most technical dificulties, best girl.", "Thumbnail is clickbait, the detective didn't show up\n\nWird für Spam und irreführende Inhalte gemeldet", "Kiara, I hope you see this because I think you should try creating KFP in Cook, Serve, Delicious! 2. I've been playing it lately. It's both chill and relaxing and the opposite of chill and relaxing at the same time. :)\nI think you'd like it.", "Don't worry guys,amelia couldn't attend because she was in pound town with our moms", "Damn!! They promote the Amelia was going to be here and she was not!!", "She probably overslept lol She was sleepy yesterday", "This is one of the biggest reasons why you need a new PC. It's not wasteful, not at all. And it's pretty tilting that you need to depend on someone for a collab on your own channel. I know you're learning but I hope this isn't a permanent thing. Remember it's not just the kfp fans are watching this time. People won't be considerate like them.", "The yuribaiting was fun at first but now it is annoying. Get better material.\n\n\nAlso, 5fps gameplay is unacceptable", "No one wants your negativity fuck off.", "Oh no.", "You're free to go, no one needs to your company.", "@Jello-mancy 4 man collab only gets 18k, while gura alone gets 40k. But sure, us viewers are the problem.\n\n\nI'll be leaving, no worries. Just like all the viewers that are not hardcore fans. Enjoy", "Any negativity can just GTFO", "@Erlos cya never wanna be ya c:", "@Erlos who hurt you?", "Are you okay? Did anyone hurts you or anything?", "I agree a little with the first, for some people it can be annoying, the second is debatable.\n\nPD: I still think there are better ways to say things anyway.", "HAIL TO THE GREAT YURI!", "I agree, Kiara needs to step up her game, and yeah they need better PCs hopefully they come soon.\nI don't know why people are hating and insulting you just for sharing an opinion, it looks like they're the ones that want to be hated instead", "@Mexican Honoka I agree too, but he should atleast word it in a better way.", "@Mexican Honoka Opinions can be respectful, which this isn't.  If you want to have an attitude over free entertainment, you're not the kind of person anyone wants to be around. It's also weak in substance and doesn't provide anything helpful.", "@Mexican Honoka I think it’s more due to the fact that the main comment comes off as rude and condescending rather than actual criticism. I do agree that I hope Kiara’s PC issues are fixed soon and she’s already addressed it I believe. Idk, there are better ways to comment constructive criticism.", "@ColdMoviez Yeah true, he needed to word it better, all I'm saying is don't combat hate with hate", "Kinda agree with the first, the second will hopefully get resolved in the near future, she's been having technical difficulties for a while now.\n\nNow, I love shipping a lot, part of the reason I got dragged into the Hololive rabbit hole was the yuri shipping. I feel like Kiara and Calli are an amazing ship lore-wise but their chemistry in stream is a little off putting because half of the time it's played for laughs and the other half a it causes somewhat awkward moments, I remember in their very first collab a very awkward silence was about settle in before Kiara went \"ANYWAYS\". Ironically, when Calli is NOT trying to go all tsundere on Kiara are the moments I like the most.", "@Mexican Honoka For sure! I think people are just being more defensive than usual due to Kiara already bringing up the issues on her other streams. I hope things iron out soon though!", "Imagine crying over free entertainment.", "@Doit XI it's 100% a bit dude. And \"shipping\" real people that have real relationships is horrible.", "@Zanpa shipping the characters is ok IMO, as long as one understands the character and the VA are two different entities. Thematically speaking, an immortal phoenix in love with the grim reaper is a super interesting concept I can totally get behind, but again some of their interactions rub me the wrong way."]