["That poor long german superchat got himself friendzoned in the worst possible way, hahaha", "timestamp?", "at 3:14:03, then she goes back to it at 3:20:57 and gives a proper response", "Ricky Capelo oh no. That was so awkward. Lol.", "@Ricky Capelo Thank you!", "Damn, it's so uncomfortable how long his text is. I still feel kinda sorry for him xD", "Robinstheles he just a lonely bro 😢", "Dude wrote a whole essay... is he serious?", "When he post it I kinda now where is he heading, big oof for him if he expects something.", "Her second response (the german part in particular) though was really wholesome.\nAnd being friendzoned by #TakaMori isnt that bad to be honest. Its just a law of the universe.", "@Knicklichtjedi Gaming thanks for a little clarification", "@Ricky Capelo The short version of the german part would be:\nDont run away from you fears (shyness). Just like a phoenix, face them and if you fail, try again. Kiara also had problems but she overcame them to live the life she wants to have.\n[Veeeery rough translation because Im not using my PC, but my phone instead.]", "he told her his life story. but the second part was sweet so its ok.", "what did he said? just a rough translation since i could not understand german", "that poor lad", "This is what happens when you ask for longer messages, jokes aside i think it was in one of her early minecraft streams where she semi jokingly said don’t just send K or a short message with red supers and how if she was giving pekora a red super chat she would write big paragraphs about how much she means to her", "@Jimmy Sullivan I laughed for an hour at this dude superhatting his lifestory.", "@Knicklichtjedi Gaming that's so wholesome", "found his SC's, he donated $500 and $100. oof", "Poor dude lmao", "Leute, packt nicht eure Lebensgeschichte in Superchats, ok? 1. Die meisten Zuschauer verstehen es nicht und 2. der Streamer kann damit nichts anfangen. Ok? Danke.", "Pretty cringey. I'm sorry for the guy, but please don't put it in a superchat, ok?", "she really  slayed him...", "Poor guy, let's Anschluss Kiara", "I almost rolled out of my chair cringe-laughing", "@Bombsquad85 The time has changed.", "3:18:07 lucina main said in the live chat replay Donator's Kampf had me laughing so hard bruh", "@Ksiyas ,,,,,,", "Fangirling when talking to Marine. I'd hoenstly be the same way. Shes one of us, and thus, one of us made it. Kiara is truly inspiring.", "Oh god we have a Kiara virus now", "@Renz Toledo there's 2 of us", "bruh", "bird flu has come to infect you all", "Indeed. I'll add you to my viruses list soon, as long as YT lets me", "You had that nickname idea too lol", "KIKKERIKI VIRUS I’ve seen so many on stream chat, even I was one at some point but I changed back because I saw there where so many.", "I’m gonna stay like this so we can conquer Youtube!", "There's so many viruses now", "Kiara: \"I used to be a professional MK driver in my previous life.\"\nFirst Race: avoids drifting, tricks, right use of items or any sort of basic MK skills\nAh yes, this is going to be good", "Then there's Crash Team Racing... 🔥", "I mean, she did say “she used to”", "@Miguel TG And she is an eternal being so who the hell knows how long ago she stopped playing lol", "Zeigen wir Kiara das mehr als 5 deutschsprachige Zuschauer anwesend waren.💛🧡❤️🧡💛 #KiaraFanClub", "Wird gemacht.", "Is' ja gut. Hier.", "Halts Maul", "Hier sind wir", "Nice, all the german watchers in one thread.", "ja scho", "Guter call! #KiaraFanClub", "Bin dabei", "Alter 136 das ist mehr als 5 ", "Für den deutschen #KiaraFanClub", "lugt hinter der Ecke hervor", "ja, das isses", "@Filoschki Bruh the hastag", "Hallo", "Wir sind viele", "Ich denke das weiß sie.", "@CH哀れな敗者 lmao", "Leider kein deutscher slang :::c aber war schon zu wild", "Jaaaaaa", "Ich werde gebraucht!", "Hi German bros!!", "De Wachtel kann ja auch Deutsch aus dem Gefieder zaubern", "Ja 😂", "Grüezi 👀", "und jetzt marschieren wir nach Russland, diese mal benden wirs!", "Debut: \"People say German is an angry language but its really not\"\nMario Kart Stream: Angry German Noises", "59:24 \"ich will doch nur einmal gewinnen im leben, einmal. Ist das zu viel verlangt?\"\nOof that hit really hard", "59:13 Fick.... würstel. Hahahhahahah", "Does that translate to \"I want to win just once in life, once. Is that too much to ask for?\"", "@無常 You are spot on", "Damn, that's rough.", "I don't even speak german and that hurt.", "A moment of silence for all of those who were fired from KFP...", "I just got that job.... Sad", "Actually, she rehired them during the superchat reading.", "@extralie Oh. I don't usually stay for SC readings, so I didn't know.", "Kiara at Debut: Want to make Yagoo proud \nalso Kiara: 1:02:12\nKiara?????: 1:02:34", "Lmao I didn't excepted that.", "Preparing for asacoco indoctrination", "Yabai Peko", "I’m so happy vtubers exist", ":O how did I unintentionally be the 69th like", "Some time after:\n 1:03:10 \"I want to be known as the pure one\"", "Also, a couple seconds later, a laugh worthy of entering HoloLivePK", "Looks at title...\n\"So that was a fu**ing lie.\"", "It was her previous life years ago. Mario Kart was a lot simpler back in the day.", "@Lalo dunno, Mario Kart used to have snaking...\nBut yeah, previous life", "Japanese fans and English speaking fans could unite in not knowing what she was saying during her German race (not complaining tho of course, the more people that can feel included in KFP the better!)", "If you need translations we germans are hiding everywhere, waiting for the right moment.", "@Zafran Orbian biding our time   ( ಠ ಠ )", "I dont even care. I just love hearing her speak German", "@Zafran Orbian \nDiese Kommentarsektion ist nun Eigentum der BRD", "I didn’t even realize she was German", "@Monkey Lol she's part German, part bird, part rage, all perfection", "Young Germans all know english, it was more for the memes than for anyone to feel included", "Are you guys sure she's complete German ( ͡° ͜ʖ ͡°)", "@Zafran Orbian Thank you Yukari-chan", "42:05 Prime Kiragerenglish\n\n“Ooooh, blue Panzer thing“", "Kiara confirmed to be a part of the 1940 Tour de France", "Kiara confirmed being friends with Erwin rommel", "Panzer has to relate to some kind of heavy weaponry, I only know this because of zoids where the liger zero has a panzer mode with big ass guns lol", "CupOfWhiskey it means tank/armour, so on the right track", "@Deathmarch419 gotchaaaaa", "Hehehe", "Amelia should really look into KFP's business practices...\nI'm not sure that it's legal to have your employees pay the business to work.", "Be carefull what u say...\n she knows the reaper ", "Zeit eine Gewerkschaft zu gründen!", "Wir reden hier nicht von so etwas ", "@KFP Eggu san dont worry, ame is the reaper's girlfriend after all, she is safe", "That sounds like communist propaganda pal", "My takeaways from this stream is that Kiara is into some freaky stuff...\n1:02:12\n1:02:35\n3:01:14 ", "Are any of us surprised in the slightest? XD", "Papa Huke placed her in the bottom left for a reason", "efdee what do you mean by bottom left ?", "@Distracting_Disaster \n\nhttps://youtu.be/oshIPfQjVBw", "whats a seiso sauce", "@H Vincent seiso means pure", "1:02:35 she is learning the ways of the pekora laugh", "Oh god, they're multiplying...", "its contagious", "Toxic Tenchou was not something I was expecting to see... but it surely hits different lol\n\nAnd low battery Phoenix is just adorable, take the good 10h nap you deserve!!!", "1:02:11 so are we just gonna ignore this", "Yes", "Someone will make a clip of it, I'm sure.", "What in the world. Lmao. Shes beyond bottom left now. Shes off the screen.", "Talk about gap moe", "@harborline765 already clipped,  i saw just now", "@shadowmaverick15 You got da link?", "@harborline765 https://youtu.be/Gr_RJ3qCCtU\n\n there", "@shadowmaverick15 Thanks", "@harborline765 no problem", "35:30 for my fellow germans, today's highlight", "54:17 for a full round in german", "@YellowCake yes but this was really funny imo", "Ah vielen dank meine freunde ", "@DodoFriend Grüß *GOTT*, yes I know haha", "Ich danke ihnen", "\"grüß Gott\" oh nein sie ist ausm Süden.", "@Zafran Orbian mia san mia", "5 leute sag ich da", "Zafran Orbian \nIch bin 100% sicher dass sie n Ösi ist. Aber ich mag sie trotzdem", "Diese Kommentarsektion ist nun Eigentum der BRD", "@Dr Eichelpirat „Trotzdem“? Na vielen Dank auch, lol", "Joe Van Hansson \nHaha war natürlich nicht ernst gemeint", "@Dr Eichelpirat Kein Ding, hab es auch nicht ernst genommen hehe", "What does it mean?", "@Quarter Ring „Grüß Gott“ is a phrase used as a greeting. Literally translated, it means „Greet god“. So she basically yelled „Well, hellOOO“ while passing that person by, lol.", "It is still disputed if Bavarians are really Germans :)", "@Dr Eichelpirat Kann sein, ich würde aber eher auf Bayern tippen, die Ösis haben einen auffälligeren Akzent.", "@Bombsquad85 sie ist Ösi, confirmed von ihrem alt acc (den ich nicht sharen werde um ihre Privatsphäre zu schützen)", "3:01:14 For Lewd chicken O7", "Thank you I've been looking for this for so long  XD", "You wouldn't believe how much I'm looking forward to that collab with Senchou. I'm sure it'll be amazing.", "Im so glad they’re swearing more freely because it shows how comfortable they’re getting and that they aren’t as worried about their language anymore", "Makes it far more genuine too", "That moment... we Realized we need a German translator, but also not... because Kiara's german is very cute.", "It is! Would people be interested in subbing the german parts of the stream?\nI could provide english subs once Im at home again.", "@Knicklichtjedi Gaming yes, I for one, am interested in German - en translation", "@mikel ramos Okay! I'll message you  here again next week (mo/tue in EU) depending on when Im home again and how long it takes me to sub the video.", "\"Die 5 deutschsprachigen Zuschauer\" haha you are underestimating us :^ )\nAlso: \"Fickwürschtl\"\nBOTTOM LEFT! KNOW YOUR PLACE KUSOTORI!", "Just put German in the title, Ein Volk ein Reich ein Kommentarbereich", "So muss das", "Jo", "Timestamp pls", "@Brian Huber 59:13", "This stream was superb. Today our birb had a brilliant spark. I pray she never loses it.\n\nAlso, props for destroying the poor man harder than Ui-mama would.", "56:17 German Round", "Vielen Dank!!!", "Guten Abend.", "This is german only race?", "Kiara might not have won first today but she definitely drove some first class banter for 3 hours!", "Win our hearts ", "@KFP Eggu san true that", "I just want to remind everyone that Kiara has an amazing singing voice, so despite what the content here might show, she really is an idol.\n...", "If you have to constantly remind people that someone is an idol, that’s how you know it’s true.", "@Vgamer311 He's trying to to convince himself", "🐔👄 Kisses Timestamps:\n\n1:49:59\n3:04:58", "Kiara Kissing ASMR when? ", "We got a lot of Chu today", "I think you mean pecks", "Word of the day, SOUP", "I'M AT SOUP", "@shingshongshamalama WHERE", "Kevin doesn't like wet foods.", "Tips\n\n Max start boost- accelerate right after 2 appears", "Wait this is actually so helpful for someone like me that only picks up mario kart every once in a while. Very useful and digestable info here, thanks!!!", "Kiara's kart skills reset to zero when she reincarnated it seems. Her commentary, for what I caught, was pretty great though.", "I think this was my favorite Kiara stream yet.  There’s always something special about seeing V-Tubers rage - this kind of salt is nothing if not genuine", "Everything is said and did for the 3 hrs was hilarious I couldn't stop laughing", "Missed the race and only SC I was there but Kiara just told me the summary of it so didn't missed much. At least you did your best Kiara. Not being last at all. Thanks for the stream.", "hello i hate anime. remove your anime pic", "Bruh", "OK this is by far Kiara's best stream.  She was so goddamn funny during this stream and genuinely.  And yeah.  Bad.  But you have to be bad to get good someday!", "\"That german guy doesnt look safe for my broadcast\" Nah, He's just an honest painter.", "Is Mario Kart hungry? No Mario Kart 8", "daaaad", "A+ pun", "Oi! yametekudastop", "straight right to Ina's dad jokes stash", "@LuisEdGm gomenasorry", "2:53:59 - We were blessed with head pats today! ", "soup", "SOUP", "Indeed", "Context?", "@TRAWESS it's a long story. 20 pages to be exact", "@TRAWESS word of the day", "@TRAWESS context: https://twitter.com/Vgamer3111/status/1314230663080488965?s=20", "Soup", "@Vgamer311 bruh that's amazing", "Tbroアイソトープ Anything for a good meme.", "@Vgamer311 thank you 🙏🙏🙏", "1:12:55 - 1:13:15 is my favourite! (German)", "kiara and bullet bill. Mention a more iconic duo, i'll wait", "Aang and Momo.", "I have to say, the superchat reading sections are always as entertaining as the rest of the stream.\n\nWe get some wholesome moments as well as stories of Kiara asking Marine how she deals with being horny lmao", "Ina has mk too. Can we get a hololive vs hololiveEN Mario kart collab", "Loved the superchat reading today", "Hopefully you'll stream Mario Kart again in the near future so I might match up against our Mighty Chi- I mean Phoenix!", "Kiara solidifying her bottom left rank as usual, I love it", "Salty Kiara is everything I needed today, honestly. I'm here laughing my ass off at this.", "Damn, nearly 4 hours \nThat stream was so entertaining, I loved it when she suddenly was so salty that she only spoke German\nWunderbarer stream!", "3:31:22 Kiara says a phrase from her fave senpai", "\"ihr verdammten Fickwürschtel\" i'm completly german but never heard this insult xD", "\"47 hours gang\"\n\"Soupology\"\nWe did it! she said the soup word!.\nFrom ~Otaku Emperor", "all is well until Ahoy ruined my life", "Why does this chicken have such an amazing angel voice?", "Viel glück beim nächsten Versuch einen Sieg zu ergattern.\n\nMit Training wirst du die beste.\nDIE BESTE!", "Do I smell a coldmirror reference?", "nette anspielung ;)", "@Joe Van Hansson We need to represent the german culture somehow right? Coldmirror is german culture.", "@Zafran Orbian Yeah, she‘s an icon, lol.", "Chicken has smol brain tho", "Wir glauben!", "It literally comes down to practice and experience.\nAlso it probably doesn't really help that the last real MK she played was on the Gamecube and especially on phone... learning the courses and the handling and all. BUT this way the stream was actually more entertaining! XD", "58:13 wo sind die anderen 4?", "Ja. Hier.", "Immer dabei", "Hier", "2 hours in and this stream is an absolute blessing! So entertaining! ♥\nAlso: The german-only round was pure gold!", "The steering wheel on the avatar was such a nice touch. Thank you for the stream Kiara!", "it works really well, too, visually.", "58:15 More like 130+ german speaking viewers. Wir sind überall :)\n\n59:15 Ha, bavarian accent slipped!", "When she started talking about not getting a driver's license at 45:00 I felt that. I hate driving and I get a lot of hate because of that...", "I've been in pain this week working my ass off and now i'm in pain from laughing my ass off. Kiara is too damn funny. ", "Ah, learning German has finally started paying off", "1:02:36 She did it she do the ULTRA PEKORA COMBO!!!\nAlso I think kiara just give up and it's breaking the barrier of bottom left in every stream", "I hear you have been in communication with Marine. That's so cool Kiara, I am happy for you.\nA bit of unsolicited advice: I heard someone once say \"You can either be a fan or an equal; you can't be both.\"\nI'd continue being a fan if I were you, I just wouldn't let it show when I interacted with the rest of them. Well... maybe I would fanboy a bit at first, to get it out of my system. 😉", "I joined in the stream about halfway into MK and it was complete chaos in the best way. You may not be first on the track, Kiara, but you're first in my heart <3", "this is the most pure girl, a true idol, she is the definition of seiso, an this stream confirms that. Her hapiness is our bless. Hail chicken", "OMG my stomach can't resist this laugher, I almost die. Best stream ever thanks for the fun Kiara!", "I specifically checked the chat when she said \"show me your banana\" to see how many people were saying lewd", "This was a great stream 😂", "Heartwarming Kiara Streams light up my day all the time. Keep on chugging, and enjoy your new pc specs!", "1:13:05 i do not understand. But i will leave this replay button coz it sounds so hot", "...And then God descended from the heaven and said \"Viva la kiara carajo\"", "The last time I heard a bird swear was when the parrot meme went live", "Finally. A Vtuber who speaks my top 3 languages 🥺💖 (next I want hololiveFR xD)\nIt's odd to see something tailored so perfectly to yourself 👉🏻👈🏻", "Lol wth did marine say to you?!\nBtw this was a pretty fun stream. Maybe do some multiplayers with the pc every now and then", "I need the timestamp for when she ragequits", "Loved the stream! I actually fell asleep halfway through superchat time. 🤣 Kiara's voice is way too comfy. (And maybe because I was a little tired already too...)", "“I’m using tilt controls!”", "I love that she speaks 3 languages \nIt adds a lot of depth to the streams", "KFP is such a Dark Company, Used to work as a Janitor.\nHighly Recommend this Job!", "Sitting through replay of this stream is probably the best thing I did today at work.\n\nKeep it up Kiara", "LMFAOOOOO I wish I could have  seen this liiiiiiive! XD Omg Kiara. You certainly are a fire to behold! ❤🧡💛💛🧡❤", "This stream screams bottom left. I love it. XD", "Kiara was way too powerful, and she didn't wanted to humiliate the other players by taking various laps on advantage, she's so kind 😊", "The pattern was complete, kiara chad say I'll help yagoo dream and this is what happens", "ah yes the true power of the german race... questionable way to word it", "キアラちゃんはかわいいし、おもしろいし、さいこう！！", "Oh oh I'm learning German as a course rn, I could understand what u said. I'm not German tho, just school requirements to learn a language...", "15:23 \nOho don't threaten me with a good time", "So sorry, I fell asleep towards the end of the Super Chat Danke schön session. Way past my usual bedtime. Anyway, thanks so much for the wonderful livestream! Continue just being your wonderful and sweet if a bit yabai self, Colonel Kiara 店長！Kiara Fried Phoenix shall be unstoppable! 🐔❤️✨", "Aaaaaaahhhh my heart!!! TuT", "1:02:25 Und in diesem Moment, hat sich Kiara in ihren Senpai verwandelt.", "Love the streams :) Keep the excellent work KIIIAAAAARAAA :D", "Oh nooo you have the  FLU??? XDXD", "Blessed by the B O I N G", "I dont watch Kiara often but I hope she gets more subs, shes so adorabable", "可愛い(❁´◡`❁)*✲ﾟ*", "Damn it, I fall asleep before the pumpkin soup announcement... Sad that I can't celebrate it live with the pre chat gang lol", "soup gang", "I think I've never laugh this hard at a Mario Kart Stream", "I would audition for hololive just so I could be the only actually good racer in the hololive crew", "Missed the stream because of the time zone :'(", "Great stream as always!", "1:03:58 love the dedication helping Kiara not be last", "1:02:09 \nKiara gets freaky.", "23:51\n\npain - arne", "That thumbnail tho lmao", "Kiara: German, English, Japanese, Bird\nIofi: Indonesia, Korean, Japanese, English, Alien\nLuna: Japanese, Nanolish, Child\nCoco: Japanese, English, Gangster", "Her laugh is sounding more like Pekora's now lel", "Coming here from plague of gripes", "anybody knows when artemis popped up in chat?", "At the very least her rambling is cute af", "56:37 German-only race", "I'm not sure, but I've read around that the whole ''Idiots don't catch colds'' comes from the fact that idiots would deny being sick with a passion and not get proper rest.", "Not quite enough to fill a lobby but I literally was watching the stream with 7 people ready to run the track backwards like true kfp employees.", "OMG YOUR SO SWEET AND GOOD GERMAN \n\ngrüss gott ;)", "XP Penalty seem pretty heavy at tenchou racial resurrections lol", "I wish I could have played. The code was going to a complete different person. ;-; I hope there's new streams of MK8 in the future.", "Probably a region thing. If you're 'murican, you're probably not gonna connect to her German server.", "If the room where Kiara is in is full the game creates another room for more people. It's the only way how 100+ people can play in the same tournament. Unfortunately this doesn't work well if you want to race with a specific person but there is no better alternative in the game.", "@Nintendodsi1000 Is her server German? Her flag is Japanese in game, so wouldn't that mean she's currently in Japan?", "@Jon Paul Cuellar not necessarily. You can set region freely on switch. Despite living in America, my switch has no problem letting me use a Japanese account.", "@Nintendodsi1000 That's not how it works though. I played with people of other regions and in this case we were using a code, it wasn't a random match.", "I keep reading MK8 as Mortal Kombat 8 and forget what year it currently is", "At the 2 hour mark I went to turn it up but it was at full volume. very odd that she is low volume today.", "Can some German bros translate her salt plz. Thank you.", "Man I am feeling a slight bit of Deja vu at 1:02:010", "Welp i didnt watched the whole stream", "はやくぺこらとのカップリングが見たいネ", "Im so sad because i didn't watch them in 3 days because of my modules", "1:37:19 PEOPLE is she a chicken or a Phenix? I'm pretty confused about that", "Kiara do you need a hug? :o", "Im soo happy im an egg in the big KFP empire great stream ", "Ich glaube Kiara unterschätzt wie viele deutschsprachige Viewer sie hat... :p \nEs sind definitiv mehr als 5!", "Unsere tarnung ist zu gut.", "Yep", "Es sind nämlich 6!", "@SilentTripmine das kommt wohl eher hin! Vielleicht auch 7, wenn wir großzügig sind.", "Commenting to help out best birb with the algorithm.", "It's ok lady bird, you still a better driver than Fubuki.", "SPEEEEEED!!!", "Aah, she's playing at 150CC... that would explain it.", "Good games Kiara. That was really fun", "Idk why but I love her laugh", "I wanna see a Mario party collab", "I bet she is from Germany", "Don't worry Kiara, we still care and belive in you, never let anyone make you doubt that ( not even Amelia kk )", "2:47 stream start\n10:05 game start", "Did she already said \"Tuturuuu\" in a video?", "One of the best streams", "jokes on you! she was using tilt controls the whole time", "wow she's impressively bad.", "new light novel", "Hololive DE confirmed", "Bloodwing in corrosive form", "when does she fire all of KFP?", "I love this Kiara lol", "Excuse me what 1:01:02", "56:21", "Local phoenix so angry she swears in german", "Having the capture card not detecting the switch because a cable wasn’t completely in is such a kiara thing lol", "I am speed.", "Take care of yourself Kiara.", "Kanns kaum erwarten, Pekora best girl und Senchou no.2 Das nenne ich Geschmack.", "the great bird comedian strikes again", "1:06:32 - Based Kiara avenges Gen 5", "Based. Jannies love mountain german bird now", "@KaiserKrieger HE DOES IT FOR FREE", "サムネずっとみてられる", "Spoiler alert...", "Kiara Sumacher, claramente más parecida a Ralf", "Kiara’s laugh is the perfect mix of Pekora’s combo-input guffaws and Pikamee’s tea kettle wheeze.", "kiara showed us 2 things today: madcuzbad and angry german noises. both are a blessing.", "I have to ask, I know she was super tired but was she drunk to?", "結果は残念だけど、かわいいキアラちゃんが見れたのでヨシ！", "43:52", "Kiara had the bird flu", "Kiara was so fast the game lost count of what place she actually was.", "Calliope please come get your wife she is going insane from sleep deprivation.", "Kiara is last in Mario Kart but First in my heart", "Hi hi!,,, popping in after seeing a clip of you in minecraft constantly crashing... Try installing a mod called OptiFine if that help :D", "❤️", "This comment section has invaded by germans. Hide me please", "Oh wow didn't expect her to talk about the autobahn and Maybach as well.As a petrolhead I really should pay attention more to her MK streams,if there's any more in the future\n\nAlso now somebody tell her about the Blitz R34 and the Nordschleife as well", "2:15:10\n3:31:00", "she has the big C.   ", "BOTTOM LEFT", "1:02:13 no context", "Her laugh is so ↗↘↗↘↗↘ like Pekora's.", "1:02:11", "1:02:07", "I wish I have more money to join Kiara Division", "best bottom left vtuber", "German Speed Demon-Phoenix MonkaS", "There's something so hot about a fully grown woman acting like a complete egg head.", "1:02:11 pardun?", "Finger lickin good :)", "Diese Kommentarsektion ist nun Eigentum der BRD", "Its odd that she is more quit but she says its the highest it can be, has her mic broke already??", "Any German translate channel~? Please show me~", "We wouldn't be here if German youtube was any good. Sorry.", "we need more kiaras. german roads goddamn... i always get choleric bcs of all the idiots that ignore even the most basic rules.", "Kiara with that niziu reference further cements her as best birb", "Noice chicken", "Nun ja ich gehöre zu den 5 die deutsch sprechen aber englisch verstehe ich trotzdem :D", "hühnersuppe beste suppe", "The simpcringe is real in this game.", "Kiara pls, poor Yagoo", "\"Poor Yagoo\" is swimming in YOUR money.", "@dupin9 He's wiping his tears with 10,000 yen bills like in Zombieland", "Hello", "Hallo", "Guten Tag!", "Wunderschönen guten abend ", "Also ne man wenn ich sehe wie sie in die Kurven rein geht ohne zu driften bekomm ich eine  zu viel ne man🗿\n\naber trotzdem zu wild", "Adolf Mii is too strong, please nerf.", "whats the timestamp?", "Although Kiara can revive from many hit and run accidents, she decides to not get a license so she doesn't pay for car insurance. Even beings like her can't evade insurance fraud.", "バカは風邪をひいたことにも気づかない。つまりキアラちゃんは天才。　Q.E.D. 証明終了\nおからだはお大事に。\n\nちなみに1位になった周回のタイムスタンプはどこですか？", "17:44", "Fuck i weiss wer die Stimme ist. \nAlso ich glaube es wenisten zu wissen.", "the german guys mii is literally adolf hitler", "Based.", "The Third Reich would be glad to have Kiara as a Panzerkampfwagen driver", "2:22:29 Awww, Iove you too, kiara.\n2:22:37 No, YOU're the best. Thank you so much though, you're too sweet.\n2:44:24 I have to say, its always a little frustating when she laughs at my superchats but doesnt read them. not because ive been \"passed up,\" but because usually I cant even remember what the joke was. I want to know what I said that was funny.", "Lollll didn't get to see it but man the chat's reaction is too funny", "Only watching the archive now. Actually so damn happy she noticed the nonsense in the prechat and that soup got a shout out. Great work team ", "Damn. Lol that even reads out hilariously as a recap. XD prechat is where it's at, I swear.", "I can’t believe myself searching rule34 of kiara and the others I should go to hell", "...so? Did you find something good?", "Dark corner of the stream i see\nDont get cought boys", "HELL YEAH", "Wie gut sie einfach Deutsch spricht. Wie viel Talent hat dieses Mädchen bitte mit Sprachen. o.o", "Obviously Kiara was losing because the steering wheel isn't moving", "To be honest when she speaks german it kind of sounds like she normally speaks a southern dialect or even austrian german, some pronunciations are of little bit. But maybe she lived abroad for a longer period of time and her english/japanese is mixing in her german, anyway I notice her accent/dialect (which is pretty cute btw).", "Wasn't she Austrian?", "@Kaii Ayren Nevaeh that would explain why I hear a dialect, but I am not sure.", "Schon mal darüber nachgedacht Synchronsprecherin für Anime zu werden? Die Anime Industrie könnte n paar Personen mit echten Deutschkenntnissen gut gebrauchen.\nEver considered the idea to become a Voice Actress for Anime Series? The Anime industry could use people with actual knowledge of german. Considering how often we hear \"tried-and-failed-to-be\" german in Songs or Sentences.", "Weisst du was das schlimmste ist Kiara. Kusotori.... wenn du das ins deutsche übersetzt ...könnte man sagen \"Kackvogel\" ... ich lache ein bisschen zu sehr darüber XD \n\"du kackvogel\" ohman. XD isn tolles \"schimpfwort\"\nWenn du deutsche Süßigkeiten vermisst und Hilfe brauchst, zwinker 2 mal in meine Richtung.", "Janitor jokes... disliked", "Janitor jokes, liked.\nFrick jannies.", "ARE YOU OK JANNY?"]