["I can't believe people are gate keeping who and who can't join the server it's none of their goddamn business and it was okayed by everyone on the business side of things it's really nothing to do with them", "If only they knew this was the man behind Black Rock Shooters and Steins gate", "@無常 😩", "@無常 we know. But this is not that worldline.", "@Otakulator So why do you wan't to kick someone who did nothing bad, then?", "When you go watch vtubers to avoid RL drama, but it still finds its way here... Human goddam beings.", "@Sora I dnt, but i cn't explain, because the cnsor delete my comment every time. Maybe i say a trigger word.", "this is the first time i’ve heard of someone gatekeeping something they’re not even part of themselves 🤔", "@Unpopular Opinions read the 2-kun archive they will explain.", "Why can't those people just let Kiara and the girls have fun playing the way they want to? She sounded excited about playing with Papa Huke, and the control freaks decided to scream out in hate for some reason. I just want to see Kiara smile and have fun and she does that most with people she loves to be around. Let the birb play with her papa!", "It broke my heart when she explained it. I thought it was so sweet that Kiara invited him and that he wants to help her work on her project in Minecraft.", "It's simple, jerks like them want to feel important so they overstep their boundaries to get involved in things that don't really affect them. It was none of their damn business who was in the server.\n\nI hope Huke can come back someday. :/", "cuz they don't understand relationship lol", "But what did they do exactly ? as she said 'there were few complaints', but I didn't see any to be honest..\nAnd I've seen people saying that this is the reason why holostars don't collaborate with any of the girls. But those kind of collaborations only help everyone, more views, more friends, more exposure, more variety..", "Man that sucks.. there's probably less than 50 people who complained while everyone was actually happy and fine with papa Huke playing with them on the en server.", "Because they can't join", "It felt sad as hell watching Kiara take down huke's room, especially when she found the secret room... I wish she could have at least left it there as a reminder to what could have been, but I guess the same idiots would have continued to complain", "@Jkhmonkey KFP IT Hardware Department #2 \nHe's not even doing anything wrong and apparently people just don't want their fantasies to be ruined.", "Agree , Papa Huke is awesome , I just don't know why some people complained .", "Agree , Papa Huke is awesome , I just don't know why some people complained .", "He cheated in a crossbow that had enchantments that are impossible, it makes you wonder what else might have been cheated in.", "@scooby yubi doo it's impossible?", "@Glazer YoRecca Yes, it had enchantments that crossbows can't have without using cheats.", "@Glazer YoRecca how do people still believe the vtuber is their property? They're here to give everyone a good time not to be your girlfriend.", "@scooby yubi doo timestamp for the crossbow?", "@Misheru I don't have one. Apparently it was during Ame's stream. https://www.reddit.com/r/Hololive/comments/jlcxpg/sad_day_for_huke_papa_your_sacrifice_will_not_be/gaocoeq/\n\nThere was more info on /hlg/ but good luck sorting through posts there.", "@scooby yubi doo \nits not about cheating in items\n\njapan has a \"idol culture\" where many idol fans don't want to see their fav idol around men or dating men. this is why fuubki says \"wife? no! friend! FRIEND!\"", "@JimRaynorRaider Dude, I've been watching Hololive and vtubers for years. You don't have to explain anything to me about idol culture, which is irrelevant to Western vtubers.", "@scooby yubi doo Yes, which meant that the enchantments were completely useless, meaning the thing was no different from a regular crossbow, which meant there was ultimately no harm done.\n\nBut also, why the fuck does it matter if he cheated? In fucking Minecraft of all things, especially when it only involved giving a crossbow some enchantments that it can't even use? Not to mention the fact that he was even ", "@Ryan Bartido hahahaha", "@scooby yubi doo it\"s minecraft. who the fuck actually care about a damn crossbow?? they literally already cheated before to find the coral biome. it was in his chest right? that means it was for him, not them.", "@James White \n\n🐶😙🎵", "@scooby yubi doo And WTF does that matter?! They can play however they want with whoever they want, wtf gatekeep their fun?!", "@scooby yubi doo its a game though, if someone doesn't like how another person is playing they shouldn't watch, but I guess you can't help kids or 40yr old virgins lmao", "@scooby yubi doo You sound too serious stating what the \"issue\" was... So you are in the same mindset as those who complained, the goal is for EN server to catch up with the JP one and a fucking enchanted crossbow was not going to speedrun them to said goal, if that was truly the source of the complains, ppl need to rethink their life priorities", "@Warlock Warlord If you say so lol. I'm going to go take my daughter trick or treating then drink some beers with the neighbors. You guys have fun doing whatever it is you do.", "@scooby yubi doo dude why flame him though for something like that. As long as you enjoy minecraft there’s nothing wrong with that", "@James White Is this the new chinese-anti copypasta?", "@scooby yubi doo who the f cares if you have something rare on freaking minecraft?? That's Huke, a living legend in the anime industry, he can do whatever the fak he wants", "@scooby yubi doo but\nwho\ncares", "@scooby yubi doo a crossbow isn't rare anymore tho, and useless enchants aren't either", "You can put those enchantements in an anvil but it would be useless (you can enchant basically anything in an anvil). You guys Just wanted Huke out of here", "@Ryan Bartido chill out my dude, he was just giving information, he didn't say anything about wanting to ban papa huke", "I don't know  how many people who hate Huke papa.\nBut here, I like you Huke.\nThis is my voice.", "Agreed tbh he probably the best player in the en server hope he is able to play someday again", "@Otakulator cheating? What?", "@Frobsons desenhos Nvm. The story outdated.", "I feel like Hololive capitulates to the complainers way too much. It should have been \"Huke is staying. Deal with it.\" 99.9% of people either didn't care Huke was there or actually liked him.", "I’m so confused, what happened to him?", "It's a sad day for the internet, I knew Huke for Stein Gate and MGS.", "@Beowulfis1 He helped to the girls some admin magic, plus he crafted some stuff, and many ppl disliked that.  The gamers because the cheat, the idolfans because he's a guy. But nvm its official the holoen server is fun server not survive. I cant say more, because my answer will deleted again.", "@Otakulator ohhhhhh ok thanks for the explanation", "Justice for huke. Seriously the vocal minority makes it so hard to have nice things in the world these days; they're shitty people whose only goal in life seems to be to make the lives of others to be as shitty as theirs are.", "Because vocal minority can do most exterme things to satisfy their demand and achieve their goal. Just like they do with Aloe and Coco. Nevertheless F for Papa Huke.", "AGREE , justice for Huke Papa , he is awesome and nothing can change the fact", "@Infamous Hudson Thats's called the heckler's veto.", "@James White if she became independent she can't get much support that she get in Hololive like making MV, getting sponsor with other company, collaboration with famous artist and musician, making her own merchandise, etc. And 400k subs in one half month can't be achieved if you're independent without any support from company.", "@James White Please don't point the finger at the Japanese side as a whole, we don't know where those complaints came from. I saw a tiny minority of creeps in the western side during the whole Aloe shitstorm too, and a tiny minority is what made this happen. Besides some of the Hologirls break that rule and collab with guys all the time (Fubuki, Matsuri, Luna etc) so I don't think that rule is necessarily set in stone.", "I find it lovely see you guys stands for kiara but i have my opinion:\n-I think you guys overprotecting her. If she your favorite youtuber, you should know that she is a profesional vtuber, who can handle herself, even without you guys, im sure she can do it. \n-we are talking about internet, what do you expect? Even a community could be toxic sometimes ,especially overseas fan", "@James White thats great, but i think she never reach 1 mil by herself, just like gura say, its all because us and her hardworking senpai.", "@ber liana What are you talking about? How is complaining about people being assholes overprotecting her?", "@Hælendleof Loc, KFP Scrub im just thinking mostly people commenting those antis instead enjoying or praising kiara stream. No fun\nEdit: in this comment section i mean", "@ber liana I respect your opinion but I respectfully disagree. Being overly protective would be to at this point go on a crusade to track down the people who complained, and ensure they stfu or forming some kind of censorship brigade. That's not what we're doing here. The point here is to air our frustration and displeasure at how a small number of unpleasant people have a tendency to ruin things for the majority. It's a difference of saying \"that sucks, let us form a shield around Kiara so that she is not hurt again\" and saying \"this fucking sucks\". I'm saying the latter.", "@James White Dude, we've been through this before. Dont lump all JP fans in one group. It'll only cause unnecessary hatred.", "@James White According to Kiara herself Cover was the one who have the Ok for Huke to be there on the first place and it was Kiara's decision to remove him  so that he stops getting hate, however small it must have been tho cuz o didn't see any...", "@James White there definitely is a very toxic part of Japanese culture regarding the purity of idols yes. However don't underestimate how bad it gets in the western world as well, where some simps will freak out and go ballistic the moment, for example,  they find out their goddess has a boyfriend. Extremist simps are extremists, no matter what part of the world.", "@James White in this case, it wasn't any Japanese idol fans causing trouble, but gamers who were saying \"it's not hardcore anymore\"\n\nPlease don't lump everyone in your overgeneralization", "@Jkhmonkey KFP IT Hardware Department #2 about western world im agree for example pokimane, anyway thanks for your opinion, its great to discuss something that doesn't affect to me at all", "@UC_-3YIhKsMM0TW9y4OYcZig Not trying to offend you but you sound like those hololive antis that try to divide the community. you are even more suspicious when I saw you spamming the same message under other comment.\nIf you are not a anti then, I take back my doubt, I just want to tell you its not always japanese society is especially the fault here, hardcore simp can be anywhere though, its that simple.", "People who were mad about Huke on the server need to get a life. Just let Kiara do what she wants. Great stream otherwise. Love seeing her approaching the KFP goal.", "I know it was an extremely small amount, but anyone who said \"No guys\" should instantly get a permaban. Kiara and Huke are both treasures.", "Context? I haven't watched the whole stream, what do you mean with \"no guys\"", "@Robinstheles Its at the start, Kiara explained that she had to Ban Huke Papa (Her Illustrator) bc some Hardcore Simps got mad a him being in the server", "@lKoPal wtf? What a bunch of weirdos", "I can't think of a single reason why would it be bad if their friend (Huke) play there as well. They had their manager playing the game with them on Left 4 Dead stream with other members, but chat even wanted for the manager to play and not be afk so ai would take over..", "Needed timestamp where did all started", "@DVDwr it's probably because the manager was a woman.", "@Steve Smash Bros please delete your first comment, it can lead to unwanted rummors about their personal life.", "@Steve Smash Bros Please delete this.", "@lKoPal Where's the proof of it being over the fact that he's a guy?", "@Mike Barnes he's made irl appearances to promote brs merch", "@Coolkid Gaming Read my question again you clearly miss read it", "@Mike Barnes i see", "@Steve Smash Bros wtf? you are taking this way too far", "@lKoPal Well that's probably what happened but we still don't know what the complaints where, kiara never specified anything herself, and nobody saw any hate towards Huke here. I have however seen ppl getting mad at him for allegedly using cheats to enchant his cross bow or something both here and on the reddit.", "@DVDwr I wonder what would've happened if Huke was a woman, or if EnMa was a guy...", "It wasn't because he was a guy. He cheated an item into the server and that set off the \"purists\" who didn't like that. This is a few \"hardcore\" gamers mad the game was being cheesed a little.", "@Ethan Matz worst part is he didn't cheese anything. The bow he made was useless, it was supposed to be a funny reference to Kiara", "Agreed. And everyone who hated on him simply for playing the game the way they want to doesn't deserve Kiara or any Hololive member.", "What I realized is that Kiara didn’t let him go simply because a minority of people were complaining, but because it was her papa that was involved. If the hate was against her, I’m sure she’d be fine, but since it was her papa, and the fact that haters do exist, and could potentially affect him, she had to make her choice. She wasn’t gonna allow even the possibility to exist because of her because she cared too much. And that’s something I truly admire. I hope I didn’t misunderstand. o7 viva la Kiara~", "I highly doubt they could do anything to Huke.", "@MrJc They can't. He himself was in the chat going RIP Huke lol. But it still hurts Kiara to see that so it's understandable why she made that decision. \n\nIf you know a loved one is getting hate, even though you know that they can take it, it'll still hurt to see.", "just fyi he isn’t her irl papa, he’s just the one who designed and drew her", "@Unpopular Opinions yeah, we know that lol. She's the father of the character Kiara.", "Where are people who wanted him banned now? Nowhere to be seen, they ruined your content and have now moved on to ruin someone else’s fun too", "Oh wow, so that happen to papa Huke. I kinda miss that explanation maybe because I was kinda late on the stream until I scrolled down in the comments.Damn, a shame too. I do have some hype for Huke to collab with Kiara again and I honestly won't mind it at all like all KFP members do but that ban had to happened.  Good for Kiara sticking up for his papa and respect for Huke's decision. But sheesh on those people who had to make such a big deal out of Huke being in a minecraft server. SMH", "Thanks for the stream despite knowing all of it now for me that is,", "That's the dark part of internet. We just need to report and block them.", "I'm out of the loop. What happened??", "@meinelust She talks about it at the start of this video bro.", "There are horses in Minecraft, you could make a parking lot for those.", "I like your comment", "Man, that sucks. I'm really sorry for you, Kiara, that some negative people are ruining the fun for you and your father. I would have loved to see you and the other girls play together with your father sometimes. But that's the internet. Some people are always complaining. :/\nNimm's nicht so schwer. Kopf hoch! :)", "If we aloud the loud minority to get their way we will never have fun. They should report, block and keep going...", "This is why we can't have nice things.", "Wow, like, what? Are they in gradeschool? Getting jealous over a teacher's favorite? Are they supposed to be the management now? They really are full of themselves huh.  \n\nHuke papa didn't deserve the hate. ", "Bring him back and shut the haters up", "Up", "Up", "Facts", "Someone : No u cant inv him to help you\nAlso Someone : Backseating in chat", "damn right... :D wtf ??", "this is the most accurate comment i've seen", "What's backseating?", "@Frobsons desenhos it's when you're not driving the car (playing the game) and yet you insist on giving the driver (player) unsolicited directions", "@ライショイケークス so basically it's a person that it's not playing telling other person how to play?", "@Frobsons desenhos hahaha yes exactly", "@Frobsons desenhos yeah.. :D but in this case its not a person but 3/4 of chat lol", "Honestly, Kiara is such a sweetheart... She didn't take down his house to appease to the haters, she just wanted to keep the haters away from him. We love you Kiara 🧡🧡🧡", "We had no issue with Huke appearing in the server so it really sucks that the vocal minority won out.\n\nIt’s not a “GIRLS ONLY CLUB!” people. Would you have made such a fuss if it was someone already established like Roberu or one of the Holostars? What about Yagoo? If he was in Huke’s place somehow I doubt that they’d be crying so much about it.", "God that's so sad... Both the fact that Huke can't go on there anymore, but also the fact that people with this shitty mindset exists. Just ban them, you'd not lose out on much tbh.", "Is this why the chat is disabled ? or is it something else that I can't see chat..", "@Kefka Palazzo Exactly. Those people are probably the same ones that were trying to Stream Snipe the girls in the Left 4 Dead stream before their manager took the 4th slot.\n\nWhat kind of message do they think it sends when he appears in Chat and everyone is generally cheerful towards him but the moment he tries to actually play a game with the girls the vocal minority lose their goddamn minds? Freaking out over the fact that a guy is living with THEIR idol.", "@DVDwr I think chat just isn't available after the first few hours of the stream being archived. It should appear some time later.", "@DVDwr It sometimes takes a while after the stream for the chat log to become available so it could just be that? I missed watching the stream live so I couldn’t tell you what it was like.", "@Christopher Doran Yeah, I completely get it... It just sucks that these people even exist. I can't wrap my head around this mindset even slightly.", "@DVDwr it's cuz Kiara had to cut something out of the stream and that disabled chat", "I think the complaint is that he was cheating in items that you can't even get in the game. We know he did it with the crossbow, so it raises questions about other things.", "@scooby yubi doo I mean, if that was the complaint... Then just tell him to stop doing that, and if he keeps doing it, THEN kick him out? Seems a bit petty otherwise...", "@Kefka Palazzo honestly having other people than the idols makes the server more lively and entertaining and adds to the lore. They should bring back Huke-papa smh", "@kb Yeah exactly, the more the merrier.", "@Sammy x But this time she didn't mention about it on twitter like on her last stream when she had to cut a part of it. She has to fix the streams one after another, hope she's feeling ok.. I see, she did cut something out at 6:51 it's hard to tell, but you can see by looking at her model as it would never lag like that. But I'm not sure why did she cut that, chat is visible still.", "@James White Ehm... I feel you're misunderstanding here. Yes, Hololive as an idol group is only for women, but they're not restricted from interacting with the Holostars members. There's several stream and song cover collabs between the 2 group, they are in no way restricted from playing with each other in games and such.", ">It’s not a “GIRLS ONLY CLUB!”\nlol if only you knew anything", "@IDKmyBFFJill Well, we could maybe reword it as it SHOULDN'T be a girls only club.", "@Kefka Palazzo \ni have no idea what thats supposed to mean. im just highlighting that OP obviously doesn't know about the strange japanese culture regarding that", "@IDKmyBFFJill It's supposed to mean that I think they should be allowed to play on the same Minecraft server together if they want to. Japanese idol culture is seriously the fucking worst, and it seems like more and more westerners are picking up the same mindset...", "The thing is, the people who are causing trouble right now are people who are new to the Hololive community or discovering vtubers because of the EN girls, and insisting that \"games need to be played exactly like this hurr Durr don't make it so easy\"\n\nIt's not a case of idolmaniacs here, such a weird case", "@Kefka Palazzo this James white dude has been going around the comments being xenophobic for a while now, don't listen to him", "@無常 Ah fair enough, thanks for the heads-up.", "@James White wow, you're really devoted on spreading your trashy anti-japanese propaganda lol", "@Kefka Palazzo \nAs long as you do not believe that I am in support of the \"GIRL ONLY CLUB\" mentality then its ok lol", "@IDKmyBFFJill Well, you never really gave any indication of being for or against, so I wasn't even judging about that, no worries ^^ I think most of us rational people here realize that's a dumb mindset anyway.", "@Fray Trow Yeah, seems like I was the one who misunderstood... He didn't misunderstand anything, seems more like he's purposefully spreading misinformation.", "@James White  That’s not true at all. Some of the girls collab with Holostars a lot. Sora just collabed with an independent male streamer a few days ago. There no such rule at Cover.", "Nobody mentioned that most of the people here are NOT japanese?lol", "@scooby yubi doo The only thing is that someone actually tested that exact crossbow and the enchantments do absolutely nothing. They don't work on it because they're Bow enchantments. \n\nFlame", "@IDKmyBFFJill Don't worry I know full well how toxic Idol culture can be. Wasn't trying to come off as ignorant or oblivious to that fact i was just saying that mentality is really annoying lol\n\nHuke should be allowed to stream with the girls but they just act like spoiled children throwing a tantrum because \"THAT GUY IS LIVING WITH MY WAIFU! IF ANYONE SHOULD LIVE WITH HER IT SHOULD BE ME!!!!\" xD", "Idol culture is so toxic. That's why the Holostars guys don't collab much with the girls. Fubuki, Matsuri and Iofi have done so, but it is because they basically said \"Fuck it\" and went ahead despite a minor part of fans getting very pissed off that their precious \"waifus\" are close with a guy. Ui (Subaru's mom) collabs with Subaru and nobody cares. Just now, people were happy EnMa played L4D2 but if she was a guy I'm sure she would have received similar harrasment. It's so cringe that a minor part of the fanbase feel so entitled about it.", "I feel like letting this vocal minority get away these outcries is really toxic overall for the community and should be stood up against to not empower them. It’s frustrating that such a small group has so much sway.", "Yeah I feel the same way, letting them have their way just emboldens them to keep being toxic. I hope huke get’s to play something else with Kiara.", "Welcome to the internet.", "@MrFunk Welcome to the internet current year.", "@mark keily True enough. But I have watched it slowly get worse and worse as our social media began to centralize from the vast number of forums and chat groups into sole destinations for content and interaction like Facebook, twitter, and youtube. These sites where sold to us as places to meet and share with new people, but as I see it. they have only widened the gap. If you are in one collective, you are not allowed to talk to the others for fear of punishment or shaming by your own group. The comments here are a clear example of something like that. Kiara said there where \"complaints\". That could be something as simple as constructive criticism. Something like \"I'm just worried this will give the girls less of a reason to mine for resources\" which is arguably some of the best content. To people crying \"OMG YOU RUINED MY LIFE!!! IM GOING TO GO CUT MY WRISTS NOW\". I will offer the razor to anyone who actually feels that way. Yet everyone here is acting like a white knight crying out to protect their queen from neckbeard degenerates. When we really don't know anything beyond \"there where complaints\". I honestly don't think she should have brought it up at all. It only caused a predictable uproar.", "@MrFunk  Agreed, but my comment was more so to highlight that it's not just an online phenomenon.", "@mark keily I cant disagree with you there. And I don't think it will get better from here.", "that's just sad, I remember Sora's words, that playing in minecraft alone is very sad, thats why when other people are online she happily meets them in game or a playful stalking.", "This is so sad. at least she knows it's a small group of people who think that way", "Respectfully, capitulating to people backseat gaming and complaining shouldn't have happened. I understand the thought process of not wanting Huke to get any abuse thrown his way, but the people complaining need to just go and get a life. This is not you playing a game, if you want to do that then go start up Minecraft and play the way your want to play.", "The recent debut of Enma-san just proves how well received and fun collabs with the staff are. Huke papa deserves better and I hope the vocal majority is able to reach the ears of the higher ups to bring him back, because his removal was absolutely unnecessary...", "While Enma is staff and tied to everyone of the EN members, Huke is only tied to Kiara and not actually staff. I have not personally seen the reactions that lead to her decision so I don't know how the criticism was communicated, but I can understand people that have a problem with that.", "@Felingus I can't. It's no different than when other Hololivers collaborated with Nijisanji members or the like. And even if it was so what? She checked with management and the other girls so why shouldn't he play?", "@Felingus You can understand?! But why?! It's just a game... The nerve of some people lol", "@Felingus I also understand that there will be some people critical of it but it doesnt mean that they are right. Also arent some the mods part of the staff? If not and they arent getting paid, then they deserve even more recognition due to the fact that they are voluntarily giving their free time and supporting the girls. Whoever had a problem with this, did not understand what makes hololive what it is, that its not just about the girls but the community and those who support it and moderators/artists such as Huke are a huge part of making this possible.", "@Akemisan - Yes, I can understand the opinions of others without agreeing with them.", "Apparently it's because Huke has a crossbow with impossible enchantments. Thing is, those enchantments are completely useless.", "@Felingus  idk man you kinda sus", "@GriffinPilgrim Also, Calli collabed with Kokoro beats no problem. I thought it was an awesome stream personally.", "@Weaver Games Yeah, I thought of that.", "@Keeys He likely did it as a joke too, since he has shown considerable skill in building, and likely plays himself a lot. He probably knew it would do nothing, and wanted to see Kiara whip out her super crossbow, only for it to do nothing, and kusa as she runs away screaming.", "@Felingus Huke is just not any ordinary person. He is the damn famous Black Rock Shooter Designer & Steins; Gate.", "@Akemisan - being able to understand something awful without agreeing with it makes you sus now? hoo boy it's not just one side gatekeeping.", "@john smith You know it's a joke right?", "Either the complains came from Minecraft elitist or fedora wearing incels, we all can agree this situation sucks and Papa Huke doesn't deserve any of this.", "Definitely minecraft elitists, they don't know sh+t about anything else. Even weeb incels know Huke sensei is a living legend.\nFreaking losers man", "@mercenary128 as if backseating wasn't good enough for them.", "Incels and minecraft go hand in hand", "Huke is #1 . But the decision was made with his best interest in mind so I'll sadly but respectfully leave it there.", "The potential of having the rest of the HOLOEN girls creators join the server, gone. RIP", "I actually liked the idea of Huke Papa acting as an troll Guardian Angel. I can't recall  all the enchantment on the crossbow so correct me if I'm wrong, but I'm pretty sure they were bow enchantments which means that it did do anything on a crossbow - aka a troll weapon.", "the audacity of these people... i mean really??? she got permission from those who might question her actions.\n\nits all green and no problems with everyone like wth... kiara just loves huke too much she needed to ban him", "WHAT A SAD STREAAAMM!!!!! HUKE PAPA😭😭😭\n(joking, it was hilarious! But this was sad, although we understand you)\n\nDanke schön, Tenchou!! I'm with a high fever and strong headache, but your stream helped me cope with it. I couldn't stop laughing, and while I was bursting out loud I'd forget the pain for the moment. And believe me, you made me laugh a LOT!!!! We all love you so much, Tenchou!! VIVA LA KIARA!!!!!!❤️🐔❤️🐔❤️", "Timestamp pls?", "@Steve Smash Bros Timestamp for what? The news on Huke participation? \nIt's literally the first thing Kiara mentions and does on the stream, must be around 4 min, or something like that.", "@Rafael Neves thanks since i haven't watch the stream due to work", "@Steve Smash Bros You're welcome!! \nLet's hope someone makes an entire timestamp of the stream, sp you can check other highlighted moments!!", "I came late to the stream and after knowing it by the end of it, you guys really have to be toxic like that? Shame on you.", "There are impostors among us!!", "They're just trolling. We need to report and block them.", "As you can see, no one who complained about the situation is here supporting you. Pls, don't let the loud minority win because they will never stop. Report and block them, that's all. Focus on the community that supports you ♥️", "3:53:20 \n3:58:01\ndon't mind me, just leaving this here for myself.", "Hey, it's you! How's it going?", "Get some clip boomer", "Happy 4 u", "You gonna clip that?", "@harborline765 I'm alright, thanks for asking, hope you are too!", "Look at this flex haha", "To those who left after the Minecraft \n3:56:50 - 5:59:17 - Holding hands\n4:00:42 - 4:05:30~ this is for us TakaMori fans", "I see you're a man of culture as well", "Kiara please tell Huke sensei that was just a bunch of haters who doesn't even know about idol/anime stuff, even less about his art 🙏🙏🙏\nPlease invite him into the server, you can do whatever you want as long you have fun, real fans will support you and of course we love the great Huke sensei.", "R.I.P. HUKE\n\nFOREVER BANNED ON MINECRAFT EN SERVER.", "F", "F", "Did he actually enter the server?\nHow?", "what happened tho?", "F", "F", "i still don't understand why he was banned. was it an internal complaint or just toxic fans?", "@grandvage toxic", "F", "F , o7", "@grandvage Most likely just toxic fans, because she said she got approval. But remember that it was a very vocal minority of so called \"fans\" that complained.", "@James White Bruh, every anime/idol fan knows exactly who Huke is, those are the \"new fans\" who like to backseat everyone on twitch or something", "This is sad, because few people can’t enjoy it. They won’t allow other people enjoy it too.Fuck them, give me back Mano Aloe and Huke", "Imagine being so much of a creepy incel that you're jealous of your anime waifu VTuber's illustrator sharing a Minecraft house with her.", "It’s especially dumb when you consider the fact that they have a Father/Daughter relationship and oh yeah... KIARA’S GAY, idiots I tell ya...", "Its crazy, it reminds me the fans of instsgram girls and stuff, some really think they have a chance with them and get jealous whenever  a male is near, absolutely insane.", "It's only because Huke is a man, if he was a woman like Ui-Mama, they'd be simping all the way through", "Big cringe for real man.", "thats how the idol world is like sadly", "@Christopher Daniels This. I doubt she's gay tho", "@ルペン Why would you doubt that? she’s shown zero interest in any males and flirts with Cali every 0.2 seconds.", "@Christopher Daniels It's called a character", "There is not proof of it being over the fact that he's a guy", "@Mike Barnes Still, doesn’t automatically prove she’s straight, that could really be her preference for all we know.", "@Mike Barnes go watch her waifu tier list with Ina. their opinions had nothing to do with their characters, she was pretty serious about always ignoring the guys", "@King Mufasa ok?again it's none of our business if she's straight or not", "@Mike Barnes i'm just saying, if you're new to hololive then remember that not everything they do is because of character. they are more real than you realize", "@King Mufasa New? dude i've been watching vtubers since December of last year i know not everything they do it in character i just don't care if their straight or not because again none of my business", "@King Mufasa I wish it was that way bro", "@ルペン what?", "@Christopher Daniels do you not know idol culture? Yuri is allowed, straight is not.", "@Darkvoltinx Bro, I know about that stuff, what I’m saying is, just because she’s obligated to never flirt with males doesn’t mean she’s pretending to be gay, she COULD be gay for all we know. Everyone likes to assume people are straight by default, that’s not always the case.", "Seriously, it's so disgustingly pathetic. Being so petty and hateful is no doubt why they're alone in the first place. They deserve to rot in isolation.", "@Christopher Daniels everyone assume that people are straight just because it’s statistically more likely, like 90% against 10. The same way everyone assumes that you are right handed by default, for instance. This is how our brain works and it’s just common sense to assume something that more likely to be. But no doubt she may have any sexual orientation, I don’t really care though.", "@ULTRAVIOLENCE  Sure that makes sense given irl interactions, but this is a vtuber who has portrayed herself as being gay off the bat, even if she’s playing a character there’s no reason to assume she’s straight, like at all. That statistic is invalid given this specific situation. I will say it’s fine to think whatever or to not even care but there is no denying that most people who watch Vtubers play into the character they portray themselves as, or atleast we are expected to. I only brought that up because given that knowledge it makes no sense to get upset at her collaborating with males, she won’t flirt with anyone other than Cali, and possibly other female Vtubers.", "Probably my only problem with Hololive is their readiness to apologise. Legit top superchat earners in the world, should probably ignore the 100 people complaining. Doesn't hurt to be cocky. But Huke's decision is Huke's decision", "Easy enough to say but we all know the wretched scum from the murky depths of the internet can be persistent and cruel. I don't blame folks for wanting to avoid that.", "indeed. also Huke  is a staple of kiaras streams.", "Google what happened to Mano Aloe and then realise why Hololive is cautious.", "@Rae Merrick I've been here for about a year now, completely different situation", "HUKE is still the best papa", "HUKE is still the best , I'm pretty shocked that people complained .", "HUKE is still the best , I'm pretty shocked that people complained .", "@Rae Merrick Well this is the EN branch, most of us really don't care about having dudes in the streams. The EN community even came to Towa's rescue when the same type of incident happened", "@Loro Lukic It's a different situation but Kiara was talking about not wanting Huke to receive hate, and we know what assholes are capable of. And Hololive has had an unfortunate history of assholes taking small things too far and out of scale. So it makes sense to be cautious.", "@kb \ni also heard that oversea bros came to defend Aloe as well.\nbattle of cultures.", "@James White Drop the racism; it's not \"Japanese Society\" it's the idol culture, a tiny part of Japanese society. Besides which Cover is not to blame on this one, they gave huke their blessing (and indeed the only reason Kiara knows huke is because Cover hired him to design her model). It's shitty trolls whining about it for their own shitty reasons. As for the idea of going independent even leaving aside the legal issues of ownership of her brand and whether she would even want to the sub numbers of most indie vtubers do not bear out your assertion.", "@James White talking without a brain I see.......", "@James White we forgetting matsuri/FBK literally told those same idols fans to shut the fuck up against them collabing with male vtubers, this isn't your average idol agency, in fact it's only a cover lmao (pun intended)", "Ngl, the people who complained about Huke being on the server need to get in a relationship or something\nImagine going out of your way to ruin the little fun and happy things in life for others, blegh", "Don't they know who Huke Papa is?! The literal Steins:Gate and Black Rock Shooter illustrator, The guy's practically a celeb!\n\nEven then, he is best papa! Why would anyone be mad at that? HoloEN server was lucky enough to have him aboard.", "Please, pay no attention to the scumbags complaining about involving Huke in MC activities - they aren't worth listening to in the first place.\n\nFun times with Huke in future MC adventures sounds great - don't let this annoying vocal minority get you down, Kiara.", "Me and the bois always terraform entire maps before we start building somewhere. If a mountain is in the way, it needs to go. It is the way.", "Tenchou, you should probably remind the other members that the Two Towers is changed to Theatrical Edition so they can get ready.\n\nalso love the streams <3 ", "As was said in the stream, a Creative Minecraft world with huke papa for stream where you roam around, improve your building techniques, learn landscaping and so on with unlimited resources is a good stream series as long as Huke papa wasn't busy.", "Imagine getting mad at someone for playing a game with someone else", "The people who complained about huke need to stop it's about them having fun first and foremost.\nnot about you not wanting them to play with a guy very toxic way of looking at things.", "I feel so bad for huke now, internet tough guy these days should really quite watching vtuber community for god's sake", "Justice for papa! Its was even more fun to see the server with his buildings, and as Kiaras papa, he already deserved a place there", "Why are we even listening to these back seating minorities? It's clear that most people really do enjoy Huke Papa's presence, and so does Kiara.  I really hope Huke comes back, because having a vtuber interact with his/her creator is some of the coolest things, it gives us a connection to a really talented artist that we have no other way of communicating  with.  I ADORE YOU AND YOU'RE WORK HUKE-SAN.　尊敬しています、HUKE先生。", "So what if her papa interact with her? When I heard her papa joined the server, I thought wow that would be wholesome in another level and it could be something that unique to Kiara but NOPE!  some people are so sickeningly childish...\nI really hope she and her papa can do collab in the future.", "i hope he doesent retreat from the chat, i really like that he is supporting here as much as he does and its always fun.\nshame on the the haters, but with that reach there are always bad apples in the bunch. uncool.", "He was still active in chat today let's just hope it stays that way", "He's taking it pretty well thankfully\n\nDamn these backseat gamers", "@無常 Nah it's the toxic and vocal minority of \"fans\" who think the girls aren't allowed to interact with a guy whatsoever", "I'm glad Papa Huke will still be with us in the chat and that Tenchou/Huke know it is a small minority that were complaining.\n\nHopefully Kiara and Huke might get to play together in another game once this small dust up settles. Maybe MKD8 or LFD2?", "Being mad for Papa Huke to be on their MC server doesn't add any chance of you incels to be in there!", "Imagine getting triggered because a male is playing on the server lmao, you should look at yourselves in the mirror", "I guess those are the incels that everyone was talking about", "as a self-calling number 1 fan of huke it makes me really sad for what happened :(", "Imagine not letting a dude play Minecraft. We live in a society folks...", "I literally haven't seen a single person being seriously against having Huke on the server.", "I heard from another commentor that most of the complaints were on 4chan. I don't use it myself (due to how much I hate it), so I can't confirm it.", "@harborline765 I can't imagine a universe where Kiara (or whoever) made this decision because of 4chan hate. I could be wrong but that strikes me as very unlikely.", "@Johan I only heard it from another commentor. I never said I believed it was true.", "A new hat and architect Kiara in action what a combination .\nAlso ~ \nWe support Papa Huke ❤️", "I was sad to see Huke leave :‘( that sucks.", "As a fans of Huke Papa, it is sad to see Kiara destroy his works of architecture... T_T", "I still can't believe the situation with Huke-sensei actually happened. Bunch of incels couldn't accept a guy who drew Kiara hanging out. I just hope you know Kiara that majority will do what we can to help you with the unneeded drama from those.", "believe it lol, that's how the Japanese are and its fucked\n\npretty cringe of you to use the term incel though", "Proof of it being over the fact he's a guy?", "@Mike Barnes what other reason could it be? Maybe it's the fact that someone not part of Hololive is in the server, so they're jealous, but not many complained when EnMa joined the L4D2 game the other day", "@TRAWESS I didn't complain about him being there but i definitely didn't like the fact he was using creative mode", "@Christmas Bear ʕ•ᴥ• ʔ I mean, it was just a crossbow with an enchantment that didn't do anything. Doesn't really affect the game. JP has a resource server where they can just get basically any item they want, and that's fine, and it's also fine if Huke got an enchanted crossbow through creative mode ONE TIME.", "@TRAWESS I personally don't mind, but its not the item its self as much as the implications. If he uses console commands or creative mode to spawn items into the game, everything he used was probably spawned in with creative mode or console commands. There is then an obvious slippery slope where anything that happens offstream is potentially just spawned from creative/console, etc. I don't feel like walking you though every possible implication. This obviously doesn't justify hate since its just a game and they can play the game how they want, but it does change the nature of the game and toxic \"gaming purists\"  won't tolerate that.", "@hakesho But it is just a game and the girls and their friends can play it how they want. If toxic gaming purist have a problem too bad. It ain’t their game.", "@hakesho The girls in the JP server also used creative mode a lot to build stuff, they did it more in the early days of the server but stopped after a while", "@Israel  that was the old sever. The also do it on their own now sometimes but never in the current main server.", "Kiara: goes around and gives away free eggs\nMe: \"I thought it was Halloween, not Easter\"", "#JusticeForHukePapa", "aww.. so sad she have to tear down her papa room T-T", "And so the foundation for KFP has been completed! Us employees will be very busy during it's grand opening.", "Training... To learn how to turn ourselves into buckets of chicken!", "Imagine being so fragile that a vtuber's artist playing minecraft with her threatens you to the point where you have to actively complain about it.", "Please don't sad, Kiara. Your papa huke was the best and justice, he was handled the character design of Steins;Gate. I loved his artists so much, just ignore these haters annoying you. We loved to watch your steam and keep bringing lots of fun for us. We all love and support you in your channel, waiting for your first horror game at midnight. You and your papa are the best. Keep going!", "I feel that these types of decisions should have been submitted to a vote among the community. I don't feel like it's fair to dump papa huke just because certain people are so caught up in their perfect idol model that they prevent streamers from actually having fun. It's a shame really and I hope they can bring it back. (sorry for my google translate english)", "All the other Holo En girls: Oh n-n-no, we can't take too much from the other girls' houses, i-i-i-is this really okay? I'm so sorry... I'll return your 16 iron I promise! I'm so sorry..\n\nKiara: Our wool, comrade", "Why not write in a complain about Huke Papa being removed as well", "Justice for Huke! \nI understand this was made to protect him from antis, but I still think one should never give in to their demands. \nIf it was mostly due to gamers being upset about his minecraft methods, well just have him play survival normally and problem is gone. If it was due to him being a male, then those incels can FAQ off", "Thank you Kiara. That was a good stream", "Can someone explain to me who 'they' are? as in who banned Huke from the server, is it run by some third party being a creepy incel or are cover being toxic again?", "some incels were mad that huke got into the server. Then they convinced kiara to ban papa huke from the server", "@James White ok that's too far", "@What a Simp KFP Navy Admiral he was spamming this comment lmao", "@James White dude... Stop it rn", "Spammer kinda sus... you can find his comments somewhere and they too are sus", "Kiara: How much do you love me\nEveryone watching: Yes", "Imagine being so cringe that you complain there's a man near the vtubers you like. JUSTICE FOR HUKE PAPA\nDont listen to incels, kiara, do as you please and have fun with the people you like!\n\nOther than that, nice stream!", "@James White Chill out dude, you cant just accuse the whole japanese community of being toxic. I'm sure that some of these diehard simps are non-japanese anyway.", "he shouldn't be booted off but its pretty cringe of you to use the term incel tbh", "@R0- -HH the one I'm mentioned is not the JP bros but the  overseas viewers that being brainwashed by Japanese society looks like. \nI'm aware that those who making an petition to ban Papa Huke is the toxic fan from overseas viewers.", "Imagine being so cringe that you make accusations without any proof, there is not proof of it being over the fact he's a guy", "@Mike Barnes he's made irl appearances to promote brs merch", "@Coolkid Gaming so? There is no proof of him not being allowed to play minecraft with them BECAUSE he is a guy", "@Mike Barnes what?", "Die Kommentar Sektion ist nun Eigentum der Bundesrepublik Deutschland", "I lost the stream cuz i'm suffering a strong headache. But I just saw the problem of  Huke ... and i just can't believe this ... Don't worry  Huke you one of best papas for us and for Kiara.", "The reason why Japanese eat KF* on Christmas because on 1970 when the first branch of KF* opened in Japan, the owner promoted it's chicken as a \"party meals\" and as a substitute to America's turkey dinner.", "Please don't listen to the loud minority. Just report, block and keep moving on. The internet can be a very dark and rude place. \n\nDon't let trolls or people without life  ruin the community.", "On a different, more positive note, triple hat Tenchou. What a blessing", "Thanks for the stream Tenchou! Also who wants to bet how long it takes until the building burns down?", "At least the first thunder storm and it will be jinxed by Gura", "I'm actually hoping her luck helps keep this up", "Hmmmm, I have a really hard time believing the vocal minority of “fans” managed to convince Kiara and the rest of the EN girls that having Huke Papa around was a bad idea. This gives off the vibes of a higher up in Cover being the cause. Just doesn’t make sense to me otherwise really", "Man stop the conspiracy theory Kiara got the permission of all the girls,all the staff and the boss himself and they all were okay with it.\nKiara just took it down because she didn't want Huke papa to be a target for haters.", "Amelia sus", "Cover authorized it themselves.", "True, I kinda wrote with my emotions first. After more thinking, makes more sense that Kiara just wants to protect her papa from those “fans”. \nI’ve been reading too much internet, seen so much drama, gonna reset my sanity by going back to Okayu now~", "Missed the stream due to sleep but yeah, I agree with the top comments, there's no issue having Huke around, in fsct this is a papa helping his daughter and being wholesome after trolling the hell out of her.", "it's devastating seeing how hurt she is about the whole thing", "kinda wonder if they would have receive the same complain if papa huke was a mama huke instead. Great video!", "Justice For Huke ", "there are like only 55 dislikes, how tf did they manage to ban papa Huke", "I know it probably won't matter but I'd love for huke to come back! if it's possible", "oh tons of takamori content and i miss them cos i slept. bad simp!", "Wasn't able to catch it live... Wow thats so Sad about Huke, its always fun seeing him in Chat and was looking forward for what y'all were going to build together 💔", "Who the F complained about huke playing on the server!? Seriously? WTF", "Who would complain about having huke in the server? He's amazing.", "i hope the Huke will join in the future though :(", "Happy Halloween 🎃  Hope our boomer Pirate feels better soon  . / There is this restaurant called karma. There’s no menu, you just get what you deserve.", "I just want to say that I really appreciate your jokes lol", "Ditto to what Syrak says. Especially after the couple of bad news (and Marine sick) moments this stream, nice to get a chuckle haha", "@Jkhmonkey KFP IT Hardware Department #2 Happy to hear my jokes brighten you people mood up a bit.", "@Syrak - KFP Wörker Drohne thanks =) I appreciate these kinds of comments", "Once again , you are amazing , and fast with this o7", "Once again , you are amazing , and fast with this o7", "@wolfz KFP Health Department Advisor =)", "being kiara is suffering. These people are why we can't have nice things.", "Why does Kiara's opening song remind me of Sims 4 music?", "54:20 - \"There's an old japanese song about making love in a single bed\" - Kiara\nWonder if she was talking about DNA² - Ending | 'Single Bed' by Sharam Q, because that was the song that came to my mind.\nhttps://www.youtube.com/watch?v=CAUcAu9dRRk", "11:35 Huke Papa, a legend to the very end :D", "Kiara Kensetsu's first employee was discharged :<", "Antis don't deserve to be in this platform. Justice for Huke!", "Justice for huke daddy he doesn't deserve the hate", "In the SC reading, Kiara mentioned she tried learning Chinese, and I saw that some people thought Japanese was really close to Chinese. \n\nNo it isn't. It's just some kanji. The intonation is hard as hell. Think of it as saying peko,PEko,peKO, and PekO, all with different meanings, and that's just one word. (I have Chinese teacher PTSD...)", "Yeah ! you're right. because I have learned it.", "Was late to comeback on the stream so guess its time to watch it again 🙏🏻", "Kiara, pls tell your papa how much we really appreciate him. So sad...", "Much love to Huke.\n\nThe whiny little haters can kick rocks.", "As someone who doesn't play minecraft, I am legitimately confused as to why people were made about Huke.", "Imagine upsetting Kiara. Jeez.", "Guess you are going straight, with no interruptions, for the collab Queen Titel.\nI suki it.", "Couldn't watch the stream since our internet was down and then I came to this. Why tf do you have a problem with Papa Huke joining the server? What's the problem with that? You just ruined the stream. You haters happy now? What the heck were you thinking? Papa Huke just wanted to help Kiara. As her fans, shouldn't you respect her decision? We need justice for Huke. And Kiara, the stream was great. Thanks as always for brightening our days with your majestic Phoenix flames.", "Kiara's approaching to egging other's houses is...different. I hope Calli's streaming when she finds her house full of chickens.", "Some losers complaining about papa Huke joining in their server?\n\nGuess i'll complain about him NOT joining in their server then", "How do I complain that Papa Huke is being mistreated? I'm sure that MANY more people will complain about this injustice than the horrible people who complained before.", "Enjoyed the stream as always, Kiara  <3", "just watched the vod and wen she mentioned icarly, i remebered gibby has a youtube channel called \"Sadworld\"", "She is wearing a hat on a hat", "I know everyone else is saying it, but I want to throw my comment out there too in support of Huke or whoever else wants to play on the HoloEN server. I think it would be great if there were even more people on it. So long as the people actually playing on it (and management I guess) don't mind, then it shouldn't be a big deal. Hopefully Huke can come back sometime. I mean, I don't think many people minded when the EN manager played Left 4 Dead 2 with Ame/Gura/Ina so yeah.", "I hope someday papa huke will once again step into their server😢.", "We still <3 papa Huke, best papa ever", "Kiara's laugh has almost evolved into full on Peko levels", "3:00:30 for a mind-blowing scare", "meme content, also that voice crack it was hilarious xD", "We respect the decision and it's really nice of you that you don't want Huke get hate, but that's the internet. Report and block them.", "Thank you Kiara for the stream..sry I called you bird brain, I didn't mean it as hate speech or me being a bully..I just meant it as a joke, didn't expect you to read it.", "Bully", "No more birb brain jokes until actual birb brain moment happens", "Huke is Kind and helpful. Why are some people always mean? \nGreat stream Kiara! KFP shall be the dominant force in the server!", "I missed the strsam, but it's sad to hear about Huke pops. I respect the decision, but it's still sad that the decision had to be made in the first place. Hopefully he can appear as a guest spot on a members only collab or something later on since you two are so close. Haters gonna hate, but at the very least KFP employees will always stick together. Love ya boss <3", "Day 13 of commenting on Kiara's videos to help her with the y algorithm", "I feel like the room could have stayed but just repurposed it for something else.", "43:18 but that's contradicting what happened at the begining of the stream...?", "Knowing the community I know this was going to happen, very sad🤦‍♂️.", "Bring Huke papa back and ban the backseatting haters", "Please tell me Huke can still show up in the chat. PLEASE!", "Im pretty sure he-", "He's still active in the chat", "@What a Simp KFP Navy Admiral Oh, thank god. I was gonna be real upset if he wasn't. Thanks for answering my question!", "Does this also mean Watson's manager is going to be in trouble for being player4 in the Left 4 Dead 2 stream? Oh no.", "The vocal minority cannot be allowed to ruin the fun for everyone! Huke is a valued, honored, and highly respected member of the community! #freehuke", "So small minority getting jealous that a guy is playing with their waifus has more sway than majority? This is not about cheating because when AME and Gura were playing Minecraft they got coordinates for biome and no one cared. And when enma came to help LFD2 collab no one complained either. So this is not about cheating or interaction, it's because he's a guy. I thought we don't have to deal with the underbelly of idol culture in EN branch. Such a shame people can't grow up. People need to realize, vtubing is a job and they have their own lives and choices.", "Some people take things way too seriously... Poor Kiara and papa.", "Is thia jp purist who give complaint to huke papa are they know holoen for foreigner audience", "\"Girls Only\" is dumb.  So, no Holostars?  No potential male Holo EN members?  What if EnMa is a boy?  Does that mean he isn't allowed on the server?\nI fully support humbly begging Huke and all the other wonderfully talented artists who help create our ladies to come back.", "Honestly having other people than the Idols in the server makes the stream and lore more entertaining. These simps are really ruining the fun", "Sadly, Cover already made a rule that Hololive for girl member only. Same with Holostar only for male. And why Cover made such rule? Because of the crazy and bizarre Japanese society.\nWe are dealing with Japanese society here. \nThe worst part is there are more of overseas viewers seem being brainwashed by Japanese society that Hololive idol girl vtuber", "Holostars and Hololive are separate branches precisely because of that rule, and interactions between them are pretty scarce. If there ever is an EN holostars, chances are they will rarely interact with the girls. That’s how idol culture is", "I remembered Fubuki doing a collab with Holostars and number of viewer were terrible (around 2,000 and normally she has around 8,000 per stream). I have seen her doing collabs with them anymore since then. That is japanese culture (take it or leave it)!", "Can someone fill me up with the ban or something? I don’t really get it", "Some people complain about Huke (The illustrator of Kiara's model) being in the HoloEn server, Kiars doesn't want him to receive Hate so they decide to Ban him from the server\n\nBasically some Insecure assholes that got angry at a guy living with their Virtual Waifu on Minecraft got him banned", "A few hardcore simps got salty because a guy was in the server even though Huke just has a father/daughter relationship with Kiara.\n\nSo as a precautionary measure they had to let go of the idea of him in the server before the few people complaining about it started actually hating on him.", "Wow these salty simps. Poor Huke", "Supposedly it's not because he's a guy, it's because he actually knows how to play Minecraft and it sullies the AUTHENTIC GAMING EXPERIENCE. It doesn't really matter in the end though.", "@Arras this is the biggest bruh moment ever", "He was using cheats to create items that don't exist in the game.", "@scooby yubi doo I’m not sure if I believe that statement", "@Kep Tarareach Go read about it on the subreddit thread if you don't want to take my word for it. The crossbow with impossible enchantments was shown directly on stream, so there is no doubt about cheating.", "@scooby yubi doo can you send the link to it?", "@scooby yubi doo im agree, but im will be grateful if you show us the link", "@Kep Tarareach I'm trying to find a direct link but the threads are clogged with white knights misrepresenting the issue (just like they did with Towa and Aloe, surprise surprise). I hate to say it but you can find more reliable info on 4chan. The enchantments were Power, Flame, and Infinity, btw.", "@scooby yubi doo well those enchants are impossible on a crossbow. Maybe I’ll do some digging for the ban", "@ber liana https://www.reddit.com/r/Hololive/comments/jlcxpg/sad_day_for_huke_papa_your_sacrifice_will_not_be/gaocoeq/\n\nYou can find screenshots on /hlg/ if you dare to tread into 4chan. I'm not a fan of them, for the opposite reason I dislike reddit.", "@scooby yubi doo you seriously care about cheating in minecraft", "I get other people's point about cheating but what's the fuzz about it though. Let them do what they want, it is their world after all.", "@Kep Tarareach he did created an item impossible without cheap but it's pretty much a reference to Kiara, a crossbow with enchantments that didn't actually work and people arr somehow offended by it... Wtf is wrong with these peoples lol.", "@Arras well if they make it 0 backseat then this is legit AF.... experience lol", "@Kep Tarareach  dude it was a freaking crossbow with enchantments that doesn't do anything aside from referencing Kiara. Seriously it doesn't even affect the game. And remember when Ame and Gura cheated on getting the coordinates of a biome no one actually cared that much.", "@Li Qiye yes, the problem is these salty simps", "@scooby yubi doo Flame,Power and Infinity enchantments doesn't even work on crossbow....A crossbow with that enchantments would be a normal crossbow.", "Danm. my day must have 50 hours to watch every good content of yours.\nThe next time you do a \"cleaning\", use a lava bucket.\n\nP.S.: this stream was a awesome bday gift, unfortunately i couldn't watch it alive.", "Please bring Papa Huke back :(", "2:06:26 \nI like this A", "Kiara likes Babymetal whoa, I wasn't expecting that. XD", "Moona’s chicken factory thingy might be helpful for resources", "I see no reason Huke shouldn't be allowed in!", "Dude...why ban huke, like c'mon...", "1:59:51 highlight\n2:09:23 HIGHLIGHT", "wow.... people get mad over some dumb stuff, i'm sorry kiara and huke papa...", "I watched this late so I just learned about Huke papa. Stay strong Kiara! There are always going to be people like that but you'll rise above it like the majestic phoenix warrior you are.", "17:40 Oh god the horror", "She dug out so much dirt, and then put it all back, such a left moment", "I missed the streme the first thought i had when i clicked to watch the archive(wonder what huke made probably something interesting )", "Man, people are weird", "Anti-male idol fans ruining a good thing for everyone else once again... I bet you most of us had no problem with Huke being around on the server, but because of a vocal minority we get to miss out again on all the potential fun interactions.  These type of vocal bullies shouldn't be catered to; they'll continue to ruin things for everyone else and everytime people give in to their demands it just empowers them to get huffy about even more things.  It isn't about the actual issue with them... they just want the power to control people.", "3:13:02 in my opinion you always should have some savings, in case something unexpected happends. And even if you have money, I think it always feel better when you can get a game for a cheaper price, it's a whole different thing when it comes to food, what you eat every day to run your body.", "Kiara, it broke my heart when you announced that Huke can't play on the server with you. You were so excited about it and I was so happy to see that he wanted to help you out. I wish people didn't make such a big deal about it. :(", "When i saw he had an underground base i was genuinely surprised", "Having my favorite artist being present with my favorite Vtuber was such a blessing. Hope Huke comes back", "Dang man. I was really hoping for that; keeps things interesting with guest appearances... ahem. KFP and the employees will continue to blaze a path of glory, however. 🧡", "stay strong huke <3", "One more step taken towards the KFP Empire world domination!\n\n\nIt really pisses me off that a few people wanted Huke kicked out, but I'm at least relieved to see that he still shows his presence on the chat. It would have been too sad if he didn't feel wanted here anymore and decided to stay hidden.", "i hope you and huke papa will be able to a collab in the future and we will all be there to support you guys", "I want to watch the vod so bad, but every time I start it back up, it's at a point where she's destroying Huke's stuff and it makes me sad.", "I do hope things can improve for idols (and voice actresses) in the future. In my opinion, the agencies need to get better at standing up for themselves and their talents, and tell these bad eggs to sit down or go out. At the moment it's more like they're being controlled/restricted by the toxic minority, whom probably wouldn't even accept the talents eventually retiring. I think this is a conversation worth having to better the community :)", "I support Kiara's decision to have Huke papa in the server! Don't listen to \"fans\" that don't want him in! Kiara should be allowed to enjoy any game with who she chooses!", "3:00:32 I LOLED SO HARD 🤣🤣🤣🤣", "I personally think you don't need to hesitate on inviting Papa Huke for the next minecraft stream; go for it if you want to and we'll enjoy whatever you two create together", "Wasn't able to watch this one live, so I'll watch it after your spoopy stream! Thanks and looking forward to later!", "Whoever complained about Papa joining the server truly belong in bottom left, the bad bottom left not Kiara's comfy corner :(\nIf you can, convince the higher-ups and everyone to let him in anyway. The haters are bad people and shouldn't be given what they want, not from you or anyone. If not, then at least you tried your best Kiara, it was truly a beautiful gesture you attempted and its the thought that counts the most after all.", "Much love to Papa Huke. Sorry there was  such bastards hounding you. #JusticeForHuke", "aww your papa was damn good in the game watching the chest being organised was damn nice", "Loyalty out the window...hmm..lol next the antis are going to prevent you from playing on the JP server.  Ngl I'm disappointed you dropped him like that.", "Huke Papa we support you and your great work!!!!", " did nothing wrong...", "Just now people were happy when EnMa appeared because she is a girl but they feel insecure because Huke is a guy and how dares he become close to their precious girls? Oof. I feel sad for Huke papa, he's such a great guy and I was looking forward to him doing a collab either with Kiara or the girls. Hope Huke doesn't take this too personally, I love his interactions with chat and hope he doesn't get too harrased because of it. Kiara seemed so sad about it.", "Justice for Huke Papa!", "3:37:00 and 3:42:17 that reminds me of that 'Nom nom nom' song from like 2009", "I'm a huke simp his art is beautiful", "I don't care about whether your Papa help you,I just want to see the huge and wonderful building and interesting interactive with other member in minecraft.", "bring back huke!", "I miss huke papa already", "Woah she met so many senpai's", "About the chicken eggs... I wonder why Mojang isn't adding any early-game food that can be made with eggs alone? Like, fried eggs? baked eggs? boiled eggs? With that Kiara can make all these egg-type food for the girls, providing them the protein they need.", "3:36:35 I hope that too", "Your papa also helped make the video more interesting cause the materials helps", "Those guys have no right to do that to Papa Huke!", "ngl i’m kinda glad the holomyth minecraft uploads have slowed down a bit, now i actually have a chance at catching up with them lmao", "We need a top right  and a piep emote btw stream was really nice ", "NOO I’m LATEEE", "Pain Kikkeri....", "Gerechtigkeit für Papa huke!!!!", "power to the minority, yay.", "why even? it's really obvious that this is what's gonna happen. just like the aqua thing. so why even try to do it in the first place.", "Give love to this pure and kind birb. 🧡🧡🧡", "Kiara eggs  Calli's bed   23:56\nKiara's plan for Calli  24:42", "Kiara, if you don't want to feel the pain of killing your chickens, you can always build an automatic killing machine.", "Haters are one thing. Pandering to them is another... if the situation was caused by antis or even just bad business, I feel like there has to be some sort of moral integrity on where you draw a definitive line. If you don't want to or simply aren't willing to put your foot down for something then you'll end up being the doormat to every last one of them. In my experience (both life and corporately), living and operating like that is often a slow poison if not dealt with. Just my thoughts. But hey, at the end of the day I'm just a guy behind a keyboard who doesn't know the exact situation... so there should also be a grain of salt in equal measure. However, IF the aforementioned hypothetical was indeed what transpired, then the higher-ups will only make their lives (and every subordinate by extrapolation) absolute hell. Hope it all gets sorted out and much love to Kiara, the good people around her, and all the other Holo-girls across the world. <3", "I felt so uncomfortable because you can tell she's forcing a smile in the first part and it was painful to watch. Those who complained doesn't deserve Kiara and should be banned from watching future streams (if only that was possible) because you know they'll do the same thing in the future.", "Justice for Huke!", "Bring back Huke papa", "Great stream", "People. My god.", "justice for huke!", "Huke 👏 papa 👏 is 👏 the 👏 best 👏", "#LetPapaPlay!", "#JusticeForHukePapa", "#JusticeForHukePapa", "HUKE PAPA NOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOooooooooooooooooooooooo! Huke Papa Vtuber ga itsu ni naru ka????", "Huke papa :c", "42:13", "キアラとフケはわるくないよ", "Yellow sus", "Huke-papa is best papa.", "Let Papa back in", "It seems like some of the people here still dont know about the Japanese idol culture. It has a rule where Idols shouldnt be interacting with people their opposite gender so thats why some people will not tolerate Huke Papa since Kiara is technically an Idol cuz she applied to Hololive. ", "Cover was the one that authorized Huke being able to join.\n\nInteraction with opposite gender isn't prohibited, it's only romantic relationships that are prohibited, which is really sad.", "That argument doesn't hold much water because Fubuki, Matsuri, Choco, Roboco and the holoID girls do collabs with the guys from holostars and Fubuki and Matsuri in particular do them very regularly.", "@Windowsill the Purple Yeah, even Aki's doing collab with Ashino and Sora with Gatchaman recently.", "Not just that, but the girl's confirmed that \"no BF/GF\" isn't on the contracts, it's at the person discretion. I'm gonna blow your absolute mind and tell you that cover isn't actually a standard's idol agency, crazy right?", "@1:44:43\nthe song that kiara was trying to remember and wants to sing in the next singing stream, is called \"Goodbye my lover\" by james blunt.\nsomeone did a sad takamori clip on twitter with that song", "Regarding your own life, neither you nor I are readers, but authors. At least in the end, you can still have the final say.ヾ(￣▽￣)Bye~Bye~", "Sorry to hear what happened with papa huke", "Justice for Huke ", "In the live chat @ 1:42:25 \"Tripdox: Maybe the issue is yourself then\"\n\nI meant that jokingly Kiara, hope you're not offended by it! Kinda hard to convey that it is a joke without using /s in text form, but I believed that you're emotionally strong enough to not get offended by it, and I'm just leaving a comment just in case it wasn't clear enough for anyone else.", "That was a real oof moment dude, kinda hard to tell the sarcasm. But at least you meant it as a joke so that's good.", "Be careful next time", "@danish ismail Yeah, I thought it was clear since both Calli & Huke leaving was for other reasons, but without adding context it came off ruder then I expected it to sound.", "It was clear it was a joke (at least for me) but it came on the wrong time to the wrong person.\n\nour girl is strong, more than she realises, I know she will be fine/won't take it personal, but we ought to be careful.", "#justiceforhuke", "#JusticeForPapa", "F for huke", "Nice Kiara", "Can someone explain me what happen with Papa Huke ?", "Some  guys had issues with him playing in the same servers with the other girls, so they decided to not let him in again to avoid problems.", "@MrALUCARDIII wow... some people really need to chill", "@tribopower the usual \"idols can't play/collab with boys\" bullshit. Huke papa won the right to play in any server he wants, the dude is a fucking legend.", "rip huke", "I find it lovely see you guys stands for kiara but i have my opinion:\n-I think you guys overprotecting her. If she your favorite youtuber, you should know that she is a profesional vtuber, who can handle herself, even without you guys, im sure she can do it. \n-we are talking about internet, what do you expect? Even a community could be toxic sometimes ,especially overseas fan", "very disappointed when you only listen to like 1% of the hater and kick papa huke while 99% of your fan enjoy you having fun with him.", "😀✋👍👍👍👍👍HAPPY VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "After browsing through the comments, I find it interesting that everyone is assuming that the complainers are all some kind of basement dwelling neckbeards who don't want men working with the girls. Its a shame that so many people either cant, or refuse to see a valid reason why people wouldn't want someone in the background doing the work for the girls. I had no idea it was going on, and honestly couldn't care less. I think it's fine as long as good content is produced, the girls are happy, and it isn't so overt that they never have to mine for resources again.", "I don't think the problem is about Huke playing together on EN server.but more to.....his dotting you too much, giving things,animals to an extreme point.\n\npeople who criticize Huke might intentionally just want EN girls to grow and build the server by their own effort.his extreme help makes some people think like you're cheating the game and play Minecraft without effort.", "\"want EN girls to grow and build the server by their own efforts\"\nmeanwhile the same people will tell them exactly what they are doing wrong and what they NEED to do. Huke was only gonna be there for special occasions, if they didn't want stuff from him all they have to do is say no", "This point is only valid at 0 backseating... hahaha... sorry~", "Who cares? 99% watch the stream for the girls and their interactions, Huke amplifies that. \n\"Minecraft without effort\", if anyone actually thinks that, get a life and stop being so useless to society.", "peoples who white-knighting blindly  might think my diagnosis up there is bullshit or exaggerating. but those cases did exist.many people triggered when seeing someone cutting corners on a gameplay stream.in Hololive already two extreme cases that I remember", "@Freyja Wion You do realize he didn't cheat to get to get those sheep right? She confirmed that he spent hours off screen doing that, and he didn't give them any items either. Huke never gave any \"extreme help\" and if he did, why not warn him instead of immediately banning him?", "@King Mufasa \nthe cheat from my perspective is for the girls.since it's like they being served an easy path by Huke.i didn't accused Huke cheating.\nwarn? ban? who did it to him? me?", "@Freyja Wion Question then, if they were getting an easy path from Huke, why are they still mining and gathering materials?why didn't he just give them everything they needed?", "@King Mufasa \neasy path doesn't wean he will give diamonds gold iron. but also included how they got food in-game. I've watched since Amelia helped Kiara making the egg farm.before that stream.few hours before,Kiara only have several chicken,a pair of sheep and cow.then after that she got animals stuffed tight inside her fence and admitted Huke helped her gathering those extras animals.for a person who struggle playing Minecraft from zero.that instant food supply can be considered as an easy way.when seeing that I already have a hunch this will become a problem in the future.and my prediction become reality", "@Freyja Wion Oh my god you're a top tier backseater. you're basically saying because they are prepared, it's somehow easier?When that's what you're SUPPOSED to do? Can i ask you when they ever said they wanted minecraft to be super difficult? What about Ina's city of cows? do you want her to release those too? They already constantly forget to eat, but now you're mad that they have food", "@King Mufasa \nI'm not mad.I'm just stating what I have in my mind about the case.is there no freedom of speech anymore?\n\nbackseater? did you ever see me doing that on her live chat and etc? you're being rude accusing me doing something I didn't do", "It was approved by the management so why the heck we're people even complaining it was them playing not the haters. The girls didn't even complain about it and Kiara was even looking forward playing with her papa. Ame and Gura had already cheated when they looking for the biomes coordinates. And those those who complains we're the one that was backseating so your argument that they want the EN girls to grow and build the server by their own effort is already invalid. Just let them play the way they want and give advice if they asked for help!", "@Li Qiye \nwell in a hardcore viewpoint.looking coordinate might sounds like cheating since it spoils the sense of surprise of founding new biome.but still many also thinks it's a form of efficiency.since at the world seed we still need to struggle to get there.so I can't really say it's cheating.", "I don't hate the guy or anything, but I'm glad he's not on the server anymore, he just doesn't belong there.", "Why?", "Why", "Well, that's your opinion, mine is that they can invite whoever they want, with exec blessing,  since it's their server. Being glad about the ban is being glad to make Kiara sad.", "Yeah because it's you the one who decides who belongs in the server and not the actual hololive manager that gave him permission", "Isn't Huke part of Kiara's stream anyway? lolx....", "You are worthless to this community.", "Your personal subjective point of view is quite disturbing me, even though I respect your opinion towards to the minority voice\n\nLooking at this objectively, I want to give statement that having Huke around is indeed a blessing, both to the community and to the EN Hololive Girls. If in any circumstances, you were thinking that having him around is blasphemy. Then the real problem is indeed in yourself for wanted to obstruct majority enjoyment and EN Girls fun experience in Minecraft", "@MissingClover  @Ammar Abdullah  Because no matter how much Kiara might adore him, he isn't a streaming member of hololive EN. \n\n@Vincent-Didier Sarah I'm not happy that it makes her sad, but I do believe that it's the best for the server. Also, I doubt she will be crying into her pillow about it or anything, it's not like they are banned from interacting or anything.", "@Krimi as far as im aware HE was going to be part of kiara's streams(as collabs) so even if he doesnt have a channel or is a vtuber we could have seen him in kiara's channel.\nHowever i belive some neckbeards with a very sad sad life couldnt accept that a man wouldbe playing with kiara. I strongly belive this is just an excuse you tell to your self to hide that you are a toxic incel.", "@Krimi But Kiara asked for permission from Hololive staff and they approved. So him being part of Hololive or not is not a question.", "@xeightlawyerx :3 I'd love to see colabs with him, and its fun always seeing him in chat, etc. I just don't think he should be in the minecraft server. Y'all are the toxic ones, I never sent hate to anyone at all, but look at you guys breaking down the moment someone doesn't agree with you.", "@Krimi \"i'd love to see colabs with him\" yet you dont want him minecraft making  content with kiara despite he had the approval of everyone in hololive.\n\"claims we are the toxic ones when they got mad over a man WHO(well actually he did all the job he was the illustrator after all) helped making kiara's vtuber model being in the minecraft server\" ironic isn't it?.", "Huke is part of the stream with the emotes there and he’s the mod too~ but well.... have a good day... lol", "@xeightlawyerx :3 You're pretty butthurt about this huh? Welp, you gonna have to get over this one chief.", "@Krimi You're being pretty defensive here, calling us toxic when you're the one who is also doing ad hominem attacks, you're no better than the people who call you toxic"]