["Don't listen to the people saying you're underlevelled and need to grind. You're not and you don't. You're on normal mode that means you already get extre exp. That means you're pretty much guaranteed to be overlevelled anyway. Levelling even more will take any challenge out of the game. What you have is uneven distribution of exp. Byleth and Edelgard are extremely overlevelled and others at around the right level. Only Linhardt is actually underlevelled because you rarely attack with him. ", "This right here. As far as I can tell, normal mode will result in overlevelling unless you do the bare minimum of battles in the game.", "Underleveled? If anything I think she's starting to catch up fairly quickly. She shouldn't have to worry honestly.", "It honestly annoys me when I see people spread so much misinformation. I'm not saying you have to be an expert but you should probably at least do minimal research before telling a newbie to do this or that.", "@Rye Bread Yeah its the biggest problem with BSG in my opinion. people telling u to do this and not to do that but they dont even played the game and often just repeat what someone else sayd before to look like they have some knowledge about it..and in the end it was even wrong and you confuse the player even more.. .. realy annoying", "I didn´t see a top left Kiara, all I saw was australian Kiara. Congratulations on 400K Subs! - A baker who worked with dough wasn't the hero we wanted. He was the hero we kneaded.", "Nice one there , also I see Brazilian Kiara on the top left", "Kiara going to Australia to let Haachama eat her for ASMR", "The real waifu are the friends we made along the way.", "1:52:15 Nothing can beat those eyes indeed. Even Calli gets lost looking deep inside them, trying to understand the meaning of the skulls/skeletons. Truly a sight to behold. Happy 400k subs Kiara!", "There were 72 people by the end of post-stream chat closing, good number~! Lots of good people in there! (Thank you White Guy for closing the KFP for the night, you're a great samaritan!)\n\nThank you for the stream Kiara, it was great~! (Your Top-Left Australian dominance was also hilarious!) Ah, and CONGRATULATIONS FOR THE 400K!!! Let's work our way up 500k next, eh?", "Salute , o7", "Salute  o7", "Salute o7", "I had to work a graveyard shift, otherwise it would have been 73. :(", "Unpopular in high school? I can totally relate. And that fact that she swears adds to her cuteness", "I stop A bit to drink and come back to see the most interesting thing  , UPSIDE DOWN KIARA and she don't want to come down 😂.\nAlso~ \nas huke papa said Omederatulations for 400K Subs Tenchou , VIVA LA KIARA .", "We're infecting the JPs with our japanglish :O", "@Syrak - KFP Wörker Drohne LOL , what had we done , Yamete Kudastop", "2:03:02: Sumi- sumi- sumi- sumi...\n\nKiaraThePhoenix.exe stopped working\nBegin new program execution... chicken.exe", "2:20:31 Top right moment\n2:31:37 \"Young lady get down here this instant!\"\n2:32:40 Taka Bell\n2:35:21 \"Kiara's in the air~\"", "Truly a blessed stream today, not only with them crits but with the hilarious moments. Congrats on reaching a historic milestone Tenchou!!! KFP!!", "Im watching the archive right now, but really, she's doing totally fine with the battles. The game is on normal and casual, so literally anything works, hell, you can even put Hubert on a flying horsey and have him slaughter everyone. Let Kiara enjoy the game, don't stress over the small things, and everyone can be happy.", "CONGRATS ON 400K!", "The difference between \"regret\" and \"regret\"!!!\nRegret means that if you go back in time, you will try to change what you did at the beginning and also change the future. Regret is the opposite. If time goes back, you will not change that thing. It is just a pity miss in your life. Regrets and regrets are originally accompanied by each other, but regrets may not be regretted, but what you regret will definitely be regretted; regrets are only telling you that you missed, and regrets negate your previous choices, so you can leave regrets, But never let yourself regret it later.", "It said “Live” and I clicked, but then I saw comments and realized my screen must not have refreshed...\n\nPain peko", "I don't have any inspiring words to give you, but you're perfect the way you are Kiara. Everyone who hasn't figured it out yet will figure it out in time. If they don't then, they don't deserve your time. You're such a wonderful and bubbly person to vibe with, and we love your content. ", "Stream starts at 2:58\n\nAlso congrats on 400 k", "Day 11 of commenting on Kiara's vods to help her with the yt algorithm", "Yet another blessed stream! Kiara, congrats on 400k! We’ll be here for you, no matter the game, so please, have fun! Here’s to many more!", "The Death Knight battle was pretty amazing", "Damn Kiara... ich hab gerade herausgefunden dass du Deutsche bist. Das hätte ich so garnicht gedacht, weil du die anderen Sprachen so beherrschst🥺ich liebe dich und die anderen HoloEn Mitglieder soooo sehr❤️❤️❤️❤️", "Congrats on 400k, Tenchou!!!!\n\nI always want to write something meaningful after your videos, but it's so difficult!! I'm always left with the biggest smile and a warm heart by the end, I just want to thank you for being awesome! Besides, if I want to say anything I usually type during the stream, anyway. And usually it's around 4 AM, so my head can't really think all that much.", "1:52:58 1:53:11 These giggles and her eyes really took my breath away. I'm dead.", "remember everyone, we're all officially girls now according to LFTT", "Congrats on getting 400k Tenchou! Now we need a 400k special KFP chicken ", "Quality content as always! Great stream! Kiara reached 400K, went to Australia, turned into a bat, and came with new lyrics for an iconic song. Today is top right day~", "When your judas but the other judas over clouts youre existence lmfao", "kiara world domination lets go!", "If you want to power up Flayn here's the formula for Superflayn: \n1) Bench her initially so she doesn't get any levels. \n2) Set her goals as Axe and Armor and instruct her in Axes and Swords. \n3) Once she is ready, certify her for Thief, Armored Knight and Brigand. (Needs Sword+Axe C and Armor D for 100% chance but you can roll for it earlier.)", "33:20 Info: Her (and Byleth's) preview doesn't show because you set it to combat being same as monestary. You can set it back in your room in exploration.", "RIP Kiara.  Akai Haato turned her into chicken nuggets and ate her.", "CONGRATULATIONS ON 400K! I cant wait for the karaoke celebration stream!", "KFP at 400K strong!", "Congratulations on 400k again. Also I'm sad that Tenchou didn't read our two SC's Frost. (Also Timestamp for reasons  3:30:29 )", "A bit Sad but we're saved Lmao", "@Frost Eye she would have to strangle us otherwise lmao", "What you two had done LOL 🤣", "When you flex, do it in style 草", "o7 for the big ass sc", "@Syrak - KFP Wörker Drohne Madlad SC o7", "We're all madlads and madlasses in arms, a salute to all of you o7", "Congratulations on 400k Kiarachan, sorry but had to sleep for this stream, I will for sure watch the archive when I get home from work later today. Gratz again and hope for many more milestones!", "01:52:28 \nKiara's eyes is most beautiful in whole hololive,", "Ich beneide dich so sehr, dass du fließend Japanisch kannst. Ich will es gerade lernen.", "Pros of playing a male character, marrying the waifus", "Kiara is just 😍😍😍 I've learned to never questioned about love, so just go for it, Kiara 😎 The heart wants what the heart wants 💕", "Top Left Kiara? Do you mean Bottom Right Australian Kiara?", "1:52:20 キアラちゃんのガチ恋距離部分👍️", "I always feel bad when I miss the FE3H streams, but I still watch them after the fact so please don't worry about low viewership <3", "Kiara and Sylvain look related lol", "3:25:46\n\nOh no, now my wife has been given official approval to bonk me!", "Sad that i didnt catch the stream but CONGRATS FOR THE 400K SUBS KIARA!!", "Fell asleep halfway through but catching up on the archive now,\nCongrats on reaching 400k Tenchou!! Thank you for giving us lots of joy and laughs whenever you stream!\nVIVA LA KIARA ", "Hang on; Ferdinand brought his horse into an underground labyrinth? Interesting choice.\nMany congratulations on the well earned 400K subs. Let it sooth the pain of a broken heart.", "Well, if we're actually gonna stark thinking about what's happening, all the support battallions on both sides also mean there is almost a thousand people down there, all who sneaked down through that one tunnel in the study... Kinda makes that one horse seem irrelevant, all of a sudden :b", "@Bulletmoaf ...fair point...", "Take my appreciation, Kiara", "CONGRATS TENCHOU~~ ❤️❤️❤️\n(Also upside down kiara is best kiara 2:20:35)", "3:45:47 A reminder for myself. designing now~", "Hurray for our \"Mother Hen\" Phoenix.. \n🐣🎶🎶🎶", "She can say now: I am 400k subs Vtuber", "Oh no, I missed it! Thankfully the archive is here.", "1:52:31 she's too cute", "CONGRATS KIARA ON 400k", "Congratulations on 400k Kiara!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Guten Mittag meine Freunde der Guten Laune. 😁", "Congratulations on the 400k! Fell asleep and missed it D:", "Congratulations Kiara on 400k !!!", "You can probably just do the end-of-month battles and beginning-of-month events on stream, cutting them down to ~2 hours so you have more time to rest.", "Congrats on 400k Tenchou!!!! You earned every single one!!", "400k chief still go on", "CONGRATULATIONS TENCHOU KIARA ON YOUR 400K. WE ARE DEFINITELY PROUD OF YOU 😍😍😍😍😍😍😍😍😍", "400K！！", "400k YAYYYYYT. CONGRATS TAKO, \"A\". SO HAPPY! You bee zoomin so fast and proud of you!! This ain't the end of your Mori cause your story gonna continue. \nP.S. superbad but just tried including references to all hololive girls 😅😅😅 but just proud of you and all them making great content and milestones", "Big congrats to the 400k subs!!\nKFP continues to expand!", "Congratulations on 400k Tenchou!!!!", "man why did i missed this stream,i wanted to be there seeing huke donating lmao", "Now, en route to 500k", "i actually could catch your fe streams live because they were at a reasonable hour here, guess i'll have to keep watching the archives", "Congrats 10chou, cheers to thousands more 🧡🧡🧡", "Is she german by any chance damn", "A vtube playing FE three house with English Language with Japanese dub....Nice!!", "huke papa super chat 2:45:20", "Just putting this out there cause Petra isn't an option.... There's a 4 foot tall, purple-eyed, Germanic imperialist atheistic-rage-filled princess on the market still. \n\nComes with a free creepy man with a clorophorm rag.", "Congrats on 400k kiara. Keep it up!", "Congratulations on 400k Tenchou! Missed the stream because of work, but here I am watching the archive. Ganbatte!", "Fantastic job on 400k Kiara", "Congratz on 400k, <3 you Kiara!", "again, Congrats on 400K!", "Ahhhhhhhh\n\nSuperchat read feels like a new odd feeling to me!!!!", "Um. 3:18:47 for my chat. Have fun Kiara. Danke is thanks. So you're welcome. Ahhhhhhhhhhhh! My heart is pounding!", "Okay. I feel better.", "Congrats on 400K!", "I love the BGM song so much", "Congrats on 400K Kiara!!", "Congratulations on 400k Tenchou! おめでとう！", "400k Sasuga tenchouuuu!!!!!!!!!!!!!!!!!!!!!!", "400K.", "KIARA AUSTRALIA\n\nKIARA BRAZIL", "Congrats on 400k! I am here to appreciate your Fire Emblem stream!", "400k YAY", "CONGRATS ON GETTING 400K SUBS! Thanks for producing great content daily!", "Congratulations on 400k!! 🎉", "I will hatch soon!  SOON", "Someone please clip 2:31:14 - 2:32:11 😂😂😂", "Congratulations again for 400k ^_^", "400K CONGRATS", "Please protect Bernie at all costs.", "👑♥️Congratulations on 400k♥️👑", "400K Sub Congratz! Kick the Ricky more", "3:28:13 for a clip ?", "Felicitaciones por los 400K subs 👏🎈🍾☺️", "Congrats on reaching 400k!!.", "Hallo ein deutscher hier uwu", "3:11:16 she could get a pet, like a little doggo or a catto, but with a dog it might be like for Ame....Booba!... kinda noisy", "400k", "Congrats on 400K!!!!!!!!!!!!", "Wher is she from ?", "I realy like the battlesystem but i dont have a switch and just for 1game?...i dont know..", "Obligatory comment", "If you wanna play the game off stream, by all means, do what works best for you. I like watching all these streams (although I usually catch the archive instead of watching them live), but I wouldn't mind if the grinding and \"in-between\" stuff happened off stream -- hell, I wouldn't even mind if you did some of the more \"filler\" main battles off stream. I'd only really be put off if you did a big story event off stream. You don't have to play the entire game on stream, especially if it's not pulling in the viewers -- getting some of it out of the way off stream will let you get to another game that get more views a bit sooner.", "My fav part \n1:52:24  and 1:55:35", "U lil fried nugget", "Top left kiara is best kiara :3", "♥️ Viva la Kiara ♥️", "", "", "Today is my birthday and no one wishes me because I don't have a single friend. I only wish Kiara would responds to me but that's not gonna happen isn't it. Now I'm even more depressed than yesterday. I genuinely hate birthday.", "Hey, hey, hey 👀\nI may not be Kiara, but happy birthday! 🎉", "If that the case, I will say Happy Birthday to you", "Im just a stranger in the Internet but Happy Birthday~~! 🎉🎉🎉", "Thank you all so much for the birthday wishes. I'm  touched. Thank you so much. You made my day ~", "I HONESTLY JUST WANT TO BE ABLE TO TEXT U, you seem cool and fun also I’d want to play some games with you", "Oh no chat how do we tell him", "I hope for your sake this is a joke because you sound like a stan"]