["2:31:17 DeepL translation of the SC (Credits to u/bloominousapple for posting this on the subreddit):\n\"I am suffering from stage 4 cancer. Your streams have made me so happy for every second of my life. Maybe this is the last time I will see you streaming. I am using Google Translate to send this message. I hope you can read this my name is Kitty. I am spending the last hours of my life in the hospital to see you streaming again.\"", "Level of pain: Extreme.", "Who is cutting onions here? 😭", "Wait I dont understand and can't get the live chat to work. But why is it google translated? She's reading japanese. Did the guy translate something to japanese to send to her instead of english? I hope this live chat thing works so I can get the context but it's so broken.", "@PewPewSol It's probably someone from another country.", "Wtf", "@PewPewSol maybe other lenguage, you know, there are so many", "\"I Hope God give you a strong and healthy body in the next life.\"", "Kiara's teary voice is pain-peko", "@PewPewSol Apparently it was sent in regular chat in Japanese and an English speaker copy/pasted it into google translate, found out what it was then put it as a superchat so Kiara would see it.", "@GriffinPilgrim God Bless that Man.", "The feels are too stronk fack me", "@schro34 Indeed. It's a small thing but it may have brought some light into a very dark time for someone.", "@schro34 the persons name is meltyclaw so if you see the person around treat the person with respect and maybe even reverence", "Idk man, there's a lot of comment like this in vtuber ch, i think watame got one too, and subaru iirc", "@Seiyu Yeah, someone raised that issue as she was responding. She said it didn't matter and I agree; on the chance it's real she may help someone out, if it's fake worse case scenario nothing happens, best case scenario someone in a similar situation who didn't comment is uplifted some.", "GriffinPilgrim thank you, I wouldn’t have known from the timestamp.", "@Seiyu I remember that user commenting in many previous streams like a normal user. I really do think that a KFP crew member just left us. But even if it wasn't real, it's still worth a response for anyone who really is in a situation like that, or would be in a situation like that in the future.", "does smn have an idea when the chat was sent (either the chat itself or the sc)?", "@confuqed Ah, as I was watching the archive, I saw both the original message from \"Kitty Esperagozza\" and then the superchat by \"Meltyclaw\" later on.  If I can find the timestamps again, I'll edit my comment for you.\n\n@Kitty Esperagozza posted twice.  Once at 1:20:25 and once at 1:22:31 .  You'll need to be on Live Chat to see the posts.", "@Scipio Massimo Replying just to check up later", "@Starlin I found them quicker than I thought.  Previous comment was edited with timestamps.", "@Scipio Massimo thank you mdood", "@Scipio Massimo Thanks for the timestamps! 🙌 Also mad props to Meltyclaw for paying $50 just for Kiara to see Kitty's message 🙏", "You madlad. I will tip my hat off to you good sir.\nAnd thanks for making someones else day better.", "@Scipio Massimo Good job dude, I only read the one from Meltyclaw and thought he was the one who wrote the original text lol", "The translation is accurate and it's such a sad thing to happen. I hope that the person had fun watching Kiara stream for the last few hours of their life.", "@Scipio Massimo Thanks for the reply", "Pain-peko intensifies", "Oh man", "It hurts. 😔 Kiara's response... 😭 I hope they got it.", "o7 I salute you valiant hero", "Raise a glass high, boys.", "@Scipio Massimo This is a bit of an odd situation. It looks like \"Kitty Esparagozza\" change their display name to \"Matsuri Virus\" recently. While I will give them the benefit of the doubt, one cannot deny that their message had a major impact with Takanashi and her audience. It's best if we draw our own conclusions of what happened and move on.", "@zero9112 Oh, how can you tell what they changed their name too?  I couldn't find them on YouTube anymore\n\nEDIT: NM I see in Livechat their name is different now.", "I was looking for kikkireki but what i got is kikcryki\n\nMy best pray for that guy\nI hope he recovered", "It looks like he deleted his live chat cause I couldn’t see it anymore.", "Time stamp for autual comment?", "That made my stone like heart sad", "For what it is worth, my fondest wishes and thoughts go out for Kitty, wherever they may be.\nBe reborn in flames.", "Mad Respect for kitty", "@Farrell and for meltyclaw for putting the message in superchat. This wholesome side of this community really gives me hope", "Kitty will not give up she have support of all of us", "@Joseph Joestar You can't really recover from stage 4", "When Kiara said we must have girlfriends, she low-key roasted us and called us losers.\n\n\nAlways have been.", "Not a Phoenix without a slow roast in close proximity.", "Confirmed caked in 11 Herbs and Spices, and turned slowly on the spinner.", "Atleast it's not Artia levels of Roasting", "It's a compliment; it means we have high standards.", "@LookingForTheTop I know, It was just funny when she said it lol", "@Lionel K.Y Artia gave me ptsd", "can I get a timestamp ?", "Pain Peko, the sequel", "Do you know which part did she say that? 00:00", "I got you fam . 2:22:54", "@Rich Robb Thnx fam 👌", "Hopefully that person with stage 4 cancer who donated is able to pass on peacefully. I lost my mom to cancer and it's been real difficult since.", "Timestamp?", "2:31:12 - And I don’t have cancer, a user named Kitty Esperagozza sent that message in regular chat in Japanese saying she had cancer. It was really long and I was curious about what it said. It made me cry, and she wanted Kiara to read it, so I donated to have the message read.", "@Meltyclaw I think you did really good don't worry", "Meltyclaw Nah I believe you did the right thing", "@Meltyclaw you did well", "@Meltyclaw thank you, thank you very much standing for her. You did a good job.", "@Meltyclaw Friend, you did a fine thing. Kiara herself said it was OK to send her sad messages and you may just have made someone happier in a very dark time. Be proud of yourself.", "Fuck, the feels be hitting", "I feel you, I lost my dad to cancer and it's been hell since", "@Meltyclaw thank you so much for what you did, it was not just the right thing but something to be proud of and admired for\n\nSo thanks, you're a great person for that", "@Pyro @Clusterhopper For what little I'm sure it's worth my sympathies to you both.", "@Pyro You must be a very strong person to keep going. My grandma was diagnosed with terminal cancer earlier this year and I have no idea what I should do.", "@Meltyclaw It's not cancer but my granny is also not going to be around much longer either. I've been through it before with my grandpa. I want to offer advice but it's all stuff I'm sure you've heard before. What I can offer is my heartfelt sympathies.", "@ClusterHopper same man same i feel you i also lost my mother 2019 november....", "@GriffinPilgrim Kiara has been a shining ray of energy and positivity that gets me through the day. And I'm sure it's the same for most of you. I didn't mean to move this comment section to a somber note. Let's not forget we were here to celebrate Kiara getting 300k subscribers. Viva La Kiara! ", "@Meltyclaw  You did good, I also saw that message from the regular live chat also", "@Meltyclaw You really don't have anything to apologize about. I remember seeing that member posting in previous streams like a normal person would, and seeing that long message from a regular KFP employee stroke me as odd, but I just left that message go away and kept looking at that stream. You took your time, picked up that message, gave it a purpose, and showed us another precious side of tenchou while doing that. Thank you very much and keep being a great human being for as long as we are here.", "@Meltyclaw you are a good man", "Meltyclaw i saw this clip in a clipped highlight, i had my doubts if this was troll or not, but now i get more context, it might be genuine. Thank you for letting that kitty have his day of having his message read by using your money in his stead.", "@Meltyclaw thank you bro, Hopefully Kitty saw that part of the stream", "@Meltyclaw You should be proud of what you did man. I doubt if it was fake, no one would ever make a joke like that to depress someone who is cheerful like Kiara in my opinion. I thought you were the one who wrote the original message when I read the chat yesterday though.", "@MeltyclawBless to that person and his/her family. You honored that person's last wish.", "Ah yes. WHOLESOME", "You don't have to apologise. You did the right thing. Even if it was a sad message, at least you managed to fulfill Kitty's dying wish and even donated your own money so Kiara could read it. \nConsider yourself a hero and be proud of what you did.", "@Meltyclaw Mad respect for you man, you did the right thing and probably made Kitty happy", "@Meltyclaw I only have to say something to you bro... You are a hero and a good person. The Best wishes for you.", "Sorry man", "@Meltyclaw in a video that translated that bit near the start of the message \"I hope you can read this\" so you 100% did the right thing as otherwise Kiara wouldn't of seen it and it wouldn't of got read, hopefully the person saw Kiara  reading there message and it would of meant everything to them.\nThere is nothing to forgive and Kiara would rather see it and cry then to not of seen it.", "i really feel bad for you.", "I won't leave a timestamp today... The whole stream was BLESSED.. Watch it all...", "Awww I got a heart... Its gonna be a good day today", "because Ahoy included and Marine appeared in 47:32 Live Chat, i tried to timestamp\n------------- List song --------------\n11:20 (2010) Aya Ikeda - Wonderful↑ Powerful↑ Music!! (Suite Pretty Cure♪ ED1)\n17:24 (2010) Junky feat. Kagamine Rin - Melancholic ", "Thank you for doing God's work :D", "What a coincidence... Of all the songs to be sung, of all the times that song could be sung, they just happened to sang it on the same time... I call the work of aliens on this one...", "@Cial :3 unintentional HoloEN and HoloJP collab", "The song is literally called Connect, I guess miracles and magic do really exist, huh?", "Legend thanks", "Thanks mvp-san!", "The Connect timestamp is a little wrong 35:15", "@highskies fixed", "@HoloLive Sings wow, even Hololive Sings reply this. No prob", "OMG I LOVE FUWA FUWA TIME! Kiara is amazing!", "I need help on finding Amelia's \"coomer\" chat timestamp. please anyone.", "@Agung Kurniawan 30:10", "YAAAY! SUITE PRETTY CURE IS HERE!", "Kiara and Nene singing Connect at exactly the same time is a miracle from Madoka herself :')", "STFU, let me know when you get a girlfriend.", "Dabead I can never understand why people spread unnecessary toxicity", "What are the chances, same song, at the same time, by accident", "@YayPeacePeace ignore it mate, it's sad really", "@YayPeacePeace It was supposed to be a joke. Refer to this stream. \nI dunno if that man was really toxic but it is most likely not.", "@Dabead STFU, let me know when you do :^)", "@Super I have one, weeb.", "@Dabead Really? Must be a nice pillow there", "@Pyro and watching degenerate anime isn't.", "@Dabead you realize you are wasting your time instead of doing something productive", "@26 Mario Martinez hardly...you wasted your time to comment lol", "@Dabead the irony", "@Dabead Cool.\n\nWe have several wives, girlfriends, a best friend, and a winning son. Get on our level.", "Glad it wasn't from a certain Miracle Witch.", "@ShunkenOne like fuck you do! You degenerate weebs have no shame.", "@Dabead hi! 🙂", "R.I.P kitty, our fellow otaku. We are a small community so the fact that one of us has to go is very sad", "1:04:00\nNot gonna lie, I was also skeptical about how the audience will receive you guys as HololiveEN. \nBut I think YAGOO just pulled a pro gamer move and you guys actually succeeded in breaking the barrier of what initially a niche market into a more mainstream market. ", "That tldr is sums up HoloEN in a nutshell lol", "Yagoo didn't pull anything. There's employees on Cover that do those things, not him, from managers to many others. Stop acting as if he does everything. lol\n\nAnd vtuber was never a niche market, at all. It has been huge since 2017.", "@Caio Coelho I mean, even if it's not a niche market, it certainly wasn't popular outside of Japan. The moment Hololive EN exists, all of a sudden a lot of popular streamers and youtubers jumped the bandwagon because at the end of the day, money talks.", "@Caio Coelho how huge are we talking about here? There is some recognition ever since kizuna ai, but it never went far. At least it stayed within the weeb community only.\nThe whole (live) vtuber trend really just starting to pick up at the end of last year when hololive collabed with azure lane and it's peaked this year. ", "Now we just wait for Twitter, big corporations and Hollywood to sink their poisonous talons into these angels.", "@Carcer Harlson It's a huge obstacle for these girls for sure because their genuine wholesomeness and kindness are put to the test to compete with those money vacuum corporation that only joined because of numbers and statistics. I hate them passionately.", "@Phrozen Flame I'm right there with you.", "@Phrozen Flame Outside of Japan is more than the west man. Vtubing is popular on Asia in general for years already.", "@RaveOn I'm talking from a perspective of someone who's into this since 2016 seeing this industry growing, which is when I discovered ai-chan so maybe that's a reason for why I see it a bit different idk. AI for example have live shows in Japan and Asia since 2017, merchandise, credit cards, ads from her appearing on the middle of Shibuya, collabs with games, her own TV show, among other things outside of youtube. Nijisanji and Hololive also have similar things on a smaller scale but still have a lot with merchandise, songs, voice packs, live shows, collabs with games and so on. ", "@Caio Coelho Thanks for the explanation. Seems that you just misunderstood my context. I'm aware of how huge it is in eastern region - japan especially. I'm talking about the recent west / global market penetration.", "@RaveOn Yeah it didn't hit the west until recently but reading your comment it's like you're ignoring the fact that the other commenter made it a point that it was huge in Asia which is def an international market. It's almost half of the global market.", "Who would have thought English is a more popular language than Japanese.", "@Caio Coelho yeah but yagoo does final approval of it as the ceo, and reviews everything over\n\nHe can just scrapped it of he wanted to", "To be honest, those of us who do not speak japanese, we are mostly limited to streamers who make an effort to speak english, there is little I can get from a 100% japanese stream if it isn't subbed", "It takes a really special type of person to take such a risk. I think that's what this 1-month journey has taught us when watching Kiara's streams. That's why she's an inspiration for so many people too (even though she is prone to procrastinate, lazy, foul mouthed in english, etc lol)", "@Phrozen Flame tbf pokimane is like a 'touch and go' experiment right now, if she succeed then many big corp gonna do just as you said, if not then i dont think they're willing to take that risk", "Personally I don't really see HoloMYTH as 'dubs' (Notice that I said 'myth' not EN).\n\nI do want to agree that in the beginning I was skeptical. But everything changed with Calli's OP music when she said \"F**K IT\"...", "Jesus the delusions.\nAnime dub are traash and pure sjw. Game dub are fine sometime, yes, sometime.\nThese girls are fine and talented and should be supported.\nHowever, this canturn into a western shitshow anytime soon, would not want to be there to witness it. I hope not.", "Here are some english and japanese time stamps / こちらが英語と日本語のタイムスタンプです\n\n00:01:34  ★Start\n00:11:21  1. Wonderful↑Powerful↑Music!! / Aya Ikeda", "ありがとう", "I think 7 is read \"Warera Houshou Kaizoku-dan\"", "Thank you 🙏🙏🙏", "@Kazuya Nakamura Thanks for the correction <3", "I believe the title of Marine's song is Ahoy!! Warera Houshou Kaizoku-dan☆", "ありがとございます。your japanese is perfect !", "It makes me happy to see you enjoying streaming so much now and starting to believe in yourself. \n\n“You do you Kiara. Don’t feel like you need to change yourself to make others happy. I will continue to simp even harder so that you can be yourself.” ", "Reject real girlfriends.\nEmbrace 2D supremacy.", "Nice Raziel pfp. 👌", "yes sir", "But Kiara is 3D, lol", "@Noelle Silva Not on my Monitor.", "2.5D overlords!", "(But only until they get their 3D models)", "The cancer thing hit me right in the heart ;A; my aunt died of cancer last year. Kiara said the right things. She is so blessed ;A; Every time I watch her and look at chat it's like world peace is achieved! We're 1 step closer everyone!", "this entire stream in three words:\nBASED\nSUPRELIT\nDOPE", "kiara is a coomer (c stands gor chicken) - amelia watson", "🐔👄 Kisses Timestamps:\n40:13 Chu\n1:32:49\n1:34:53", "Not all heroes wear capes", "o7", "QUALITY CONTENT ", "U r a god", "This stream put me in many feels from her amazing singing to that sad message 2:31:17", "Blessed singing, based papa, synced senpais, and a happy Tenchou! Congrats Kiara, looking forward to many more!", "I fell into sleep when she streamed this. Sad times. Oh well. ARCHIVE TIME!!!\n\n\nCongrats in getting 300K!!!", "Watch the whole stream if you can.", "@Huy Hoàng ah yes, I did finished it 30 minutes ago. That \"cancer\" superchat hurts, man.", "it was a cancer-related superchat, right? Something like that?", "@KIARA VIRUS it is part of it but this include lotta surprised moment ya. Marine-senpai song. The incident collab with Nene. They all appeared in the chat so what I meant is the whole stream was blessed so you shouldn't skip it", "Theres a kiara virus??? Hmm hmm", "@AMELIA VIRUS I didn't knew there was an Amelia Virus.", "oh a new virus?", "About the thing with girlfriends:\nKiara, no! Bad phoenix! Besides, you already have Calli!\nAnd I hope Kitty can have a peaceful passing with no regrets. I salute our fallen sibling.", "2:31:14\nWish you all the best and always stay positive <3", "It's so sad to hear that Kitty's in poor health, but I'm glad that they could find something to enjoy in their final hours..", "\"BASED!!!SUPERLIT!!!!DOPE!!!\" Auntie trying to be a zoomer", "Marine: how do you do, my fellow kids?", "Man, now I feel really emotional hearing that superchat from the guy with cancer.", "IM DYING IN PAIN", "The Nene duet was amazing  congrats again tenchou!!!! That's three hundred thousand people around the world sat in front of their computers watching you do your thing! And we ain't leaving!", "She talked later about a possible collab  i need time stamps please ", "2:06:45 got it ", "Seriously tho, all of hololiveEN has such a beautiful voice", "Lol I hope they’re real", "@Carlos Andrade  hope they are real apposed as what? Being a computer program?", "@Shyphyre cat lol naw I mean that I hope their real voice ain’t that different from their on screen voice so they don’t strain their throats", "I don't know man, amelia's kinda...", "@TheLobitzz amelia's just nervous, the amount of nervousness present in her voice is off the roof, if amelia will just get more comfortable in singing, her singing voice will be more beautiful", "@Carlos Andrade I think theyre real cus who can sing and rap in a different voice for like hour straight?", "Really think about the factors that had to be in place for that Connect sync with Nene to happen.\n- Both Kiara and Nene had to stream at the same time of day\n- Both streams had to be karaoke\n- Connect had to be on both of their setlists", "Time stamps\n\n11:05 1. Wonderful↑Powerful↑Music!! / Ikeda Aya\n17:05 2. Melancholic / Kagamine Rin ", "Funny how the chat was requesting Rammstein for a super brief moment and suddenly stopped.", "Ask for Rammstein and you get Pretty Cure.  Everyone wins.", "im imagining kiara singing du hast", "35:18 it's like a duet of nene and kiara they sung it at the same time in their own livestream", "Someone need to make a duo clip ", "https://www.youtube.com/watch?v=AIK6fyh1AP8", "@Raiden thank u ", "Between Rock, Paper, or Scissors who went up to sing karaoke, ? Rock. He was Boulder. Quite a coincidence between the phoenix/chicken warrior idol & orange/peach ceo idol. Also I´m happy that Kiara´s content can entertain us all and put a smile on our face no matter our circumstances.", "This is the most lit singing stream I've ever seen. Her papa cheering together with us, Amelia making a Coomer joke, Kiara and Nene singing Connect at the same time on different streams and Marine appearing in the chat when she started singing her original Ahoy song.", "Thank you Jesus Christ, God himself to bless this stream and Lucifer(?) too for hanging out with us.\nThere's no hiccup, no sudden connection lost, no mic problem and a sync karaoke with Supernenechi too.\n\nBlessed stream all the way.", "What a fun roller coaster of feelings in this stream☺️\n\nHappy, Wholesome, Funny, , Sad, Proud,  and thankful...", "I was truly blessed to be watching both streams at the same time when the unintentional duet happened. such a great coincidence.\nalso that Ahoy was amazing even with mistakes", "Who else was singing?", "@Akagi Balaur nene was singing connect too", "@Bom Boyage Thanks!", "It's been a roller coaster of a month. This journey has been an exchange of emotions, an unique experience when many of us feel isolated for external or internal reasons. I think we humanize other people and the streamer the more open we are with our thoughts.\n\nKiara, I don't think it's a coincidence that the KFP crew is so supportive of you and of each other. Your own personality created this community and attracted that type of people around you. I'm blissed and proud to be part of that group.", "2:36:30 i will explain how to say my name another time ^^ kiara thank you! 언니 보기만해도 신나고 행복하고 따스하다!!!!!!사랑해용💕💕", "I think that was some of the best singing I've heard in my life. You have such a nice voice, I think I teared up a little.", "Theres surely no way they don't all make a song as a group surely?!\n\nThe bar has been set high for future holoEN generations", "I raise a Mug of Mt.Dew for this awesome singing stream and to our comrade who fell in this rabbit hole that we called Vtubers while fighting his stage 4 cancer! Cheers KFP!", "I'm glad Kitty was able to pass on happily watching their favorite person. As a cancer survivor, it really hits home hearing about something like that 😞", "I'm young, yet I already feel that my life's been blessed.", "I have subbed the entire karaoke portion of this stream in English for those who are curious of the meanings or wish to improve their Japanese or English", "Thank you!", "Congratulations Kiara-chan! Here's to 100k more soon! Lots of love!", "Honestly, what a lovely stream~ I might not have seen it all, but for the parts, I managed to catch, I'm very happy to have watched! The thing I like most about Kiara is simply how close she is with her audience and how inclusive she tries to be. Keep going strong as always Kiara~!", "マリンの歌、歌ってるの可愛い(๑•﹏•)", "Beautiful singing Kiara, just what I needed to help me through my Asacoco withdrawal", "I must say that I just saw the part of she Kiara read the super chat. I want to say that she is just a wonderful person with beautiful feelings. Starting from today I will be subscribed to your channel and watch your streams.", "I'm sad I missed the stream cuz I was sleeping lol. Congrats Kiara! We love you ", "Hello Kiara,\nI wanted to apologize, because I needed to leave the your stream, and I missed half of the Supercht reading, I'm catching up to it right now. \nYour singing is really awsome, the energy you transmit with your voice cheered me up and made my day. Sorry but I don't know how to say it in English but du singst wie ein Kanarienvogel wirklich zauberhaft. Dein Deutsch klingt auch sehr süß.", "Thanks for archiving this one, its so fun! I'm still impressed at how well your voice works with really poppy songs, it's perfect!", "This stream put a smile on my face", "Truly a blessed stream! Congratulations on 300K! ON TO 400K!! ", "That last song really got me tearing up Your voice is so beautiful Kiara! I hope you can do more slow songs in the future too, it's really enchanting when you sing like that. This stream was so amazing full of so many miraculous moments. Congratulations again on 300k!", "2:34:12 that is the wisest quote I've heard in years.  May kitty rest peacefully and had a better life up there", "Just missed the stream, however, this karaoke it's archive that one good things", "57:16\n\nYES WE ARE😭 YES WE ARE❤️, AND ALWAYS WILL BE!❤️😭", "ふわふわ時間で泣いた😭\ni cried when she sung a k-on song.\nmy memories...!", "Think of yourself like a Phoenix. ❤️", "For me who understand 5 languages including Japanese (and English of course), her streams are 10 times more enjoyable.\nNot to mention she's wholesome. I love this bird", "Congratulations Kiara!\nI'm so happy for your success and thank you for such a wonderful stream. \nYour KFP family loves and supports you, old and new.", "This is the future and i freakin love it!", "it's always worth watching the 8 hours of SC reading, that's where the deep content is", "Congrats for this awesome stream, you deserve more and more, your colors aways bring us hope and happiness.\nWarriors cry to, but never stop fighting.", "Kiara, you have a beautiful, loveable, and charming voice ♡ \nI couldn't make it to the stream but I'm still glad to hear you sing, and congratulations on 300k!", "Best of wishes to you JP bro, remain brave and strong as you already have been. Let the flaming light guide you through and may the phoenixes' tear aid you through your hardship.", "Amen to that", "@Wowza Kitty was the one with cancer. The guy who pasted his regular chat to super chat was meltyclaw. It's one of the top comments in Kiara's original stream", "@Wowza Ahhh, ok I missed it then, i ma change it right but regardless, I still wish him/her the best.(its him right? I think it was a him)", "Dat Ch'e my bad, I guess I read it wrong. I really needed some sleep.", "I am already extremely excited for a new karaoke stream, I need more Kiara's voice in my life, I am suffering from abstinence", "What convinced me to be a member? I watched the Mario 64 stream. That oil temperature was way too high for a deep fry.", "いっぱい動いて楽しそうなのがかわいかったです！また聴きにきまーす！", "Congrats on 300k Kiara! Seeing you come from debut week to where you are now has been a hell of a ride. Loved the karaoke and the superchat reading was the cherry on top!", "Gurren Lagann is one of my top animes, have original Japanese and a copy of the Dubbed, when you had to pay up to 50$ for a volume.", "Congratulations on 300k! Well deserved, you're amazing!", "Thank you for a wonderful time Kiara - you singing is on point. This stream was an absolute blast!", "KFP FAST FOOD EMPIRE CONTINUES ITS EXPANSION!!", "That one super chat hit deep brings back too many memories of my g-ma🙏", "Huuuugh i was sleeping i missed it, glad there is an archive.", "Damm i missed it😔", "Congratulate 300k!!\nJust Kiara!", "Congratulations! I had to miss it 'cause I was out and about lol. But watching this made my whole day so much better. ❤🧡💛", "I was so tired after the MC collab that i missed the stream t.t \n\nFinally watched now, wonderful voice and stream tenchou!", "Sometimes I forget that VOCALOID music is popular for other people as well and not just something rare and special I found in middle school.\n\nYou did a great job singing Kiara!!! 🔥🐓🍗", "Kiara's laugh is starting to resemble Pekora's really closely wwww", "This Phoenix sing had save me from deepresion", "Kiara is a good girl go-getter and deserves tons of subs!", "That was a beutifull stream uwu", "We love you Kiara! Love your energy and hardwork! The last song you sang hit me! Ganbatteeeeee!!!", "Great stream! It was worth superchatting for! I'm extremely happy for you! Keep being aweseome!", "Omggg so happy for u hope u feel proud of urself now we will always be there for u whenever u need our support😌", "ねねちとコネクト被ったの奇跡に近いと思う。二人は相性が凄く良さそうだね??いつかコラボでコネクトを今から期待してる(*´▽｀)", "Congrats on both 300k subs, and a second karaoke stream with great songs and singing. I enjoy seeing you having fun with singing songs that you want to and being happy. I hope you can collaborate with others for more songs and making your own songs as well.\n\nCan I confess something? I have a crush on you (and Amelia, too); I figure it's just part of the idol world experience and it's something everyone is going to have for one or more idols, something that's all in good fun as a fan as long as it doesn't go too far. I know it'll never come to pass as an actual romance, but it brings me some peace and hope to have that feeling for now. I hope that's OK; I'll try not to go overboard with gushy romantic stuff that's not appropriate. Thank you for being you.", "Congratulations Kiara I hope it always happens to you and you have the best we love you our favorite chicken", "I commiserate with Kiara's difficulties with tea. I like my tea, but I can't handle hot drinks ;_;\n\nThere's mugs that keep your drink warm from the bottom for a good while...these help.", "The warmth of this wholesome Phoenix is just too much\nIt burns right throughout my bones and flesh\n\nPlease hire me as a dishwasher in KFP", "You are awesome. I hope someday I can get to be as carrying for others as you. Keep the great work fenix!!!", "You have a amazing voice, keep up the good work.", "30万おめでとー！\n応援してます、これからも頑張って！", "You are perfect as you are Kiara you do not need to change for others we love you all of us and I hope you always give your best and be well", "She sang Diamonds. I first heard it in the game Drummania (now part of Gitadora), the game that made me play drums in high school.", "OMG I MISSED IT UGGGGGG", "Official Duet collab with NeNe when?", "Kiara, I love your songs! これからも応援してます！", "CONGRATS on 300k !! GIGA DRILL BREAKER INTO 1 MILLION !!", "her voice is SO GOOD!", "I had to leave halfway through the stream. Well here I am again", "K-On! <3", "CONGRATS ON THE 300K Boss!", "RIP Kitty", "i actually watch the whole thing", "Thank you so much, Colonel Kiara! Congratulations on surpassing 300,000 YouTube subscribers! Well deserved! 🙏❤️✨", "I'm blessed", "Couldn't see it live but these are for you:\n\n👏👏👏👏👏👏👏👏", "Hey, I dont know if this is the right place to make a song request if not someone let me know how I can haha...but I think Kiara should try to sing Jiyuu no Tsubasa from SNK/AoT..it's got a little german in it and I thought hey...I'd like to hear her sing it xd. Kiara/Kiara manager please make it happen hehe :D", "🎉🎉🎉おめでとう！！！🎉🎉🎉", "To kitty, plz live, if not, see you in next life* Hold up drink of Dr.Pepper* and down it in one gulp*", "Is it me or does kiara have the highest amount of movement every stream compared to everyone else🤣", "Congrats on 300k!", "I still can’t believe you covered a Princess Princess song. The Highlight of my day.", "I love you ❤️", "OMG a singing chiken", "Thankfully this was archived since I was asleep", "我ら宝鐘海賊団、ジワる", "Heard she speaks in English and Japanese!! Awesome!! subbed", "300kおめでとー", "YEY ITS ARCHIVED!!!", "Seeing kiara cry hits me right in the heart 😢", "400k next baby let's go!", "A rare phoenix! To see a karaoke stream be archived by the official channel.", "1:42:20 I relate to these sleeping problems. Even when I wake up early to do stuff, I stay up like 20+ hours anyways and wake up at the same bad time.", "Shes so good at singing but i guess she was a idol at some point so that makes sense", " listening at work.", "Her energy is just what we need on a daily basis.", "Nooooooo i missed it", "For Kitty, we will see you again.", "Great show Kiara!", "congratulationn", "Cant wait till review brah puts out a review of KFP foods", "Beautiful singing! Kiara is best pure idol", "300k LETS GOOOOOO", "My little chicken can't be this cute!", "Aw I was late", "My best waifu, I love you kiara 7u7", "Damn, I was hoping she would sing Never Gonna Give You Up", "I guess that really let you down huh", "Congrats tenchou!", "Oh thank the lord this is archived", "German song? Try \"So ist es immer\" It's in German and English lol (it's from AoT)", "Nice!", "Wow. HoloJP and HoloEN's first collab", "is it me or is this comment section full of bots?", "コネクトすごい", "Tonight we drink to a fallen comrade. CHEERS", "You know what would be amazing if you do another minecraft video with the whole gang with a subscriber play on your guy's world if xbox can play with computers then my xbox account is Obama Gaming634", "I know you're not getting this until late, I'm working through all of the EN backlogs when I have the time. While I don't have cancer it has ravaged through my family, my grandfather passed two months ago for cancer my aunt's years before that. My dad did have a thankful he was able to be treated and has been clear for a couple years. With that in mind anything cancer related is always sensitive for me, and they can only congratulate you for the way you chose to handle that message from Kitty. And it's weird to say it kind of helps when the ideal thoughts of those who I have lost as well the analogy of like Phoenix kind of helps. I'm not one to come that much I'm sorry if this comes off weird just wanted to get us off my chest and say you are a brighter point of light than you may think you are for those who are watching. Keep up the great work.♥️🐓♥️", "God i wish i was her tea", "congrats on 300k", "more like Kiaraoke", "I Love Your SINGING", "Ich finde immer noch krass, dass du Japanisch,Deutsch und Englisch so gut sprechen kannst.", "2:31:17 #bottomsupforkitty", "I'll take any cover of Connect, but today being meguca was definitely not suffering", "conguratulation 300k", "Kiara and Nene synced singing timestamp:\n\nKiara: 0:35:16\nNene 1:09:58", "Here is Nene's direct song link https://youtu.be/9C5CZ7hdcAo?t=4198", "Watcht kiara on tv and nene phone with sync sound god im in haven ", "Here's a side-by-side by HoloLovEN https://www.youtube.com/watch?v=AIK6fyh1AP8", "Atleast calli will see kitty right?", "Blessed stream", "Takanashi do u love Mori?", "First Kanata and now Kiara who else will join to Marine's crew?", "I could never tell that her throat is less than well", "For Kitty 🧡 🍺", "Thanks for the karaoke. It's fun that you sang Marine's song since it's that song that made me a fan of hololive. Good singing. Congrats on your 300K.", "Why only Kiara's karaoke is archived?", "Cause she got all the permissions for the songs i think.", "@pikminboss Yeah, Hololive/Cover seems to already have a bunch of licenses for Japanese songs, but not really for any English songs", "the song call connect and really connect people", "2:24:24 sorry but I love Amelia", "Kiara, I dragged my girlfriend into the Hololive rabbit hole.  Is that good enough or am I gonna have to break the news that I'm taken?", "2:15:45", "1:22:49\n2:30:56", "For an XYZ graph, what do y'all think they should add to purity and intelligence?", "It would be so interesting to hear you sing Blumenkranz from the Kill la Kill anime. \n\nAnd yes, I also noticed the difference between German native speakers listening to German lyrics and English native speakers listening to English songs. German instinctively feels a bit cringey to me in lyrics in our pop music. I don't really mond it in old anime openings and the likes because those are fun lol.", "IT`S MORPHIN TIME!\n\nRushia: YANDERE POWER!\nSubaru: BIRD POWER!", "2:13:52", "2:22:49 J U S T  K I A R A/\nOrigin of Yandere Kiara", "Still a better deal then my last ex", "The miracle connection between Nene and Kiara. Could it be fate?", "OMG CONGRATS KIARA !!!!", "Just Kiara 👀👀👀👀👀👀👀👀👀👀", "Just yesterday someone has an identity crisis. Now we on 300k. Is this phoenix time I am experiencing? Congratz Kiara! Stay confident.", "FIRST HOLOLIVE EN SINGING COLAB IS HERE", "Nice UmU ❤️", "大切な人と、いつかまた巡り会えますように。", "👍", "Good girl", "Timestamp for kiara duet with nene?", "Unsubstantiated just so you can do it again.", "1:27:55 just my own superchat reading, don't mind me.", "Very deserved most sleep on EN member", "1:12:49 heh\n1:18:48", "Kiara is the cutest of gen 5\npure birb", "Looks like Kiara and Nene have to do a connect duet MV now. Sorry, I don't make the rules.", "2:06:45 she talked about nene chan and 5.gen this is too cute", "38:05", "@ichiいち someone need to cut this in to a duo ", "2:06:45", "Here's a side-by-side from HololuvEN https://www.youtube.com/watch?v=AIK6fyh1AP8", "2:22:25 I spend money to talk to anime girls. Do you really have to ask whether I have a girlfriend?", "No llores hermosa tu no deberías a ser eso", "ختبقخياخينقختيتيمباخياحيخةصخبت", "‌", "I missed this!? Time to fix that", "hi", "i play minecraft", "yayyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy", "How come Kiara can archive her karaoke stream? Don't get me wrong, I love her and I appreciate not having to look for a clip of it, but won't this have any negative impact on her channel? A copyright strike maybe?", "she mostly ask permission first and ask which song is ok to be archived", "She said that they have a list of approved songs they can sing and monetized", "", "Congratulations on 300k Coomer", "Usually like Kiara voice, but these songs just didn't seem that well done on this one. IDK if it's from being spontaneous, or what, just sounded a bit subpar.", "I Strongly disagree", "@Pyro and that's fine. I know kiara can sing, just seemed off on these ones to me.", "Slight delay on the OBS that's why she sounded offbeat. I got this on her tweet", "@aleisley I saw that. I didn't mean the slight offbeat, just her voice in this one. Idk how to explain why it felt off, so I haven't tried to. That and people would pounce", "@Ryan A Oh ok. She's suppressing her own power level idk why. And yeah, sometimes a hugbox is pretty bad since it seems like you can't state your own opinion.", "Don't act too cute you might've killed someone already.", "bad start", "To what?", "you don't look real"]