["At this point KFP might as well stand for Kiara firing people.", "That's good 😂", "Nice one", "damn", "Ina fans: Let me wait for you at the entrance m-lady tips fedora\nKFP Employee: I DON'T GET PAID ENOUGH, HAVE A SHELL", "Ina: Dang it guys you’re supposed to play fair, don’t you want cucumber ASMR?\n\nKiara: You s***heads lemme win already!!", "@Shuangshi Ye Hahahahahaha", "Best example of the phrase \"I DONT GET PAYED ENOUGH FOR THIS SH*T!\"", "C'mon KFP crew... You guys let her win too much, she's going to get cocky", "I just don’t want to get fired again, sorry.", "@Vgamer311 yeah man keep falling 🤣", "The poor bird deserves to win, let her", "But we can't fund her superchats if we lose our jobs!", "@Dnao - KFP's HR Manager big brain time", "indeed, We don't need her to get too ahead of herself. She still has the Peko virus so Bullying her is a must.", "Word. Treat her like that and Pekora is going to destroy her when they meet on the track.", "What do racers eat before a race? Nothing they fast", "...........*like*", "WRONG CHANNEL", "FOUND THE TENTACULT", "Ina level jokes right here 🐙", "There’s a Tentacult among us", "....", "Boo! Hiss! Boo!", "They eat losers for breakfast", "God damn it....", "This is actually good and I hate you for it.", "A moment of silence for our rehired brethren who were promptly fired, again...", "She went from meh driver in the beginning, to progressively getting better, to being betrayed by Judas, overtaken by the Colonel, sighting an Old Ped0, losing to an imposter Kiara and finishing up in 11th place. Just another day in the Daily Life of Kiara.", "Out of curiosity, who is the “old ped0” you’re talking about? I didn’t notice anyone like that.", "@Vgamer311 there was another player named that yeah", "@Sleepy Todd - KFP Chess Club Rep ah, I see, thanks for explaining. Ngl I kind of thought op was talking about me since I’m proudly one of the most hated people in the community, lol.", "@Vgamer311 you weird but i like you ", "@Vgamer311 wait why do ppl hate you??", "@ichiいちHonestly, I don’t want to sound conceited but I think about 80% of them are just jealous that I’m fairly well known in the community and can afford to superchat every stream. The rest just think I’m “cringe.” My fiends and I literally go salt mining out in the wild and compile screenshots of the funniest haters. It’s hilarious.", "@Vgamer311 People really hate on you? You're iconic at this point.", "@nate0560, KFP Inventory Manager Yep, and you also figured out why; it’s because people consider me iconic and their fragile egos can’t handle it.\n\nHonestly, if anything I’m glad it’s someone who can take the heat and even finds it funny, like me rather than someone who would be truly hurt by that sort of thing. I figure every second these toxic people spend on me is a second they aren’t spending on causing real harm to the community. It’s a win-win.", "@Vgamer311 That's still a real shame though. This community has really seemed to be super wholesome overall. There will always be a few bad eggs (pun very much intended), but they seemed very few in number.", "@nate0560, KFP Inventory Manager if it makes you feel any better, all things considered they are few in number. Only reason I’ve seen so many examples is because we periodically go searching for them. If you take it as a percentage of the whole, the vast majority of the community is chill.", "@Vgamer311 I'm not doubting you, just thinking that it's a shame.", "@nate0560, KFP Inventory Manager if you gather over 300 thousand people together, there’s no possible way they’ll ALL be good people. It’s just not something we should dwell on.\n\nInstead we can choose to focus on the vast majority who are actually good people.", "@Vgamer311  interesting comment thread. And sorry for the late reply but obviously i wasn't referring to you as was stated earlier. Was browsing the chat in the 3rd to last match and people were going \"lol wtf is that name\". It just made me laugh.", "Timestamps from Kiara's Fan Discord - Please visit us Kiara Fan discord is discord.gg/kfp \nPart 1/2\n1:07 Kikkeriki + BMG humming \n2:26 Kikkeriki!! ", "Part 2/2\n39:37 i can drive without holding the wheel \n40:10 Judas betrays the savior \n41:10 KFC attacks ", "Yay , Captain Pepper Jack's with the timestamps , Thank you o7", "@wolfz KFP Health Department Advisor no thank you for finding it useful. I've been very lazy lately", "@Captain Pepperjacks , It's really helpful tho , sometimes I come back to look back at certain moment , so this help me a lot , respect to egg members o7 🥚", "BTW for anyone wondering. YT likes to censor some weird words and shadow ban comments. The part where I typed YT censor word I not really a cursed word or anything. Getting around YT censorship is the hardest part of making timestamps.", "The Return of the King", "@Vgamer311 lol epic gameplay , respect o7", "Is the discord official from Kiara?", "@Comrade Ma YS No. From my understanding each discord is fan made and there is a discord for each hololive. There is a main hololive discord but idk much about it.", "thanks so much, by the way can you catch what she said at 29:09 - 29:11 ?", "@A SINFUL GURA VIRUSサメの罪深い教信者 Sorry can't make it out. I would just say bird noises", "Commenting after stream is nice", "Because it could become useful in the future: \"Bottom left\" is \"unten links\" in german!", "54:47 \"Imagine me as your girlfriend right now. As your girlfriend, you would want me to be happy, right? SO MAKE ME HAPPY!!!\" moaning LMAO xD", "I want to point out Judas's toxicity and exposing him of trying to sabotaging your chances of victory. \n- 40:09 - 40:18 Judas stealing the boxes making Kiara rage at him.\n- 41:52 - 41:58 Judas using Bullet Bill to hit Kiara and overtake her. Thanks, Acer Shaw for point this one out.\n- 54:17 - 54:33 Judas being toxic by throwing 3 Red shells at Kiara.", "Can’t believe Judas would be a betrayer. Personally, I’m shocked.", "Wait I can explain.", "@Judas there’s no need, you’re fired lmao", "41:52 - 41:58", "@Acer Shaw That Bullet Bill I almost forgot thanks for that. ", "I'm not sorry. She has to learn the Mario Kart way. It's a rough world out there and someone's gotta teach her.\n\n\nPersonal Timestamps:", "Damn it, Judas, this is why we keep getting fired.", "It is what it is.", "Yeah, I'm pretty sure that was also your excuse when you betrayed Jesus.", "@extralie Judas betrayed Jesus because the later was not good at Mario Kart?", "@opphiucus yea, he was aways letting people cross him", "What an appropriate name.", "Autobahn.......... \n*sigh | Na dann wollen wir mal... \n*clearing throat | \"Diese Kommentarsektion ist nun Eigentum der BRD.\"", "hahaha", "lmao", "Find ich gut", "In case y'all didn't catch it, the Autobahn is Germany's country wide highway network. A fitting name for the German Chicken's driving stream.", "Time will tell it one day Kiara will try her luck in Nordschleife\n\ninb4 actually flies off at Flugplatz", "🐔👄 Kisses Timestamps:\n1:52:08\n1:54:30 CHU for huke papa", "Let's Go , timestamps post 🔥🔥", "o7", "Ill leave some timestamps here\n26:51 Kiara: \"Oi oi oi oi oi oi!\"\nRohan: \"Oioioioioi!\"\n1:32:57 Kiara: \"Whats o7? Is that like someone is \"saluting\"?", "Thankfully Not all KFP Employee are Fired in this stream while Kiara proceed to speak in three language 😂. \nPS : Have a nice rest Tenchou", "To be honest, I was proud of Kiara's mindset that she didn't care about the wining or losing in the game, she just want to have fun and comedy for us in her steam. Most people liked her personality of hard working, she really do her best to bring us lots of joy. And I hope one day Kiara can have 400k subscribers in her channel, because she was not a normal chicken, was Burning Fenghuang, our favorites vtuber! Keep going.", "Today's a truly Austrian motorsport experience for me\n\nI jumped off ADAC GT Masters stream where they raced at Red Bull Ring (an Austrian race track) into this Austrian Phoenix's Mario Kart stream,then had to jump off to see Christian Klien (Austrian ex-F1 racing driver) racing in GT Open stream", "yeah nah mate! the Bathurst 1000 might've just gone past but there's plenty of other Aussie motorsports to keep you satisfied!", "@The Chinese Russian oh I love Aussie motorsports as well! 😁 Bathurst 12H,Bathurst 1000 and WTAC are three of the events I always wait for.Quite a shame WTAC is cancelled for this year 😔 Always looking up to Improved Production races as well,but can't find where to stream it live as someone living outside Oz", "Kiara: \"We broke each others ears\" Me: \"Do birds even have ears??\"", "Lol, bird don’t have earlobes. But they have an opening like an earhole. It’s usually hidden behind their feathers, kinda creepy. Of course there’s bird that have their earhole exposed too.", "@Gekie Xerion Cool, I learned something new B-)", "I don’t even know what to say. This was amazing. Playing those rounds of Mario Kart was the most fun I’ve had in a really, really long time.", "the legend in the flesh (metaphorically)", "@Alex H the... digital flesh? Maybe? Idk.", "RIGHT NEXT TO ZE AUTOBAHN\n- james pumphrey (up to speed on brabus)", "Kiara's getting Amelia-levels of aggressive lately.", "I think I'm going to buy Mario Kart just so I can play against Kiara, I haven't applied for a job at KFP so I can't get Fired.\n\nEdit: 42:30 Kiara: How am I supposed to win against a fast food Giant?\nLiterally Huke PaPa: ハンドルにぎってもろて", "Looks like Kiara is getting better. Time I selected saw her get fifth place, though the course was pretty simple.", "Bro, her toxic rage is so funny lmao", "Kiara gets so spicy in these games, love it.", "Got my name said and everything and didn’t even have to simp lmao", "11:18 We're drinkin' from the same cup!", "53:46 here’s one “imma drift right into your mama’s dm’s!”", "Kiara picking up Calli's language... ngl I dig it", "I know she's a fire girl, but didn't expect her to also fire her employee.", "If egotistic tyrant Kiara becomes a thing from here on in I am here for it.", "i kinda love how stream snipping as a KFP employee means losing.", "Day 4 of commenting on kiara vods to help her with the algorithm. Sorry i missed yesterday but i forgot", "She keeps on firing her employees lololol", "She becomes a totally different person in mario kart...we need more toxic kiara", "高らかな〇ねの叫びが聞けるのはココですか…", "Shoot, I was late, I just woke up and missed the stream, at least I can watch it again :D", "Takanashi Kiara : professional chess and Mario kart player everyone 😁\nLove you really kiara... Don't fire me", "Yay! + Death threats in german.\nI can't ask for nothing better! xD", "Her intro theme already seems really nostalgic for some reason 🤔", "前回よりは上手くなってるな....\n\nうん...", "Well the stream is rather explosive. Congrats on reaching 1st place on that one moment and not being last. Lol people getting fired again.  Your German and your shouting is as blessed and great as usual. Thanks for the stream.", "Ahhh shoot, I slept in and missed this.", "Ah yes, the birb is back at it again. LOVE IT !", "the moment kiara said if we can ski reminded me of Dora for some reason.", "Wonderful stream as always! Thank you very much, Colonel Kiara 店長! 🐔❤️✨", "Aww, I just woke up and missed the stream.", "#metoo", "Same... but we here anyways 🧡", "34:22 It's not like I wanted to use my ears today, it's fine.", "Sees Kiara streamed Mario Kart 8DX again. \nTime to print another Resume..", "Having a balanced sleep schedule < watching every stream live", "最近までずっとｹｯｷﾘｷｰだと思ってた", "Man I my phone died during stream 😞", "Tenchou is at it again! Verbally abusing her Employees :D", "when your boss (who you pay to work) threatens to fire you and invokes the state of the economy. Very on brand for Tenchou lol", "i couldnt watch u were too loud together lmao", "Man this streams give me life", "damn i was asleep for this", "Kiara's firing reminds me of Donald Trump saying you're fired in trump tower.", "Kiara: I'm doing well\n\nTrump: WRONG", "I like all her bgm but the one she plays in the SC reading at the end here is special, I really love it. It reminds me of the Shuffle! ost.", "I feel like her demanding she has her employee's let her win stems from how she would play with her brother. Lemme win or I'm telling mom.", "Hey Kiara, I dont know if you can see this; I really like your personality and hope your channel will become successful, so dont get me wrong, but the only thing stopping me from tuning in to your streams frequently is that the difference in volume is really jarring at times. I think you know what Im talking about. Then again, I dont want you to hold back and not fully be the personality that I and all your fans love, but it would really help if you can tune your audio so as to even out the volume levels. I believe there are automated scripts out there for a 'quiet mode' that closes the gap between high and low volume input, and that will help the quality of your streams immensely imo. Good luck with your work and go kfp!", "Kiara best boss!", "Thanks for the Stream Kiara. I am now a fan.", "Good stream! Here to rewatch", "I miss it :(", "We need more Mario Kart this is to funny", "Swearing every other word gang", "37:26- \"A\"", "🤔 ich bin echt fasziniert~", "1:17:43  That laugh tho", "I bet this was fun to watch live", "I heard she has nice buns- Ina sent me 😎", "I wanna see Mario party collab", "Tenchou, I have a complaint... I ordered these fried chicken earlier from KFP, but why are they so salty today? :) Loving the content.", "I watch Hololive for fun content. Like a chicken firing her employees for not letting her win at Mario Kart.", "Epic Stream", "You can tell she is not used to talk german casually anymore, \nhowever the way she can still speak it is ridiculously good.\nWhat surprises me the most is that she has no accent, \ni would expect at least somewhat of a japanese one but there is none at all.", "Kiara is natively german lmao, why would she have a Japanese accent", "@2 cheetahs eating a pumpkin She lives there duh", "i assumed everyone put on Japanese accents (Source 1 see Kiryu CoCo)", "@DeathbyBeer I mean even if she lives there how would you get an accent on your native tounge?\n\nI've lived in the US for most of my life and my Spanish doesn't have an English accent.", "@Keeys I don't know, i never lived in another country. \nBut i have talked to peeps that just studied in other countries for a few years, they came back with an accent and started tripping over their own words. \nLong time ago back in school I also had a teacher that would always visit the UK over summer break (like a month) and everytime school starts again you would notice that she talks differently for the first few weeks.", "man I didnt catch up.", "F for those who lost their job again", "1:47:25 Personal Reminder", "Great stream, but I unfortunately found out that Kiara's already got one of those freaky donators that keeps donating sizable amounts so that the idols read something unimportant about the donator. Vgamer I think was the name. Reminded me a lot of that DjMary on Hanamacchia's chat who wastes all his neetbux on donations.", "Yeah, that guy’s a fucking weirdo. Can’t stand that dumbass.", "Authentic german driving experience", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Raging of course", "Nice comment :3", "Thanks for being so awesome you guys", "Good morning phoenix one", "15:28 bruhhh", "Kiara is really cute!!", "How many races ends with her pulling a Bullet Bill and shooting up from like 10th to 4th. How does she keep doing this.", "I feel like I play like her a lot. What are we doing wrong? Any tips?", "Why does it pain me so much that she never does tricks off of ramps of any kind or that she never drifts...", "キアラちゃんおもしれーぜ", "is this holoen gen.1 or holojp gen.6 hmmm", "Sooo KFP is a black corporation confirmed?", "Glad I'm not the only one who stays up to ridiculous hours.", "Kiara: ha ha ha ha", "If you're the sort who skips the opening talks, don't for this one. Very wholesome birb.", "hey chicken lady you are cool", "I did good today and next time you'll do better Kiara, Kikkerik", "Is basically anyone who knows what drifting is, auto top 1% global ELO?...............", "Obligatory comment", "Sarcastic remark", "Sleeping is nice who agrees", "Noice", "I would love to play a game with Kiara, but I don't have a Switch for Mario Kart. I do my have Steam account and Quake Live, but I don't know if she'd ever play it; I haven't played in months, almost a year. Don't really have anything else I could play with others except Minecraft and all my board games (which I do have a group for; I got no group for MC). That said, I play for fun and to earn my victory; I don't hand out wins, nor do I expect wins to be handed out to me.", "55:36 Haha I made it into the stream! Bottom right Coco all the way >:3", "Nice", "yuh", "Autobahn BGM is very efficient.", "Now I want to get this game just so Kiara can fire me.\n\nAlso can we get an F for Vgamer", "So is she German? Or US? Or Japanese?", "yes....", "", "Autobahn", "Viva la Kiara", "Kiara has a lot of secret lovers I'm starting to think that Cali is into NTR", "Wusste garnicht, dass sie Deutsch sprechen kann.", "Macht sie leider selten.\nSie spricht Deutsch, Japanisch, English fließend, sehr bewundernswert.", "@SenatorBesonders, weil sich die Sprachen so stark unterscheiden, war sicher schwer alle zu lernen.", "Judas Why would you betray your queen, with a kiss on the check?", "She has to be prepared when her KFP Crew cannot be with her. Like a mother bird raising her younglings. I make her push her limits so she can improve... I think... ", "Just for me. You can ignore.\n22:30\n24:45\n27:45", "Kiara you need to press ZR when you go to the ramp. lol You'll get a boost every time. I have no idea why people still didn't say anything about this.", "lowkey Stream is always best not like gura too many shrimping to her", "Kiara is steadily creating her harem.", "Except all KFP employees are fired, especially Judas he gets double fired.", "@Sachman18 hahahaha"]