["I feel like Kiara is being her own worst enemy by being too hard on herself for things that are out of her control.  She reminds me of me in that regard... I really hope she realizes that we all love her no matter what happens.", "Mori gives off the exact same vibe. Being a streamer and a persona must really not leave a lot of time for one's own mind.", "Makes ya respect the girls before them who have been doing this for months and some, years.", "That's why I love her so much. I relate to this feeling a lot and it's something I really don't want someone like her to feel.", "It easy to see that Kiara is really stressed and frustrated atm, she's got a lot going and things aren't working as they should for things outside her control", "B-bbbut there's Matsuri who is just being Matsuri.", "Tho Cali more actively tries to better her mindset. I hope we will see Kiara doing more like her wife...", "Anon Emanon I hope so too :)", "It's a shame that the technical difficulties ruined it but, it was still a fun time! Don't be too hard on yourself, Kiara! See u later! ", "Yes this! It's okay, these things are normal and it happens. Don't overthink it too much Kiara, it's fine. See you in a bit! ", "@Ohma Argus It's gotta be frustrating when it feels like the universe it out to get you, but in time these things will resolve themselves.  Stay strong Kiara, we're with you.", "I understand her frustration. I've been in situations where I have an ideal in my head and the world seems to conspire against it happening. That said I think she's being too hard on herself. We're here to see her. When you go visit a friend do you complain they didn't get the snacks you like or are you just happy to be in their company?", "That sort of implies that the stream wasn't still fun to watch. The technical difficulties didn't \"ruin\" anything, just cut the fun a bit short.", "Vgamer311 yeah you took the words right out of my mouth, the stream was definitely not ruined", "金3 A.M. Normally I wouldn’t point out semantics like that, but knowing how much Kiara is bothered by these issues compounding combined with the fact that we know she reads comments, I fear that seeing sentiment like “the technical difficulties ruined the stream” might really get to her.", "@Vgamer311  ayo i understand where your coming from but i didn't really say \"ruined the stream\". I was referring the minecraft rta plan lol. Anyways, no need to read negatively into things! You too tenchou! (if ur reading). Every stream with Kiara is a fun time for me ", "kohi san we know you didn’t mean it as such, we’re just being cautious as we don’t want to add stress to her ☺️", "it wasent ruined. it just made it that much better.", "The oldest computer can be traced back to Adam and Eve. It was an apple but with extremely limited memory. Just 1 byte. And then everything crashed. No worries it was a great stream thanks Kiara and Manager-san.", "Heh...", "Ok", "Wow thats good.", "What is this comment about? 😂\n\nThe heck. Rather than support her, it looks like it make fun of her... 😐☹️", "@DBT ??? How do you figure?", "@DBT Not my intention at all rather than walk on eggshells I try to laugh about a situation together with everyone and I don´t think that she is A. that fragile that this harmless joke does even faze her and B. that this joke is making fun at her or is hurtful at all", "Big Nier vibes from this lol", "@DBT And apparently Kiara liked this joke better than the endless pity parade in the rest of the comment section.", "Gratz on being noticed ~~~", "@CMZ 😁", "@Ausdrake lmao", "Casual filth is HololiveEN's official unofficial comedian! I'm vaguely picturing you warming up the crowd on Calli's concert...", "@GriffinPilgrim Haha the crowd is already warmed up and at their peak from the girls, as my Joke comes after their great streams. But I appreciate the complement and the complicated but cool sounding title that comes along with that =)", "haha good one!", "Kiara we’re here for you! Don’t worry or stress about a thing. Get plenty of rest and take care of your health ❤️", "Is the cost of eternal lives a 0 luck stat? Maybe her stats roll randomly each resurrection.", "I think it’s more that if you live for a long enough amount of time your gonna end up having a higher chance of something good/bad happening.\nAccording to her 3rd vid the tale of kira she comes from a time before humans so she has to be atleast 200k+ years old minimum according to a quick google search and if we assume only 0,5% of those years were bad ones then she still has 1000 years of bad luck.", "So Kiara is a Real Life Fire Emblem character?", "The amount of love and support in the chat for Kiara was phenomenal. Amazing work, soldiers. o7", "o7", "salute to the soldiers", "Kiara needs a hug, if you ever encounter technical difficulties don't be afraid to ask your fans or your fellow ENs ♥️", "🐔👄 Kiss Timestamp:\n\n35:42", "Thank you my good sir", "Yeah thank you", "Thank you, sir.", "Thank god Thanks :)", "U are very Call true", "kiara dont be so hard on yourself, we will still be here even if pc-kun doesnt want to cooperate", "Kiara dont be sad, dont cry! we are here! we will always understand you, we will always there for you, we are enjoying your streams even on hard times. That's why cheer up and smile like you always do! Never give up, so we are! VIVA LA KIARA ❤ ", "Yes VIVA LA KIARA! 💓", "We all know that you are under a ton of stress already, but you don’t need to worry about us. Even if all you can do is a podcast until you get a computer up and running, we will still watch it. We come here for you, not the games.", "1:05:31 \"I'm only going straight.\" \n1:05:35 \"I'm only going straight.\"\n1:05:37 does a 30° turn to the right\nAnd I thought you said the birds attentionspan was 5 seconds :P", "She must of thought about Calli for a moment.", "Don't worry Kiara, we're always here to support you! Your content and streams always make us laugh. 🧡\nYou may be flightless at first, but we will always cheer you on and one day you will really start to take flight, and we will be proud. So keep doing what you are doing! \nDanke für alles, Kiara! --From your loyal fans 🧡🧡", "Congrats on Subaru wanting to be your first Senpai collab! Also, don't be so hard on yourself, Okay? There are some Hololivers who have had their own hiccups at the beginning as well. I mean, just look at Korone!\nYou'll be okay, and we'll give you as many chances as it takes! So, hang in there!", "Also, have a virtual hug. You may not feel it, but rest assured, It's there.", "We through Kiara be like Pekora but really she like Marine", "no worries.try trade stories with Moona from the ID branch.she experienced many hardship when streaming since her debut.internet lag, streaming with phone tethering data, PC problems and etc.now she's pretty steady.also Polka JP branch who still struggle with her poltato PC and kusozako internet.so, you're not the only one. we know you're doing your best. bless you ☺️", "Dealing with computer problems is hard. Don't let it get to you too hard, many people still enjoyed the stream and we're still rooting for you 100%.", "DANKESCHÖN, KIARA TENCHOU❤️🐔❤️🐔❤️🐔❤️\nThe stream was a lot entertaining, you never fail to put a smile on our faces and make us laugh!! \nKeep on fighting, we'll be here whenever you need us to be here for you!!!!\nAuf Wiedersehen ❤️🐔❤️", "You did well, tenchou! Don't let this get you down, all is okay!", "We've got a Vairus here", "Kiara I want you to know that we love you and I think you're being a bit too hard on yourself. It's clear you are holding yourself to a very high standard and I can appreciate that you want to make your streams as absolute best as possible. I want you to know that all us viewers see your efforts and we can all tell how hard you're working.", "WE'LL SIMP AND SIMP TO YOU FOR A BETTER POTATO PC!", "Apparently she has a decent PC, she just can't use it at the moment.  She's using her manager's PC at her Manger's place for the time being until her internet is installed at her new place, and it seems that PC is not stream-ready.", "\"better potato PC\"\n\nWhy not \"BEEFY PC\"???", "@SeraphArmaros Do you remember pc her setup?", "I'm spreading the word sir!", "@DBT BEEF PC. BEEF PC. BEEF PC. \n~GO GO GO~", "@AusMasterProductions Its Kiara so CHICKEN PC!", "@Ackerman99 Not off the top of my head, but the specs came up during the various Minecraft streams.  Her \"rental\" PC that she normally uses is fine. A little weak in the GPU department but good enough.  Manager's PC had a slightly better CPU, but an even worse GPU.", "@Ackerman99 this is certainly a better pc, it has a ryzen 5 first gen and a rx 580, the one that is at her place has a ryzen 3 third gen and a gtx 1050 ti, so I'm guessing the technical difficulties in this stream were due to software issues", "@SeraphArmaros you got the GPUs backwards, the rx 580 is like 50% faster than the gtx 1080ti, so I guess manager PC has software issues, look, benchmarks for the GPUs\n\nhttps://gpu.userbenchmark.com/Compare/Nvidia-GTX-1050-Ti-vs-AMD-RX-580/3649vs3923", "1:06:05\nKiara when found sheeps: \"THERES A SHEEP! GIVE ME YOUR WOOL FOR 2 BEDS WITH CALLI!\"\nWatame: \"ORE NO SOBA NI CHIKAYORU NAAAAA!!\"\n1:06:27 YAGOO Burger", "Somebody needs to give this girl a hug.", "Damn it hurt real bad to see you sad like that.", "Only real fans Won't mind these events! So dont worry about anything And Stay determined kiara! ☝🏻❤🧡❤🧡❤🧡❤", "we need everyone to give her hugs stat, get calli over there too", "Hyped for the Collab with Subaru Senpai! Also please take care Tenchou! We'll definitely be back later for SC reading!", "Being german myself, hearing the obvious german pronounciation of Kiaras english is absolutely funny to me. Keep going girl.", "Damn PC-kun not playing ball...\n\nDon’t worry about it, get some rest and come back stronger", "Kiara Did Nothing Wrong", "YoOooOoOw! It's heartbreaking for a broke weeb like me having to see our idols ,who gives us happiness and inspiration each day, suffering and apologizing for the inconveniences caused.\n\nAt the same time, her, being helpless and such, awakens our inner weeb Instincts to care and protect this adorable little creature", "1:25:56 \nThe moment it all went wrong", "I'm very proud to be a part of this wholesome community that YOU Kiara Tenchou built. We'll always be here for you, so please don't be so hard on yourself over things you can't control, we appreciate all your hard work, you never failed to entartain us  Thank you Tenchou, we love you ", "Damn it hit me \n\nWhen the phoenix is sad\nIm sad", "No need to apologize Kiara it was still a fun and entertaining stream.", "It must be realy frustrating when u just wonna entertain everyone so they can forget about bad stuff they have in there lives but then she have so often trouble with things she can nothing do about. Since her debut we have seen her sad and crying so often and its realy heartbreaking...... we all love u and be there with u no matter what happens! if u are funny or cute or bottom left or even sad and emotional! Send u a hug! and for everything!", "> \"Manager said it was a good PC.\"\n\nI really hope you have a 3rd Gen Ryzen 7 / Intel i7 or above, with a good graphics card and over 16 GB of RAM. If you don't, well... don't worry, the Shrimps are coming, so you'll be able to get one ASAP.", "Kiara we're here for you and we'll always support you <3 <3 remember to always take a break and to take care of yourself <3 <3", "alterantive title: energetic chicken sad about computer running on potato", "Don't get too down Kiara, We all know you put in a lot of effort. Even if the technical issues keep getting in the way. We love you more then enough to make it not that big a deal. We know you will continue to I-run out the problems. Wishing you the best.", "Poor thing, it breaks my heart to see so much go wrong on the technical side when you're trying so hard for us.  Ganbatte, Kiara-chan, we love you. <3", "It's okay kiara for what happened, this stream was fun, thank you.", "Well, Minecraft Java is an \"unoptimized\" game i think. AND IT'S JAVA!\n\nAnd please don't be too hard on yourself.", "Kiara, you know we're here for you...❤ You can get through this, you have all our support, hun yes take your time please💕Don't be so hard on yourself, no need to be sorry, not everything was your fault, but the things you currently be going through is very relatable from my opinion to be honest, \n\nPC was just being shitty so we have all reasons to blame that thing ;))", "I'm disappointed she already knew about not sleeping in the nether. \n\nBut aside from that, I still and will always love her Phoenix energy", "I have to go to sleep now, so I can't catch the SC stream, but know this one thing at least, Kiara. We the fans still like you even when you're in such a low state like being unable to stream due to technical difficulties. We've all been there and I really really know you don't like hearing this said to you, but \"it does get better\".", "Definitely thinking we need a good pc setup design specifically for streaming, seems like all the girls are having issues with pcs atm.\nKiara i wouldn't worry, this happens to the best streamers\nI highly recommend pcpartpicker website to help with potential builds, ina and amelia seem like the types to know the best pc parts to put together and pcpartpicker will tell you if the parts clash.", "Don’t worry Kiara we will always support ❤️\nViva la Kiara!", "Don't be too sad, these kind of things happen sometimes. I cant speak for everyone  but I will say this most of us will never think lower  of you for this. We love you , your kiara takanashi! The loveable idol ,friend and streamer. We come to your streams for you. You could have a black screen with nothing on it but if it was still you talking we'd watch it cause its you", "I feel the stress and frustration from streams not turning out well. That emotion is valid and warranted and I hope you get past the technological struggles soon. But you have to remember to not blame yourself. This can happen to anybody. Nothing hurts more seeing you sad but your positivity is infectious as well and we're here and will continue to be here because of it <3", "Honestly I think her lagging issues and stream hanging issue could be either an overheated CPU, or just that the older quad core CPU can't handle streaming at 1080p 60 fps for a game through OBS.\n\n15:23 This current system is running an old AMD Ryzen 5 1400 quad core CPU, and an AMD RX580 graphics card. ", "Is ryzen 3 third gen with gtx 1080ti better than ryzen 5 first gen and rx 580 for streaming minecraft? The latter specs are the ones from the rental pc she used in previous Minecraft streams", "@suavitelrocks the 3rd gen ryzen is definitely more powerful. And a 1080ti is also definitely more powerful than a RX580.\n\nWhat the 1080ti helps with is also the NVENC encoder that Nvidia cards come with. This means they can let the GPU take care of the stream encoding in OBS, which would otherwise create more encoding load on the CPU.", "@Fate ugh I messed up, the rental pc has a gtx 1050ti not a 1080ti, the proper comparison would be ryzen 3 3rd gen + gtx 1050ti vs ryzen 5 1st gen + rx 580... My basic knowledge makes me think both CPUs are almost at the same level and  according to benchmarks the rx 580 is like 50% faster than the  gtx 1050 ti, so manager PC should be at least at the same level than rental pc, but maybe there's more than just that, maybe the nvenc feature in nvidia cards you mentioned", "@suavitelrocks oic , yea a 1050ti is pretty weak compared to an RX 580. a Ryzen 3, 3rd gen might just be another 4 core CPU. So comparison wise both CPUs are actually almost the same. \n\nThe NVENC encoder on the nvidia 1050ti does help. But like my original comment mentioned. I think the manager PC might have some overheating issues on top of older hardware.", "@Fate good to know, thanks for answering", "It was told that 300 Kiara Spartans stayed after the stream ended to support her with all of their might to the very end. God I love being part of the Kiara Fan Club.", "we held untill we all got booted", "Yea. I saw 311 people even after stream ended. Only left after we really got booted from chat.", "I was there are you guys there to", "Aw man, it really sucks seeing her get this frustrated. Looking forward to watching her happily streaming once all the issues are finally out of the way.", "I'll be honest - I had to restart my PC 9 times, Router several times as well, had to change so many windows settings and had to go really deep just for an internet connection. And the best part - I restarted my router after about 4 hours just so that it connected instantly. \nDon't worry, tech is sometimes really difficult, even for those with more knowledge about it.", "manager-san's computer was not as powerful as he thought.", "i want you to know that everyone will encounter technical difficulty at some point. the more important part is you show us you're trying your best to fix it and it work/doesn't work.\npeople are more forgiving if you show them determination you try to fix it. out of everyone technical difficulties that i've seen so far, yours are the most heart warming and the most welcoming one. it really tell you a lot how people feel about kiara's persona (either it's fake or real) that people like kiara as kiara and you should cherish and be proud with that. you are the one who make this kiara happen. ", "Hey don't be so sad birb, we love youuuu. I always love watching your streams because your personality and voice makes me feel so much better than anything has in recent months... ❤❤❤ I would show up to a stream of you performing 'percusive maintenance' for half an hour cause just you being here makes me happy. 😄", "With all of this training, you'll be an ace when you get back to your own computer.  Plus you had said you had your Switch, so as long as the capture card works you're all set. You're my favorite for a reason, you just need to see it for yourself.", "We love you Kiara ❤️ don’t worry about the PC issues! We’re just happy to be here in your wonderful livestreams!", "19:50 So THIRSTY!", "Did she get a new mic? She’s a lot easier to understand", "Don’t worry about it, it’s fine to take a break especially if your PC doesn’t wanna cooperate and if your not feeling 100 percent \nTake care of yourself pls ❤️❤️❤️❤️❤️❤️❤️", "Kiara I hope you won't be too hard on yourself. We as viewers still really enjoy your streams, no matter the technical difficulties. We understand your situation and we're okay with waiting it out with you. Just one more week then you'll be ready to go! I've been loving your streams so much. I haven't had this much fun watching hololive in a while, so thank you for your content 🐔💕", "I can’t get over how cute Kiara looks in the thumbnail!! Props to whoever made it ❤️❤️❤️\nEDIT: Yes, as everyone else has said; don’t be sad if things don’t end up working out. It’s all good, we’re all here for you. :3", "We love watching you Kiara, even if things aren't perfect. You've got a great, vibrantly bright personality that we come to watch. Don't let the little hiccups get you down.", "Pekora is gonna be jealous of Subaru stealing her favourite Kouhai ^^", "For real though Tenchou, we're just happy to hang out with you. You don't have to worry about being entertaining or what's going on ingame, as long as we get to chat with you the stream's a solid 10/10. The only person unhappy with how you've been is you, and that might be enough for you to be frustrated regardless, but you should know we're all standing with you in a great big group hug every step of the way. No salt on our side of the screen, just love. Don't be afraid to lean on us, man. We gotchu. ❤❤", "I know it’s stressful being a premier affiliate of arguably the current biggest vtuber group, but it cannot be overstated that things will always have the potential to be messy in the beginning. I know you may feel like you have to hit the ground running and hidden aspects of your upbringing could be reinforcing that in your private thoughts. Still, just stay calm and iron out the behind the scenes one at a time. It hasn’t even been a season yet and your fans/supporters are already here. ", "Your presence and experiences, thoughts, personality is what keeps people glued to these streams. In reality even technical problems are sometimes equally entertaining. I know it's hard not to worry, that's how you are. But just know the negative self reflections are not at all what we think of you. The future is bright! ", "PC maybe potato but our love for you is fries.", "is the R5 1400 really that bad? ik she's streaming at the same time +other stuff using the CPU in the background ,but with minecraft using just a singlethread on a quadcore CPU makes me think it should run smoother than it did", "@Roger Arruda I want to say the streaming is the culprit for the CPU bottleneck. Then again I don't know how CPU heavy is streaming actually.", "@Roger Arruda Was probably due not having enough ram.", "@Roger Arruda the price of ryzen 1400 today is $20-$40.....(2nd hand though)", "@LordZero25 streaming is cpu heavy, that is why other people use seperate pc in order to have no impact on their gameplay", "@LordZero25 I never tested how much it inpacts the CPU but I know OBS uses multithread, and depending on the config it may uses even more (selecting CPU for encoding instead of GPU).\n@Senseless by the GPU and CPU used I would bet it has at least 8gb RAM, also the game had 2G allocated, dunno if it's standard now instead of 1G. could have manager-san fall for the old \"4gb is good\" meme?", "@Senseless cant see the ram, there is no way its 2gb right? (based on top right)\nthat must have been rx580 4gb VRAM or else, i cant imagine a computer having 2gb-4gb ram in todays era", "@Mad Tech 2gb is the dedicated ram for the game, selected in the JVM arguments, I guess it's the standard memory allocation as of now, used to be 1gb. also the game don't really uses much of the VRAM I think, it doesn't even fully uses my rx570 with shaders installed", "@Roger Arruda so you are saying that this pc has ONLY 4gb ram with 2gb dedicated to minecraft?\nam i right?", "@Mad Tech lol no, as I said before, i think it may have 8gb. Considering the cpu and gpu it must be 8gb, it's the bare minimun nowadays I guess. What I meant is that the 2gb shown is just what minecraft picks up when it runs.\n\n I doubt Minecraft would even open with only 4gb, as w10 uses more than 3gb sometimes. Btw,if it do have 8gb as I think it has, I could see OBS lagging the system, having around 3 or less gb to work with", "@Mad Tech in my 2nd reply I mentioned the \"4gb ram\" meme that I think still exists, with computers still being sold having that config, but it was just a joke", "We love you Kiara, even with all the technical difficulties.", "despite the pc and laggy internet, you still managed to carry the stream bc you're so upbeat and cheery and loveable and sweet and kind and funny and entertaining! just having you here is enough :) \n\nthe phoenix shall rise again!!!!! love ya kiara", "Her smile and optimism: gone", "damn that hurt right in my meow meow", "Must protect", "It's not no simp september any more them life savings lookin really good rn ngl", "@luk Open the savings October", "Pain Peko", "the end of this stream was really painful to watch, i really want to just headpat her and tell her that its all going to be okay", "1:25:58 I love Kiara's noises of surprise XD They're adorable and funny.\nSucks about the difficulties", "Sad that her pc decided to get wonky on her", "Dear Kiara... Know that we support you because you're constantly giving your best despite all the problems life gives you... (LuckStat:0?)\n\nSeeing you come back from the ashes again and again is so inspiring, empowering, and wholesome...", "It's okay Kiara! We understand! We'll be waiting for you until you recover! Please rest! VIVA LA KIARA", "I hope this will reach you. Regards your performance problem. You should upgrade your Bios / Uefi firmware. Dunno if you ever heard of Spectre/Meltdown. Some people don't know that AMD got also in trouble with it.(Spectre) Microsoft delivered an upgrade for Spectre / Meltdown which requires a micro code upgrade from the Mainboard manufactures. Without this micro code upgrade you will have performance or/and crash issues. I did know someone with the same problem. Not with Minecraft but with Anno 2070 / WoW. Sry for my bad English I hope this will help you. If you still have some question feel free to ask me. It would be an honor to help you.", "PC-kun may have had issues later in the stream, but those eyes right after switching from the loading screen KO'd me.", "It was a fun stream regardless of the circumstances Kiara! I can't stop you from blaming yourself, but you really shouldn't! Everyone was having a fun time cause it was with you! 🧡", "hearing her swear is like being woke up in the tender hours of the night by your friend saying to stop afk", "Difficulties are part of life, dont let them win. Every time something bad happens you will return stronger, uou are a Phoneix after all. We will always be with you and waiting for you.", "We still love you Kiara though XD  just do what you want and we'll enjoy watching you regardless", "Protecc this girl, she is precious.\nYou always seems to do your best, sh*t happens don't let them get under your skin.\nIf you enjoy what your doing the people who want to see you happy will enjoy it too. \nThank you for your stream and your hard work", "Even with the technical difficulties this was really fun to watch. Thanks Tenchou and Manager-san!", "We believe in you Kiara! I have the utmost respect for you trying your hardest. Your streams have already been so funny and entertaining! \nHope you can remember that you always bring smiles to faces, even when things seem like they aren’t going your way. Best of luck to you!🧡🧡", "Take it easy Kiara! Do not get discouraged, things will get better!", "I’m going though a bunch of moves right now so I feel this stress 😓", "Shrimps unite!!!! She needs our help", "We will always be here for you Kiara ❤", "See you again soon Kiara ! We still had a good time while it lasted 🧡", "The fact Gura said striders and Kiara immediately said \"Aragorn\" pleases me.", "Don’t give up on us!!! We won’t give up on you we enjoy the streams regardless of the technical difficulties they happen!! Aslong as you return we will be here!!! 🖤🖤", "Someone should let her know you can't be perfect and i love streams because this kind of stuff that only happened on stream we should laugh at this not cry", "Don't be to harsh to yourself, we will always support you Kiara ❤❤❤❤❤", "It makes me really sad that she's being too hard on herself :(( We love you Kiara and probably only fake fans are the only ones who minds the technical problem. Anyways, please take care of yourself. eat, sleep, and over all stay healthy :)", "Wait could someone explain why she completely started over", "Dont worry Phoenix girl, we love you with or with out technical difficulties. I even wake up early just to see your streams, take it easy girl you got this !", "Thank you for the stream Kiara! Despite the bad luck we had fun watching you!  It seemed to look like Managers PC was dying beforehand and the specs had nothing to do with the lag. It is no fault of your own! Kiara wa warukunai ne!", "Kiara we watch your streams for you and that all. You can legit be doing anything writing,  talking , just reading and am sure we’re all still watch it!! Cheer up!! ❤️", "Didn't Catch it again by the way this song is for you wahahaha:\nChicken wings chicken wings, hotdog and baloney, chicken wings with macaroni, chicken wings with my homie. Love yah", "Hope you'll feel better soon, Kiara! PC problems are understandably frustrating.", "The Raging Phoenix stream.", "At this point, I will have to cheer you up/support more on Twitter because so much tech issues are happening in this stream. Thanks for the stream as usual despite all of this.", "i watch the archives, and most of the time i skip to the beginning of the game, so i was wondering if this new world is temporary? Or is it forever we use this one", "She is strict with herself, that kind of thing is fascinating too, but I hope she is happy.", "Idk but kiara you always make me smile whenever i see your stream lol ty for that 💓💓", "The cute intro ends and a big kiara looks at you with the most seductive expression possible... Why you tease me like this little one? You belong to Calli but this makes me want to NTR you from her!", "500 maybe 600 maybe even 1000000 more tries we’ll be fine with it kiara, we’ll love you no matter what u do u wholesome chicken 🐔", "Subaru collab will be hype.\n\nAs far as I've seen she seems to at least be able to understand english quite well even if she doesn't speak it much, so maybe you can try it out a bit. Either way it should be a fun time.", "This just mean you should rest (I mean you must be tired after doing all the moving) for now and come back even more energetic", "50:54 me 4 hours into trying a new hobby", "Don't worry Kiara - we're all always here to support you! <3 It's easier said than done I know, but don't be too hard on yourself - it's not your fault PC-kun had some issues! Rest up <3", "Never have I seen someone so happy to be in the Nether.", "Please take care of yourself! We all love you and will be here functioning stream or not!", "Now I'm eggcited for that birb collab with Shubaru!", "We all love you Kiara. You're the best <3", "I really enjoyed the stream Kiara! Dont be sad dont pull yourself down!", "Sad I couldn't make it to the stream so now I'm watching the vod", "Take your time before the next stream, Kiara. You already know no one is mad or disappointed in you for the technical trouble. None of it is really your fault. You are such a kind and loving person to everyone else and that is why your own community is giving you the same love and kindness in return. You can be proud of what you already accomplished and achieved in just a few weeks", "I like how the day her new wifi come is the same day that Hololive En are allowed to cross gen collab", "May the tears of this stream lube up the cheeks to come.", "Talk to Ken from Austin Evans. They get content. You get a new PC. Win win. Maybe extra for Ken cause he's a big Vtuber simp.", "This was a pretty fun stream. See ya later.", "Don't worry about anything. It can be stressful, but we're here for you and will be here with you till the end.\n\nI am stoked to see you collab with Subaru. In fact, you both are my favorites, I am excited to see what you both have in store for us!", "It was the forest fire on the surface caused by that lava which was causing the lag. \nEither put out the fires or let them burn out on their own and the lag goes away.", "Like pointed out already. Install optifine.", "Hang in there, Kiara! We love you and will always support you!", "Don’t worry, my computer can’t even stream roblox, so I feel you", "Hope you get a more powerful PC soon to lessen your stress. A happy Kiara makes our day beautiful. Know that we are here to support you 🙏🏻", "せっかちさんへ\n2:04\n\n今日も可愛いなぁ", "Such an entertaining stream! ", "I want you to know that the first half of the stream was fine, not really your fault when every single thing decides to crash your stream midway through.", "Suuuuuper excited for the collab with Subaru (SHUBA SHUBA), and keep on working on your relationship with Pekora! She's definitely shy, as you know, but I think you're the kind of person that anyone would want as a friend :D\n\nI mean, Calli didn't really stand a chance, no matter how tsundere she is lol. Phoenix Power is real.", "CPU's always been dead, Kiara's just been plucking a feather from herself and attempting a revive.", "Man kiara is the only vtuber I'd go watch the entire stream if I'm late. lol", "Hey Kiara if you need any technical advice on streaming I can help you out I'm not a big streamer but I can do my part to make it better for you. Best of luck and wishing you the best!", "You can rest for a bit but if you really want to do streams you can just do some voice only or like some q&a \n\nDont push yourelf too hard Kiara♥️♥️", "Kiara just needs that affinity points to raise for manager-san's PC, but seriously it might be a RAM thing there is ALOT of programs running while streaming no less, but it's all good, everyone is with you through it all", "Subaru collab! Great I can't wait. And don't worry technicals problems happens to all so it's OK. We all want you to be happy. You are a great streamer. Greetings!", "Thank you for the stream! It was really fun.", "floating trees... regarding you lack of moralit in that regardfun stream, don't bully yourself for things out of your control", "PC-SAN BADDD! Kiara really wants to have us a good time and her too. It will be alright soon Kiara 😊💕💕", "I think someone needs a lot of headpats from pekora right now :(", "We should all put in something to upgrade her stuff", "The viewers should have told you to allocate more ram into the game. From the minecraft launcher click on \"installation\" tab, hover your mouse over the 3 dots on latest release and click it, click \"edit\",  more option, find \"Xmx(amount of ram)G\", change the amount of ram gigs to your liking. I set mine to 2 but streamers should make it a bit higher.", "1:17:20 「collab ban will be lifted in a week!」", "we shall wait for your return ❤️ stay strong ❤️❤️", "love you so much and always will, so happy I get to watch your videos in quarantine everything else is so dreary. hope you get some rest and chicken 🍗🍗🍗", "Birb collab yeah.\nBe sure to check the temperature of your pc, maybe needs some mantainance because heat", "Thank you for all your hard work Kiara!\nWe all love you very much!", "You are doing great, Kiara! Keep going! ❤️❤️", "We all love you Kiara!!!", "I enjoyed my time. :)\nThank you.", "I'm here to support Kiara so that her dreams may come true, games don't matter. \nProtect the smile, the energy and her dream so that she can make other peoples day brighter also.\nSee you in the superchat stream~ <3", "I know it has to be frustrating to be held back by things beyond your control, but just be aware that we all understand and nobody blames you for what's happening.  We're happy to show up to any stream you have, so even if it's just chatting or whatnot we'll be there to support you.  Stay strong, and don't let these setbacks get you down.  In time everything will be better, and we'll still be here to support you.", "We’ll always be there, and no matter what you do, we’ll be entertained as long as it’s with you!", "Thank you for the stream Kiara!", "As much as I like Kiara streams I...", "Kiara we all realize how much effort you are putting in, and will continue to support you through these struggles! ", "Hmmm, They should have thier own EN server. Or for them be able to connect to the main Hololive Server.", "Goddammit I missed it!", "I know this is probably an unpopular opinion but I feel like you should just focus on yourself first get your rig working right and when you're sure everything is working fine, only then you should stream, because when you're sad we as the viewers will also be sad and when you're happy we're happy too, but when you know you're this fragile when it comes to your streaming settings it feels tiring for us seeing you sad everytime you're streaming due to technical difficulties. Yes, I will go through hell and back with you along the way, but I am also here to feel joy and the positivity you exude, so when you're easily saddened by every little things it becomes hard for me to watch your future streams. ", "it doesn't matter to me that you and Subaru speak Japanese, though I cannot comprehend the language. Watching you have fun with your senpai is fine to me.", "Just got to the talk about Untitled Subaru game, and yeah it's definitely doable. There are even amazing remote connection tools that provide near local levels of connection. So if you don't want to go through steam's remote play, you could use Parsec to play \"locally\" through remote connection.", "i love seeing people play minecraft for the first time. to see what they do and build. and how they grow", "I had a good time. keep up the good work !", "I feel so bad for her, but non the less it was an entertaining stream for me and the chat was super supportive!", "its okay kiara. the stream was fun despite the technical difficulties. it wasnt your fault.", "Have a good rest, Kiara.\nThings will get better, and so do the PC", "At this point technical difficulties are one of kiaras charm points lol", "Its frustrating Kiara I know, but try not to be too hard on yourself, deep breath in and deep breath out, we loyal KFP employees will always be here and give u all the support we can.\n\nPS. Is there a PO box where we can send donations? like maybe we should start a go fund me to buy her a new pc with good spec?", "❤ love u kiara!.", "You can use a program called Parsec to play local games online.", "Having potato pc is part of the journey to greatness. Hang on there chicken.", "That moment when no nether", "love you Kiara! we'll be here for you no matter what😊", "meh don't worry Kiara. All the attention, channel growth, constant streaming and now moving from one place to another + you don't have access to proper hardware (PC) and internet is not only mentally but also physically very taxing. I'm sure overwhelming majority understands. If you'd have to take a week off to wind down and get settled in a new home then it's more than understandable (also, just 1 measly week. in a grand scheme of things, this is nothing). Stay strong!", "Rest well kiara!", "You have a lot of people who support you Kiara, me included. Things will only get better from here on :)", "Have you already seen my Minecraft Animations? I hope yes!", "dont mind dont mind kiara! we all love you and support you no matter what happens!", "You're the best Kiara.", "I hope she can calm down it tears me up to see when shes sad ", "I think someone just ordered a large Kentucky Fried PC Fund", "With the power of Shrimp Squad your PC-kun shall be upgraded", "Thanks for the stream Kiara!", "Exploding manager-san's PC RTA", "bok bok kirara bok bok! 😂\nbest boin boin phoenix chicken\nwait..", "You go this, Kiara ! ! ♥♥♥", "Seeing Kiara so sad hurts my soul", "Suuuuper hyped for your Subaru collab!!!", "KFC ads for Kiaras videos. Perfect", "Thanks for the stream", "Why is this I keep seeing", "Everyone has a bad day every now and then, especially this year. Just know that what you do is greatly appreciated and you do bring happiness to many, many people. Take some time to recover and keep your chin up. Things will get better! You’re awesome 😊", "Make sure you collect on all the people who made bets before the stream", "Kiara don't worry about it  We shall always stay at your stream Even if your laggin stay strong \"Our\" Strongest warrior Luv (♡◕ω◕♡).", "don't be disheartened!!! ❤❤❤", "1:17:22 Subaru collab clip", "kiara darling please dont stress if theres issues with the stream or your live2d or your internet, all we want is to watch/listen to you, sure its unfortunate that it cant be perfect but imperfect birb is infinitely better than no birb at all. Nobody can blame you for things you cant control...", "Don't feel bad about yourself, Kiara! ♥️🧡♥️🧡♥️🧡♥️\n\nWe are always here to support you even if things don't go well. Let's turn that Potato PC into Delicious 5⭐ Quality French Fries. YUMMY!", "Well chat in the transmission is closed, time to come spam here I guess", "Lol everyone thinking the RX 580(GPU) is the problem.... Please don't spam advice if you are not sure", "She requires headpats.", "Stream crashing RTA\n\nsorry about my bad taste joke. keep it up gal", "Love you Kiara! It's ok, don't worry. Hope your tech gets better.", "It’s ok Kiara, just rest and lay down on this super comfy mattress you have(us), cuz as always we’ve have you back.\n\nWe will always wait for you, LOVE YOU TECHOU.❤️", "Don’t let mild technical difficulties get you down Kiara you entertained the KFP even if you didn’t finish what you set out to do!", "please don't be too hard on yourself. we love you. we understand the situation.", "She really needs a new PC.", "Don't worry too much about the quality of your PC. You are fun on your own and the PC will get upgraded eventually.", "Do anyone got scared by the Opening screen ? Cause i do", "Some people in the chat gave Kiara wrong tech advice uGh. Don't speak when you don't know anything man. Anyway, great stream Kiara!! <3", "I might have to get a vpn just to be a member cause for some reason its not available in my country", "The origin story of the bestest birb to ever run a restaurant in the bottom left kingdom!! We love you Kiara!!!", "No worries kiara was fun and worth staying ! Don't \nLet it get you", "Subaru-Collab freut mich sehr - viele Grüße", "IT’S OKAY KIARA! WE’RE ALL HERE FOR YOU!!!", "I don't know if this comment will reach but even how many times you fail we are always rooting for you so don't be so down we are still here supporting you.", "Don't be silly Kiara Subura can speak a little english she use you work in the public.", "We love you kiara❤️", "Aw poor kiara, these things happen.", "Kiara were all here for you if you need the support, you can always relay on us fans and supporters, so don’t put yourself down because of technical issues. We all love and support you ❤️❤️❤️❤️", "You better be drinking lots of water and getting a good amount of rest you funky chicken", "give ne your wings hngngnggggg", "We know you are doing your best Kiara try not to stress about it too much we will always support you💜💜", "I understand you might feel a lot under pressure because of all the eyes on you, but don't be so hard on yourself. We are always here to support you and there's nothing wrong with some technical issues here and there! Because even with that, the stream was entertaining! You'll figure everything out, don't worry too much. Virtual hugs for you!", "Yo, take it easy Kiara. The likes and dislike on this video shows how we feel. Hope you have lesser frustrations in the future.", "I’m back here,because I tried a Nether Portal using Pickaxe Speedrun. it took 53:42 minutes for me,I guess it’s just my bad luck", "Sending support for our fiery birb ❤️ don’t worry Kiara it’s all fine ❤️❤️❤️", "sorry for your technical difficulties Kiara, don't let it bother you too much we still enjoy watching/hanging with you  (=", "The KiaraFanClub is here to support our favorite phoenix! ", "don't worry about silly glitches and what not we love what you do and are all so proud of you for the hard work you put in. We just enjoy spending time with you nomatter what so thank you for sharing yourself with us. We love you kiara. Also if I had a dollar for every time I broke minecraft I'd be rich.", "Kiara, please don’t be so hard on yourself. Things have only started for you and will improve drastically. You’ll be looking back on this and will be laughing before you know it. You’re community is always here to support you and help you out with anything if you are in need. I’ve enjoyed every single one of your streams thus far, and can’t wait for more to come from the Great Phoenix", "Chat streams are ok while you move and settle in! Minecraft will be even better next week when you can collaborate and potentially join the Hololive server too!", "Letz support Kiara to get her new PC-Kun", "technical difficulties are unavoidable and we understand so don't be too hard on yourself. it was still a fun and enjoyable stream though, so don't worry we will still be here when you get back. ❤️❤️❤️", "oh she has a new mic now ? She sound nice", "Kiara, you make such good content, you make a lot of us forget our worries, you have this innate ability to brighten up any room you are in and bring people out of there comfort zones, your talent is that, being a light in the dark, A BURNING PHOENIX, BRIGHT LIKE THE SUN, don't ever forget that, we love you and keep being you, we love you soo much, believe in the you that we believe in, ok? <3", "it would be really cool if kiara did colaba with japanese hololive", "Kiara, you're the best. Don't worry about your PC we will be with you no matter what", "Game is crashed and heart is too\nSad tencho makes me sad too", "I know really well how much technical difficulties can be frustrating, don't blame yourself for this, it'll get better in the end ! I'm really sorry for you not really enjoying yourself right now, but we'll wait don't worry, gambatte !", "please dont feel bad you are such a sweet person things will get better and dont hold the stress in its ok to be human", "Держись там, мы с тобой!", "Poor baby bird ;n;", "She should install Optifine, tbh", "From what she said last stream they're not allowed to install mods.", "@SeraphArmaros Oof, bugger", "@atikabubu The PC she had been using was fine, she was just using her Manager's PC here and it seems to not be up to snuff.", "That Ryzen 5 1400 did it's best, Minecraft + Streaming is too much.", "Don't worry Kiara, we are here for you despite what happened. Technical difficulties happened but you don't need to blame yourself about it", "Tech problems are the true horror of the Nether...", "VIVA LA KIARA!", "Focus on yourself,don't look at others.", "Optifine", "Lets shrimp her to get a 2080ti spaceship pc", "Don't worry Tenchou, it was still entertaining, i can understand and sympathize with wanting to produce and broadcast a high quality product with equipment that don't meet expectations though.  For what it's worth, the fun is hanging out and being along for the ride on your journey.  Even if we can't make progress, whether that's from a difficult game or technical difficulties, the journey doesn't stop, we're still here, along for the ride, having fun where ever you might take us.  It might be frustrating, but we'll always be here next time, so please don't pressure or be too hard on yourself!", "1:48:26??", "Kiara wa wakaranai yo ne!!!!!\n\nBad things and misfortunes  happens, KIARA, but we need to overtake them. It's not your fault that the PC was laggy.", "I wonder if her tunnel was under that forrest fire, cuz fire spreading like that tends to eat up cpu really fast with all the block updates.", "Was the problem a Minecraft issue or a \"Minecraft while streaming\" issue?", "がんばって　ください", "❤️❤️❤️❤️", "She should try optifine", "We gotta get Manager-Kun a better PC", "We will shrimp to you whether your pc is good or not becuz we love you.", "We always support you Kiara so Don't Worry", "I am not bullying u. I love you.", "Tell managemt to give you more ram for your pc. 2gb is insultingly low and should never be put on any device worth it's salt. This is not your fault, this the fault of the people who gave you this. Don't be so hard on yourself. Edit: after further review I see that this pc is FAR weaker than I thought. A 720p monitor, 1050 for the gpu, and weak processor are barely enough for streaming, do they not have any tech guys?", "How do you know the specs of her pc? Did she say on stream?", "@E2k iirc when she opened up the  coordinates in minecraft you could also see the PC's specs", "20:00.", "We all need to do the chicken dance to buff Kiara's luck stat.  It will get better u.u", "I can’t join", "Only in Japanese huh?  At this point Kiara should  be in her own thing, Hololive Ambassador.  Subaru and Kiara collab gonna be exciting", "No one blame You\nTrust Us\nTake it easy", "動画と全く関係ないかもしれないが、cmが英語でちょっと違う刺激で感動してついつい最後まで見てしまった。\n脂肪（死亡）を燃やす、、、、ここでもフェニックス成分が使用されているんだなぁ・・・\n\nフェニックスドチキン食べたい。。。。", "VIVA LA KIARA ❤❤❤❤❤❤", "Kiara, don't be sad. We will help you install OptiFine, performance mod for Minecraft, and Potato PC's won't be a problem. Just get some rest, stress is bad for your health, m'kay?", "Chicken PC ain't wanna play nice", "Lemme clarify what Minecraft actually needs.. since people thinks a quadcore cpu with minmum gpu and 4 gb of ram is enough.. No just no.\n\n A good gaming PC should be 6 core cpu with 16 gb of ram and atleast a GTX 960 at LOWEST. I say 16 gb of ram because Minecraft demands that much ram to run everything smoothly. 8 gb of ram is a joke for minecraft. ", "being birb is suffering", "Don't be worry about stuffs, Kiara. Take it easy like HoloID. Especially Moona.\n\nMoona first got bad PC and also Internet. Her debut stream also kinda laggy back then.", "Aaaaa I wanna play minecraft agaaaaain", "👍👍👍👍", "Her luck is almost as bad as the discolating jaw stray cat", "Bleib glücklich Hühnerfrau und wir wünschen uns alle gute Dinge für dich!", "Kiara you have move around and done so so much. That is not something to be understated during everything happening in the world. It really hurt to see you so upset. It's going to be alright. Everyone who is a fan is going to be here. We already know your doing your best", "we love you kiara please dont feel bad", "💕💕👍😁", "poor kiaraa its commmon problem tho ita ok potato pcits good too dont worry", "\"Another of the 500 chances.\" What do you mean? No one is giving up on this little fire chicken how many chances do you need? 500? 2000? You get them all. You're going to go far and be amazing.", "Love you Kiara do not be upset", "I love you Kiara", "YO KIARA ", "This stream was depressing to watch because Manager-san's pc reminds me a lot of my own Poltato pc.", "Atleast you have PC", "Netherare", "Minecraft chicken best girl.", "Said this before but don’t ever blame yourself for the tech problems. I know you’ve been struggling but I just wanted to let you know we love you for who you are.", "Don't worry Kiara, Minecraft is not optimized that well. I think you should try using Optifine or Sodium to increase your Minecraft performance for next stream.", "Kiara don’t worry.  It doesn’t matter to us if your here to stream games are to talk.  You being u is all we fans need to enjoy the stream.   \n\nAlso for some pc tips.  As people suggested in stream, download optifine.  Beware though, some websites are malware sites.   ", "I hope you get better soon Kiara", "Tenchou, it's okay to have technical issues, especially with Minecraft, it's a very poorly optimised and CPU-intensive game. I'd say most games would run fine, but with that potato CPU you would be better off streaming Switch games for the week. Not really a solution for the planned Minecraft collab with Calli, but hopefully you can get your own computer for that with Manager-san's internet. If you do actually read this, please remember that we all love and support you, no matter what happens ", "cri", "Don't worry. You'll get everything sorted eventually. Things are obviously rather hectic for you right now with moving and not having your proper pc with you etc. I know what it's like to constantly feel like things are always going wrong. You fix one problem then something else seems to go wrong. Nobody's going to be mad or disappointed with you. Just stay positive ❤", "ily", "Kiara probably needs to allocate more RAM to Minecraft, her PC is decent enough to run it.\n\n(This is just my speculation though, correct me if I'm wrong.)", "Yh it's a ram problem", "Kiara dear..... maybe it's more wiser to buy a new pc now than to suffer anymore future streams. The stream is still fun though. Having your presence and interacting with the viewers is 100/10 the best out of all hologirls imho. So don't mind. There's no salt ", "🐔🧡🐔🧡", "I see that CPU and graphic isn't the big issue rather the memory or RAM which use like 100% of memory allocation which is bad compare to the first minecraft stream it's use 93% which still a bit bad for streaming on a PC. I will recommend to use like i5 or i7 or ryzen 7 or ryzen 5 with 6 to 8 cores on the CPU and more memory for the PC like 16gb(8x2) to 32gb (16x2).  Perhaps that pc use an single stick of memory or RAM. Also, I will recommend for kiara to ask others Hololive en or hololive EN on their pc specs for streaming.", "As far as I know Minecraft always allocates up to 2gigs of memory (it can be changed to allocate even more it seems) so I see no issue there as it's always the same regardless of PC's RAM size - even though that PC looks like it's from 2017 it still should have 8 gigs at least. That CPU is only 4 cores and first gen Ryzen at that so it's really unsuitable for comfortable streaming. Six cores should be a minimum for that purpose. It was funny to me so many in chat said this GPU is worse than 1050Ti ... are they trolling or what. RX580 is at least 50% faster than 1050Ti and 8gig vram version gets less bottlenecked in modern games too. But that's all in context of manager's PC, she'll definitely get a better one. Like 3700X + 2070S and 32 gigs of ram would make a very solid and cost efficient setup. New stuff is around the corner though too...", "Kiara don't worry about technical issue don't be so hard on yourself T_T ! But if ever you can help me and my Motion sickness can you remove BLUR please ! Make me almost vomit so I have to Only listen to your voice sometime. Your voice pretty but would love to see gameplay too <3", "Please do collab with Subaru senpai..and speak japanese to make both comfortable to communicate \nAnd maybe translate a bit for us English too XD", "1:18:00 about collab with suba", "Don't worry Kiara, things happen out of our control, I send you a link to a video to install a mod + the mods link that can improve your experience next time on to you twitter account.\nI hope it helps, cause it help me too", "1:45:45 We did it boys the Legendary Pheonix tears are finally ours.", "Pls don’t witch hunt me It’s a joke", "I wish people would also shower me with money whenever my PC shat the bed.", "Same", "Her loading times were a sign that this stream was going to be a flop", "It wasn't a flop, she needs PC improvements to stream and game but the stream was fun overall. It wasn't dying the whole time.", "I thought it was fun :)", "@Dr Nowzaradan i didnt mean entertainment wise i meant on a technical level", "She gave up lmao\n\nCause of lag kusa", "we will forgive you\n…", "Kiara...........", "I wish you didn't decide to put some streams behind a paywall :( i wish i  had enough money to donate.", "Have some dignity you're a grown woman.", "Dignity? In what? She's doing her job just fine. Are you new?"]