["Her smile and optimism: regained", "Is that before or after Casca regains her memories", "For now. At least until I get bored again.", "Comment made 4 hours ago. \nReplies made 6 hours ago, seems legit.", "She is a Pheonix after all. Bouncing back up is kinda her thing.", "37:46 Amelia and other anime girls: \"Ara-Ara~!\"\nKiara: \"Kiara-Ara~!\"\nEnjoy, clippers", "underrated comment", "epic", "Don‘t mind if I do", "Ogey", "She sounds embarrassed about saying it but I want more\nKiara-oneesan ASMR stream?", "Everyone, I believe we can all agree that Kiara is doing things right. She shows true emotion all the time, she has so much fun with her streams, her being here just makes us feel ready for anything the world throws at us, and us fans' hearts melt because of all she does, and the realest emotions she shows. (She even built a friendship between myself and another fan, just because we love her.) I believe she needs to know what kind of power she possesses. It's just amazing to me what kind of power some amazing people possess.", "39:29 No, I'm not changing my name, it's just that Calli can't ever read the Kanji correctly 🤣🤣🤣", "通りすがりの仮面ライダー I got the joke immediately upon hearing your name and kept getting triggered that she keeps reading Ga as Gi. Hell reading your name here confuses me even more since ITS WRITTEN IN HIRAGANA.", "I just love this. Jokes completely aside now.\n\nThis channel and many other hololives are my happy place where I can relax and just take a moment to smile, recently my dog died at 13 years old he was a great friend and always smiled. Thank you for helping me burst a laugh.", "I'm sorry to hear that buddy. but know that me and many others got your back.", "I’ve gone through the same exact story myself my guy. Just only Last week as well I had to go to the vet with mine. You can get through it my dude!~ <3", "TheRubyMoon thanks", "Pety thanks", "🐔👄 Kisses Timestamps:\n\n38:19\n1:04:15", "best comment thank you", "This is what we needed ", "GOOD WORK!!!", "KFP's Best Employee of the Month right here", "This is the content I am here for.", "Those timestamp almost cure my depression :) need to watch more ", "@Alveldir get this man a promotion!", "Takanashi Kiara: come for the wholesome, cozy atmosphere, stay for learning German swear words! ", "25:05 It means a lot that you read those tweets. I honestly wasn't expecting to go that deep  but once I started it was like the floodgates opening. for anyone reading this, the TL;DR was that I've personally struggled with low self-esteem and feelings of inferiority, etc. but seeing someone as amazing and talented as Kiara experience similar feelings helps me see that they're normal and even people with extraordinary talent feel like that sometimes, and seeing her push through them helps me feel like I can too. (Side note: this question was the jumping-off point for a glorious 13-minute tangent and that just feels great.)", "Just gonna reply so kiara is more likely to see this have a nice day", "If you have 1 millions fans, I’m your fan; If you have 1 fan, that’s me; And if you have zero fans,then I’m not existing anymore. Have fun, Kiara", "That arrangement can be made.", "Cute German Bird mode:   1:12:00\n\nGerman Bird Went Brrrr:   1:15:56", "Her PC circumstances are so complicated lol. \n\nI hope you figure things out Tenchou! Thanks for streaming again! ", "I get being embarrassed about crying on stream but I find one of Kiara's most absolute endearing qualities is that she wears her emotions on her sleeve. Like when she's happy or excited it's almost like the energy is just bursting out from her and she can't control it. It's super adorable and I love her for it. I guess also that extends to negative emotions too.", "1:49:45 for my reference, don't mind me 😂👍🏻", "Missed this stream, but I was around last night.  I understand your frustration, so please take a break when it is not going well and we will be waiting in support.  There is no expectation for every stream to be 100% perfect, and we do not blame you for it.  Thank you!  Hope to catch your next one soon.", "I'm only 20 minutes in and this is the most wholesome thing ever.\n\nEdit: Okay, I see.  Don't donate for a new PC.  Donate to get her out of survival mode.", "We are happy that she's happy now", "I ordered a Chicken and an Egg separately online...  I´ll let you know!", "Your damn fast lol", "@Adam Rizky Mubarak talking about fast I still wonder which will arrive faster the Chicken or the Egg", "ba'dum, pshhhhh", "Sip", "@Taylor slurp", "@Casual Filth Cheers m8", "@Taylor 🍻", "I tell you what comes first: Casual Filth's EN jokes.", "@GriffinPilgrim the chicken.", "@GriffinPilgrim the speed that is important is how long it takes for us all to laugh together =) thanks dude", "I've spend more time thinking this than I'm willing to recognize.\n\nBut I believe the highest attribute of each EN girl should be something like this:\n- Ame: Luck", "Ina’s sole brain cell is powerful", "So wonderful to see you upbeat again Tenchou! When you're feeling sad and down, your fans feel sad too... When you smile and seem happy though, the joy of us watching and sharing the moment with you is uncontainable.\n\nYou're an incredibly gifted, talented and charismatic individual, whose presence touches hundreds of thousands of lucky people. Never doubt the power your smile and laughter has of making our day better, and letting people forget their troubles to replace them with joy for a while.", "Now Calli has to do a Ara Ara too or accept that she's the \"shota\" of the two kk", "Gotta love to see her bounce back from that previous stream", "The phoenix will always rise from its ashes after crashing and burning", "“Maybe it’s okay to be one thing at the same time”\n- Kiara 2020 proving she’s a top right", "honestly superchat reading with all the casual chatting during it are the comfiest kiara streams + are always super fun as well, and people who skip out on em are missing out on so much", "Welp I slept through my nap alarm and missed most of the stream and I am legit disappointed in myself, but I'm really glad you seem to be doing okay now  We'll keep throwing all the love you ever need your way. KFP! KFP! KFP!\nAnd now time to watch the archive", "We're glad you're feeling better. It made me sad to see you like that last stream", "For the record, Kiara, I worked at an ISP. I don't know what laws or what policies are applicable to the ISP you're going with, but you should definitely call and complain about the date change. Usually ISPs hire contractors to do installations so they're probably just as pissed about the delay as you, and you should 100% demand compensation for the missed appointment. Go full Karen Kiara and you should get a massive discount for the mistake. Especially if they're in-house.", "Watched the whole stream, a very fun and wholesome one!\nI just wanted to say that so far, my favorite part of your streams are these superchat readings and your just chatting streams because it feels more real fuzzy and we get to know you better. And if ever the technical difficulties arise again, I think it's a safe option to fall back to another just chatting stream where you are rest assured most of us will stay. Stay strong Kiara, we here for you, not specifically the game (at least for me) so stay confident in yourself!", "It was a lot like the chatting stream, only with more venting and details of her moving woes and the plauges of modern telecom companies. As a former tech support for an ISP, I felt her pain on a spiritual level. \n\nWe also saw the return of Cardboard Kiara as a result of those internet woes, with her live 2D model spending the entire stream staring at the ceiling and breathing deeply. Many of us were surprised to see her moving in Callie's snack review collab. ", "@NotAGoodUsername360 congrats on getting hearted", "Superchat streams devolve into everything but superchats and I can't get enough of them. Bless KFP for my daily dose of laughter.", "Get some PC help from Botan-san. She’s a PC enthusiast.", "Kiara brings me this..Wholesome happiness that I rarely feel so yay", "Kiaras story about trying to attract cats, and feeling cucked is literally the most relatable thing in the universe.", "16:40 \"they want to sit in that spot. It's like the perfect hole\"\n... I mean, there is a perfect hole there, indeed. :D", "The stream only started and Kiara already blew my mind. An egg sandwich is vegetarian (Not vegan, vegetarian) while a chicken sandwich is not, and the only difference is time. So an egg sandwich is also a chicken sandwich.", "Let's go bois, let's get her to 300k!", "Someone should let her know you can't be perfect and i love streams because of this kind of stuff that only happened on stream we should laugh at this not cry", "Kiara i got a question!", "48:30 \"They would put all the points into one stat\"\n... I wonder what show you watched. XD", "\"You guys will be such gorgeous chicken nuggets\" \"and I'll eat you, I'll eat everyone of you\"\n\nThat quickly went from wholesome to threatening", "\"For the little things that make life more pleasant...\" Really, though, I hope you can get the things that make life better for you and be able to enjoy your time more. Talking about finances, I think I need to be more careful with mine; I'll keep the membership at least, but it may be a long while before I can do another Superchat, much as I would love to support more. Hoping things will go well for you, even if it takes a lot of time, I'm sure it will work out.", "You can play low resources cool games like noitu love, ys origins, iconoclasts, reflex and tempest of heavens. Also ask for advices in pc building to Botan she is a pro in that area", "19:37 So true, cute doggo impression! 19:55 Uhhh... what", "Thx", "28:19 people jump on everything with a knee jerk reaction.", "but then, you can have 2 computers! - play on one, stream on the other at the same time; better performance (?)\n... idk. stuff like that might be useful?\n- I'm not sure how much extra GPU load would it take to render a 3D model, etc...", "Kikkeriki!!!! I fell asleep halfway the stream cuz it was literally 5 in the morning lol. But I was really happy that you were really happy in this stream and I'm so relieved. Don't be too hard on yourself Fire Chicken! We're here to support you! If you have some problems we're here to listen.", "That opening comment about the egg was the most Gavin-From-Achievement-Hunter thing I've ever heard someone, who was not Gavin (From Achievement Hunter), say. \n\nYou also explained your reasoning about 3x better than the aforementioned Gavin*.", "1:27:46\n\n魑魅魍魎 :\nThank you Kiara, I will totally need the compund \"evil spirits of rivers and mountains\" in everyday life.", "I’ve been roped into a second philosophy class, apparently.", "Danke schön for the stream! I’m glad to see you smile again!", "Nicht-persönliche Fluchwörter und -Sätze +1:\nHimmel, Arsch und Zwirn!", "Damn the whole vid has ads", "\"I didn't really use my hands. I just used my face. It was...big.\" -Kiara", "I had to miss this stream after your Minecraft stream, but I'm glad to see you picking yourself back up! Hope you can find a good solution to your current situation! ", "Kiara starts out with an almost scary commitment to her character. It's like she's lying awake at night actually thinking about chicken.", "21:12 Griffy reference?", "Haha, that's so great\nThanks for pointing that out", "19:40 I want to rub this cute bird's belly", "1:36:15 how we will be her food\n1:41:07 for me", "Couldn't watch the Whole Stream but, Its good to See you smile and cheer up!", "Thanks for the stream. It was really wholesome and chill the entire stream. Hahaha.", "Thanks for archiving these! I'm always busy working at the animal shelter I work at when you're streaming. All the love and support!", "FINALLY MEMBER! YES 🥰🥰", "I wish I could watch these dggrqms live but it was 4 am :(\nI'll watch the archives for sure!", "5 months...but with that rented pc it's girigiri but not optimal for streaming.  ok tenchou, I'll place my faith on you. Stream was fun and we got to know more about you.❤ ", "Shout out to Samaritan who said my tweet (or at least it very much seems like they were referring to my tweet) \"Melted their heart\" in the chat shortly after my SC was read at 25:05. I had to open up way more than I normally do to write that tweet, so its nice to know it reached some people in a positive way.", "I know that I superchatted and it was bound to happen but it makes me so happy to have her just say my name and my superchat.", "2:04:24\nYou can remove youtube's ads.", "Super Eggcited for that birb collab with Shubaru!", "Missed it cuz of work :(", "cute Kiara", "Yandere Saiko No Sutoka Game Play", "dogs are better anyway :) theyre always happy to see you", "i just have one wish for my birthday in two days after i post this. \"don't let any vtubers that i watch ever cry or went sad again.\"\nwatching earlier minecraft video truly made me realize that kiara is also human.\ni can't possibly give any money since i only earn $5 to $10 a day and i had to spent everything on rents and bills. but my prayers are always be with you kiara.", "Love your streams", "Big fan from the Philippines Kiara!", "we love our silly chicken\nI MEAN PHEONIX", "1:49:52 the voice of an angel.", "いつも楽しい配信ありがとう　　　　　自分用1:16:54", "1:36:18\nI DIDN'T SIGN UP FOR THIS\nPANIK\nPANIK", "SUPER CHAT TIMEEEEEEEE", "I want to see a Kiara tier list of german dishes.", "We love you, Kiara!!", "Sorry Kiara, I fell asleep while watching the stream ", "Actually you know what would be really fun, kiara does a only audio stream and boom.", "Bleib glücklich Hühnerfrau und wir wünschen uns alle gute Dinge für dich!", "Is she reading the Superchats from the prior Minecraft stream as well before she had to take a break? Or is this just exclusively SC’s from this stream?", "Previous Mc stream and SC stream 🥰", "Takanashi Kiara Ch. hololive-EN Ah, thank you for the clarification! I donated in the prior Minecraft stream, first time to any VTuber, actually. Keep on rocking, Kiara! KFC FOR LIFE! ;-)", "🐄", "30:00 I was SO sure she was going to make a joke about Macklemore's Thrift shop", "Look at it by the bright side guys, by the time Kiara has her good PC, we'll all be fully grown chickens :)", "Ahhhhhh i fell asleep during the stream!!!!!", "You're amazing at what you do Kiara!    Your fans from India say hello!", "Kiara deserves ALL the headpats! Precious!", "Man where did all the vtubers come from recently, not that I’m complaining just 1 month ago the only vtuber I knew was melody", "so, kiara needs designated cat shorts for going to cat cafes?", "PRECHAT GANG AND POST CHAT GANG 👏👏👏", "welp. I got called a \"weeb\" by Kiara. Guess my name choice from the late 2000's is coming back to haunt me. ", "Note for anyone: Don't edit posts as a way to reply, as it removes the streamers like bubble. A good safety feature, YouTube. I guess I'm too used to Reddit.\n\nWhatever the case, thanks for the like, Kiara! Keep up the good work! Also, I kinda enjoy seeing people try and pronounce Hokie (roughly ホキー).", "tengo la campana activada y youtube no me está notificando sobre los directos de Kiara. ¿por qué youtube?", "Kiara I love you 🥺🥺🥺❤️❤️❤️", "For context: her sound cut out last night and I wanted her to voice the sound effects in Minecraft. But she didn’t give up and didn’t let us down, the sound was restored pretty quick all things considered.", "She’s just a constant ray of sunshine. Soon as Kiara enters a room it’s a nice warm and cozy atmosphere, fitting for being the chipper phoenix she is.", "Glad to see you feel better Kiara, was worried because of the tech issues you had earlier but feel good you got it back together.\nEven when things feel like they aren't working don't give up and keep trying, we are here for you after all just like you are here for us.", "you are great! 💖🍗🍗🍗", "Phoenix thighs please 😖", "The ending wasn't Tenchou screeching, but the PC...", "Criticism is welcome? I hope that's true. I've been attacked by \"fans\" on social media platforms cause they thought my criticism was \"hate speech\".\n\nFirst of all, I'm a fan of yours. You're just a ray of sunshine that could brighten up my hectic days. It's a kin to a virus when you are happy, I would be happy too. But at the same time seeing you down and sad, turns those positive energy into a negative one. ", "Es war ein vergnügen", "The attention Kiara (and the other girls) pay to following up on the superchats even given how many they get is quite impressive.", "Three weeks? Curse the internet demons...", "Kiara I love your charisma!", "How does one join the kiara fan club? Tell e bröthers", "God I forgot all the germane and ancient greeks I know while I studied philosophy. It’s sad.", "❤️❤️❤️❤️❤️ love you chicken kiara", "ovo-lacto vegetarians eat eggs and diary. normal vegetarians do not.", "normal vegetarians eat dairy, its vegans that don't", "Yeah I don't think animal byproducts that don't require the animal to die is fine, right?", "Most eggs cannot become a chicken.  (they would need to be fertilized)\n- You can think of eggs as Hen periods... edible. yes. whow...", "pls go yandere for Calli", "Mfw school", "Kiara is one thrifty birb", "If you sit Indian style, you would be showing off YOUR cat, and not the adorable kitten.", "Guys why doesnt she get a new pc we should all know by now that she has a potato pc (cp: re 3200g gpu: 1050ti monitor res:horrible not even 1080p) she probably already has enough money so why doesnt she get a better pc and idk if she built her pc.", "I thought the hololive Co. Give every holostar pc :o"]