["they do be speaking about the truth though. you can practically hear Kiara's smile.", "Discord-kun paying a surprise visit LOL.\n\nAlso that teasing with Marine-senpai is gonna be awesome ", "Calli comes back after a week and the first thing Kiara hits her with is \"Calli milk\" lmao", "Kiara: \"We're just friend\"\n\nOooof", "kiara deserves more attention, she's honestly very funny and entertaining!", "They're all doing great though! Don't compare them to Gura; she is OP and even JP Bros love her.", "the real problem with kiara is that she lives in japan and her streams are ususally while the west sleeeps, unless australian bors begin migrating en masse.", "@seiji fujii ahhhh i see", "@seiji fujii \"she lives in japan and her streams are ususally while the west sleeeps\"\nOn one hand, the scheduling thing does hurt for Western bois. BUT on the other hand, she gets to physically hang out with her senpais like Marine and future kouhais. I'd say the trade-off is worth it. lol", "@Oliver Xu she's just now starting to colab with them, i hope the jp audience can become a regular to her too, but thing is the jp audience is extremely diluted witha ll the choices, the west has more potential, and with less choices, the current gen 1 girls got it high right now.", "@seiji fujii She's moving out of Japan next year anyway so we'll see.", "@grace calis Really? Where did you get this info? I imagine callis coming too, they couls even get a living rck with most of the girls save watson, eho actually cant do to bobba and her other pets.", "@seiji fujii kiara told it on multiple streams, she is moving in 3 months if i get that right", "People want memes 😥", "@Salty ho, good for her ,i hope she can do more collabs, is mori moving too for better hours?", "@seiji fujii they dont have plans for traveling together, and mori doesnt have plans for moving now as far as i know", "@seiji fujii Did she ever stated why she moved to japan in the first place?", "@Franz Joseph she seems to have been living there for a  while now. I think she's actually german , or from somewhere wehre they speak german , as her native tongue, her next best langauge is actually japanese , fluently for that matter, and english is her third language aparently , while  my favorite is probably amelia, kiara just has an estupendous attitude.", "@seiji fujii yup, I know that from what she worked with but I don't know if she ever said why she moved to japan", "I'm here once again just leaving a comment for the algorithm", "🎃 Immediately. Immediately found out, guess our Manager can´t lie that well. / My next door neighbour keeps saying he's actually a big cat in a human suit. To be honest I think he might be lion.", "XD. Is he a La Lion?", "Lol", "@Jkhmonkey KFP IT Hardware Department #2 also fun fact I put the cat , Lion joke here instead to the other girls because of the halloween art for the en girls where Kiara is dressed as a mummy cat and it fit here the most =)", "Bu dum pshhhhhh (*insert spooky sound effects pls*)", "Kiara as kid: runs away from the neighbour.\nKiara as neighbour: runs away from the kids.\n\nA chicken indeed.", "1:12:38.her \"what?\" Is so cute lol.", "1:07:20 That moment when you finally got the neighbor but gets instantly found out is hilarious.", "1:07:20 Gura immediately calling out Kiara as Imposter.", "Kiara is the soul of the party", "Cute Girls Do Disturbing Things.", "The last game with Kiara as the Neighbor is way too hilarious. She got found out immediately and yet Kiara still won lol.", "I'm sad bc I miss this stream I was literally eaiting all day for this and then I got tired and fell asleep", "I meant to say waiting btw lmfao", "Discord Chan 😏", "As always Kiara too inacent to be a proper villain. Sasuga Tenchou lol. Great job on the win though ;)", "PUNtastic Stream", "kiara carried this stream", "Kiara carries EVERY stream she's so extra", "Lol getting immediately called out was hilarious. Tenchou pulled through tho!", "Can't wait for Sleepover with Marine hahaha.", "Everyone got to be a neighbor! \nKiara being PANIK and chicken the first rounds and then finally getting imposter at the final round. Altho she's immediately exposed for some reason lol. Sasuga tenchou", "calli wants to be the bait when kiara was imposter", "1:02:34 - i see u are a girl of culture", "I used to follow the games development, however i had no idea the game was gonna turn out like this. It's odd but im glad the girls had fun playing it!", "1:19:24 Calli Jelli Moment", "\"Kiara's got the red key! Kiara also has a gun.\" Top tier ghosting....", "Best horror collab stream. Wholesome, and Kiara wasn't freaked out alone.", "Sadly Kiara had connection issues as it seems, other member couldn't hear her all the time, it would cut of the sentence and Kiara couldn't hear them", "This game is kinda sus ngl, but collabs are the best", "Kiara being totally not outed as Neighbour. www", "rlly funny dat she was being hunted either way", "47:13 hello discord!!!!", "1:02:40 NNN again bois....", "Kiara would be an open book at Poker. See how fast she was busted just by the sound of her voice. Calli would rather trust the apex predator than her immortal love.", "great stream kiara!!!! i loved the walkie talkie mics and discord parts", "for a bit i thought maybe kiara wouldn't be the neighbor like the first collab of among us where she wasn't impostor lol", "Fun and entertainment at the highest level :D", "will kiara play warhammer games？", "First Enma-Chan surprice debut, now Discord itself simping. What's next? Gabe Newell simping?", "Discord is one of us", "@Yuki Baskerville -KFP lazy cashier today, discord. Tomorrow, the world. Things are looking up for the KFP cul- I mean company", "@Jkhmonkey KFP IT Hardware Department #2 sasuga! Can't expect nothing less from the cul- I mean, my wonderful workplace, everyday a new adventure.", "Normal game : Split\nKiara Neighbor :  ASSEMBLE\n\nLOL. my bird has  been bullying xD", "1:02:24 Happy November 1st guys", "Thank you for the stream Tenchou... you probably should never play Poker tho", "Wie hast du eigentlich so gut englisch gelernt", "kiara knows of no nut november", "Lol so much for a certain novemberv", "Quiet chicken makes for a scary chicken", "1:02:24 Damn Kiara is indeed dangerous with that many nuts before November ;)", "congratulations, your POV is being watched. Please do not resist", "On side note, if Kiara’s sounded like robot chicken on discord is probably the internet. Yep my friends call me cybernetic organism", "It's really cool that you speak German!", "This is so UwU", "best burd", "It was nice to hear mori again!", "Lmao that nnn joke", "You crack me up so much ❤", "Kiara really is a chicken huh..", "Chicken of culture talking about NNN", "I had to work when this stream was live.  :-(", "Thanks for the stream Kiara! Not sure if you guys plan on playing this game again, but I’m pretty sure there’s a in-game proximity chat you can enable to make it easier for the neighbor to get the jump on people. Regardless, fun stream and thanks for everything you and the rest of Hololive EN have done to entertain us during these trying times lol", "来ました。", "Today I become tentoceultist and proud KFP emploee. \nIt will be a hard life, but ascension is not just given.", "14:38", "Anyone knows the name of opening BGM? I really like this music and I know it's from DOVA-SYNDROME but I couldn't find out.", "DO PHASMAPHOBIA COLLAB NEXT!", "Thanks! It was realy fun Kiara!", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "🙏👀", "kiara is sugoih kawaii forgive my speelllliiiinnnngggg", "Is this game worth it if I have no friends? lmao.", "Nice 69 coment", "Man. Ina is skeri", "I love kiara", "Fufufu", "", "Kiara has such a nice annoying voice, i dont understand how it can be so beautiful. (this is a compliment)"]