["I posted some fanart of Kiara since she said she hasn’t been receiving as much and she liked it INSTANTLY. Today is a great day.", "i feel so bad for her i cant draw but i if i could id draw her multiple times", "@Peachy Look for my tweet in her likes. I assure you that you don't have to be able to draw.", "That’s actually quite wholesome", "Skooma Cat To be fair I did superchat right as the stream ended telling her I was about to post something and to look for it. Kiara was literally the first like though, which is amazing.", "Skooma Cat by the way, if you’ve actually seen the art in becomes slightly less wholesome but a thousand times more hilarious: https://twitter.com/vgamer3111/status/1310838459129622528?s=21", "Dank Chicken <3", "Kiara really wants fan arts, Im not so good but I might try it out because of Ina's tips and ofc Kiara deserves this much love", "Kiara is the most underrated member of Hololive EN.", "Linden Just do what I did and slap together something intentionally shitty in like 20 minutes in MS paint and get noticed anyway.", "ClokworkGremlin Easily.", "Vgamer311 \n\nOh lmao nice drawing", "Skooma Cat Thanks, I tried SUPER hard on it. It took me like 15 WHOLE MINUTES.", "Time to fanart", "Bro lucky I’m learning how to draw and soon I will also give out fan art", "eyelessjack 32 If my story can be learned from there’s nothing stopping you from starting, finishing, and posting a piece of fan art at your current skill level all within the next 20 minutes.", "PS love the picture you did better than anything I could do", "@eyelessjack 32 Im sorry to hear that considering I sort of went out of my way to make it as bad as I possibly could.", "@Vgamer311 Easy- however I feel I can do better! I am sure Kiara would tell me I could so thus I should- circle of energy or something.", "\"You could solve world hunger and someone would starve themselves in spite\" just meant that no matter how amazing you are, someone will be unhappy with you. Just wanted to clarify how great of a job you're doing!", "Fire chimken is good dont change our good and wholesome fire chimken we support fire chimken", "Well said Cousin", "That is a wise saying! I'm gonna add it to my list of wise sayings and write it down!", "Kiara is just building a castle in bottom left at this point and I love everything about it. She is best birb.", "what is bottom left?", "faker daker its a reference to her position in the intelligence-seiso personality chart in the 2nd EN 1st gen collab stream", "@Edward Knight OWWW I TOTALLY FORGOT ABOUT THAT, THANK YOU FRIEND!", "@lol no This https://youtu.be/GQI4yf7ZgHU?t=3810", "She said she’ll consider a bottom left emote and if it actually comes true, it’ll be OFFICIAL.", "Oiii, my shuba shuba sense is triggering right now when you say best bird", "@Edward Knight So THAT’S what it meant! Thank you, I was so confused.", "She is the best", "\"Maybe because yesterday my dinner was two pieces of chocolate.\"\n\"Yesterday I didn't really eat much... I mean I already ate a muffin today.\"\nKIARA. YOU'RE WORSE THAN I AM. PLEASE EAT. NOURISH YOURSELF. MORE KFP.", "More nuggets! Or maybe she's secretly hoping Calli will hear about this and show up to her house with a box of nuggies.", "@TheStupidrule I think they live on different continents.", "*two kinder buenos.", "im sure shes fine, girls gotta keep a slim figure", "TheStupidrule omg", "@ClokworkGremlin As far as I've read, Calli and Kiara are in Japan and the other 3 are in the US", "@Peachy eating that much is unhealthy and can lead to illnesses", "@Futuf your body knows when it needs food and will tell u: eat when you are hungry, its literally that simple", "Peachy when your stomach grumbles it’s from an extreme lack, you won’t need much to sate it, but that still can too little", "Sometimes I go to bed with no dinner only cause I’m too lazy to make it or fill sick but I feel for her. I wanna watch her grow in views and as a person and eating will provide her with energy to do so. So Kiara eat more and healthy please", "animal fats and proteins are good for health specially for a young woman like Kiara.. sugars otoh.. yah, defo in moderation", "@jub8891 yes!! she mus eat lots of eggs and beef", "if i was able to have KFC, Burger King, McDonald's, local restaurants and bakeries then i would take that almost any day, as long as everyone making it wears a mask (during the pandemic) but i don't have that money, i have a growth disorder and a high metabolism (due to the growth disorder) so i am always no heavier than 115lbs/52kg (i am 5ft7in/170cm to put in perspective) so i try to eat a lot of calories and carbohydrates, food at home does not give me as much but i will eat what i can", "Petition to Make the whole holomyth crew to have a Minecraft Collab.", "I'm like 9873900% sure they will. A lot if not all hololive girls play mine craft so its bound to happen", "CupOfWhiskey true", "HoloEN server ASAP", "they will, kiara just started first because of fire emblem issues", "They already have plans to do so Kiara just wanted to start early so she could learn how to play before that happens.", "The one who made Kiaras skin already made a Calli skin for her too.", "Wish has been granted XD", "I didn't know i needed 1:02:40 so badly until i heard it..", "I really try to hit that high notes when I sing that and it's such a powerful song to sing along with friends.", "I really wish the girls would be able to sing more English speaking songs, even though Kiara is in Germany and the other girls being almost certainly in the US they're  still  limited by Japanese law which is apparently very restrictive on copyrights. \n\nHallelujah is one of  the most beautiful songs and there's a lot of potential to have a truly wide variety of music if they could sing whatever they wanted. (grumbles in American)", "Any confirmation on that kiara is in germany ? Its heavily implied that kiara and mori at least are in japan.", "@Taj Wright Kiara was born in Germany, though it's unknown if she still lives there. Mori has unknown origin, simply just being a \"grim reaper\" (though her accent is very western), and she is still learning Japanese [she had a study stream 19 hours ago], so it's unlikely she lives in Japan.", "Tom DuMond im pretty sure its youtube who has very strict copyright laws", "@Taj Wright No confirmations, but going off some simple assumptions from one or two of Kiara's streams were she was briefly mentioning streaming times and that she would consider trying different times to accommodate more people with her stream times matching up with EU timezones. Most importantly though during her failed Fire Emblem stream as she was getting more and more frustrated and sad she said something along the lines of \"what terrible way to start the day/morning” which matched up with being early morning in Germany’s timezone.", "@What a Simp KFP Navy Admiral Youtube is required to enforce copyright laws that differ from country to country, the US has different laws on copyright and fair use than Japan which is more restrictive, because all the girls accounts are registered in Japan and because they work for a Japanese company Youtube is bound to Japanese Law. ", "I hope she sings the full version in a Karaoke stream.", "@Tom DuMond Cali gets 450¥ wine at a convenience store she lives near, she is in Japan. Shouldn't really go further than that though even if it's publicly available information.", "\"I'll never forgive the Autojump\" - Kiara, 2020", "2:39:30 50% of Kiara's fanart is Kiara with her wife\n2:41:01 She wants to see fanart TakaMori kissing\n2:45:01 The CP name\n3:17:28 Kisses for Calli", "The most important thing to take away from this stream is that the official ship name between Kiara and Calli is TakaMori", "Personally im a big fan of ToriMori", "@SorrowfulRose Birdreaper xD", "Kiara = Bird\nMori = Death\n\nBird that symbolize death = Crows", "And here i was, calling it Calliara", "🐔👄 Kisses Timestamps:\n3:01:54\n3:17:13\n3:17:18", "hahah nice!", "Cute", "@General Pekorin Just doing my duty, General o7", "Thank you yet again haha. 🤣", "@FoxByte Always a pleasure 😆", "I love that this is a theme.", "Cute", "Oof thanks mate, I'll remember this moment when I was rejected 😂😂😂", "Wong Ye Heng first time?", "@Vgamer311 Eh probably more to come, I don't mind though 😂😂", "Wong Ye Heng I was once rejected so hard I got an avalanche of “F” and “oof” in chat.", "Kiara in 4 hours: Learns how to fight, mine, farm, craft.\nMe in my first 4 hours in minecraft: Mining iron ore with wooden pickaxe", "to be fair she has an army of backseaters to guide her, don't feel bad XD", "It's probably really cheesy to say, but I feel like we're this one big family (of employees?). We all lift each other up to the best of our abilities, so everything feels warm and tight. We'll always be there for each other no matter what. This is the best rabbit hole I've accidentally fallen into, no regrets at all. ", "We are kiara's finest. We are the kfp!", "Only the best chicken are considered for KFP, you good sir, can be viewed as one", "Joe, you're fired.", "we're fucking slaves bro", "[Time stamp under construction] Will be done soon™\nSorry I'm behind.\n2:01:51 I'll leave this here for now ~~🔥🔥", "1", "2", "3", "4", "5", "viva la kiara!!\no7", "Viva La Kiara! o7 to both Generals!", "And here we go again, Good luck Cap. o7", "Cap’n pepjay and everyone else may i just say I appreciate the things u do for this community like it’s still less than 3 weeks old but you’ve donated so much to our Tenchou and to us as well and to that I applaud 👏👏👏", "diajeng salmaa putri Exactly. You love to see the amazing support.☺️ \n\nVIVA LA KIARA.❤️🐔o7", "The suffering 😭", "2:30:17 that sounded just like that \"uh oh an ecchi thing just happened\" sound effect they use in anime.\nYou know the one", "but it also sounds like the black man who was like \"ow my GAD! w a w !\"", "39:22 IM DECEASED BAHAHHA", "crunchy", "1:14:17\nKiara: \"I'm back home, but at what cost?\"", "\"Un momento, per favor\" was almost perfect. you just need to pronounce the e at the end. It's \"Un momento, per favore\".\nThis phoenix knows too many languages. She's becoming too powerful <3", "3:19:45 Fanart of Kiara wearing a bucket over her head when? Jokes aside, another fun stream for not only me, but the rest of those who watched as well. I have now become a worker at KFP with a wage of -$5.00 a month. Life is great!\n\n1:49:17 Another Bruhket moment.", "shouldn't the second bruhket moment be the first since it's earlier?", "Glad you are feeling more comfortable in your own shoes and feeling a bit more confident! Ignoring harsh messages is difficult, but glad you are focusing more on the outpouring love now! Baby steps are fine, let’s walk towards the goal together. No rush! Thank you for the stream, we all really adore you and want the best always. Glad you feel better, we’re right next to you on the road. ", "There's something so enchanting about Kiara's singing ", "Out of all the Hololive EN girls I tend to watch kiara more often! Thank you for bringing joy to all of us that are watching.", "When she said \"TAN TAN TAN\"\n\nI Felt that...", "3:18:04 for myself move on, also AHHH embarrasing", "you're an absolute legend bro", "Doing god\"s work bro", "Kiara's pronunciation of \"iron\" reminds me of Tobuscus.", "2:28:29\n\nThe bgm rhymed when she's walking", "Everything was going so smoothly until those accidents happened. That was some Grade A Pain Peko that even I felt it. Man, this game really punishes you hard when it comes to those mistakes. Good thing, you persevered thru all of that. Thanks for the stream as usual. It was a wholesome experience. Danke Schon and Auf Wiedersehen, Kiara! ", "2:11:53 I’ve died so many times to auto-jump that watching this part was mentally liberating.", "これから日本語でたくさんコメントするね！\nI will comment a lot in Japanese from now on 😎", "キアラ言ってた「みんなは英語を使ってれので日本語のコメントがめっちゃ目立つ」とか。片言ですみません、日本語はまだ勉強中ので。", "@Danke Schön そうですね！私のコメントが読まれる可能性が上がるかもしれませんね…", "From the very beginning. to the present, and to the future. You bring Joy and Energy to our everyday lives Kiara. We will always continue to support and love you for who you are. The light of the Phoenix is eternal and shall cut through the night.\nGLORY TO THE KFP!! \nVIVA LA KIARA!! ", "VIVA LA KIARA", "VIVA LA KIARA, GLORY TO KFP, GLORY TO TAKAMORI!!", "General! o7", "o7!!!", "General Pekorin oh jello there general", "Minecraft stream 1: excitement.  \nMinecraft stream 2: anger and pain. ", "I think your actions are correct.\nI am cheering for you. \n気遣いのできる綺麗な心の持ち主や\n愛してんで", "Ummm... YouTube-kun please pretend nothing has happened here. Ok? :\n\n1:41:35", "No, Kiara, she's the kind of girl who'd take a kiss very seriously.\n\nLike, \"we're literally at the altar\" seriously.", "Kiara to the mic arm:\n\"Weakness disgusts me\"", "27:51 imma just put this here", "Top 10 anime battles you wouldn't want to miss", "Thanks for that.", "3:05:36　推しに名前を呼んでいただけるだけでこんなに嬉しいとは思わなかった…。二回も呼んでくださるなんて今日が全ての幸せの終わりかもしれない。そっと自分用に……。", "おめでとう🥰🥰", "I really felt her pain, when she lost everything yet again in Minecraft.", "It’s really nice seeing someone have that sense of discovery after playing this for the first time.", "There is no “If you left the stream early, you missed this: “ this time.\n\nCuz I left early for F’ing school.💔", "Didn't catch the stream at all I am at work it's 2 am...", "I mean 03:22:06", "Danke Schön Now I hate school even more. LOL💔😭", "Brothers 🤝!!!!", "bruh zoom classes are a baller, i had fun watching.", "yes. we see Kiara grow in Minecraft,if she keeps the pace,she’ll be lighting TNT everywhere like her favorite senpai", "Man, there's just something so fun about watching someone, especially one like Kiara, play Minecraft blind. It's absolutely charming see them make the same mistakes you used to (and maybe still do).", "Have you ever watched Piropito's playthrough? He plays completely blind with no walkthrough, wiki, etc. It's absolutely wonderful.", "its also fun because Kiara is such a girly girl.. her personality is very bubbly and interesting to observe..", "Does anybody else notice her opening music sounds like it should be in a pokemon game?", "It would take me 2 years to finish the calli x kiara fanart. I'm ded.", "The lava bit was such a mood. \n\nItems burnt, heart did too. ", "Kiara finally experiencing the harsh realities of Minecraft.. \n\nStream was fun and wholesome, as always!! ", "I still remember when I went to fight the Ender Dragon for the first time with all of my best gear, only to find myself on a small platform over an endless abyss and getting gently nudged off of it by the damn dragon.  Stopped playing then and didn't come back for a year...\nLet's just say Minecraft is a game that builds character. That, and an assortment of phobias.", "28:00 ish. that \"real\" voice? is amazing. ASMR stream when? lol", "So me and my friend made a Tier list of all hololive members (yes aloe included) and he put Kiara at D tier as I put her at S tier, then we had a fight but Kiara if you see this I love you and your content keep up the great work", "\"dies to lava cuz of auto-jump\"\nKiara: I'll never forgive the auto-jump!\n\n\"cue image of Joseph with Kiara hat saying that\"", "I've been enjoying this Minecraft adventure and looking forward to seeing where it will go next.\nTakaMori is definitely a better name that what I suggested (Ashes and Dust) now that I've thought it over.\nI'm always hoping that things will go well for you and this community; I want you to believe in you as much as we do.\nFrom a dove with love, thank you for all your hard work so far and take good care of yourself.", "I hope Calli is aware of this mating ritual you described", "When she almost dies it makes me anxious and makes me want to bite my nails. And also i know where her first spawn was and i didnt make it to the stream.", "In Twitter guys she got raided by the enderman inside her house and she dies....\n\n2nd: she use water to drove away the enderman hahhaha.. Genius..chicken", "27:52 Beware of Shock attack", "39:25 Hearing the HoloEN girls cuss will always be hilarious to me XD", "2:01:45\nI think my face palm super chat jinxed her D: FORGIVE MEE", "Absolutely love your Streams Kiara :D wish I had more time to be around, all of you EN girls are doing great and remember that what is important is having a good time doing what you love :) we will love and support you all regardless of what happens!", "Hi Kiara, just wanted to say, I didn't watch your stream, But i listened to it during work, And i couldn't bare to hear you say that you might be uninteresting.\nI was pulling a 12 hours shift and your funny yet relaxing atmosphere was the only thing that kept me smiling.\nI will enjoy whatever you do as long as you enjoy doing it <3", "\"You just need my consent, you don't need Calli's consent\" 2:42:50\n... you know, that tsun might be deserved XD", "2:30:18 \n\nThat's for me and me alone.", "And I thought we had to pay for the German teaching streams - you're already teaching us schadenfreude!", "She’s doing pretty well for herself so far, I’m impressed", "I’ll admit, the sadistic part of me greatly enjoyed the freak out that started at 28:00", "I really like watching Kiara stream while playing Minecraft myself, it's chill but the chaos that often befall  her always able to catch my attention everytime so I just ended up focusing on the stream instead, since our goal is giving tenchou wings to fly in minecraft.\nIt's a big feat but nothing is impossible.", "1:14:19 that sigh was heavy. totally understandable after all that effort lol", "i want to hug kiara, give her dinner, and a large red superchat and say \"U r amazing, plz continue to do ur best!\" \n\none day i will make enough to donate!", "Just finished the stream, sorry I couldn't catch it live, Tenchou! ", "見どころ沢山あって面白かったです！徐々に慣れていきましょう…マグマダイブは誰でもしますから練習あるのみですね！", "Your new mic sounds so good, you have such a sweet voice", "Order for everyone to be happy you have to log in on your phone and listen to your voice as you are playing then you'll be able figure out a good system. That's what I do for my streams.", "3 hour 30min. 3 second Wow", "Aaahhhh Kiara why are you so darn wholesome! I'm so happy for you and your wife!", "Thanks for the stream =)", "Another good stream to end the day! \nI love this", "Glad you're enjoying minecraft so much! It's really enjoyable seeing you figuring things out, and learn the game. You're making great progress for someone who just started, and I look forward to more of your streams! Be it Minecraft or anything else.", "Man, this stream ended up being pretty brutal, I saw the sand death coming but the lava one... I looked away for 1 second and then suddenly it was the recreation of terminator 2 ending. The darker side of Minecraft has once again be revealed to the uninitiated.\n\"More dust, more ashes, more disappointment.\" - Narrator, D.D.", "- You could write her a poem!\n- I already rick rolled her!\n... I kinda get Calli now, ngl... XD\n2:41:25", "Fried Chicken at 2:01:53", "2:02:08 now thats a nice fried chicken frying in lava :^)", "I swear your intro music is SOOOOO uplifting! ^_^ I could listen to it forever!", "Tenchou youre so amazing, cool and funny! You deserve more subs and views!!! We love you! Please dont ever doubt yourself!!!", "VIVA LA KIARA!", "キアラ！頑張ってね！！！", "Kiara is so bubbly and wholesome", "Thanks for the kisses you gave to us Kiara!", "I just can't wait for kiara to open a KFC restaurant on the main minecraft server lol", "53:36 PANIK", "Sorry I missed this, the first one was so fun. I got weak and had to sleep. Guess I know what my next three hours will be doing.", "It's highly recommended to turn off autojump.", "Thank you again for the chat reads!\n2:50:58 (personal highlight) don’t know what to say, it makes me happy that I made you happy.\n\n2:55:52 The truth hurts sometimes.", "When you dig straight down and dont die, but then dig straight up again expecting not to die.", "Kiara you are a goldmine of love and happiness please stay strong and believe in you <3 You don't need anything to get love from me and lots of people. We Absolutely Love You !", "AHHHHH! I got a KFC ad.", "Always a lovely time with Kiara", "I'm not a Simp father Plz Dont Take away my PC \nFather:What is He Watching \n2 minutes later \nSON SAY NO MORE THIS IS FAMILY BOND NOW", "In the future the small cave at the centre of the vast farmlands of the KFP empire will be a holy site known to pilgrims as Phoenix Rest.", "I love how Kiara dies the same way i would play this game ages ago and now. Feels traumatizing for someone to lose so much progress, especially as a minecraft fanboy for years. Lolololol love the stream.", "so, no I know how phoenixes make babies... but now I have to wonder: do they have cloacas? XD", "A minecraft veteran is satisfied even if I am late to the stream", "1:02:38 gonna need the full rendition", "nooooooooooooo I missed it...", "Did I miss this stream?", "27:50 lol poor tenchou\n1:02:33 Hallelujah!", "2:39:29 Kiara gushing about Calliope", "Bro I missed the stream by 27 seconds😔", "damn i never heard someone call minecraft logical", "birds actually have smaller neurons, thus smaller brain can be as inteligent\n- however, mammal brains are more resilient to blunt force trauma", "Kiara heart is broken, mine is too", "what song was Kiara singing at 54:05? sounds familiar", "2:01:51 mmm thats some nice fried chicken", "No I missed your live stream!😶😶", "Kiara(asking chat): Are you all streamers?!!\n\nMe: Plot Twist:\nThe other 90K people who didn’t leave a like on the stream are famous streamers/youtubers watching with no account/alternative account.🤔", "27:50 oh... PANIKKU", "The Phoenix tried to swim in lava", "all hail kiara and her kfp!", "Kiara, could you try For Honor?  Its a game about warriors!", "That sound was too scary! Also I hate clouds...", "It must be so hard to start playing Minecraft ten years after release. You don’t have the luxury of learning the mechanics one by one, you have to manage all of them all at once. It’s worse for Kiara because she has nobody to patiently teach her, but that’s why it’s so rewarding to see her learn and grow as a player.", "Kiara make sure to eat more!", "I know it's still a long time until you can enter the Hololive Minecraft server, but I'm already extremely excited. I can already picture all the wholesome Peko interactions.", "Hi Kiara thank you for the stream! Maybe i have the wrong impression but Minecraft doesn't seem to be much fun for you. Since Minecraft is a sandbox game everything depends on what the player wants to do. The fun in minecraft comes from creating and designing stuff like building a house. If that isn't for you and you have no motivation to create something, it's ok to drop the game. We are here to watch you having fun after all.", "Day 2? Didn't EN group play Minecraft together not long ago? Or am I thinking someone else?", "いつかホロライブサーバーにも入ったりとかして他のホロメンとコラボしてるところとか見れたらいいなぁ", "- doesn't eat, except for about a piece of chocolate per day\n- drinks sugary drink, instead of water\n- wonders why her stomach hurts\nXD 子供かよ！XD", "I'm not familiar with all of hololive, do the members usually swear? I know Kiryu Coco does, but is it the norm? I also know that Amelia, Kiara, Calli, and sometimes Gura, but I don't think I ever heard Ina swear. Maybe hololive En is just exceptionally swearing a lot of the time. It's probably due to the long form of the streams. I'm willing to bet the ideal is to make money from ads and superchat. Ad revenue is typically shot down when YouTube catches a swear. Maybe YouTube should cut some slack for longer forms of content. There is the 1 minute rule that I heard about. So that probably protects against demonetization, I think.", "1:41:30 just put it here", "Can you play titanfall 2?? Please", "Is it just me that can't see the chat replay? I thought Kiara said it won't be on screen but WILL be replayable for archive?", "I think it appears after a certain amount of time(?) I usually wait for about an hour or so", "2:30:18", "people dont tend to emphasize the r in iron that much", "Ah about the whole Iron thing, it's I-earn, no 'Y' sound and no 'O' sound. At least in north east US and most American shows/movies/games. Its one of those words that is different all over the English speaking world.", "Real life moe girl", "Kiara, say hallelujah for no bad words", "All hail the Fire Chicken! ", "Please crouch next to ledges and lava, it will help u not fall.", "🥚", "Maybe its the American accent but I've always pronounced words like Iron and Environmental as \"Iorn\" and \"Enviornmental\" \nI never hear it pronounced the way its phonetically spelled and at this point, I'd probably get made fun of if I pronounced it \"more correctly\". Who knows what the original or correct way is...\nif you learned English as a second language then that pronunciation sorta makes sense. Do what you're comfortable with. I won't judge you because it sounds cute anyway lol", "so cute Kiara", "Love your gameplays Kiara ", "it's funny because she said she would go in a straight line and then didn't", "Kiara is prime S tier waifu material", "Is her render distance on low because of her pc", "She set it low on her first stream because of chunk loading.", "If she turns off vsync, and sets the fps to 60. it would run smoother", "@Ricky Capelo Bro she cant even read coords.", "@stinkiiraven 😩", "hololive minecraft hunger games collaaab", "I’m so glad she’s enjoying minecraft"]