["Kiara: \"So... I live in Japan\"\nEveryone: \"yeah, we know...\"", "4:39:36 The Ancient One hacked Kiara and turned her into ina", "What the hell happened there?", "That's happen if you reference anything related to initial D 🤣", "Don't stress Kiarra, I've been watching Hololive from America. You are a valuable and unique addition to the group, you'll grow on people. Memes have helped the others grow. I'm a Daoist so a quote comes to mind from Zhuangzi - \"Flow with whatever may happen, and let your mind be free: Stay centered by accepting whatever you are doing. This is the ultimate.\" I have no doubt you will come into your own and your fanbase will grow. I saw your reaction the other day to a superchat. This is untrue, while you may have perceived yourself as not worthy, or lesser; in whatever sense. I promise you, it is false. Another quote for you - \"There is nothing outside of yourself that can ever enable you to get better, stronger, richer, quicker, or smarter. Everything is within. Everything exists. Seek nothing outside of yourself.\"", "Being a nice, respectable, up lifting human.\n\nSIMP", "your american your opinion doesn't count", "Chess PTSD + potato chip ASMR + 100% luck by kiara + ina raid = best RPG stream 😂", "Claude making Kiara question her homosexuality", "While I appreciate the sentiment, I’d say she went straight past questioning it and just threw it out the window. Bisexual bird confirmed, I’d say.", "@Vgamer311 Kiara appreciating hotness, wherever it can be found", "Kiara is bisexual confirmed", "There's no way the husbandos in this game don't turn her bi", "Claude has that effect on anyone's sexuality. He's that hot.", "She is just ClaudeSexual, just as any other Golden Deer", "Claude does that to everyone though on both sides", "That's just claude", "🐔👄 Kiss Timestamp:\n2:04:55", "Go for it , help the archive gang", "Ina literally came out of nowhere i was really surprised lol", "thank you fellow internet friend", "@Cool Warior plot twist; all 5 HololiveEN members have really just been Ina all along", "The ancient one hacked you", "4:39:35 Sasuga Ina-sama, it's all part of the keikaku. First take over Kiara's stream, then, the world.", "I wanted to make a joke about sword fighting, but it would have just been a riposte.", "LOL 😂", "That was a quick riposte", "Aye well done mate", "stop", "bu dum, pshh", "angry upvotes to the 69 like", "I did to, but I figured it'd just be a broadsword.", "angry upvote", "I'm actually curious how did Ina get her avatar to pop up? It didn't seem like Kiara accidently changed into Ina's model, it seemed like Ina actually took over, I wonder how they have that set up and why?", "Pure guess here: there could be a software on a local server of some sort that manages all the streams. It takes in gameplay, model and audio data, sorts them into the right streams, and sends it to YouTube. Ina could have wrongly selected this stream to send her model to instead of her own. Maybe.", "@twotothehalf Makes sense, she was probably adjusting her model or something and was testing and accidentally clicked on Kiaras livestream.", "Ina said sorry so i guess they have their 2D capture software linked to their stream key by a certain url of each channel and Ina just pasted in the wronk link from their collab lol", "To follow whole process: girls use iphone to capture real person, compute and show greenscreened avatar on phone's screen. Then they use app called AirServer to mirror iphone's screen to their PCs where they add apps window to obs layout. And here's a pure guess as I never used this software: mirroring might be based using keys/rooms/some sort of \"account list\", Ina had highlighted two accounts being active at this moment, simply missclicked and mirrored herself onto Kiara's running stream.", "She is an emmisarry for eldritch beings, don't question it", "At which time frame bro?", "@Hrithik Waghmare Around 4:39:36", "I really cant wrap my head around this one too. They simply use AIrServer to mirror their iPhone screen onto PC. This gotta be a feature on the Hololive app itself, and even so, I couldn't think of a reason for it to be designed like this", "@RaveOn Specially if this is a feature that has never been used before.", "@twotothehalf but Ina was in chat when it happened", "@SephCon Uno If she's working with multiple devices, I don't see the problem.", "@RaveOn Let's see.  Kiara didn't switch her model by accident, because her lips werent synced with her talking, so it's more complicated than that.\n At first I thought that they were now just streaming the data for collabs, maybe to save bandwiths or make it easier to capture. So you'd have the girls participating in the collab would connect directly through their iphone to a VPN and the streamer then could simply download the streamed data and render it locally. Then open it with VLC or whatever and capture that with OBS. Ina started streaming to her adress, which Kiara was still listening to and capturing with OBS and so it displayed.", "I think one problem with JRPGs is that a lot of people prefer to play them themselves and don't like to watch streams because of spoilers, so it's mostly people who've already beaten the game who'll watch. It's not a lack of interest, it's just a more restricted audience than usual, I think. But on the other hand, it pulls in a lot of new viewers over time I think, as people who're big fans of those games love watching peoples' playthroughs of them so they can see the player's reactions to their favourite parts and whatnot, with how diehard JRPG fans can be. I know I've subbed to a lot of people just because I really enjoyed watching them play P5 in their archives. So the immediate/at-the-time audience will be slow, but you'll pull in a lot of subscribers who're interested in the same games as you over time, which will be really nice 😊", "Yeah especially with long form playthroughs, few will have the patience to watch live, but on archive when you can skip the unimportant stuff it'll do much better", "@NotAGoodUsername360 That's a very good point", "This. Same reason i don't watch Roberu (Winning Son) xenoblade streams. i have the game on my backlog. i don't want spoilers.", "Can confirm. I like FE and was very excited for her interest in it, but since I haven't played Houses yet I only allowed myself to watch the first stream until I had played it myself. I didn't actually watch this one.", "Im going to sit here watching all the jrpgs streams, waiting for her to play all the Xenoblades", "Ah yes the story of Waffles Dadapon as one of the greatest Phantom Thieves that ever lived is one that I will tell to my grand children", "Kiara, i'm almost certain that a lot of the issues you face with viewers is just due to your stream times.  For example I'm in GMT-4 and this stream was at 5am for me.  A lot of your streams are while I'm at or heading to work, and the only streams I can attend live happen at 1am my time.  So for pretty much all of NA you just stream at absolutely terrible times where it's hard or impossible for us to watch. Combined with the fact this is an rpg, which are known for lower viewer counts, and it's inevitable you'd have lower numbers. ", "Not to mention that her live views are still pretty damn higher than most people that have streamed this game.", "@Zeph Shoir That's true too. She honestly has a skewed vision of streaming numbers, since she's in like the top .1% of streamers worldwide when it comes to viewership. Most streamers would kill for even 1k viewers, let alone 10-15k, so it always blows my mind when she says her numbers are low.", "her viewers are still pretty insane considering the average streamer gets 5k max and she's playing a long RPG game", "Why care about the number of viewers she generates and what type of games she plays bro? Just simply support her enough said.", "@MJP4884 I don't care at all. However she talked about it in the video, so I'm commenting on it.", "@Abyssionknight When did she mention this?", "@Bleak Forest Dude it was a 5h video I watched 5 days ago... I don't remember where at this point.", "I missed the stream because I had some other plans, but I know for sure I'll enjoy this archive ;w;\n\nEDIT: wow that last battle 😂😂\nInsane crit saves (4%~21%chance) and bernie getting succesful hits even with ~50% hit rate, while enemies missing their attacks... this was one lucky Phoenix whew ", "Enjoy ☕", "Same", "I just wanted to say thank you for streaming this - not for views but for your enjoyment. It would be easy to just forget about streaming RPGs because they aren't popular, but you staying true to yourself is what makes you so enjoyable to watch and follow.", "I hope she will keep playing what she wants.  An EN stream that early having a consistent 5k views is nothing to scoff at.  There are veterans in hololive that don't even consistently get those numbers. On top of that, just chasing what gets you the most views is what drives a lot of streamers crazy and burns them out. It's best when they mix in the games they love with the stuff that gets tons of views.", "@atariDC_ these FE streams are honestly my favorite series, despite really odd stream times and low view count, they really make time fly by, 2AM-7AM gang 😎", "I do hope that Kiara plays more RPGs on the channel.", "4:39:37 Ina hackerman", "I can't believe Burger King noticed her on Twitter lol", "Missed the livestream but now I'm rewarded with a FIVE HOUR STREAM to relax to after work? I'm fine with this.", "Day 3 of commenting of Tenchou's videos to help her with the yt algorithm", "Wait does that make her more visible? Guess I should be commenting more", "Yeah commenting helps.", "is this a JonnyAmazing reference", "Kiara and FE makes 5 hours seem like 10 mins, enjoyed all the way through ", "1:14:00 Pattern of wanting to marry a new girl every stream still holds up.", "If you do a second playthrough (golden dear??) I feel like it would be really cool if you switch to english voice and japanese text, just cause the English voice acting is so Goddamn good and I like it", "Purely selfish reason that also doesn't harm anyone", "Her reading through the chat and missing all the important dialogue gave me an aneurysm!!! \n\nAwesome stream though. Entertaining AF. Keep it up! I'm excited to see how she reacts to the later plot beats", "Kiara's going to be so confused later lol\nyeah, she's paying us too much attention", "Chapter 12.\n.\n.\n.", "she was highkey simping for claude, not even surprised tbh", "\"simping\" might be inaccurate.\n\nThis is an EXTREME thirst.", "3:40:15 Info: Luck is best for mages. It increases magical hit, magical avoid (lower enemy mage hit rate), critical hit and critical avoid (lower enemy crit chance).", "Hey Kiara, you mentioned late on in the stream about trying to reach an NA audience from Europe (or something like that), depending on timezones the best way to get both NA and EU is to do an evening stream that NA can start their day to and EU can relax to! However your base appears to be primarily EU compared to the average  Holomember so giving them preference isn't a bad thing. Love the stream, hope you're having fun!", "Yea like the time she streamed Mario Kart i woke up to the stream was great", "Her stream times are just bad for NA.  Usually she either streams at 1am or around 9am for me, so either I'm at work when she's streaming, or it's the middle of the night, which makes the only days I can actually watch live reliably weekends.  Today the stream was at 5am, so it was just impossible to watch. So her NA fans are just vod watchers for the most part.  She'd need to stream around 3am-10am her time to really build up an NA audience, but I don't think anyone wants her messing up her sleep cycle that badly.", "Her reaction to claude cracked me up JSJXJXKX", "Kiara: the earliest I can get up is like....12\nMe, looking at the upcoming collab with Subaru which will be at 7AM my time and which I refuse to miss: silent pained noise", "If I wake up yesterday at 7am just for the among us collab, Im gonna do it for the birbs again", "Tip: Train all of your magical units in both healing and reason, even if one is a weakness, then everybody can attack and heal. Early ranks don't need alot of training, even when a weaknesses. \nWeaknesses are best trained set as a goal (only -14% loss vs -50% for direct instructing).", "And the winner of the night is Claude.", "Claude’s charm is too high lol", "Tip: It's alot easier to recruit by building up support levels to B via presents and mission assistance instead of trying to get tons of different skills and stats you don't necessarily want/need just for recruiting.", "I think the steam got shadowbanned, can't find the stream on Kiara's channel only way I could find it is through my history since I was watching it live.\nEdit: Can find it now, but it was unfindable for a whole hour after the stream ended.", "Yeah that happens sometimes when the stream just ends.", "That's just youtube. Sometimes it takes an hour to move into archive if the stream hits a certain length", "Ah I see, but its weird that I only have had that problem with Kiara's streams. All the other En girls don't have that problem, at least that I know of.", "@Tony Chan I think that she spent some time cutting out the loading screen at the end of this stream, because it's not there anymore. That might be why it didn't show instantly.", "@Insignius That makes sense, hopefully this is the case rather than youtube shafting Kiara", "I was only able to stay up for the middle part, but I'm watching the archive. Thanks for streaming this, these big RPGs aren't something I have a ton of time for, but watching you go through it is a lot of fun!", "2:18:19 Of course her takeaway from Edelgard's story would be that \"her parents had some fun\" 😂", "1:19:00 Even lesbian birds cannot help but     f e a r     t h e      d e e r. Also I can't see this, especially not with Claude, without hearing Joe Zeija's fancy tea time voice. \"They were drawn into the conversation! Capital! Good show!\"", "I rarely ever comment on any yt videos but I just had to say, one of the ads I had was a KFC one lmao 🤣", "3:15 \" I was just enjoying the suffering that we cause, I loved.\" \n- Kilboara Bakanaggins.", "You gotta love the intro lol", "Who knew knew that the frase \"gotta go fast\" summons Ina. I guess she hangs around Sonic a lot.", "1:53:40 That's actually a cooler, more action packed version of that cutscene now. It looks like Byleth caught the sword straight into an attack.", "Dude imagine hanging out with your senpais. Shes living the dream. I'm happy", "Just wanted to say your my fav hololive member and i try to watch all the streams i can. I drive trucks for a living so its nice to just put on streams while im working.", "4:39:38\nNinomae Ina'nis has joined the chat", "I can’t wait for Kiara to get the chance to stream one of the Tales games. I’ll definitely make sure to catch it live!! 🥰🙏🏻", "Well, it's official. No one can resist Claude's charm.", "This face at the end 😯", "So surprised at Kiara actually falling in love with/wanting to marry Claude - after such a huge streak that seemed to have her only interested in the girls (other than Ferdinand saving her ass), it didn't seem like she was interested in the boys at all. Shame she only realized the majesty of Claude this late, Golden Deer is my favorite House/Route and is under-rated, would have loved to see her play that, but I called from the start that she'd choose Black Eagles/Edelgard.", "Uh I'm not sure about the Golden Deer being underrated. If anything, Black Eagles and Edelgard get a lot of hate.", "@Caio Coelho they're the underrated ones in the circles I've been in, which are mostly just Eagles and Lions fans warring over which is better/right and Deer are just ignored", "@Oak we Deer are just chill, no worries", "@Oak ashen Wolves just chilling in the trash", "The ancient ones are truly powerful...", "\"i havent closed my eyes in 3 minute\" LUL  lovin the RPG streams even if i catch them as VODs a little later.", "\"15 more minutes\"\ncontinues for an hour", "i finally manage to watch this till the end and omg, it was awesome, had to watch the archive hahaha, i love every second of it, i agree with the chat that the problem is timezone and not the game, because FE never click to me, and i love watching kiara playing this game", "Ina raid was pretty hilarious.\n\nThe Ancient Ones have Blessed this Beautiful Chicken!", "perfect tea time with leonie, she one of my all time faves\nyay for the ingrid recruit too, #1!", "You know Kiara, if you were to learn such a powerful technique then you could become even closer to Mori =D\n\nI can see it now a random phoenix popping in and flying around Mori's room once more haha", "\"LongFénixgirl bad\"\n- Patrilbo Taxggins", "I felt bad that I had to leave after the first hour because I had to get up early in the morning but Jesus this was a 5 hour long stream, how much did I miss?!?!", "I really like RPG, and I love that you stream them, they are  quite rare in the stream community, thank you for the amazing video", "4:39:36 INA CONSUME KIARA.", "This is the first time I watched this long live stream... Oof. I was exhausted as hell \nBut it was really fun stream!!", "i had fun watching tenchou, thanks for making it a good time as always", "\"people won't care enough to watch\" and yet I am watching and finishing  a 5 hour vod hmmmmm", "noooooOoooOOOOOOO I fell asleep halfway through :(\n\n\nfeelsbadman", "I'm glad you still want to play rpg's even if they get less views than some other games! Your fe3h streams have been some of my favorites. I love seeing you do stuff you enjoy!!", "Kiara is so lewd!!  Truly Calli is blessed with such a wife.", "Yup! Claude has that effect on people!", "Bruh I cracked up so hard when Ina just popped up outta nowhere haha.", "You tend to stream when I personally cannot watch live, but I really enjoy the Fire Emblem content! Rpgs are some of my favorites so I hope you keep them coming!", "Joined membership to support your RPG love!\nNice stream and nice game, please keep up!\n\nEdit: You should listen to what game says, lol. The despair of you seeing the second health bar was worth it, though.", "4:39:36 ~ Ina making a sudden appearance in the stream was pretty hilarious and HYPE.", "That thumbnail fits kfp so well. we're all rooting for you Tenchou! \n\nAnd also on a side note, for most of us I think almost anytime is fine as long as we know in advance the timeslot for the stream either through the hololive schedule or the youtube scheduling (or both ideally.)", "I love you Kiara and I'm so happy your playing this game.....I hope you enjoy playing the game", "Congratulations on your engagement Taka, long may you and the King reign", "Imagine telling someone you have a lot of dead siblings and that person says \"Good job parents you definitely had some fun there\"\n(2:18:24) XD.", "Another Quality Stream!", "Oh boy i should start sleeping earlier I keep missing all these 6am streams", "Thank you for the hydration reminder kiara <3", "KIARAA love youuu\nThank you so much for these fire emblem streeeeeams", "commenting of Tenchou's videos to help her with the yt algorithm", "There's only one explaination.\nIna vented. Sus on Ina.", "It's nice to see a vtuber, more so our waifu pheonix play FE, this series and especially 3 Houses is such a masterpiece", "Kiara is definitely my favorite vtuber. Just gives me positive vibes I need for the day", "Damn why didnt i watch this last night", "So i hear u married burger king?", "4:39:38\nIna accidentally teleports to Kiara's stream", "Thank you for the great streams queen!", "What an amazing stream, Tenchou!!\nI'm so happy that you've already got this figure out and has a focused gameplay: find the best waifu and husbando.\nFire Emblem is such a good Date Sim, it even has a great plot, besides the already awesome plot. It's difficult to understand it at first, though, and you'll actually only fully understand it by playing every route, which you'll do to enjoy the quality marriage gameplay, lol.", "You are my favorite Kiara. Cheer up and try do what suits you to the best you can. No harm in experimenting though. It is a process so just have fun along the way :)", "Five hours of cozy RPG with my favorite idol. Ah, this is bliss.", "Wow, 5 hours!", "8:26", "2:39:05 \"I am Faildinand von Aegir.\"", "I have never played the game, thanks for streaming it", "An awesome stream today! Luck was definitely on your side for that final battle. KFP!", "Ao-chan with the \"insane\" crit buffs", "Thanks a lot for this stream, Kiara! 🐔❤️✨", "4:39:35 最高の瞬間", "Will wait for collab with Subaru!", "Same , it gonna be lit 🔥", "Lit just like subaru did to pekora's penguin house 😂", "Pain - peko 😂", "I wanted to watch it so badly live but it was 5am for me  Time to enjoy the archive!", "4:39:36 lol Ina appeared out of nowhere", "Kiara?! 5 hours of stream?! Girl, you are out of this world.", "korone did 10 hours tho ://", "@Shampoo bet you are the life of the party.", "@Shampoo korone did 24 actually...but it's not a competition anyway bruv. We're just happy to see kiara in a longer stream", "This is not long enough, this needs to be 30 hours stream, thats when the long will be sufficient.", "this was great lmao", "What an amazing stream, Tenchou!!\nI'm so happy that you've already got this figure out and have a focused gameplay: find the best waifu and husbando.\nFire Emblem is such a good Date Sim, it even has a great plot, besides the already awesome plot. It's difficult to understand it at first, though, and you'll actually only fully understand it by playing every route, which you'll do to enjoy the quality marriage gameplay, lol.", "Fell asleep half way through the stream now I get to watch the archive for the rest", "Cute birb ;D", "4:39:38 kiara: I was hacked.", "Cant wait for the next one!", "4:52:39 Kiara loses her sanity...", "that is why we save gambit for the \"real final boss\"🤣😂", "FINALLY I CATCH UP WITH FE3H! ", "Kiara knows what is up. Prioritizing the girls over the guys in this game.", "Kiara thank you so much for entertaining us We love you", "What a great Stream", "I would love to live in Japan", "so excited for the collab yay", "I think the only thing I like more than Ferdinand von Aegir is how Kiara hypes up Ferdinand von Aegir like she's an excited mother showing off her son.", "5 hour vod PogChamp", "Fell asleep but wow 5 hours to catch up on! I’ll get it done! ", "自分用　　1:18:50", "Starting to watch te archive now...", "My longest kikiriki ever", "This game has a lot of unintuitive mechanics.", "How did Ina even get in the stream???👀", "4:53:07 rage", "Did the homie dirty again LOL! \n\n#JusticeForCaspar", "Dating is all about strategy", "no one is safe from Claude", "Good job kiara!", "Kiara I love you but you're wrong!!!! Lindhard is cute!!", "Kiara is way too funny lol", "Sie leben hinterm Sonnenschein\nGetrennt von uns unendlich weit\nSie müssen sich an Sterne krallen\nDamit sie nicht vom Himmel fallen", "Hololive EN chess tournament!", "Here's some tips\nThe one that matters:\nEven though Hubert sucks at faith you still should train his faith to atleast D since EVERY CHARACTER in this game learns heal at D faith so he can be more useful.", "the only thing you got wrong was the tournament part, the higher your weapon skill the more bonuses you will likely have such as sword crit and sword fare in this case which makes everything go much faster.", "I refuse to believe Mercedes is the worst healer, she’s amazing.", "@Vgamer311 eh the issue is most of the others are better, i mean the only one that could be argued to be worse in manuela but she at least learns warp.", "@MrEcoho Yeah, I should word it differently. It definitely DOES matter. Hit rate is probably the biggest issue, My Catherine can win most of the tournament but she sometimes miss.", "@ラファエルRISE yeah but i will admit your right about not using that for everything as edelgard in a bow tournament as a heavy armor class just breaks it as nothing can hurt her but it takes forever.", "Mercedes' problem isn't that she's the worst healer. She's actually the best healer. The problem is that she's ONLY a healer, and on the hardest difficulty, dedicated healer is not a very valuable niche to fill.", "Yeah, she's supposed to be the best healer but the irony is that she starts at D rank faith magic while Linhardt and Marianne starts at D+ and all of them gets physic at C. Starting at D means she also missed Nosferatu since it's unlocked at D+ . So, at chapter 2, Marianne can gets physic without a sweat and Super-Chad Linhardt who starts at E+ reason and D+ faith can get D reason and C faith to help both doing damage and heal. Mercedes? well, you either get her to D+ for Nosferatu and getting physic next chapter or get D reason cause thankfully she atleast starts at E+ to get fire spell but will get physic even later.", "4:39:36", "They way she plays is really entertaining", "17:07", "Love rpgs", "Feel free to stream what you like", "4:53:09", "Kiara don't worry to much. I didn't even think I would enjoy watching jpg streaming. But since your first FEH streaming. It is fun and hilarious. Because your personality and a some expect event. Today I gonna watch for an hour but I end up watch the whole stream.", "Mounted units better be good", "And then, Ina hacked", "I love fire emblem but started at 4 am for me.\n\nThank God is archived haha", "Same for me, I'm now just starting to watch it lol", "Me 2 now. Idk how long she'll play im excited for the really good parts of the story", "Everyone is Claude-sexual\nNo exceptions", "😂", "Kiara is so lovely", "You cute", "Backseat gaming would be hard if you haven't played the game either. But I hope she enjoys the game.\n\nEdit: Hope everyone can get reclassed when she can. I like looking at different outfits.\nEdit2: Near the end, I forgot she turned off Permadeath. Good thing, huih?", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "👍", "An lovely stream kiara.", "I mean she's getting better but she should still take a deepr look at the menus and try to understand what skills/talents do and that she literally can make any character into any class and class promotions follow kinda a path. So picking an end goal is good imo.", "Bernie in heavy armour.... Not a bad idea, actually. She can tuck in like a turtle, and nobody can hurt her.", "Aside from mages or units with armour killing weapons.", "I think someone should tell Kiara that she can't really marry everyone since only some girls will agree on a homosexual marriage. So only some exceptions from the same gender can be married. It's kinda tied to choosing Byleth's gender in the beginning. Same for male.", "Casperも悪い子じゃないんです…(使えるユニットとは言っていない)\nCasper isn't a bad kid ... (I didn't say it was a usable).\n\nキアラさんが担任する学級には不死鳥の加護がついてるみたいに奇跡が起こってて楽しかったです。次回も楽しみ！", "VOD gang", "I don't mind the content. Seeing Kiara's hilarious luck this game is great. The time is hard for me, cause it's midnight/1 am around when this stream was my time, so I gotta see archives. Bernie's 46% hit and 4% crit tho\n\nGENERAL TIPS TO HELP KIARA: 1. Promote Sylvain when you can. Promoting in general helps with stats in this game. Their skill ranks determine promotion chance for the related class. 2. Crits do 3x damage and are guaranteed hits. 3. Monsters that have 1 armor square broken get stunned and don't counterattack during the next combat in the same turn. Monsters that have all armor squared broken can't do damage for both your and their next full turns. The number of diamonds next to their HP bars are the number of extra bars you have to defeat to kill them. 4. The Lance was Sylvain's special weapon which you can get later.", "Just a tip for an edit here ; Im pretty sure saying which artifact belongs to which character in a game with a story circling said artifacts is kind of a big SPOILER >_> good tips/clarifications overall though.", "Bitte was", "Wow, the translation is so disappointing in this game. Taming it down for western audiences is condescending to begin with but some of the lines they decided to censor are kind of offensive. Dorothea saying being with a woman might be more chill gets translated into her saying it might be nice to have you look after her? It's like it's purposefully trying to not acknowledge that it'd be a lesbian relationship. I guess we'll see how it goes since I'm assuming the translation team weren't able to edit out having female waifu as a female MC but if they keep toning it down like this, I'd suspect they would if they could. Reminds me of sentiments where gay couples were referred to as just being 'good friends'. Glad Kiara is here to put a light on this sort of bad, possibly politically motivated, translation.", "Not having played this game but having played awakening, fates, and echoes, is the point of this game still the strategy or is it a an actuall dating sim now? Its kind of odd...", "It’s very much both.", "Intelligent Systems took a ton of cues from Persona when developing this game. The game is now firmly divided between the monastery life aspects of the game and the tactical battles, much like how the school life and dungeon crawling aspects of the Persona games are separate parts of the game yet feed into one another; you have to foster relationships with your students and train them outside of battle in order for them to do better during story or side missions that involve tactical combat.", "@ShunkenOne Yep, and using characters together in battle helps them build stronger relationships in the monetary sections. It’s an interesting feedback loop.", "I see, sounds more interesting than I made it out to be.", "Oi", "I really like this streams", "Im broke so I help by liking and commenting", "Sorry I couldn't join the stream", "Ah yes potato asmr"]