["Just wanna say that I'm so happy for Kiara that she is now able to show the power she holds with these JP collaborations. I felt like she's being hard on herself because there's some mishaps along the way such as tech errors on stream and other things that's taking a toll on her mental health. I'm so happy that you've risen like a phoenix, Kiara. I know this is not the end but the start of a wonderful journey. Congratulations for a successful stream!", "Yeah the possibilities are immense for her, basically being bilingual, she'll be the bridge with jp", "I feel like she really takes for granted the fact that she gets to meet and collaborate with her JP peers, all of them offline thus far, which is inherently more personal and genuine. Since she mentioned being a Hololive fan herself, being able to essentially hang out with the people you admire, I’m pretty sure that’s living the dream ", "yeah, she might not be as big as the others,  but now that EN are allowed to collab outside, she can finally show her skill, and I wish this'll help her grow so much more.", "@xDewritos I disagree wholeheartedly. She absolutely does NOT take these collabs for granted. You can tell that she’s absolutely ecstatic for each and every one and she’s fully and acutely aware of the fact that she’s living her dream as well as the dreams of thousands of hololive fans.", "@Giuseppe Piuma She is trilingual as she speaks english, japanese and german.", "@Kalec She's Tori-Lingual... You forget she speaks Birb. Lol", "@Vgamer311 big fax, obvious even.", "Damn I feel so proud for her 😭", "@xDewritos bro do you know how to use “for granted”?", "@Kalec yeah I know it was more regarding the 2 \"big\" languages of hololive", "@Vgamer311 Look like she agree with you. You got your third heart.", "Is it just me, or did Nene seemed to feel a little awkward in this stream? It will be interesting to see how the main branch and especially the rest of HoloEN will warm up to each other. Right now it feels a bit tenuous, but maybe some special relationships can develop that allow them to become closer. (Like the Pekora/Moona interactions that brought the Indonesian girls more in the focus).", "Couldn't have said it any better myself. She's finally able to make use of her special ability of being fluent in Japanese, and I hope along with these collabs, she'll gain more and more confidence in herself and pride in her abilities as we go further into the future!", "@Irfan Agoes Mursalin Thanks, Lol. I'm glad she agrees. Also, are people really keeping count? Because I have to be honest, I'm not even keeping count.", "@Vgamer311 I'm not. Don't know for others. Just click your icon at your comment and you will see how much the hearts you get, but it not show which comment get it.", "@xDewritos While living near her seniors is helpful for the purposes of offline collabs, it is her outgoing personality and fluency in Japanese that allows her to reach out for a collab in the first place. If she lived anywhere else, she would have just done online collabs. If she wasn't fluent in Japanese, her options would be much more limited. ", "@Vgamer311 Welp, I feel silly now 😅, simply shared my opinion, never said I was correct or anything, for the sake of your comment I will not delete mine. I would like to apologize if I offended anyone. Alexa, play “live again” from best selling album “deadbeats”...", "She read that. That's great", "@xDewritos Don’t sweat it, it honestly just seemed like a bit of a miscommunicated point to me, but I wanted to voice my thoughts anyway. At this point, We should just be glad that she confirmed how incredibly blessed and grateful she is to be having these collabs. If Tenchou is happy, so are we, after all.", "Kiara has a magical ability to instantly sail a ship with anyone she collabs with.", "Gae birb", "^this, despite her being a bit of a goofball sometikes she has really good collabs. This one was awesome, her one yesterday with Ina was also really fun to watch", "seem like She have found another use of Her Hot Phoenix Fire", "Sail a ship eh....AHOY!", "Literally Ahoy!", "Kiara is a harem protagonist", "admiral kiara with her fleet of ships", "Okayu: FINALLY! A WORTHY OPPONENT! OUR HAREMS WOULD BE LEGENDARY!", "True and her knowing Japanese is really handy.", "Kiara collabs are always fun as hell.\n\nJust as fun as Mario 64 lmao", "And that's her main talent! Kiara is the collab master!", "Idk Fubuki friend zoned all the viewer's so maybe she'll friend zone kiara if they collaborate haha", "Piercing our hearts, Gae! Bol- bird!", "@Erick Sanchez yeah, that's probably the case, Fubuki already claimed Gura as her wife and is on the brink of war with Matsuri", "@mas0ny1 Because she IS a goofball, it's so good", "@Math Pretty sure, Marine wants in on that as well. Although thats not surprising.", "Anyone she mentions by name!", "To be fair she and Nene were already... Connect-ed", "Singing Connect\nNene Disconnected\n\nThis is peak of comedy in Hololive.", "Irony at it's peak", "SUPER NENECHI", "that just how Nenechi works", "Damn this pun 😂", "I shouldn't be laughing, but I am... too funny bro lol", "peak of humanity here", "Pekora approves", "666th like", "Kore ga.....Hololive.....", "@Sirawich Khimhan irony, heh\n\nSee what you did there", "Thats a tragedy", "@Lord Sylph also a ClariS song lol", "@Brian Huber ofc!", "Dis co Nene", "timestamp?", "@Biker its like 7 or so min before the end, the last song", "We are hitting levels of kino that shouldn't be possible...", "(dis)connect", "you know nene is talented when she can sing while invisible", "as expected of isekai'ed CEO", "Imagine that suddenly appears Ina..", "She can sing from the spirit realm.", "@Martin Mendez lol i remember that tragedy..", "I think that was a stand power", "Invisible to mere mortals sure but she actually just phase shifted into a different space time", "I think she ascended", "We in the future\nNo more ghost writers we have ghost singers", "Superpower Nenechi", "HOLOLIVE-X 1Gen", "NGL bro, that takes some serious skills. The only man I know who can pull this off is John Cena.", "Whaaaat? Lol", "Nene can use stand and sing", "\"You've got to let her go, Kiara. The accident wasn't your fault.\"", "Songlist=>ENG(JP)\n\n1st Song: 10:24 Fuwa Fuwa time(ふわふわ時間)/K-ON\n\n2nd Song: 17:32 Blue Bird(青鳥/いきものがかり )/ Ayumi Hamasaki(濱崎 步)\n\n3rd Song: 26:50 Lion(ライオン)/May'n、Nakajima Megumi(中島 愛)", "????", "22:35 Tee Tee\n\n23:09 Orange=>O'riends\n\n23:47 LOL\n\n24:03 Nene favorite fruit:grape", "41:47 Kiara are custom Time Travel\n\n42:15 Ame is a Time Traveler!\n\n43:10 AHOY!\n\n43:34 Ahoy!! Warera Houshou Kaizoku-dan☆ (Ahoy!! 我ら宝鐘海賊団☆ ", "So Fast! Thanks for the work!", "Great job, and so fast! I am guessing you had it partially prepared while this was live.", "You're a hero thanks !", "ブルーバードは「いきものがかり」だね", "Thanks to all time stampers :3", "isnt blue bird from ikimonogakari?", "You have my thanks", "Not all heroes wear capes. 👍", "@nayaka dika nah", "Man you are everywhere", "Thanks a lot!!", "17:32 That's not Ayu's Blue Bird :(", "Blue Bird is from the Band Ikimonogatari\nAyumis Blue Bird is another Song", "Thank you.", "Thanks!!!", "I think u mixed up singer for the song “blue bird”...no way they sang Ayumi’s song...", "420th like for the timestampers.", "MVP", "ありがとうございます", "さんきゅーべりーまっち、おま(╭☞•́⍛•̀)╭☞優〜秀〜", "Wasn’t sure before, but the arrows convinced me to like", "I love how Kiara made 2 off collabs already lmao. She's like \"I have to get a look at my senpais houses\".", "was she at NeNe’s house?", "J L she mentioned she was using Nene’s setup, talking about there being more monitors", "She's window shopping for a new place to live :P", "@AraOugi yeah, Nene’s mic made Kiara sound even more C R I S P 👌", "xDewritos Crisp KFP 🔥👌", "I think it was at Kiara's house but Nene brought a lot of her equipment. Kiara mentions at the beginning that Nene brought a lot of her stuff.", "we were at the studio! neither one's house!", "Takanashi Kiara Ch. hololive-EN ohhhh that makes sense", "@Takanashi Kiara Ch. hololive-EN The studio set up sounded nice! I do also hope everyone can eventually visit each other's homes and become great friends. :)", "@Takanashi Kiara Ch. hololive-EN That explains why you were rushing at the end", "Shes speedrunning the offcollab quest", "@Mika Girlx that explains it... nene has another collab after this was made... sasuga supernenechi...", "@Takanashi Kiara Ch. hololive-EN Oh, now everything makes sense. (But you still want to check your senpais houses).\n\n\"Guys, orange is looking kinda sus ngl\" lmao.", "No wonder the Wi-Fi wasn't all that stable for the app. Still a great collab! <3", "@Takanashi Kiara Ch. hololive-EN I still choose to believe that you're collabing with all the JP girls to scout out a new place/roommate :P\n\nIn all seriousness though does that mean that when you guys go into the hololive studios you have to lug your PC there too?  Or was the triple monitor thing a Hololive setup?", "We got what we needed\n0. Super English 4:00\n1. 🧡O'riends🧡 5:00\n2. Singing Start (Fuwa Fuwa Time 10:30) ", "For someone like me who doesn't have enough time to watch all their livestreams but also wants more content from clips, you sir are a godsend.", "6. Kiara = pink", "This is the future\nGhost singers", "This is what we need every stream thank you bro", "they didn't harmonize", "@Village Stone thanks. Unison with different vocal tamber confuses people apparently.", "@UM536 Vids and  @Village Stone    sorry if my comment offended you in some way the wording has been changed", "So, Kiara is Bottom Pink?", "@Marci Dominguez Thanks for the change. I’m sorry to have been so harsh. I really liked the singing and I share your enthusiasm, but based on your comment I was listening for them to harmonize like singing a duet written for 2 voices and was a little disappointed when I couldn’t find that. Apologies for ruining the fun with technical talk.", "Thank you bro. I prefer it this way (stamping) rather than clipping because it gives vtubers more watch time on their channel", "@HydraAeon11 no problem I just had the time to do this and it was fun to watch those moments too", "17:38 Blue Bird\n26:50 Lion", "Is it missing something or the sream is kinda short with so few songs?", "27:00 Lion", "Kiara’s ability to collab with the JP HoloLive branch has been the best thing ever. SUPER Excited for the eventual Pekora collab 👀👀", "Kiara is literally us if we joined Hololive.\n\nCollab with everyone lol", "Imagine Kiara and Pekora laughing in arrows in unison.", "She's the final boss. Kiara doesn't wanna come off as too headstrong cus she knows Pekora's an introvert, so she wants to \"corner the rabbit\" by collabing with literally everyone else to pressure her.", "@Keeys and if we were able to speak fluent Japanese, nihongo is hard UwU", "@grace calis bottom right Kiara move", "Im actually hoping for usada construction collab with watson railway", "@Hakiim Coeg The greatest building Partnership", "It shall be a day to remember", "@Hakiim Coeg Watson Industries* But yes, I'm also super hyped for that one day.", "I'd like to hear Kiara go ... HA↑HA→HA←HA↓HA↑HA", "@Hakiim Coeg Moona, a loyal employee of Usada Kensetsu, is doing a collab with Watson and Gura soon! (edit for punctuation)", "@Hakiim Coeg \nhttps://youtu.be/YTbvDqCYID8\nWell well well, looks like there would be a colab with Gura Industries, Watson Engineering and Usada Construction", "Kiara EN: botom left.\nKiara with JP: Seiso.\n\nEdit: 420 likes.  Noice.", "What's this bottom left and top right stuff?", "Except when she sings AHOY!! lol", "@Miguel Duenas Watch the second collab of HoloEN. The timestamp should be in the comments", "@Miguel Duenas \nThere’s this chart thing on the internet where the higher someone is placed they are smarter, lower is dumber, left is greenminded i think and right is seiso (innocent)", "@Kana na And most importantly even her own papa said she's bottom-left.  So there's no debate either. ", "if you say so", "@Backbeat Highway He was even saying it in this stream a few times, which made me laugh. No respect from her papa.", "She actually said that in the collab with subaru lmao", "@Miguel Duenas There is a clip of Kiara explaining it to Subaru, that should help clear it up. ;)", "Kiara: lewd Ahoy\n\nhuke papa: ↙️↙️↙️↙️↙️", "Hmmmm...\n\nPINK!", "Nene disappears\n\nDude in the chat:  Calli took her", "lmfao", "The Holy Trinity of Disconnection:\n1. Watame\n2. Moona\n3. Nene", "The \"did notging wrong\" squad", "Korone air drive go brrrrr", "And interestingly enough Kiara has collabed or at least streamed with 2 of the three on that list so far. All that's missing is Watame. Can't wait for a sheep and chicken stream, we won't be able to handle the combined cuteness (and wonderful singing voices) of both.", "After this business deal collab I think we need to introduce our new* menu.\n\n1. Chicken Gyoza\n2. Gyoza with Gravy", "How bout Chicken and Dumplings?", "Orange chicken", "Tasty Shampoo...", "@Yasu Orange chicken gyoza sounds fuckin great tho", "10:22 Fuwa Fuwa time / ふわふわ時間\n17:34 Blue Bird / ブルーバード\n26:53 Lion / ライオン\n36:18 Uchiage Hanabi (Ascended ver.) / 打上花火 (上る ver.)", "Thanks for the time stamps :3", "ありがとう", "That was rather imrpessive. It seems Kiara has a knack for getting along with all the energetic weirdoes (in a good way).\nTenchou and CEO working together to bring us awesome music. What more could you as for?", "Its the oozing extroverted energy. Birds of the same feather flock together literally and metaphorically", "hmm how bout that Polka chaotic energy?  Would be interesting", "Fate brought them together. And they did not disappoint.", "U mean internet connection?", "@azim amri No, the internet didn't make them singing connect at the same time by coincidence.", "Like the gacha game fate?", "@azim amri They both made a singing stream the same day, and sing the same song at the begining of their each stream", "@isabella jemica I thought the same XD", "Fate brought them together i guess there's nice things that came from mano aloe's leave", "@isabella jemica More like Magia Record in that case. ", "Nene is my fav from 5th Gen, and Kiara is my fav from HoloEN, this is a blessing collab.\nAlso I always watch both of their karaoke stream, but never did I expect their voices to fit so well together like this. Just WOW", "Those are uncommon picks but I'm glad just to see it. They're all so fun and hard working, it's a bit like picking a favorite parent in that it just feels wrong, but when you only have time to watch one it really forces your hand. Kiara deserves to be hundreds of people's favorite hololiver. Just... not mine. XD", "Explendid taste", "Another memorable milestone in Kiara's journey towards her final boss.", "Kiara bizarre Adventure", "Her final boss which happens to be taking on Amelia in a chess rematch", "@BeyondDaX \nshhh, no spoiling", "Can't wait for her collab with Yagoo himself", "Kiara vs Huke the ultimate show down.", "@One Punch Fish If its Huke, they'll cheat by becoming Altera from FGO", "Pekora?", "Maybe Kiara is the final boss, making her way to conquer Hololive. Remember, heroes are usually passive.", "pekopekopeko", "Kiara is a natural born comedian just like her senpai pekora.\nSings connect only to be disconnected.\nSays she is top right and says the colour of her pantsu.\n Sasuga birb.", "Sashay birb", "Dont worry I'll fixed it\nDisappeared 2 secs later\n100% Birb powa", "Sasuga the bird of O’riends.", "Because Super Nenechi/CEO Nene is here 🥟🥟\n\n\n\n0:02:42 Start / スタート", "La más rápida del oeste", "Thanks for the time stamps :3", "O'riends was worth no sleep. Even when disconnected, let us reconnect as we continue forward together! ", "sleep is for the weak 😅", "@jub8891 And health is for the weak.", "@陰茎Emperor yes! 😄", "Fantastic collab and another collection to Kiara's harem! Jokes aside, holy fuck, what a combination you two are. You girls are so goddamn talented that it hurts. haha Both have a pretty great singing voice alone but together with that duet it's really great. It's even better when I imagine that you guys had a short time of practice and were on a collab for the first time, and even with this, it was almost perfect.", "I like how chat go \" CONNECT \" when Kiara said they accidently sing a song in the same time.\nXD", ":)  as a fan of both Kiara and Nene i am happy for this collab. Since this is Kiara Ch i suggest everyone please see Nene on her channel esp during her EATADAKIMASU where we teach her English and Spanish. And then stay for Nene Singing weekly!  Shes so good a singer please get her to 300k.", "I AM SUBBING EVERY VTUBER I FOUND. 😏👍 thus why when my friend wanna borrow my phone. I am immediately change my YT account. So they didnt found out.", "@Najiv _J let them fall into this never ending hole as well", "@Najiv _J Weak. True chads spam vtubers on main for everyone to see www", "Already there bro.... Corporate slave gang 😂😂", "@UpGames literally made a public playlist knowing my friends know my channel lol", "Subscribed\nShes so cute\nAnd sang pretty well \nAfterall kiara's friend is our friend too ", "@Keeys I've got a 3×2 ft custom canvas print with arts of 9 hololive girls hanging in my livingroom", "Gotta love Kiara's ability to kill and revive Yagoo's dream every time.", "Angel Jair \nLike a phoenix with a chainsaw and carpenter kit.", "When I stumbled into the Hololive rabbit hole, I would have never expected to pass my sanity check and ascend. Thank you, Kiara and Nene. Truly a blessed stream!", "What i expected : Epic stream concert\nWhat i got : a glimpse of heaven", "*The Peko Hole :3", "The FAQ that, They managed to connect singing CONNECT in a random way.... but end up DIS-CONNECT, when beside each other was the best part.", "Hololive comedy at it best", "Me, crying, while looking into my Yagoo shrine:\n\"Look Yagoo. They're idols. They're your beautiful idols\"", "Stream Summary:\n• Connect !!!\n• Nenechi WORLDWIDE\n• Watson ISEKAI", "26:42\nMy own personal bookmark for mecha fanboys everywhere.", "19:29 kiara nailed this part", "Since dude got recognised by the bird itself, I guess I will congratulate you!", "Are they Twins?\n\nSame voice lol", "For real, It's really hard for me to catch which voice is whose\n\nif they voice are any more similar, I shall call them \"Connected Orange Twin\"", "Their voices are pretty distinct to me. Maybe you need to watch them more.", "@LISTENER 2700E same", "@LISTENER 2700E agree", "their voices are distinct but are in a very close range to eachother.. when they sing together it harmonizes nearly perfectly", "Its beautiful how they harmonize with each other. Truly fated combi", "Man, I can’t believe Nene dies in the new Star Wars movie", "🧡🍊🧡 Fanstatic Collab 🍊O'riends Kiara & Nene! 👏pachi👏pachi\n\n\n\n46:47 Even when not in stream, Marine remote projects her Lewd energy. Well done Senchou.🏴‍☠👏", "We are reaching bottom left levels that shouldn't be possible", "@FusionHarry ಠ益ಠ Wait until Kiara collabs with Marine lol", "They spoke already on discord and interact a lot. I need MarinexKiara collab so bad", "@Vinx97 and when the whole stream is bottom left , nothing is bottom left\nCause there are nothing to compare with in the scale", "@Ng Gerald the fact that she exist in bottom left and top right state simultaneously will be actually true lol. This was said in the last FE stream", "My ears have never been blessed so hard.", "SAME", "Kiara super positioning between  *Bottom Left* and *Top right*", "Kiara the bipolar chicken~", "Quantum phoenix", "Hi Daddy Khun", "Rotating all positions everytime she died", "She is quantum entangled on both positions", "quantum chicken", "Maybe the real supernenechi is the friends we made along the way", "What happened to Hololive CN?", "@Satella Maji Tenshi i think they are going to be independent vtubers or something", "They gonna graduate ALL of them, however, Hololive was a MVP and this month the girls from CN can keep all money for them and they Gina keep their avatar after graduating from Hololive/Cover", "@Yeisson Velandia I feel that's actually a good play on Cover's part.  I know it's sad to not have them as part of Hololive but allowing them to continue their careers unhindered is pretty cool of them.", "Thanks for the info", "Best for the rest of hololive tho with what happened to Coco/Haachama due to triggered commies", "What rhymes with the word orange... nothing really but these two oranges compliment each other pretty darn well. They may be Disconnected from the screen but their hearts are certainly Connect-ed", "Cringe rhymes", ">Sing Connect\n>Nene Dis-connect-ed\n\nWhat an Irony", "Door hinge rhymes with orange", "Door hinge, but that's about it", "Eminem would like to have a word with you, sir.", "Wait I remember calli talked about this somewhere", "door hinge", "@Liqourice More fringe lore binge for my bored friends.", "Door hinge doesn't even rhyme with orange though? Unless you mumble", "I thought this was going to be a concert, not a sneak peak into heaven!", "same", "本当に最高！！！！！！！！！！！！！！！！！！\nREALLY  THE  BEST！！！！！！！！！！！！！！！！！！", "普通にこの二人高校の同級生みたいな感じに見えるわww", "声の相性も良くてハモリが気持ちよかった　また次回も期待してます！！！", "I loved how they sang (dis)connect at the end \nThis stream was top right with all the time traveling/isekai interference \n\nThe orange collab of Kiara and Nenechi is blessed", "Remember people, 46:47 is a secret between all of us, definetly shouldn't be cliped or shared, not even time stamped in the comments", "You're comment is ironic itself.", "@Canary r/woooosh", "but said clip already appear", "That Disconnect while singing \"Connect\"\n\nBIG KUSA", "10:24 Fuwa Fuwa Time\n17:33 Blue Bird\n26:52 Lion\n36:34 Hanabi (But disconnect)", "41:24\n\"It won't happen again\"\n\nNarrator: \"It happened again...\"", "Memes aside, the singing in this collab was phenomenal. I'm glad Nene disconnected during Uchiage Hanabi and made you sing it over again, cause it was worth hearing a second time. If it ever becomes possible, you two should do a 3D concert together someday in the future.", "Finally Kiara flexing her Japanese skills! Add the fact she's an amazing host as well and she's truly the Collab Queen of Hololive! Phoenix too powerful!", "WE CONNECT \nWE DISCONNECT\nWE RE-CONNECT \nWE ARE #O’RIENDS", "Disconnecting, and technical problems in general, is like a staple of HololiveEN at this point\n\nDoesn't matter if you are actually part of EN or not, if you are with an EN member you are bound to the curse of disconnection.", "They are all good singers, there's no lie in there vocals tho. I love both of them. Keep it up❤️🧡", "This was a beast of a collab. Kiara's language skills are proving its worth in translating and expanding Worldwide Nenechi's English vocabulary, and the singing was incredible. O'riends is a great idea!", "Kami-sama!!!\nI forgot that I was listening the live, I thought I was listening a song from spotify \n\nIt's wonderful watch my 2 favorite waifus singing 👏👏👏", "キアラちゃんもねねちゃんも優しいオーラ凄くて好き", "This was the most epic, glorious and piece of cake stream", "Yagoo is crying. His dream is being fulfilled.", "This is the moment YAGOO has been working so hard for\nNot some random chicken threatening to kill an Italy plumber.", "Yagoo's dream +20hp", "🌟 Start: 00:02:44\n1.  Fuwa Fuwa Time: 00:10:25\n2. Blue Bird: 00:17:35\n3. Lion: 00:26:52", "orange you glad that Kiara is collabing with a bunch of senpais?", "nice pun right there", "Ina would be proud", "Ok.. the door is right there sir.. down the lane pass the right.. you can't miss it..\n\nTake this like with you tho you majestic beast...", "love u kiara", "!!!(歓喜)", "My god, they share the same energy, same amazing cute singing voice, and both top right truly connected!", "I had never heard Nene sing before this, she has an incredible singing voice.", "Kiara is definitely my favorite person, going beyond the personality, a genuine good person and I wish the best for her!\n\nKiara stay strong and determined!!\nAlso selfcare is just as important as any job!", "Nene's confusion everytime Kiara speaks english", "Really love how she mixes English and Japanese together smoothly to keep both overseas and JP fans out of the dark. It could even help us overseas fans improve our Japanese bc of how understandable and smooth Kiara talks tbh", "Yagoo's dreams is slowly becoming true..what a beautiful stream O'Riends has given to us.", "We need O'riends to sponsor the Marble League team O'rangers", "Oooooooooooooooooooooooo", "OOOOOOOOOOOOOOOOOOO", "Ooooooooooo", "Was not expecting this to be here, lol.", "Hell yeah", "@BorderLineAzn literally the rarest intersection of tastes i think i have ever encountered on here LOL", "I was expecting greatness. I got perfection.", "二人とも素晴らしかった！最高の時間をありがとう！！", "That Lion Cover was insanely good.", "they radiate so much of the same energy it’s insane", "58:19\nSong Connect\nNene Disconnect", "*cali tsundere heart can not handle such overwhelming power*", "What a great collab concert!! Here's to looking forward for more!! 🥂🥂🥂", "Girl,Kiara really speedrunning this EN JP collab quests !!! \n\nI thought ina chanting her spell again when nene disappeared,or calli a bit jelly because someone \"connect\"-ing too much lol.", "Kiara has more power than we initially anticipated. She has a list of Hololive JP to collab with and she's running it!", "17:32 ah yes, the memories... Thank you for singing such a great opening", "Hearing Kiara and Nene's songs while listening to Fubuki's comments... What else can you ask for?", "Dis-connect is now my most favorite Connect cover.", "This was really good, Kiara and Nene! A wholesome concert during these trying times, is just what we need :)", "October really doesn't disappoint giving us great Hololive Streams", "And so YAGOO's dream lives on", "Finally had time to watch this archive, and it was everything I hoped it would be", "This stream reminded me yet again how amazing Kiara's multilingual skills are. I spent several years trying to learn a second language(Spanish) and still can't speak a word of it. But she goes back and forth between the two so easily. I am in awe of her.", "They collabed for the second time already. The first time was not official and it's blessed.", "\"You will not disappear now, it can't happen a second time\"\nThat was Gura levels of foreshadowing.", "Connect was perfect, exactly the way it was :). Especially knowing it was a sequel to the original not-collab collab the two of you did accidentally. Amazing.", "Super Nenecchi has adquired a new power: [INVISIBILITY]", "I always feel the most feels with Kiara. I'm so glad she's having amazing streams. Especially after a rough start, that genuinely made me sad to see such a cheerful and happy individual taking hits like that. Keep it up, you're doing great. :)", "conclusion: it was worth it staying up past 4 AM to finish watching this livestream my ears have been blessed, my day has been brightened and I'm energetic as hell", "Thanks for this collab kiarachan!♥ I really love your bubbly personality. You are always loved! Cheers! I wish I could personally talk and hang out with you... but of course,  i know that it's impossible. Just saying something impossible loud. lmao \nI always brag how wonderful you guys are to my students. LOL. ", "My ears are in heaven, how ironic Nene ended up getting disconnected singing Connect", "最高👍こうゆ関係、好きよ。\n\nI want to see more of this collaboration.", "The timing of the last (dis)connect is hilarious. I love the stream thank you so much to Nene and Kiara!!! 🧡 O'RIENDS 🧡", "They were connected when seperated but they disconnect when they're together? 2020 messing with us again😂 Anyways, awesome stream!\n🧡O'RIENDS🧡", "1ヶ月しかないからほぼ同期は間違えない\n2期生だって1ヶ月空いてるし", "Kiara: make a second collab with the senpais.\nMe: please madam, I want more.", "One of my absolute favorite streams so far great job kiara and nene you guys rock", "Great collab!\n10/10 would disconnect again", "I’m craving orange chicken for some reason. Time to reinstall UberEats I guess.", "58:13 Here's the \"(dis)Connect\" moment if you're looking for it", "Damn that Lion cover is just nostalgic eargasm. Can't help but go revisit the song again.", "That (Dis)Connect cover was the highlight of this stream", "Loved this concert, thank you to both of you for the hard work and the show!, Love you Kiara, Love you Nene! you both work so well together.", "Now i want a triple collab with Kiara, Nene and Coco. To get the full ORANGE EXPERIENCE.", "IT WAS WORTH NOT TO SLEEP!!!!\n\nYou both were amazing!! Thanks for the concert!!!!!", "their voices harmonized so well", "Singing Connect but disconnecting, the irony lol. I mean at least they re-Connect-ed lol\n\n\nEdit: I skipped online classes for this and it was worth it.", "'Irony' is a good song too 😊", "I can't believe how beautiful both your voices are together!!!\n\nTruly connected.", "I missed the livestream...but this collab was amazing, glad I subbed to this channel", "What a collab, their voices blend so well, keep the hard work Phoenix. I love  how kiara cares for her fans for example, here she even likes so many comments. Go Go Phoenix!!🔥🐦", "Absolutely wonderful! Thank you both so much! If I ever feel down, this will be one of the videos I will use to cheer myself up! Again, thank you!!! 🐔❤️🥟💛✨", "The :D on them wont go away", "This is an amazing collab, kiara and hololive jp is a great combo, keep it up our special phoenix ♥️", "Kiara rolled a natural 20 on charisma that's for sure..", "I MISSED IT I FORGOT AND MY PHINE DIED SO MY ALARM DIDNT GO OFF. IM CRUSED", "F", "@What a Simp KFP Navy Admiral F", "F", "This pairing is so good ^^ Their voices harmonises so well and just overall very teetee <3 great to see two of my fav collabing~", "Amazing how this all started with a coincidence... I enjoyed every moment of this 🍊\nObligatory call for that (dis)connect too lol", "O'reinds Forever! This was such a good concert, your voices compliment each other so well! And the name is genius, since there are more orange colored Holos you can add to O'riends in the future!\n\nAnd don't worry about tehcnical difficulties, the first time it happened, it was after you and Nene talked about how both of you were CEOs, so it looked like you assassinated your rival. The second time it happened was during connect, which is now Disconnect. Both are hilarious!", "First day off in awhile so I missed it live, so happy to see the archive! Great job to both our wonderful genuine idols! ", "Their angelic voices matched so well,such a blessed collaboration.", "Literal es:\nNene: ⬅️➡️\nKiara: ↘️↖️↙️↗️⤴️↪️⤴️↕️🔄🔃⤴️⤵️", "The introduction piece was so cute, like a teacher and her student.", "From conect to colab and end with a disconect XD", "chills through out the entire stream! here's to more in the future, oriends is a definite strong combo!", "This stream was beautiful, even with the technical issues, your voices are a great match! Thank you very much!", "Great, after hearing Connect I almost had a mental breakdown again😭 but you both sang so beautifully❤️", "The second I was this announcement, I couldn’t wait. My expectations were pretty high,  as I’m a huge fan of Nene, and lately I’ve become a huge Kiara fan, because she’s been having some Collab AMAZING, super fun streams lately. Those expections were blown away yet again. Funny, entertaining, ridiculously silly, but also a fantastic singing tandem. Congratulations to the both of you on all your hard work and achievements, and thank you for the smiles (occasional tears), and all the laughs. You both deserve all the success coming to you 😊 🍗 🍊 ❤️", "Even with technical difficulties the concert is still fire", "Notice: they both are wearing 2 accessory on top of their head\n\nTurly some amazing singing!", "I've seen enough anime to know what Nene asked you during Marine's song xD... I just can't believe you actually responded XD\n\nBless you, Kiara. Promise me you will never change!!! You are amazing and are doing amazing things for everyone around you. Don't let anyone tell you otherwise, not even yourself!!! Love you!!!!!!! ❤❤❤", "I really love how active Kiara its nice to see her interacting with everyone especially overseas to", "Their voices mixed together so beautifully! That was a classic collab with typical mayhem, misunderstandings (raspberry?) and unbearable cuteness", "コラボ最高でしたね！個人的にはコネクトを歌った後の disconnect が秀逸なオチで笑いました。", "This was fantastic! I'm kind of amazed. I didn't know if Kiara could do another off-collab on the same level as the Subaru one, but I think she rose to the occasion.", "Beautiful singing! Really impressed with Nene's English too!\nNeed to do a collab with Tenchou, Senchou, Shachou, Kaichou and Danchou and call it the Gochou stream.", "I feel enjoy upon seeing your character moving \nlively Keep doing Kiara  ~", "This stream was so damn entertaining and wholesome! I kept smiling the whole hour long. ^^", "This was so hype. Loved you guys! The singing and synergy was just incredible!", "Kiara, you have the perfect personality for collab's, being very extroverted brings the most out of people and it results in a really great watching experience.\nDefinitely the queen of collab's for me.", "This was so good! I love the energy you two have together and I really liked how Kiara kept it easy to watch for us who don't speak a word in Japanese~ ", "This was such an amazing concert even though they had some technical difficulties but on the bright side there will be so many funny memes from this stream.", "Comedic when Connect becomes DisConnect mid way.", "I have an idea for a new item on the KFP menu. It's called O'riends, and its fried phoenix with orange squeezed on it", "I remember when Kiara said in her debut, she want make Yagoo proud, and today the phoenix keep her promise, because you and Nene sing really beautiful", "Yagoo must be so proud.", "His dream is once again in sight! Lol", "Achievement Unlocked!\n\nO'RIENDS: Nene Team-Up\nWow!: Three 6th Octave Notes", "Just watched this stream a little late. Nene and Kiara's singing are awesome that it is good that the EN-JP collab is happening at pace~", "Congratulations on more collaborations! Let's get you to the next milestone 400k, and keep rising!", "Kiara, you’re truly amazing! Your soft power of being so warm and welcoming to all of HoloLive, regardless of language barrier, is simply wonderful! You are introducing me and so many others to the rest of your friends! Thank you!", "This was such an amazing collab!!!!", "Nene is truly the most precious imouto of Hololive, and Kiara is that fun sister Nene can depend on!", "kiara & nene: we are seiso top riiiight\nsenchou: I'm gonna show you a pro gamer move", "I love this so much, I hope more incredibles collabs like this one in the future UwU", "Your singing is Amazing 😍 both of you 😍❤️ hope for more karaoke 🎤 streams thank for your awesome work", "Goddamn they blend so well, we'll look forward for official cover from Oriend ! ! !", "Blessed, kamicollab, yagoo no yume! I felt the fire of excitement in my belly and tears of joy in my eyes like I haven't in a long time. Thank Kiara and Nene.", "Thank you for this wonderful concert, Kiara and Nene! It was amazing, great collab! 😊👍🧡👏👏👏👏", "This collab was soooo great!! My jaws hurt from smiling throughout the whole video lol", "Great collab, \nThey were so Seiso Nene got disconnect.\nI hope you two do this again", "BASED!!! SUPERLIT!!! DOPE!!!!", "I kinda like when kiara  interact with Hololive JP members is really cool and awsome:) Keep it up Kiara the all great majestic phoenix of KFP", "First time I heard your singing voice Kiara, you're so talented!  Can't wait to hear more in the future.", "Man, what a collab I missed, that was amazing congrats Kiara-chan and Nene-chan", "Missed the stream since it was very early in the morning for me. You must feel truly blessed to be able to collab with other JP girls, and especially to be able to do so in person. You were both great. Looking forward to see who you'll collab with next.", "58:16 disconnect", "everytime i watch a stream from Nene i feel so happy because i can see how much she is fitting herself inside hololive, those who watched her debut saw that she was very shy and insecure but now Nenechi is always smiling and laughing and happy, it's great.", "やっぱり最後はコネクトなのね:)", "Damn, their singing voices are so similar. One harmonizing at an interval would probably sound amazing.", "Kiara's MC skills are out of this world 🧡🧡🧡", "listening to this, my life is now complete. thank you, Kiara, Nene, your both amazing. enjoying all your streams.", "GREAT JOB KIARA! THIS WAS A WONDERFUL SINGING COLLABORATION!!!", "Because of my sleep and work schedule, I have a hard time catching some live streams and I truly am sad I could not watch this live. Kiara is super fun, and deserves way more respect/notice than she already gets. Her ability to vibe with anyone (her own pod or her senpais) is absolutely legendary. My face hurts from smiling when I watch her collab. I'm looking forward to seeing more senpai interactions in the future!", "After that unintentional singing collab, this was the next logical step.", "とても良かったよ\n楽しいのに落ち着いて聴いていられた", "Goosebumps, just goosebumps...\n\nAwesome duet.\nP.S.: I love the way you put Senchou on the stage!", "The baby bird has finally  flew 😭 i am so proud of you kiara keep going and don't look back 🧡🧡🧡", "Congratulations for the amazing lives, I'm going through a difficult phase and seeing your lives improves my day! Hi from Brazil <3", "So sad that I could not watch this stream live :'(", "58:17\nきっと奇跡は \n“disconnect”", "Damn i really love this combo. Ahoy was especially good. Really would love a second collab", "This is beautiful, I have been listening for hours...", "Yoooo so this is how kiara sounds when her mic is good.", "Makes sense for kiara’s favorite k-on char being mugi, you know.... in their.... interests", "This stream was really good, thank you. I haven't really watched much from the Gen5 girls but after this I'll definitely check out Nene. Thanks Kiara.", "58:30 Someone was summoned to fight a witch!", "奇跡なコラボ再臨！めちゃ凄かったです(≧∇≦)", "Wow kiara first Subaru now nene, your flexing collab is endless. Love the collab you do and love how you try so hard for both us Oversea bro’s and the Japanese bro’s. Hope to to see more future collab with a certain rabbit in the future. Keep up the good work and remember to take a breath if your feeling overwhelmed.", "What a roller coaster of emotion.<3.", "You guys are so great together! What an amazing concert. Hopefully you can connect again <3", "Current song : connect\nNene : Dis-connect", "i really hope they do a stream like this again", "This has to be one of the best karaoke collaboration streams this is definitely a must watch", "This stream was so epic! You guys have such beautiful voices I had to watch it twice! 🧡💛", "I had to watch it way later, but this was an honest-to-goodness treat.", "My two favorite vtubers doing a collab. This has to be a dream...", "I couldn't watch this live ;_;\nWatching now :D It's excellent!", "One of the best streams i've ever watched", "My hearth was melted, my soul saved and my day blessed", "Way to go, Kiara and Nene! Awesome singing together. Hope you get to sing together again soon.\nThank you for archiving this; I feel bad every time I miss a stream for sleep or work.", "O’riends best ever", "I gotta say this collab is wonderful and fun even when a language barrier in the way, two hololive members are having fun, and Kiara doing this means other hololive members can collab with holollive EN, and congratulations on the stream Kiara. :) \nBetter late than never", "Watched it at work, missed half of a morning meeting (and I dont regret it).\nGreat concert, luckly no one was around sa I sang along....\nO'riends BANZAI!!!!", "42:20 in Chat:\nAmelia Dabson.", "This collab blew me away man! Im so happy for the boss lol ", "Wait, did they take the musics from my playlist ? o_o\nI'm so happy to hear them singing w", "This was an absolutely delightful collab! Can't wait to see you 2 collab again in future! <3", "Yes...damn i love Nene's voice...can sing even invisible...also Kiara is just perfect...she can do dubs and subs", "色合いも声質も相性良くてすこです🤗", "DISCONNECT\n\nAbsolutely amazing stream !!!", "GUYSSS LETSS HELPP HERR REACHH 400K BEFORE THE END OF OCTOBERR", "Stayed up until 2:am to watch the stream, best decision I have ever made, #oriends for life gang.🧡🧡🧡🧡🧡", "43:33 Ahoy！我ら宝鐘海賊団\nキアラちゃんもねねちゃんも歌声かわいい！", "Another great collab!\nThank you for this special concert, Kiara & Nene.", "I definately underrated Kiara at first but now she is my favorite of the EN members.", "I can’t believe I overslept and didn’t get to watch this live\n\n\nF", "Thanks for this wonderful stream kiara and nene it was perfect and even more with the end of “disconnect” Lmao\nViva la Kiara y nene :D", "21:30 it was at this moment Kiara jinxed the stream", "二人とも最高だったよー！！！", "Day 8  of commenting on kiara's videos to help her with the yt algorithm", "Kiara's favorite K-on character is Mugi. Can she be more perfect?", "Kiara and Nene: fuwa fuwa time \n*cries \nSo this is YAGOO's dream huh?", "man what a good collab again, i had so much fun and wanna see more of O'riends xD", "I jumped in the stream when Nene was time traveling lol", "Truly one of the best collabs 🥺🥺❤️ two angels singing", "Thank you for the stream! Amazed at how well you both harmonized and worked with each other, and the (dis)Connect had me dying 😂\n\nLong live O'riends! 🧡🧡🧡", "I never knew I needed such collab 👀 \n\nThank you for this...", "They CONNECT,\nSuddenly DISCONNECT,\nBut most importantly they\nRECONNECT!!", "ALREADY HERE?! also 5th gen was released some months ago and already a senpai", "二人の歌声相性良かった！！", "This collab was epic", "Is this a glimpse at the true power of \"O'RIENDS!\" if that's true then it's too high spec! too OP! this was amazing if I didn't know any better I I'd even guess they were sisters or best friends!", "Why am I crying in happiness 😭❤️", "7:37 Nene wink", "コネクトで繋がった2人\nオレンズで繋がっている2人\nホロライブで繋がっている2人", "Lost my wig when the final song was connect", "What a fantastic concert.\nGreat job, both of you! I hope you had as much fun singing as we had listening.", "I remember when Kiara talked about speaking Japanese being pretty much the only thing she was good at when the others have their own skill or talent. Well, Kiara, you are making damn good use of your skills in your collab streams. But the ability to speak multiple languages would go to waste if the personality of the person behind it was not interesting to see and see interact with people.", "Yagoo's dream is alive!", "🧡O'riends🧡 for Kiara and Nene!\nI was glad that we could see Kiara singing lots of current song for us with Nene. Their voices were so cute and sweet, have a good teamwork like an idols to listen their songs. Although it has a bit mistakes or accidents in the steam, we didn't mind and keep enjoying to listen their current song.  Thank you Kiara and Nene bring lots of fun for us again. Hope they can do more the collab of EN&JP in the steam, we want to hear your singing again! Good work!👏👏👏", "LMAO I was late 11 seconds ago🤣", "My word... what an amazing collab. Kiara might be known as the master of the off collab. Shes just so good at meshing with people.", "Nene sang so well during the stream she ascended twice!", "An awesome surprise that showed up in my notifications, which I'm glad I got to attend to see magical singing!! I love both Kiara and Nene!💖", "I'm so sad that I missed it live but I'm having so much fun watching the archive.", "Kiara rose to top right this stream, then immediately crashed bottom left ", "2人ともお歌上手でたのしかった！またコラボして欲しい！！キアねねてぇてぇ！", "Kiara will be the Marine of Hololive of Collabing with the most Hololivers! That is my prediciton and a Talent!", "i loves your song selection, it reminds me at old good times with my friends in college", "This stream is really a gold mine.. the songs, the fun, and the comedy are all in one.\nAlso because both of you are a fantasic singer and really wholesome🧡.\n\nLooking forward for the future Collaboration, Tenchou!", "Just listening to my 2 favorites from hololive sing a duet I can die in peace❤", "17:35 Just have to leave this here for my personal favorite song", "Thank you Kiara and Nene for the blessed singing stream! It was wonderful 🧡", "Incredible how both your voices match together. Really a wholesome and pretty stream! Kiara and Nene you were great!", "Someone should show Marine this amazing Duet sang from her two kohai.", "ねねち社長とコラボしてくれてありがとう！！\n二人とも歌うますぎ！！", "I love how kiara has already done 2 collabs with JP hololive members lol.......I hope you continue to do these collabs.........\nI heard pekora wants to do a collab so very much looking forward to it...........\nLove you kiara and very very beatiful singing ..........nene also......", "Their voices are great together omg", "Not only the singing was great, but the interactions in-between were so cute and fun.\nCouldn't stop smiling!", "really love this version of \"AHOY\". It's slightly faster, but it's alright. Both of you added your own flavor into the song and i absolutely love it!! All in all, the stream is very entertaining and i can't stop laughing, so keep up the good work O'riends!! Also love how Nene sings from isekai, really great improv!", "Listening to them sing fuwa fuwa time melts my heart", "58:19 pekora accidently throw splash potion of invisibility to nene", "This Duo defenitely have Soul Connection!", "I wasn't able to catch the whole stream but I loved what I saw.", "From Subaru and now, Nene. \nI hope that Kiara will collab with her beloved Pekora-sempai.", "fell asleep as the loading screen was playing TwT nooooooooooo.....", "One of the best holo collabs for sure.... Ty Kiara and Nene <3", "tfw you have to leave home halfway during the stream ;(", "This the most Seiso collab I have ever heard!", "I'm so grateful for the self-dubbing/translating from Kiara!!!", "A great skill that is over looked and frowned upon. If she has a notable skill that makes her stand out from the other four it's definitely being fluent in different Languages thus being able to include more fans and colleagues into her streams", "Both were amazing!!! hope you could collab again!!", "Connect? More like Disconnect.. I’ll go now.", "Please sing \"Tsubasa wo Kudasai\" or \"No Thank you\" once", "58:19　???「Orange-tooth disconnected」", "Time to rewatch again after just seeing it live! Great collab Tenchou! and Shachou! 🧡O'RIENDS🧡", "This makes me very happy ^_^\nThank you kiara and the hololive crew for being a beacon of good in these times.\nKiara's hard work is definitely not wasted or unnoticed by this viewer!\nI can literally feel her giving it her all and having fun, it is very inspiring!!", "They're soooo cute!!めっちゃかわいい😍", "OMG THEY SING OUR FIRST SONG IM CRYING RN😭😭♥️♥️♥️♥️", "Orange girls good. Folks, we love what's happening! We love it!", "First time i ever watched a live stream from start to end!", "46:47 trust me, it won't disappoint you.", "These two are the reason orange is one of my favorite colors", "楽しそうで何よりです🧡", "Absolutely wonderful stream! From beginning to end it was nothing but fun and enjoyment and the way the two of them play off of each other was very endearing. Kiara is so outgoing and open with just about anyone she interacts with and I love it. With her personality, charisma and language skills, any collab she does will be a must view!", "Birb has such an uncanny ability to click with the jp members, her genuine enthusiasm combined with nene's nervous energy is cute as hell", "I missed the stream 😭", "さすねねです！完璧でした！出張お疲れ様でしたー！！Thank you dear chicken! You are both amazing!!", "They ran out of time at the end wwww", "21:24 She's been infected with a little bit of Gura jinx curse right there haha", "Kiara is such a good intertainer.", "omg Nene is so precious, must protec", "No sleep gang... I rewatching it, lion part is incredible, they are such amaxing singers", "News Flash: Yagoo has woken up in the ICU whispering that his dream is not dead", "This was so worth waking up at 2am to watch. Another great job Tenchou!", "That was so great!", "I melt everytime Nene speaks english hahaha", "My chest is literally about to explode☺️", "Thank you very much for this blessed Concert 🧡O'RIENDS🧡", "Their voices blend so well together uwu", "Oh... right Hololive it's an idol group... I sometimes forget it... All this girls have Precious Voices.", "I want to see this in 3D so badly🤧🧡🧡🧡❤️❤️❤️", "Damn miss it to adicted for lol wild drift :\"(", "キアラちゃんとねねちゃん ~", "i feel like crying twice in this stream because of how good they sing. Hope more karaoke collabs tho, i really love your voice 🧡🧡🧡", "A wonderful concert you two! Thank you, both of you :)", "There was an accident during the performance\nBut the performance was completed smoothly\nThis is an idol (●´ω｀●)ゞ\nALSO  Kiara & NeNe  both  かわいい～", "43:33 AHOY~~~~~~", "I love kiara so much she’s so sweet YOU DESERVE MORE LOVE THAN U GET💕💕💕 1mil subs to kiara 🥺💕💕", "Kawaii~", "the thing i would do for nene..........man i really love her", "WE ARE CLOSER TO 400K LETS GOO!!!", "二人はカラーも元気なとこもだけど声質もにててめちゃくちゃコネクトしてた＼(^^)／\n是非またコラボみたいです(*´ー｀*)", "Really love you both!!! Besto collabo!!! <3", "Kiara out here like a harem anime protagonist. Instantly connects and sets sail in the romance ship with anyone she collabs with. I love it, lol.", "Kiara and Nene you did a great job with translation here. The pace was really nice. Even the vod feels nice to watch.", "Wow amazing singing from both nene and Kiara. I can’t wait for En and 5th gen to get 3D models, I hope they do this again with 3D, it would be the only thing that could make this concert just that much better!!!", "Great job talking in both Japanese and English!\nIt made it really easy to follow!", "オレンズ末永く続いてほしい", "素敵なライブをありがとう！！！", "Ahoy= Aho + horny... Bottom left confirmed.\n\n\nAlso, a beautiful performance, 10/10 would watch another.", "No kidding,kiara may be the bridge between EN and JP, and i can't wait to see more of it,keep going strong phoenix!!!", "Huh, I'm now in the mood for chicken and gyoza. Weird.", "AHOY!", "神回！！！", "🍊O'riends !!!!!", "So precious, never change.", "top secret\n\n46:47\n\n47:25", "the chemistry between u 2 are insane :))", "我竟然沒跟到！  I like this !", "I woke up and she streamed 36 Seconds ago bruhhh.", "Impossible not to smile during some of these songs, awesome work", "This is blessed!", "man what an amazing week this was.", "10:25 fuwa fuwa time\n17:32 blue bird\n26:51 lion\n36:15 uchiage hanabi", "Couldn't watch it live but Kiara and Nene have cute voices!", "とても可愛いライブでした！！🍊", "DisConnect is even funnier if you remember the ending of Madoka Magica", "beautiful singing, good job both of you!", "7:45 Nene's number one fan.\n8:28 Huke's present.", "This is the best!", "Wish I could have watched it live🖤", "They looks like a sister :O", "Their voices sound so good together", "added to my happy pills!", "Omfg nene is so frickin cute!!", "Ok i regret everything for not remembering this stream reeeee", "best colabo ever!", "It is hillarious that a german speaking phoenix has to teach a japanese o'riend about the japanese for raspberry.", "Kiara and Nene have great synergy. Hopefully they do this again.", "This give my heart joy", "really great to have someone that can bridge the language gap for us english viewers like kiara does. blessed chicken diplomat", "okay i can see it now\n\nKFPro Company", "Pefect NeNe chan <3", "Their voice really sound a like lmao", "Excited for the sequel Re:Connect", "They are so cute, perfect karaoke pair", "Wow this was so good!", "A new meme is born, DIS:CONNECT\nLOL Both getting their avatars disconnected while singing Connect is hilarious. Great Collab stream!", "What a wonderful collab!!", "I need Coco collab with Hololive En, maybe a Shitpost review or something.", "Kiara or Amelia would be great candidates for that collab", "All of EN and Coco doing a Shitposting Review at once.\nIt would be amazing chaos.", "Man I love orange chicken!\n\n(Can this be the ship name plz?)", "Phoenix collab with a 9 yo girl who happens to be a CEO.", "Hey Kiara,\ngood job :)", "NENE IS SOOOOOO CUTE!!!", "🧡Thank you Kiara and Nene for the outstanding performance🧡", "Beautiful collab Kiara keep the good vibes you are an amazing Phoenix.", "A collab I didn't know I needed", "A collab I didn't know I needed", "Notice how they both wear 2 hats at once", "Sorry was unable to tune in live. But man such a great collab! Hope to see more JP collabs from you and we KFP will continue to support you on your journey! ", "That was so beautiful", "My favourite singing oranges. And yes,, I have comparisons.", "2 gals together <3", "How can someone be so lewd yet so seiso. i wonder.", "21:30 Epic foreshadowing", "People literally just kept spamming orange hearts in the chat for one hour.", "If You're Wandering When Nene Disconnected. Here You Go! 38:15 No Need To Thanks Me.", "43:34 ahoy!!!", "Hang in there Kiara!! You're doing great!!", "they got too into the song that Nene char got yeeted out of the stream", "46:46 Nene asks Kiara what color her panties are", "I keep coming back to listen to them sing fuwa fuwa time", "最高のa h o yをありがとう！　\nお二人共お歌上手いねぇ", "Wait a minute this is entertaining", "i love you kiara! i only watch you from afar but im still rooting for u!", "It likes a lot of Hololive members have some passive skill about comedy things\nWhat a timing in that Connect song lol", "Thank you for the SuburaSingingStream KawaiKiara and SuperNenechi! 🧡🧡🧡", "A very good collab that brings a smile to your face\nNene et Kiara's voices are pretty similar when singing", "kiara with nene daisuki~~", "↗️↗️↗️↗️↗️↗️↗️↗️ top right for today's collab!!", "Don't worry Kiara, having technical difficulties during collabs is part of your character.", "Gah damn! She can sing so well", "46:46 Bottom left moment", "5:04 Uncle Roger approve your color", "Could it be..? Is Yagoo's dream partially restored?", "Kiara is on her way to fulfilling her goal", "The adventures of the invisible", "kiara, we make fun of u alot, but we love you even more :)", "I know Nene usually fits the Genki girl description, but damn Kiara you're on a whole another level. I thoroughly enjoyed the stream and I'm looking forward to Among Us tomorrow (at least tomorrow we're I'm living)", "Connect\n (X)\nDisconnected (O)", "bro you speedrunning these collabs", "Could not believe the rush of nostalgia when Fuwa Fuwa Time was the first song in the set. Such a great show guys!", "The technical difficulties make it 😚👌 extra tasty", "nene..ranka...so similiar.......\njust suggest all you guys watch her streams...\nand kiara sings nice too....\ndisconnect was funny🎈", "THAT WAS EPIC !!!", "Wishing you every second of your life is a happy one", "ねねは今日もかわいいなぁ", "man i almost got killed by my damn father when the video enters 38:31", "Those 2 singing Ahoy was so great", "今後、もっとコラボ増えてくと個人的に嬉しいなぁ", "You sing Lion, you get my subscription.", "Someone should put the songs in the order with the minutes.", "i never knew how much i needed an ahoy cover", "Everyone be singing Connect, but I have yet to see a Colorful or Luminous cover,", "I would like to propose that we rename these two as Chicken and Dumplings", "This made me want to watch Kiara more", "何も分かってなさそうなねねの顔が面白い（笑）", "Can't believe I missed this", "the boomer pirate that every kouhai loves :))))", ".... I have a sudden craving for orange chicken and dumplings for some reason. 😳", "I cant believe i missed this", "Ahoy was really really good!! Very fun stream!", "epic collab!", "ネネちゃんはやっぱり不憫な子だね〜w", "異世界へ吸い込まれたねねとコネクトするためにキアラも旅立った…と思うことにする", "Thank you 👏👏👏", "Their chemistry is awesome", "Kiara's collab adventures continues. Supernenechi and Tenchou has such great chemistry. Hope you're able to collab with everyone before going back from japan, especially the final boss, Pekora", "Congrats guys, we now know what her panty colour is, now the question is, what do we do with this information", "声質の相性も良いんだねw", "10/10 concert", "38:15 Nene is gone!??? is Mori the Impostor??", "Fuwa Fuwa time into blue bird is a legendary combo", "Can't wait for 3D debut where Kiara and Nene sing", "KIARA CHAN MORE O'RIENDS PLZ THIS WAS THE BEST STRUM", "Kiara Jinxing it: 21:23 🤣", "Kiara has to simp for someone else like nene, so calli will realise how much she actually needs Kiara", "my first time ever watching a live stream till the end.. 10/10 would watch another karaoke stream xD", "You are in for a treat. There are many Hololivers, Nene included who hold amazing Karaoke streams.", "GOOD SHOW!!!!!", "1. Fuwa Fuwa time - 10:24\n2. Blue Bird - 17:33\n3. Lion - 26:52\n4. uchiage hanabi - 36:19", "As For Kiara. Here You Go! 40:41 No Need To Thanks Me.", "I wish I could upvote more ;-;", "Now this is wholesome.", "Cantais muy bien 100 de 100 voces gemelas no son hermanas ? me gusto mucho el concierto kiara y nene hacia el estrellato!!!", "Epic Collab. Kiara is love!!!", "I missed it, just shouldn't sleep that will solve all problems", "If I'm not mistaken, Kiara is trilingual right? That's amazing. I know it sounds corny but you really have inspired me to start learning Japanese. And German soon after. I know it will be a while before I can become fluent. But seeing your work ethic has motivated me. Thanks Kiara for being the phoenix you are.", "Good luck on your journey man, right now I’m learning Japanese too, and once I’m fluent in it I’ll become trilingual!", "@Thatonethiccactus thanks man. Keep up the good work!", "49:25 My first red superchat... ", "( Takanashi Kiara's wonderful spell )", "god voices damn", "この2人なんか似てるしコラボしないかなってずっと思ってたw", "Kiara makes talking in english and japanese look so easy talking to Nene and translating for us", "初めて一緒に歌ったのに息ぴったりってかなり凄くない??", "Should have started with connect,as it is their unofficial debut", "Actually insane work", "I swear, AHOY is impossible not to vibe / headbang to", "Kiara really shines while speaking english and japanese- these jp collabs are really fun!\nReally appreciate keeping those of us that don't know Japanese in the loop during these collabs.\nNot only do they both have an amazing singing voice but the chemistry really shows and they know how to have fun with it- especially when you listen to them sing \"Ahoy!!\".", "Good job tenchou! You will be bridge ambassador to EN and JP fans", "At first I wasn't sure about Kiara, but now I can say without hesitation she is now my favourite Youtuber. Keep burning bright Kiara.", "Kiara has that special factor that brings light to the ambient. U can notice that both japan hololive members she collab were more energetic and excited than their usual. Thats amazing! Keep the collabs coming! Kakkoii!", "Nenemomo Suzu? Wasn't it Suzumomo Nene?", "uchiage hanabi was actually so good kiara!!", "I want them to sing a love live song", "Kiara crashed in Nene's house? :P", "Disconnect", "Off collab ???", "Amazing", "We are truly living in the right world line", "Both of you are fuwa fuwa!\nTolle Kollaboration Kirara!", "Wow I really like the kiaraxnene combination  singing", "Im extra super late...", "Im extra super late...", "Double Bottom Lefts here", "Curse my terrible sleep schedule I missed the livestream", "I didnt even know kiara is fluent in japanese", "日本人の俺より日本語うまい。", "Can we get a takamori concert next please", "Love this collab", "Cant wait for Kiara x Pekora collap 👀👌👌👌👌", "SOOOO GOOOD!! but also sooooo short....i want more Kiara x Nene ....", "Beautiful👌", "Top right stream", "The disappearance of Nenechi", "46:48 pink!!!", "用事があって推し達をリアタイで見ることができなくて悔しかったけど、キアラ店長もねねちー社長も最高でした！テンションも歌声も完璧！ディスコネクトになっても、Oレンズしか勝たん！", "02:42 start", "They are the main ingredients of \"orange chicken\".", "That’s why I’m here", "Nene is too good for this world. Great duets.", "God i wish i was a grape", "lol disconnect", "Was asleep for this (damn you american time) but if this ain't the cutest goddamn thing I've ever seen.", "so kiara have a birb club, now an orange club \nnice, whats next ;-;", "I'll just leave this here: Pink", "As expected of btm left pink birb", "Does this mean that KFP will start serving Orange Chicken?", "You can't script this natural comedian thing. You must be born in it, molded by it to get the perfect timing of comedian. Anyway, Kiara-Nene duo are truly blessing. They both have perfect unison voice.", "10:27 Fuwa Fuwa Time\n17:02 Blue Bird\n26:46 Lion\n36:11 Uchiage Hanabi (lost connected)", "Edit 55:23 (Dis)Connect", "流石ねねち持ってんなぁ〜w", "愛してるぞキアラ…", "Is it just me or is Kiara going that harem route?", "God they are cute together.", "good!gooder!goodest!👍👍👍", "🧡O'RIENDS🧡", "🧡O'RIENDS🧡", "The connected too much that they got disconnected.", "Ship them alllllll", "Marine will be proud", "is there no chat ??", "This is the best thing since sliced bread", "Nene sugoi kawaii", "I have been awaken", "I love chicken and dumplings", "Epic", "me who can understand small japanese", "Kiara. Giga Stacy\nGiga Kiara", "God nene is too cute....", "Nice oranges🍊", "Double hat duo", "🧡 P E R F E C T I O N 🧡", "PINK?!?!?!?!!?!?!?!?!?!?", "Epicardo", "Kiara be filling the JP collab stamp book, really enjoyed the JP & EN balance so that all EARTH bros could understand, can’t wait for the next one!!! ", "38:15 58:18 yab", "Brilliant", "Oh My Gae", "Orange Chicken combo #1.", "What were people talking about bottom left and top right", "Okayu is mio, korone is yui, Marine is rin, nene and Kira are azusa and mugi", "I’m kinda late to the party, so to say, and did not have the possibility to see this live, but just being able to watch this now, during my rather gloomy friday gives me some much needed energy. Nene was a joy in this one and kiara continues to amaze me with her language skills and the way she brings this joyful energy to all her streams. Being able to follow all the Hololive_EN girls have been a blast thus far. Thank you to both Kiara and Nene for this amazing collab.", "I am new to the hololive scene. I don't know what Nene-san is based off of. Could someone help me out?\nI know Kiara-san is the phoenix.", "Nene is CEO.  Ok being serious, I think she is supposed to be an idol, but I'm not sure what is 5th gens theme.", "Nene is good", "Seems like Flare has a new challenger, because Kiara is The absolut Chad of HoloEn", "is it me or is the live stream chat history is disabled", "Give it an hour to get there. This normal happens when you watch a stream that ended a few minutes ago.", "❤️🧡💛💚💙💜💖", "Kiara was able to unleash Super Nenechi!", "YOUR SINGING VOICE IS OP.... HOLY HELL IF ONLY I CAN LIKE THIS VID A BILLION TIMES. SUGOI !!!", "Nene's voice is AMAZING as well!!!!", "This chicken dumplings is tasty.", "Kiara I can't believe that like 40ish days ago you were debuting, nervous, talking about your goals, and now you are here in such a short time, doing off collabs with your senpais and singing beautifully. Both of you are such good singers and even if I wanted to tweet about it I couldn't take my eyes off the screen. Amazing and funny stream, we love you ❤️🔥 congrats Kiara", "キアラちゃん多彩すぎんか？", "But... but... never trust orang ?", "Die beiden Haben super schöne stimmen die perfekt zusammen passen hoffe, dass die zwei öfter zusammen singen. Weiter so!!!\n\nEnglisch : The two have super nice voices that go perfectly together hope that the two sing together more often. Keep it up!!!", "Orange Chicken Karaoke Stream", "てぇてぇ", "てぇてぇ", "anyone else struggling with the urge to eat drumsticks right now?", "Neat", "Kiara just fits in with everyone, and I don't mean just the language. The room just comes alive when she is here. That is a really good thing to have in the long term. What a benefit to the EN server to have someone so fluent in JP too.", "Tes\nWhat the hell is happening\nI miss this for a whole day?\nWhere's other comments ?!", "This JUST ended. It probably shows \"23 hours\" because it was reserved since then.", "I hate that I missed this", "tenchou sachou danchou senchou kaichou", "#BlAME", "Hi", "AHOYYYY", "SUKI", "I wanna gush over your singing but I wanna bring up the point with your translation during the stream and like. I love it and I appreciate it tbh. It’s not awkward and it’s smooth and I just ;;; thank you Kiara 💕", "It's a very great and underrated skill that seperates her from the other four.", "@Vindingus exactly! I just think it’s just. Amazing and shows exactly how hard working she is. ", "The world could not handle the CONNECTION", "kiichigo? more like kiichi eigo, cause they say it in english", "Too Much Orange", "3st comment", "キアラのコラボ相手って\nスバル ねね ペコラ（予定）\nと芸人枠？\n1期と4期は誰になるのかな？", "キアラちゃんは、会長と共にENと日本勢の架け橋になってほしい。", "はい、賛成", "Nene is top 3 singer in hololive", "💓💓💓💓💓💓💓", "Lol the Kiichigo vs Razuberī", "aaaaaaaaaaaa i love you kiaraaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa", "Zu Wild", "Actually not too bad, should've gone holoJP than EN.", "I wouldn't be surprised if her plan was to join the JP branch, but ended up being accepted for EN.", "10:25 \n14:54\n15:06\n15:28", "Dry erase board noises \nAmazing laugh", "🧡🧡🧡🧡🧡🧡🧡", "... Pink", "Kiara said she wasnt special or anything but shes the only one who can really collab with the JP hololive girls so that makes her very special", "Yeah I felt sad when she said that, honestly I hate it when anyone says that about themselves. But it looks like she's past that mindset, fun stream!", "When I saw that clip and discussion it finally got me to watch Kiara and I like how she's so inclusive and welcoming to all whether you understand what she's saying or not.", "", "", "Dokidoki", "God u can’t dislike this German,English and Japanese speaking Phoenix!\nJust nice to watch the streams and Videos.\nWhat Else can u say.\nLove it. Keep it up 👍 ", "Lamy is an elf, Botan is a lion, Polka is a fennecfox, but what is Nene? The only \"weird\" thing I see is that she has many sleighbells, and an oversized one", "You should do a song next time you collaborate  with someone we’re you sing in English and they sing in Japanese were.", "Schon wieder technische probleme. Kiara ist schon ein Pechvogel....", "We need a Hololive (GER) with Kiara as Headliner :D", "we certainly dont", "Kiara got a side of dumplings? I'm in.", "Wooo they sing blue bird.. Ayumi... Nice.. Hm? This naruto one.. Oh\n\nKiara is sherry and Nene is ranka..... Wow...", "We all knew this would happen. Even the other holo en girls have said it too that she's just so friendly and knows how to uplift the mood and make people feel comfortable, definitely a people person and very outgoing! Its only a matter of time before she collabs with everyone, and I can't believe how good all the songs sounded, definitely going to come back to this stream to listen again", "Is Kiara's schtick going to be off-collabs now because I'd be down for that.", "She'll definitely try to do as many as she can in the next months, as she said she has to leave Japan fairly soon (probably visa related)."]