["Ina nodding in approval while Kiara gives her announcement on the Hololive interviews at 2:10:48, God I love her", "I can hear the humu humu", "Ina so precious, I don't even think she was streaming. Just there to support her fellow member and for the viewers' amusement.", "@The [REDACTED] Virus she wasn't streaming. Initially she was just watching Kiara's stream, but then hopped on once she saw that all of her cows disappeared", "dude, fuck yes, kiara finally bottom right!!!!", "Title: \"GATHER THE SHEEP\"\nIn my thought: \"GATHER THE WATAME \"", "For anyone wanting to know a better way to get farm animals use a lead. They're slow with food, leads can make them move quicker.\nAnd watch the distance from your base. travelling with any animal at night is very risky. So it's easier to just use animals nearby or build a series of small huts to hide in.", "This girl is a real gift to the world...", "Agreed", "Ikr, imagine if they didn't make HoloLive EN. She'd be a lost gem.", "@MankoPanko agreed, she's actually very underrated right now, being overshadowed by other members, but she's definitely a treasure to keep, i hope she can be more successful in the future", "Kiara: speaks 3 languages fluently\nalso Kiara: \"People only compliment me on translating, one day I will do something worthy of praise.\"\n\nMost underrated HoloEN member for sure.", "@ClokworkGremlin i know right, she just keeps putting herself down, but she's definitely a gem. Sure, every EN girls have their own talents, Calli has her rap and personality, Gura has her singing and humor, Ame is a toxic gremlin (joke) and is a good fps player with great sense of humor, and Ina with her art, comfyness and dad jokes, but Kiara is a ball of energy that can speak 3 languages fluently that, yes, she shines on her own, but she shines brighter with the other girls with her ability to reduce or eliminate awkwardness between the members, like how she did in the Amon9us collab. Such ability made the collab possible in the first place. They all have their individual talents and i love them all for it.", "@人:Re KFP Ceiling Fan I think it's the fact that we often can't see our own talents. Like Calliope said Kiara works harder than anyone else she knows, but we can also all see how hard Calliope works, and she also constantly beats herself up for \"not being good enough.\"", "@ClokworkGremlin true, all the more reason to make it rain reds... Im broke af tho", "@人:Re KFP Ceiling Fan yo, same.", "@ClokworkGremlin yo, and that's like the reason why i never skip the ads on their VODs unless it takes more than 15 mins, just a way to support them while I'm still studying in college", "@人:Re KFP Ceiling Fan Same. I almost always skip ads on YouTube, but I try not to when it's one of the Hololive girls.", "@ClokworkGremlin such wholesome comments here.", "Kiara is slowly but steady evolving from bottom left to top right", "Wait... Is this Gura?", "@Nix No it's patrick", "@Es Teh Hangat is this gura?", "whats the timestamp?", "Ah yes the overused meme", "@Akemisan - \nIt is not a meme if it is not overused.\nThat's the main definition of the word \"meme\". :P", "@Chaos-15 still an overused joke", "Mmmmm bottom right actually", "Kiara´s wants to interview everyone in Hololive: \"Lets start with someone older, they probably have more stories to tell.\" thinks for a bit: \"How about Marine?\" she is old alright --  Here's a joke about Kiara and her flock of sheep. Stop me if you've herd it before.", "This is the true content I watch Hololive for", "chicken: escapes\nKiara: Do you wanna die?\nchicken: nods", "Minecraft mining in a nutshell:\n\nKiara: I want Diamonds!\n“Hours of mining and still nothing”", "We call it the \"desire sensor\"", "True, i wanted iron but end up getting redstones instead", "2:20:55 i'll just leave this timestamp titled \"most intense and shocking thing that happen on the stream\"", "I love Ina's 'w' in the chat haha.", "Where even was the creeper?  lol I don't blame her for dying there what even happened lmao", "2:22:15 a funny thing chat noticed sign read:\n『Here lies Kiara\nwho lol no\nsurprise died", "1:31:06 Kiara insults Ina's stairs lol", "00:35 Humming?/鼻歌助かる\n     | 01:03 Caugh\n01:41 Start!\n01:44 KIKKERIKI", "15:22 Come back !\n16:10 egg!\n16:45 What's wrong is this chicken?\n17:32 Today's mission:Find the sheep->have a lot of color-> make color bar to decoration", "Nice", "1:06:32 smart bird.....(huh?\n1:07:28 Kiara feel her progress befind\n1:07:50 Did anyone sick for a lot of MC stream?\n1:08:27 about Pekora senpai ", "1:39:17 Find the Ina\n1:39:43 Ina is angel!!!!!!\n1:40:20 Ina is so cute!\n1:41:00 Ina is watching the stream", "2:03:27 JP collab( translate as possible)\n2:05:12 Diamonds again\n2:05:25 but maybe won't translate like the collab of 雑談(Zatsudan)/talkshow\n2:06:24 Ina , bring the water!", "2:42:37 Read the SC\n2:43:07 LOL(OOPS\n2:43:32 Will collab with Ame at 20:00(JST)\n2:44:27 No JP collab next week", "3:13:47 Huke papa->best papa ever\n3:15:47 Nene PRO PAYS WELL->To join Kiara member\n3:16:34 Why does Nene has so many money\n3:17:15 chu chu chu", "Thank you for the timestamps o kind person", "Absolute legend! Thank you so much.", "Ina: \"wait WHERE DID ALL MY COWS GO\"\nlogged in\n\nshe just got stressed by hl stream hours ago, now this. poor tako", "I am having Ame flashbacks now.", "It's ok. Looks like she got to laugh at Kiara for a little while.", "2:01:58 Kiara, if you want a tour around HoloServer with Pekora as your tour guide you have to ask her offstream and make a deal with her. She really wants to learn English to connect to overseas fans and is doing some excercises/apps but also mentioned you a couple of times already regarding this topic. You don't have to be a teacher but having some regular casual offstream conversations in English with her and guiding her in the process would not only speed up her progress significantly, you'd also get acquainted without pressure. Consider it Kiara, if you offer your help with her wish first she'll be happy to accept yours as well, she does want to talk to you so please take the initiative and make things happen offstream first.", "I'm waiting for the day that Pekora will say \"Hey Kiara\"", "@The Potato HEY CHIKIN", "10:10 \n\"Give me freedom or give me death\"\n-Chicken, 2020\n10:50 ", "Kiara, chicken whisperer", "Really hyped for the bi-weekly Hololive JP interviews! Also mad props to Kiara for learning Japanese by herself, that's next-level dedication", "I think she said that it's going to be every two weeks not weekly.", "Biweekly* most likely", "@extralie ur right mb, imma edit my comment thanks", "13:46 it‘s fine kiara! Play more if u want, we are fine with everything u do! But then again minecraft streams are quite entertaining!", "10:10 cracked me up lmao! Savage chicken", "Those Collab Interviews are gonna be lit 🔥", "You:  2:40:02\nThe guy she says not to worry about: 2:40:10", "\"I never plan to stay.\"\n\"It's always sad to leave.\"\n\nThen why?", "The way she said that... ngl, that hit different.", "0:51 THE LITTLE SINGING I CAN'T-", "gura spends a whole stream making a secret prank contraption and chat tells kiara what is is immediately\nFFS", "Hololive Interviews?! Kiara you absolute mad lass! That actually sounds like a lot of fun, and since both your English and Japanese is amazing, I'm sure you can pull this off! \nWe will watch your career with great interest ;)", "Ein Stream 6 Uhr in der Früh bis 10 Uhr zzzzzz.\nEN: A Stream at 6 o'clock  until 10 o'clock. zzzzzzz\nCute detail with her arm at 3:32:00", "2:29:00 (Just leaving this timestamp here)\nSo will Kiara come back to Japan?", "I would enjoy more minecraft stream lol dw. \nAlso, ur idea is super POG can't wait\n\nDiamonds timestamp", "The interview idea is really top right and I'm so excited for it, really looking forward for that big project\n\n\nAlso don't worry if you make full Japanese streams with your senpais, we're okay with that and as long as you're having fun it will be fun for us too (And there will be translators and clippers like last time)", "The interview idea is soooo good! ♥\nI would love to get to know the other Hololive girls as well!", "Kiara seems most open about everything, like out of character towards the end, it's nice to hear how things work behind the scenes,", "2:18:17 ダイヤの歌ｗ", "🧡 Lol. Not gonna lie, the interview idea is absolutely genius level. My goodness, this majestic bird of ours is hiding the biggest of brains. 🧡 Also.... That Creeper was so VERY rude! 😧", "キアラさん安心してください！配信中にホロライブメンバーを呼び捨てしていても失礼なやつだとは思いませんよ！まったく気になりません。", "Typing this during the SC reading portion of the video.\nLol, Kiara, we all love watching you do what you do.\nIt's always nice to see you having fun, and even your misadventures can be fun to go through as well.\nThe interviews are a brilliant idea, and I look forward to seeing those whenever those happen, seriously.", "Best Idea Ever 2:10:13", "Deep fried interviews coming up", "Tenchou, the interview show is such a great idea! I can't wait to see it!", "Kiara out here making yagoo's dream come true.", "Kiara always making me smile 🥺 I love her very much keep up with the good work sweetie", "This stream was so cute and wholesome", "The interview idea is amazing", "2:18:17\nDiamond Song", "The way she just dances around a pool of lava had my heart racing", "@Ghostly Gibus she's a Phoenix, lava won't kill her....", "I just want to say that your interviewing idea sounds absolutely amazing and I do hope that you try and ask some deeper questions, that'd be really really interesting. How long would the interviews be? I think just one hour may be too short to ask enough questions if the questions are all in-depth. Super excited for the future!! Thank you so much!!!", "10:00\n\nThe story of chadiken the suicidal chad chicken.", "KFP's employees have any kind of heathcare? Cuz they're almost deaf after this stream...\n\n\nP.S.: About the \"talk show\" idea, you should check some of Tamaki videos to get some ideas.", "3:04:19, let the sneezing super hat raining begin", "It does enrich the stream when other en members make a cameo or just randomly appear on the stream, but when they don't stream themselves.", "1:53:20 blessed 🙏", "Thanks For The Sneeze: The Suffering From Success Story by Takanashi Kiara", "3:03:33 just gonna leave it here", "I love how inhumane minecraft farms are", "Kiara repeatedly finds Ina's shaft, the movie.\nEdit: and then blows Watson's. I swear, the doujins write themselves.", "Minecraft is always entertaining :DD", "does she sound like kek queen or only to me ?", "Kiara: Can I have some iron?\nIna: 599 US dollars", "Kiara might be able to make yagoo proud at this point", "くそとり！", "After she got the diamonds, I said \"now cue the creeper\" but I didn't really expect a Creeper, yet he still showed up anyways.", "#Gesundheit Hope Kiara can take care of her throat. It’s so distressed by her situation.", "Interviews. I like.", "Helping with youtube algorithm", "Maybe the real diamonds are the friends we made along the way.", "Keep the chicken noooooo :'(", "Thanks for connecting everyone", "Looking forward to your streams", "She's so talented", "Fun stream!", "If you can put hoppers under the chickens, you'll get more eggs", "Kiara if ever you read comment i have difficulty for MOTION BLUR in option make me sick :c Your stream was really nice but I have to pause sometime to not being sick. Thank you <3 I love you !", "noooo i miss the stream", "Sheep is for the Beak", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Yes for Kiara Deep Takes", "Your making a chicken out of a feather", "♥️Viva la Kiara ♥️", "Obligatory comment", "Lol", "Komisch das als Deutscher zu schauen", "I love you kiara marry me!!!", "44:55 the sheep don't go away when you sleep because sleeping just advances time in the game, it doesn't simulate the sheep wandering around for 8 game hours.   Same thing with planting a crop and sleeping, they don't suddenly all grow because no actual game simulation is happening.  The clock just changes to \"morning.\"", "I must not have seen the \"bottom left\" chart, I thought you were talking about Calli's bingo card, I think she put \"kusotori in chat\" on top right :)", "any interview format, according to Hololive tradition, has to include as the final question \"what color are your panties!\"", "Given how many animals she goes fetching from that area maybe Kiara should build a bridge, save them all having to swim.", "Although the interviews are a good idea, I'm worried that she might be biting a bit more off than she can chew (do birds chew?), or getting too ahead of herself. It's easy to get burned out and frustrated and when you do so many things at once very fast, so I hope Kiara can find the right balance and ease into things.", "Maybe it have something to do with her leaving Japan soon? You know, do anything she could while she's still there?", "Youtube burnout can happen yes, before I quit ages ago I tried the daily upload and variety to keep stuff fresh and it did get tiring but a couple things might be in her favor, one I was likely much older then she is now, ok she's \"immortal\" but you know what I mean lol her energy seems good even among these 5 plus it's pretty early in the channel's development, she should try to do these heavy things first then after say 3-6 months she can back off, upload a  bit less and get a  relaxing routine before burnout happens. It's always about balance in anything you do and if she can get stuff out of the way now it's smarter then a year when it becomes mentally more like a job then fun 24/7", "I don't know if anyone thought of the band flock of seagulls when she say iron. 😁👍😆", "Kiara is such a cinnamon roll", "Que guapa la Kiara", "Pog", "Kiara is our winning daughter ngl", "@2:20:50 And this may be a reminder to PUT TORCHES. Torches = no enemy spawn. Sure it was not anyone's fault it was invisible due to a server bug. But had the tunnel been properly illuminated, that could've been avoided.\nPlant Trees -> Log -> Stick + Charcoal = Torches.\nThere is a mod that lets you 'see if it's bright enough to stop spawns'. It's clientside, so the server do not require it.", "Gura had nothing to do with Ina's cows going bye bye. Gura has her own cow farm. \nbad Kiara's chat", "Kiara, you are really getting a lot better at minecraft!\nFirst we struggled for food and iron, and now we have a chicken empire, a good chunk of iron, diamonds and we started to work on the mob grinder! Good job!", "Guys, am I the only person worried about the upcoming collab with Ame?", "Why?", "-", "Ame was having a pretty bad time with her chat during the Witcher stream, and it could  affect how she interacts with Kiara", "@Blooper {Reloaded} Not sure why that would affect their interactions with each other. They all have to deal with the shite that is internet chats.", "@Tru Null I know, but my anxiety is just flaring up, and it's making me only think of the worse case scenario.", "@Blooper {Reloaded} ame's resting and cooling her head rn and I trust ame will keep her cool", "Yes, you are the only person worrying", "@Blooper {Reloaded} just chill mate. Get some pantyhose Tea and a fried kiara, after that everything will be good.", "@Es Teh Hangat Thanks man.", "@Blooper {Reloaded} I feel like holo en are internet veterans, they knew what the headaches were gunna be and can handle the morons who cant chill out when watching anime girls play vidga games. Ill take ame being the one that puts chat in its place though...thats dope.", "what happened at that stream?", "@dia, KFP's Nerdiest Cashier Toxic chat, the usual", "Just got back from the stream, everything went fine thanks to my guy AO-chan.", "Well she does seem a bit tired but all good", "Sana magkaroon din tayo ng vtubers. Pero delikado sa mga toxic peenoise. Holo PH will always and forever be just a myth.", "Pururin tyka lele ph vtubers", "@Hiko Boshi i don't understand what you are saying", "@Inadobong Chicken search Pururin from tsunderia. And Lele and indie vtuber. They are filipino Vtubers", "@Hiko Boshi you don't know lyrica?", "Ok na ako sa lola Lyrica natin", "A word on pick usage:\nIron picks last longer than stone, but stone is much more abundant. You can save on iron by keeping just one iron or diamond pick on you, and using a stone pick to dig out everything except gold, redstone, diamonds, or obsidian (obsidian requires diamond, gold, redstone, and diamonds require iron, everything else can be dug with stone).", "Iron is plentiful enough that it's not worth bothering with the slower and less durable cobble tools after the very beginning of the game."]