["(15:53)\nKiara: I will never forget the first time I heard Amelia hic\nAme: I remember that too\nKiara: Eh, how do you remember that? You're so smart!!!", "Amelia giggling every time kiara swears so normally lol", "Why did the employee get fired from the calendar factory? He took a day off.", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "@Bread Cheeks okay? I assume this is one of the bots.", "@Blaze Yes. Just report and ignore them.", "Which one?", "@Necromancy For Kids The video he was linking got taken down too by the actual creator.  I’m guessing he was trying to get ad revenue off of someone else’s work by linking it in every comment", "@I Don't Get The Joke Some people link their videos in comments with many likes to spam or advertise.  Naming them isn´t productive just ignore them =)", "@Casual Filth no which day did he take off?", "@I Don't Get The Joke February 30th", "@Casual Filth now that's just painful", "\"First automatic system in the server!\"\n\nCries of Ina can be heard distantly", "Inas farm needs a button press, auto-egger just needs the chest to be opened.", "@No Name its still auto poor ina", "A moment of silence to all of our chicken brethren who will never live to see the day they become a delicious bucket of KFP. May they rest in nugget pieces.", "Buried in a grave of honey-mustard dip", "We're sorry Momma... We never meant to hurt you.....\nWe never meant to make you cringe, but tonight... Us chat is BOTTOM LEFT too.", "Bottom left gang!  Ah\n \n\n\n↙️ HA \n↙️ HA \n↙️ HA \n↙️ HA \n↙️ HA \n↙️ HA \n↙️ HA", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "Always has been", "@Bread Cheeks You really need to stop your tasteless stolen content spam...", "Nice", "some lives has to go to make space for more. \n\n-Kiara, 2020", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "She sounds like Thanos, ngl", "If not her husbando Calliope don't have work to do and the world become over populated.", "She's not the first Austrian to have that idea, should we be worried?", "Out of context 2:42:46", "Huke made orange sheep on the upper side to quietly hint \"top right\".", "A \"top right\" emote is definitely coming. Ohh yeah. It's all coming together ", "What does \"top right\" reference? I can't find the context for it anywhere.\n\nEdit: Also \"bottom left\".", "@Cainenghis When HoloEN first debuted, fans made a chart rating the girls on their intelligence and purity. Kiara was put in the bottom left, meaning least intelligent and least pure. She has her top right moments though.", "@rundor8 thank you!", "@Cainenghis It wasn't at the debut though. It was at the collaboration on Kiara's channel. She did the graph and when it was her turn to be placed chat kept saying bottom left. Right for smarter and up for more seiso (pure/elegant). Amelia was bottom right btw.", "KFP now taking janitor applications", "F for Albedo.\n\nDude only wanted a promotion... But he was too honest for his own good.", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "Our other overworked Janitor's gonna die from overwork", "@Bread Cheeks Silence Chinese bot.", "So no one seems to mention this, unless chat did at some point but generally making a whole build out of wool isn't the best thing, besides the fact lightning can wipe it out in one bolt but a fast food place involves cooking, and fire is a no-no as well. This might be brought up as yes collecting gravel and sand can be tedious but you can't burn down concrete. I suggest someone tells her to set down a block of wool and introduce fire to it as an example lol", "Good point. Unless she decides to layer the wool with stone etc. that restaurant is just a fire accident waiting to happen ", "The chat wanting Kiara's chu~ to getting slapped by Kiara in a split second: PARKOUR PARKOUR", "Look on the bright side, now Albedo can audition for Holostar so we can simp for him too", "Please support me in my next endeavour guys", "You know simp is an insult right?", "@Tiberious_Of_Elona in hololive its not.", "@ZeWorld not even an insult anywhere from what I've seen", "@Tiberious_Of_Elona It is technically an insult, but it became a joke to call someone a simp, and now nobody cares if they're called one.", "@Tiberious_Of_Elona where?", "Shrimp *", "@Albedo the JFP Janitor where's Rubedo though?", "@Tiberious_Of_Elona For you it is.", "1:14:12 R34 artist: WRITE THAT DOWN", "44:09 pain F for my brothers and sisters ", "And here ladies and gentlemen a tradition of sneeze shower on our Majestic Phoenix's channel has born", "I really love the 'bottom' dynamic between Kiara and Amelia. Hopefully there comes a time where Kiara is on the right side of the spectrum during a collab with Ame...", "They start on 4:00", "Arigato", "Thank you!!!", "May the holy spirit be with you", "Damn, F for Albedo. He was only trying to make the floors sparkle.", "1:05:54\nKiara: Meheee meheeee\nWatame: Understandable, have a good meheee meheee", "Does anyone  here know if nenepro has an opening?", "10CHOU!!!!\nI laughed at the stop every time She did something dirty.\nすけべなことする度に止まるのは笑った", "F for Albedo losing his job", "wait what happened to albedo where did he lose his job?", "the day that huke makes his vtuber debut moves closer", "“I wanna play it normally [Among Us]”\nProceeds to threaten the jobs and lives of her employees when they see her kill someone the next day.", "Kiara's mom checks out Ame...", "that was the joke lmao, she just chickened out from going in for the punchline", "It's more awkward when talking about a friend's mother. Especially when they could be watching. Lol", "Itachi Uchiha: 45:26", "Day 9 of commenting on tenchou's vods to help her with the yt algorithm", "I was confused i fell asleep watching Kiara stream and when I woke up she was still streaming but it was two different streams lol", "huke-sensei vtuber when", "Ame really bringing out her inner Thanos at the beginning lol", "2:54:19 please never change", "I keep replaying this not only for boing boing for mostly cuz her laugh is so blessed 🥺", "@Milkthrow both, both is good", "I don't know anything about Redstone contraptions, so if they are doing something wrong I don't know.\n\nI imagine it's frustrating for people who do understand how it works.", "Second Half of This Stream:\nKiara Total Fall Counter: 10 (+One Fall from waterfall caused by a Creeper)\nKiara Falls (Jumps off) on Purpose: 3\nAmelia Falls: 1", "10/10chou. \nWould watch again.", "Thank you for the wonderful stream, Kiara  I loved how you and Ame helped one another with each other's projects Also, cheers to Huke Papa's progress in the server. Really looking forward to his works  And the SC reading was truly chaotic. Together, we're all ", "uhh who is Huke papa? :,D Kiara's artist?", "It's ok for Kiara to be a left\n\n\nThat's where the heart is", "For use italian speaking peeps 2:24:00. kiara è alto a destra raga, TOP RIGHT.", "Imagine being so THICC that the chat breaks", "May the sweetness accompany you through every moment of the day, may safely walk through every moment of the moment with you, may happily accompany you through every moment of every moment\n甘い日々があなたと共にあり、あらゆる瞬間を通してあなたに安全に同行し、そしてあらゆる瞬間を通してあなたに幸せに同行することができますように", "Play Minecraft, watch together, get pig!\n\nSurprisingly relevant yellow text for a stream. Even more so if they happen to get a pig this stream too.", "F we just lost our janitor 😞", "44:22 that’s literally cannibalism", "01:56:22 Kiara choosing Ame over KFP .... TeeTee (?... ", "39:25 the dramatic life of a single chicken mother. \nWork hard, KFP employees, so that these chickens may have the proper crispy crunchy future that they deserve.", "I just love that waiting screen animation. It's so good. Who is the mastermind behind it?", "CANT WAIT FOR SHOW!!! I like the Japanese channel but I don’t understand them ✨💓✨💓✨🥺\n\nMaybe have Japanese lesson for people interested in learning!!!", "Guten tag.", "Albedo congrats on getting fired LMAO", "I hope you settle into your new house despite it shortcomings. - I hope you can soon get an apartment/house you feel more comfortable with. :)", "Missed stream, watching now!", "2:24:47 possibly the fastest firing/rehiring of all time.", "Did huke papa really play on the server?  If yes, was it on stream?", "Yeah. He has joined the server. But, he played offscreen ", "Um...I'm new here, can you please tell me who's this huke?", "Is he the manager?", "@stopdahrain He's the character designer for Takanashi Kiara. Thus, he is Kiara's OG ", "@NotYetPro I see...thanks!", "@stopdahrain He's also the character designer for Stein's;Gate and Black Rock Shooter.", "@PumpJack McGee thats so cool", "Welp not anymore thanks to some people", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "2:54:10 Don't mind me. Leaving where I left off", "Oh my gooooooooooooooooooooo!, Mr Crayfish needs to ad his mod in whole youtube!.", "Albedo, you absolut wonderful madlad o7", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "Whose albedo?", "@Christian Nisperos The former Janitor of KFP who was fired at 3:42:11", "Ame x Kiara streams have such a nice vibe to them", "Man I wish I got to watch the stream but staying up until 4 was not on my schedule", "1:27:03 \"German technology is the best technology\" aka German technology is the best in the world!!!", "Holo-en 2nd gen will star Huke", "パパ、笑えるｗｗｗ", "Amelia, Detective for \"Hire\"", "kiara has inherited pekora's laugh", "44:03\nUchiha clan flashback", "What did Albedo said to get fired? xD", "He superchatted \"Kiara your breath stinks\"\nabsolute madd ladd", "Watson Amelia: Architective", "The moment Kiara killed thousands of employees 2:56:15", "HUKE papa is just MVP lol", "Kiara just Itachi her chicken family :(", "Ah is a Naruto reference?", "AND THEY WERE ROOMMATES!!!", "might have been useful to make a cobblestone gen first since that makes mass building easier oh well", "10cho....", "3:05:08 LFTT stands for...", "So i was starting up the stream from the beginning and Kiara's dance is in sync with Ob La Di Ob La Da by The Beatles.", "https://youtu.be/JeD9exFQ3OM Subaru pineapple pizza", "Shticks", "3:16:38 and 3:19:34 about sending fan letters and presents to hololiveEN", "Can't wait to see what crazy things Huke gets up to", "It's in Pennsylvania, and it's not German... it's Dutch. There is an amusement park called Dutch Wonderland in that area.", "36:30💪", "New day starts with a new HIC...Kiara.", "chat go to horni jail! bonk", "can't wait for duke papa debut stream", "ｈｕｍａｎｉｃ", "Starts at 4:00", "I have seen my future", "2:53:30", "21:04*\n1:38:30.", "1:43:52", "I don't know what happened especially at that end and even the trash bin. Like seriously, what happened?", "Kiara did an off-collab with Subaru (As in, they both streamed from Subaru's house) a while ago... Despite having done off collabs before, apparently Subaru only had one chair; so Kiara had to sit on a cheap bin turned upside down; and promptly broke it.\nSounds like it was pretty doomed to break regardless, but yeah, it couldn't take out gorgeous (MAJESTIC) Empress' divine booty without breaking, haha  ;)", "@Minori Setsugekka ohhhhh.... Yeah I remember now and you're absolutely right because Tenchou will be perfect in our eyes", "@Minori Setsugekka I find it funny that Kiara's concerned chat thinks she's fat because of this, when in fact chat sees this as proof that she's Boing Boing", "@Jkhmonkey KFP IT Hardware Department #2 She worked as a personal trainer and flight attendant, how could she possibly be anything but fit?", "@Didn't have much of a choice... Woah really? when did she coment on that?", "@Jkhmonkey KFP IT Hardware Department #2  \nHaha, yeah, it's just convinced most people that she really does have \"Divine Attributes\", haha xD", "@José Dourado Just to clarify, she said this jokingly as her jobs in her previous lives as a Phoenix, because Phoenixes reincarnate over and over again. This wasn't talking about her actual personal history. This is similar to how she keep saying she was a professional Mario Kart driver in her past life.", "I'm still in the beginning of the archive, but I hope the rest of the girls were OK with Huke Papa joining the server.\n\nBut personally I think it's awesome that he's actually there!", "2:17:34", "Are you reading this?", "Testing", "Beast albedo", "I wasn't joking they really do call their German Pennsilfaanisch because they're from Pennsylvania", "#10chou", "Rest up kiara you need it", "Is it really 7 hours?", "She stream 2x this day, both minecraft", "@shitori_ oooh isee thanks 😅", "KFC is a knock off of KFP I dare you to correct me", "Anyone know what shaders Kiara has?", "huke best papa", "Chikkiin Chaos", "why is Ame’s stream and Kiara’s stream so far apart time wise?", "Kiara did a superchat reading after playing with Ame.", "Well, probably because they live in a different timezone, ever thought of that?", "So what happened to stream chat? Someone created a trouble or something?", "Chat takes time to load after each stream", "@SheepSheep * still not available", "@Sam Kam Be patient.", "@Sam Kam welp guess what, chat is up :D. Just be patient", "3:40:56 just enjoy the moment", "TBH the chickens  are disgusting to those who have the phobia lol\nHow about creating an automatic egg shooting machine lol", "3:23:17 I do hope she'll never do it again as I know some people have gotten themselves in trouble for things like that, as it may be considered self harm from youtubes perspective", "Kiara > any hololive member", "The other kid is so annoying.", "pls shut up", "There is no kids playing? Who are you talking about?", "what"]