["Kiara is definitely the reason this went as well as it did. Translating and being the bridge for all the girls is so important. It sets up the future collabs of EN and JP. Thank you Kiara for all the hard work!", "I got into the hololive fans late but heard that she had trouble with confidence and feeling like she was not as good as the other girls. But from what I have seen she is amazing.  Sad she doubted herself because she is great.", "oh for sure, especially considering certain facts like Botan was a bit sad because she couldn't speak english and communicate, Kiara's involvement was so important", "Is Kiara the only one who could speak Japanese in HoloEn?", "@inXtrastic Calli speaks a good amount and Ina can atleast hold conversations for a while. Kiara is the most fluent", "I remembered when Kiara cried coz she was doubting herself and there were negative comments about her self translating\n\nSo proud of her right now", "Jep, she is the connection between JP and EN, so big birb brain BBB! and always seiso", "https://youtu.be/GTzdUKpukME Gura is the imposterrr", "I'm so happy that her ability to speak Japanese and English is becoming a big used to both Hololive JP and Hololive English. I'm so proud of our Tenchou 😁😁😁", "Yeah. Her self declared \"only\" redeeming quality over the other en girls (that being her japanese fluency) was really helpful in this.", "can i know what's going on with the negative comments? i usually on JP branch side so i dont know much about the EN branch", "@CHICRITRO Well this video will explain what happened \nhttps://youtu.be/Ci6e90sIRW0", "@lissaleigh mercado 　i see, thank you!", "@CHICRITRO You're welcome 😁😁😁", "@lissaleigh mercado Making our poor boss cry is punishable...by DEATH", "@Ocean's Blue Waves Never make our Tenchou cry or else we, KFP will haunt down those people who make her cry", "@Ocean's Blue Waves To be fair she broke down easily when she started. Glad to see she grew a spine.", "though she didn't win a lot , but I can say Kiara is the MVP of this collab.", "translating, investigating, tasks doing", "https://youtu.be/GTzdUKpukME Gura is the imposterrr", "i mean she translated but didnt she also vote innocents out and clear people way too easily", "Love how she tries everyone to get along together and translated things for all.\nShe is like the team mom.", "@WeabZ Making sure collabs go well is infinitely more important than being good at a game.", "@Aldric Edmondson I was thinking more of the game mvp than the collab mvp. Game MVP is the o2 sabotage", "Gameplay: bottom left\nCollab       : top right", "@WeabZ it literally says collab mvp on the op's comment bruh", "@Redan Dinata Even gameplay wise she was finishing her task very quickly.", "@Moltenlava Gaming / Edits yes, brain bakuhatsu", "Kiara you were amazing in this collab hopefully you get imposter next time", "https://youtu.be/GTzdUKpukME Gura is the imposterrr", "I second to that notion", "What if... Kiara is too pure to be sus?\n\nNah, all the way, just there's blood in the water / air.", "1:11:50\n\nPolka: What's the English of \"Let's go\"?\nKiara: Let's go", "\"It's definitely not Ame\" -Famous last words", "Gunna say what everyone is probably already thinking or saying but Kiara really shined here with hosting and translating. Shes a very good host and shines in collabs", "Yeah, at first I wondered why she was playing host for the collab, then I realized it's because she's the most fluent in both English and Japanese, and was even able to play pure translator in that one round after she died, without giving anything away.", "This", "i have to agree", "Agree", "@ClokworkGremlin I was concern that she would be killed immediately to cause confusion without a translator. Glad to see things still worked out.", "Kiara's confidence is insane! even tho she voted the wrong person  BUT THE CONFIDENCE IS IMPORTANT　草 nice try kiara", "like the doggo spoketh, half coffee dance", "Kiara is too Seiso to be the impostor.", "If Kiara's too seiso, then I don't know what Ina is.", "@Christian Philip Cayanan shes seiso if you say so hehe", "Bottom Right", "The highlight for me:\n\n\"BOTAN SUS!\"\n-Polka", "Polka was a surprisingly good detective. If she said someone was sus, they were usually an imposter.", "@ClokworkGremlin She does have a fair amount of experience under her belt by now. She plays with her English fans on stream!", "Kiara being the bridge for HoloJP and EN collabs. What an MVP.\n\n\"Thank you for the hard work, Translator-chan.\"", "Our bird is finally starting to fly out of bottom left.", "She will be demoted back soon enough\nJk she's always been top right in my heart", "Never has been ;3", "30:32 - It can't possibly be Lamy again right?\n32:27 - Gets killed by Lamy\n\nSasuga Tenchou, she's learning the ways of the Pekora lol", "I had Ame's stream in the background and muted this one.\n\nIts just Kiara sacrificing herself for everyone's sake. Sasuga Tenchou! taking the hit so everyone can have a better stream ;D", "Kiara did not do any fowl-play today.", "She is to pure for th--- [\nremembers Calli] Eh...nevermind give her time she can be very dangerous.", "Ina virus is spreading I see", "Ayeeeeeee I see what you did there", "33:23, 39:50 When the translator is dead and language barrier is a problem.", "I feel like this was a big moment for Hololive. When I first fell into the rabbit hole back in January, I never imagined we would reach this point. Everyone has grown a lot, and HoloEN has surpassed all expectations. Really amazing to see.", "I thought I was the only one! Hololive feels really surreal I still feel like it isn't real, after almost a year of been here I am so shocked but happy about the huge success", "Absolutely amazing seeing Kiara helping everyone communicate. And like usual, she is always the soul of the party.", "最高に楽しい時間でした\nキアラちゃん大変かもだけど、もっとJPとENのコラボが見たいんじゃ～\n\nthanks for your translation!", "Thank you so much for the wonderful stream Kiara. Your translations have no doubt helped to bridge the communication gap between both groups. Overall I had a lot of fun tuning in to the stream. Don't mind the technical issues because they happen sometimes. You did an excellent job today!", "Kiara: \"Have Confidence!\"\n\nImposters remain.", "I overslept and missed the stream", "Kiara so bottom left, even her audio became bottom left", "Kiara, thanks for translating and making the conversation go smoothly. \n\nYou’re the real MVP.", "It must've been hard to deal with the technical difficulties while also being the main bridge of conversation in the group and also because being left out of the conversation may feel bad. Despite those problems, you managed to give us this awesome content which would probably be impossible without your presence. Thanks! Tenchou.", "Started with Left Ear Asmr\nEnded with Top RIght Kiara\nParted away with Byonara", "God this was the greatest crossover ever. I was expecting some difficulty in communicating between members but you guys pulled it off so well.\n\nAlso Rip Calli, she barely got to talk because she kept getting killed lol.", "Suzumomo Nenechi, forgive this birdbrain.", "so basically, does anyone else remember when she said she has no worth while skills so she makes up for it by speaking multiple languages or translating what she says live\nthis video she shined with being the translator\ni also translate for people since I'm also multi lingual", "Kiara is so much more than just a translator, but i love how she utilizes her abilities.", "@LOSTLEAD8R ikr\nbut im still hung up on how she cried that one time when she felt like she had nothing else to offer after being told by an anti that her translating herself live was annoying", "@Viet Dragon it wasn't an anti, Kiara just took the criticism harder than expect and like the person that gave the criticism felt super bad about it.", "@LOSTLEAD8R i didn't know that actually :o\nthanks for letting me know.\nso everything regarding that is ok then?", "1:03:50\nKiara is so based", "1:11:52 Polka: How do I say 'Let's go' in English?\nKiara: LET'S GO", "8:00 is when it starts 20:00 for first game", "キアラちゃんの翻訳のおかげですごく良いコラボになった！！！ありがとう！", "予想通りキアラさんが一番仕事量が多くて奮闘されてましたね\nお疲れ様です…ｗ", "Imagine if Kiara was imposter. She could talk to anyone. So she could convince anyone.", "Maybe I've seen a lot of High level gameplay of AMONG US this group is just so bad but its fun and funny but I love them \nthey just need more experience looking forward for 10 players next stream with Pekora and Kiara", "1:11:49 Polka asks how to say \"Let's go!\" in English.", "she did so well leading the flow of the collab and translating for everyone, sasuga tenchou", "Everyone was bullying Calliope! She died first every round XD", "Reap the reaper~", "It was really cute how whenever Gura and Kiara were both crew, they were able to finish their tasks together and then hang out.\n\n[edit]Also, you'll want to learn to use the emergency meeting button. Round 3 would have been a crew victory instead of waiting to die.", "They could try playing with Hololive-ID next time.", "Kiara's ability to flip between English and Japanese is so impressive. I sometimes have trouble flipping between my first and second language, but she's doing it without any problem with her second and third language. Really fun stream! :)", "You are the most pivotal piece of this equation for en and jp to interact. You are priceless Kiara! Keep doing good work!  :3", "YABAI funny Collabo LOL 👏🎃 Super BIG KUSA !\nやばい面白いLOLコラボでした🎃\nGG, and your trans was also awesome ! bb\nGGでしたが、通訳も最高でした！bb", "I was so hoping Kiara would get Ina-Pasta so that I can see her act all nervous and get caught! I'M SORRY KIARA! But your flames are most beautiful when you have the odds against you. Such is a Phoenix who's reborn constantly", "Most defensive word ever\nPOLKA: G-GURA SUS!\nGURA: NNOOO!\n🤣cute fight🤣", "19:58 first game start!", "Honestly, I really liked the stream. Even with the language barrier, it seemed everyone enjoyed it. You guys should definitely do it again. Also, I really like that EN and JP got together this close. Without Kiara, it would maybe have happened but definitely not like this. Was having a great time.", "Just wanna say...your translations are great, definitely the hidden MVP as one of the bridge of HoloEN and HoloJP, and we're always rooting for you Tenchou!", "Just gonna say kiara and calliope is meant to be since they both didn't become the impostor", "That makes me so sad because you know Kiara wouldn't kill Calli, but Calli would do it in a heart beat!", "Kiara was MVP for this collab, wouldn;t have gone as smoothly without her. Other Holo EN seemed kinda shy lol.", "God bless the chat for telling me to turn on mono audio so I could hear Kiara from both sides lol", "Thank you, Kiara, for making this collab possible and thanks 5th gen and HoloEN for the fun. I thought the language barrier would make this awkward but it was really good !", "Just a comment to tell kiara\n \"You are the best Kiara! keep it up!!!\" \nThanks for the collabbbbb", "Kiara is the strongest one of the group cuz shes a multilingual BEAST. Kiara is #1!", "CAN WE GET A ROUND OF APPLAUSE FOR THE ONE AND ONLY MVP OF THE COLAB...\n\nKIARAAA👏👏👏", "Here... Here is the Real MVP, thank you kiara for making this collab possible!!!", "I love how you said \"Goodbye 300k subs Vtuber\"🤣😂", "Thank you for the stream Kiara! Hopefully you don't have to deal with any issues next stream. Suggestion: Use the option to play with mouse+keyboard, this is especially important when you play as an imposter because it allows you to react much faster and do stuff while running around.", "\"watch all our streams at once\"? That would kill my laptop. I'll just stick with yours Kiara ;)", "INA-CENT HAHAHAHA", "Look where the self translating land us now. An amazing collab that transcends the language barrier thats where!! You did such a good job, Kiara. Much love ♥", "That 300k sub burn to polka tho 😁", "that was a meme polka created to herself. So I don't think its a burn. She's enjoying it.", "24:00 Is the probably easiest task in the game. Yet the bird struggles. 草", "Just gonna repeat what everyone says. Kiara, you're the real MVP of this collab.", "The title wasn't a lie!\nThanks for the stream~✌", "1:11:52 timestamp for myself\nPolka: What's the english of \"Let's go!\"?\nKiara: It's \"Let's go\"", "Oh my this is gold XD", "that was really fun to watch, we are proud of our tenchou", "Why was Cali killed first so many times... :(", "Reporting for duty, Kiara Tenchou!!! i'm glad to see that you enjoyed playing with the girls, i also enjoy watching the video and hearing you speaking in flawless japanese, too bad you couldn't be the impostor in this video, hope you can enjoy playing with the viewers like you did with the girls, also i hope your headache is gone by now, take care and gg Tenchou", "通訳しながらプレイとか大変だったと思うけど本当にお疲れ様！\nまたみんなで色々やってほしいな、楽しかった！", "I cannot help but be reminded of XCOM whenever I see that loading screen.", "Kinda sad that I lost my bet; but this was a great stream, as always. Danke schön Tenchou!", "Poor Calli spend most of the game dead. RIP Reaper.", "Why kaiara's voice is coming just from one side of my headphones?", "キアラちゃんの通訳が有能すぎる", "キアラちゃん本当にありがとう！！おかげで楽しい時間を過ごせました！\n\nThank you so much, Kiara!", "thanks for the hard work kiara, your help with translating between jp and en is precious!!!", "Kiara is amazing. Never doubt yourself! YOU ARE AMAZING!!!", "the new greeting when entering a room from now on\nMINNA KUROSU", "楽しかったよ！通訳お疲れさまでした。そして真っ先に狙われる通訳。", "Today, I can proudly say boss. Top Right.", "Yo this stream was sick, I can’t wait for more Copland in the future", "面白かったー！\nキアラちゃんの通訳のおかげで、よりスムーズにゲームを進めれてる感じだった！\n配信楽しかったです！！", "You just became my favorite HoloEN vtuber! Your translations were great and you were a spectacular host!\nI look forward to seeing more of your work! ❤️", "Loving the live translations. That Oriends betrayal though lol. 1:06:54", "はなから分かってはいたが、素晴らしい武器(SKILL)だッ！！", "これからも心より応援してます🍗", "キアラちゃんが日本語と英語のかけ橋になってくれて、とても楽しく見ることができました。これからも頑張ってね。", "39:40 Blonde Group Meme", "I yet again could not miss watching any single one of you girls, so I played all of your streams on separate devices. Love you all!!!", "You have 9 devices? 😮", "@What a Simp KFP Navy Admiral Not personally, but I borrowed a few", "And grabbed my brother's phone in his sleep", "You know if you're gonna say this in every among us collab to each channel, it will sound like they owe you a favor", "I don't want anything back from them, I just want them to know that I am one of hundreds of thousands of fans who love them. I am sure there are thousands of others who do the same, but don't say anything, so I speak for them, too. But I do see where you are coming from, and hope they don't think that way", "MVP Kiara 👏 Looking forward to the next one as well as the possible viewer stream!", "I know many of mobile users here struggle to watch each povs, what I do is focus on impostor pov so I can catch up who's killed", "So many things to thank you for in this stream but I will just keep it simple and thank you for existing and being in such a unique position of being a wonderful bridge between Hololive EN and JP and to all the many viewers as well! Really appreciate you! 🐔❤️✨", "Well so much for O'riends", "Thank you Kiara for being such an awesome host! ♥ Top right chicken! ♥\nI had a lot of fun the entire collab! I really need to watch the other 6 perspectives I haven't seen so far!", "Thank you for doing a great work as a host between the two parties again. It was a lot of fun!", "You did great Kiara on the translations! I'm so happy for you!", "It was a great collab stream! Excited already for future collaborations.", "Kirara I am in Germany i wanna be friends ;w;", "I wish I could of watched it live.", "Those who were here for the awesome streams, who was your favorite Hololive 5th Gen?", "None of this would be possible without Kiara.  I'm really proud of her.", "Start 7:53", "This looked like a lot of fun; haven't played this game before but I've played a board game that's along similar lines of having hidden traitors.\n\nI hope there are more fun times ahead for you and those you collaborate with.", "The game and the stream was so fun!!!! I tried to put the 9 streams in different devices to saw it all but was a mess LOL\nI endly seeing you and the imposter of every play, was amazing LMAO\nAlso the way how you can translate and explain to the 2 gen was so good it make the conversation feel naturally\nSo thank you so much if this worked so well it was also by your way of translating.", "お疲れ様でした、キアラちゃんのおかげで凄く楽しかったです。", "Thank you Kiara for being the bridge between JP and EN!", "Kiara i love you!!! You're our MVP!!!", "I just imagined Kiara following Calli and Callie is an imposter", "It can't be the tsundere reaper", "Bruh how is she bottom left she is the bridge between EN and JP with her ability to translate, she's amazing.", "8:00 start", "Kiara: what did you say?\nPolka: how do I say \"let's go\" in English?\nKiara: isn't it just \"let's go\"?", "MVP SASUGA TENCHOU", "Kiara was a great moderator  XD", "300k vtuber bye bye! AH↗️HA↘️HA↗️HA↘️HA↗️", "I thought my headset was broken", "Kiara being the best live translator! You Rock Kiara!", "Kiara MVP translator <3 thx so much kiara chan", "Good stream, Kiara. Hopefully you can solve the audio problems before your next stream.", "Sasuga Phoenix, translator of the game.", "コラボの幅がぐっと広がりましたね！おもしろかった。", "Kiara Timestamps:\n\n19:54 First round (Gura and Lamy)\n21:06 Discussion (skip)", "BEST 3RD IMPOSTOR, CHAT BANISHED KIARA INTO THE REALM OF BOTTOM LEFT!", "鳥リンガルってコメント草", "Thank you Kiara for all the extra work throughout the collab translating", "having separate audio channel is a very smart move bird", "300k Vtuber bye-bye.", "Translation Queen!", "Did they start early, or did I just set my alarm to the wrong time? I opened up stream and they only played for a few minutes longer =[", "You were an hour late :(", "Actually i think its a good idea for kiara speaking voices came out from left speakers so she wont mix her voices with others..", "i woke up just in time to catch everyone saying good bye. Now to watch the archive ", "Ich bin nur hier weil ich gesehen hab das sie deutsch kann xD", "Great job doing all that translation work!", "1:11:42 Let's go!", "poggers bird!!", "I die a little inside anytime they take the long route to bottom o2", "Kiara being the avatar, the bridge between two worlds", "キアラかわいいなぁ。日本語話してれば会長みたいにすぐうまくなりそう", "I have to say Kiara is the MVP of this collab", "Thank you for your hardwork\nIt was super fun", "Kiara literally has a dead child on top of her head", "W-... what?", "Pour one out for aloe that shoulda been here 😔", "Yabai OMG !!", "キアラのおかげでJPとENのコラボが素晴らしいものになったと思う！", "Everyone getting Overshadowed By The Reaper ☠ keep getting herself Killed , even her PC decide to kill her too Lol 💻🦈🐙🐔🕵🏻🦁🎭❄☯", "Nooo me quedé dormido :,c no sonó mi alarma", "01:03:50 300K vtuber bye bye.", "Your translate was so good ty tenchouu ", "The bottom left audio centering tho.", "地獄みてえな企画", "I missed it   damnit", "Why is my left ear only hearing kiara", "Did callie stream? I dont see her vod?", "Her stream cut off a lot because she has a bad setup rn until the vod was reduced to 12 mins(?) and she really wasn't having a good time", "KIARA MULTILINGUAL FLEX", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "well it really wasn‘t her!", "Man Kiara is just playing dumb. Having control with different languages makes you smart. #KFP", "人間は音や光に過敏だから音量調節したほうがええね\n嫌がって離れちゃう人もいるかもしらん", "Aww. They didn't set it that if they launched someone to space, the game would tell if she was an imposter or not?", "More fun when its off", "Ye, it's better without. More suspense.", "Ye, it's better without. More suspense.", "Kiara is so bottom left her audio is also bottom left", "Kiara the true MVP", "12:44\n15:14\n35:57\n39:32", "左側からキアラガチ恋距離ボイス助かりすぎる", "Darn it I slept past my alarm 😖😣😵", "日本人\n↓\n↓\n↓", "my right ear is liking this.", "Translation MVP, you'll get Impostor next time!", "グッド ジョブ👍", "Kiara never heard Calli say she wasn't the imposter.", "Ofriends......", "Takamori too pure to be killers", "MVP Kiara", "Wattoson kun lol", "39:02 Kiara opened cam to see Polka vented\nAlso Kiara: I don’t know what that does help me", "I was expecting to purposely mistranslated things to her advantage but sadly no chance. :(", "I think she takes too much pride in that to break that trust for a game. And I think it's overall more fun if everyone can reliably understand each other.\n\nThen again, she was never the imposter, so there was never a reason to anyway.", "Yeah no opportunity there'd be no point mistranslating if she's crewmate", "What a fun bunch of people", "missed it by 16 minutes T_T", "Same :( when I woke up the stream was ending:(", "Kikiriki", "I didn't complain much about it during the stream, but the sound issues were rough. Hopefully you can fix it for future collab streams. Still had a lot of fun regardless and appreciate your translating and cementing yourself as the true bridge between HoloJP and HoloEN.", "Yahallo", "this is why the world can't have good things, because of idiots", "Kiara is the best in collab. She connects the two worlds together. Imagine no kiara here, All hell break loose."]