["When I watch Kiara's stream,I can understand why overseas bros like pekora although they don't know japanese very much.(I'm ajapanese and not good at English.)", "It’s all good, bro! We understood you clearly. Kiara and Pekora are amazing girls.", "just like you listen miko's  English   you dont know what she say but it so cute  so......", "Something that helps channels like Fubuki, Watame, Pekora, Korone and others is that they have live translators in the chat", "Yeah, we understand you jp bro. Thanks for sharing your thoughts.", "Waifus unite the world!", "Pekora is just overpowered", "Hi JP bros...booth of them is amazing", "Considering Kiara really loves Pekora make more sense to your message", "KONPEKO is just an universal greeting that touches your heart.", "What a group of chad bros its enough to make a grown man cry.", "Pekora and Kiara both have a love for their fans that transcends language boundaries.", "Hell yeah! Gotta love waifus bringing us together", "Okay, so now we know why they're constanlty replacing the guard rails and crash barriers on the Autobahn here in Germany. Thank you, Kiara.", "Kiara: Falls on Warios Gold Mine \nAlso Kiara : VERDAMMTE SCHEIßE ALDA!!!\n\n48:44", "Time stamp pls", "Lmao", "Can you translate what does it mean pls?", "The reason why KIARA worse than  solo stream is that She is having too much fun collaborating with Ina.\nキアラがソロの時より下手なのはイナとのコラボが楽しすぎるからに違いない", "True", "\"Lets see what you can without your workers!!\" i never thought id hear Ina make such a aggressive   voice", "It sounded like a line from a movie right before a huge fight goes down lmao", "Mario kart truly does bring out your hidden demons.", "The winner here is the audience: Kiara in swimsuit really soon.\nKFP!", "44:09 Kiara: \"Oh you wanna do 1v1 huh? Lets take it outside ina!\"\nIna slaps Kiara with calli's wine\nIna: \"Tekidanateme!\"\nGura: \"Nani!?\"", ">Calli sips red wine\n...\n>Calli starts kicking Kusotori too", "Is that a jojo reference", "When Kiara rages you can cleary see her German Origin.", "that's the best part , lmao", "48:20\nPetra with another act of betrayal against Kiara ", "What Kiara is saying in German at 1:00:14 ~ German technology ~ Light and speed ~ Energy ~ Hope ~ Quality ~ Tires ~ Cars and bicycle", "That small pekora laugh in the Background though", "GERMAN TECHNOLOGY IS THE BEST IN THE WORLD!!", "What french gaming console had the last mario kart on it´ system. Nitendo Oui", "Dude seriously i always see you on a holoen clip or archive\nAre you a simp version of Justin Y?", "@Ammar Abdullah ¯\\_(ツ)_/¯", "@Ammar Abdullah Justin Y also shows up on those loo", "Day 7 of commenting on Kiara's videos to help her with the yt algorithm", "Kiara: ina your too good, your fired\nIna: but I don't work for you \nKiara: would you like a job\nIna: anything to help a friend", "For those keeping the stats: It's an 8 - 4 win for Ina. I guess we will have another round of layoffs\nOn the plus side: Kiara won the bet for a swimsuit drawing from Ina", "Multistream synchro guy here.\nStart with this stream, at 0:03 run Inas video.\nI'll try to provide for future bigger collabs.", "48:40 proud german \n😂", "Ngl, that \"oida\" almost seemed Austrian.", "@Faking Is that actually confirmed?", "@Faking Oh, I just thought that she might have mentioned that in a stream. If it's just hearsay rumours then I'm not interested anyway.", "@Weeb Extraordinaire It’s not really hearsay. She said German is her first language so she’s most likely either German or Austrian. Her accent sounds either Bavarian or Austrian. It’s not prying to come to conclusions that she herself has left purposeful hints for. It’s a different story for Ina and Gura who haven’t left any hints to their origins but people are still trying to jump to conclusions.", "Kiara everytime i watch your stream, i cant stop smiling and laughing because of you!\nI cant wait for my  monthly salary so i can join member of yours!\nThanks for this hillarious stream\nI never missed your stream, and cant wait for the next stream with nene!!", "La fenix quemando llantas contra el pavimento.", "5:09 Ina's anime villain voice comes out", "Kiara's stream: Bottom left\nIna's stream: Bottom right", "3:20 start", "Un mes ha pasado desde el debut de hololive en, y ya se nota que cuando hacen collab las chicas se sienten más cómodas, ya bromean, platican, que bien por ellas ya entraron en confianza", "This is what 500 hour on autobahn does to a chicken", "Swimsuit POG. Nice wins Kiara. Thanks for the stream.", "Loved the collab kiara and ina are so fun together. Hope to see them more in other games too.\nAlso as an KFP employee... Can I get a raise please kiara 🙏😁  thanks.", "Where's the time stamps guy", "Gone 😔✌️", "Went to Brazil😔🙏🚶✈️🇧🇷", "@Felix Villasanta LMFAOOOOOOOO", "Maybe you are destined to continue the legacy", "@Squirtle Squirtle maybe I am", "Honestly I can only imagine that the only reason the kfp crew is getting first place instead of Kiara is that their doing it for her honor and leadership", "CHICKEN SWIMSUIT HYPE", "did she win? I couldnt finish the stream", "@Lucius Ina said if she won \"just once\" she can get a swimsuit", "@secret_simp_account time stamp?", "@Francesco Paolo Naour Gonzalez 32:37", "Kiara's driving is just like her idol", "I live for these Mario Kart 8 DX streams from Kiara. 😂🤣", "You mean mass firing streams", "great stream kiara, i watched it when i was driving and looked like a mad man at stop lights laughing", "Ina vs kiara\nWinner : viewers\nBird swimsuit coming up!", "Vgamer, you're a hero xD", "I love Kiara's driving lmao", "Much love kiara 💜\nRise up, and don't be discouraged!", "May things always turn out the way you expect, same for peace, love joy and happiness.", "More Takonashi would be amazing, I love your dynamic", "Kiara plays like me before I figured out that you have to accelerate while drifting... pain peko", "The people that waited for kiara so she could finish the race: good soldiers follow orders", "Be proud of yourself\nI have faith in you!", "I only have one question: will we see Kiara in a swimsuit or not?", "german driving......yeah sure xD", "3:19 Start", "I can't believe I missed this.", "Please keep doing these.", "Kiara is so expressive, I love it", "KFP employes be all simping for kiara", "IM HERE FOR THIS INSANE CROSSOVER", "Kiara found a reason invade Callie lessons totally coincidence 😏", "What a good stream, very funny, sasuga Tenchou and Ina ", "59:44 wha", "This is totally off topic and I know I'm just an overseas guy so I don't know much but. I don't know if recommending a game would be appropriate but I'd like to see some of y'all play Ghost of Tsushima (Sorry if I mucked the spelling up).", "I've been waking up so late recently I've been missing all of Kiara's steams 😔", "They raced on Neo Bowser City?!? If I'm up I'll join the next Mario Kart stream and hopefully get that track. I'm unbeatable on that track!", "New sub", "It's just another unfortunate day that's all. Next time you'll show everyone that you're the best for sure. o/", "Ina learning crowd controle from tenchou dono ", "why so short? only 1h?", "Kiara you need to activate auto-steering. You're falling too much because of this, I think you have it off.", "KIARA I LOVE YOU", "Kiara for birds sake just, please learn to do tricks after jumps", "Kiara doesn't fire her employees... She permanently lowers their salary to zero.", "you guys have such well made thumbmails. who is drawing them?", "Ina herself )b", "Your videos always make me happy", "☺☺", "Hey kiara, ich bin dir sehr ähnlich vom Charakter her und wollte bloss sagen, dass du super darin bist andere Leute mit deiner Energie mitzureißen. Du kannst mehr als du glaubst, du siehst es bloss nicht. Liebe aus der Schweiz! 😁", "Why does the bigger gay one (Kiara) hate rainbow road?", "I didn't watch the full stream but someone pls tell me if vgamer showed up", "yes. He joined the race and sent SC too", "And finished behind kiara, sasuga vgamers sama, employee of the week", "amgry german chicken", "O", "I wanna root for you kiara but you’re so bad at this :(", "I mean it’s all about the great content and laughs she doesn’t have to be #1 on the game it’s the same with other games", "@Richie_77 i know that, im just sayin", "Welp, our bird won the swimsuit. This is what matters.", "It is nice to watch Kiara enjoyed to play the game with Ina in the steam. And some players were so nice for her that they'll wait for her to finish the race, make sure she won't take the last. Now I am excited she will play with other HololiveJP vtuber tomorrow, because we loved her voice and interactive in her channel.", "Anyone else feel like Kiara's getting in her own way by streaming at bad times for the US demographic? Like, no matter where you are in the US, most her streams so far have been between midnight and 7:00AM? I know they're not the only market, but can't help but notice a ton more viewers/views on streams that are in the US evening than the ones that are at 5:00AM. Add to that her first big solo LP is an JRPG, which is both a major time commitment and will never get the pull of some shorter less niche LPs... like, Kiara's great, but it sucks she's getting less views due to these two factors in spite of her great persona.", "she lives in japan lol", "She could still get views from the archive", "@Kolton Chapman And? that would mean she's streaming between like noon and 6pm. A ton of Japanese streamers stream in the morning there to get prime time global numbers. She has said on stream she stays up super late.", "@AlphaBagel True, but the whole benefit of the format is viewer engagement. Probably a ton of fans that wont watch what they can't catch live."]