["Kikkerikiiiiiiiiiiiiii!!!", "So. You've arrived.\n\nI never expected you to be here, but I'm glad to see you♡", "Goddamn I can’t believe you’re here.", "Lol", "The end is near", "lol our senpai of culture!", "@Jason Visto i totally expected him to be here", "Rough Time Stamps in Reply\n[Time stamp under construction] I'm a bit behind so it might take a while. I'm still working on the minecraft play-through streams. Will finish those first.\nFor now:", "Rough time stamps - From Kiara Fan Discord - Thanks\n1:31 ShaKiara\n2:56 drumstick as a light stick\n4:37 BGM is off", "2", "3", "4", "Damn you work fast", "you were this close to her saying Whats up dog! hopefully next time", "thanks man you're the mvp", "@Andrew Gomez Mission failed, we'll get em' next time", "Captain I missed most of the Stream due to adulting, did she mention why we are going to be eaten?", "Hey, I don’t want to cast doubt here because the whole community loves what you do, but are you sure you haven’t bitten off more than you can chew? I can’t help but notice you have a 3-day backlog of unfinished highlights. Would it be better to be somewhat selective of which streams you highlight? I don’t want you to burn out, and I’m sure nobody would blame you for taking a day or two off here and there.", "@Goreishk I don't think so. Afaik she is just growing us to turn into KFP buckets.\n\n@Vgamer311 No problem. I've just been a bit busy. Gameplay streams are a little harder since Kiara's attention span is measured in seconds and she has some godly comedic timing. Super chats/talking streams/Karaoke is much easier. I'll probably be less detailed on her gaming streams to speed things up.", "Thank you for your service Sir", "ty, you´re the best!", "@Captain Pepperjacks Theres a discord server?", "@Jared Perez discord.gg/kfp", "@Captain Pepperjacks Thanks", "If youtube have a feature where you can give award like in reddit, you got my gold award.", "Kiara: I don'want we grow too fast \nand they're basically top5 subscribe growing", "Kiara i  really love your voice,its like something i need in my life was fulfilled :3", "her voice is really cute lol", "When she first spoke I finally felt emotion for the first time in months", "I could listen to her talk about nothing for hours and be entertained.", "I'm currently simping over Amelia and Kiara rn I really love their personalitys", "I'm not going to lie, I was extremely happy when Kiara spoke a little bit of Italian: I never  thought I'd hear a Vtuber speaking in my native language...", "When does she speak it", "16:45, featuring Mamma Mia.", "Omg fellow Italians!!", "Not something you see everyday indeed", "@Artic Berry la mia stessa reazione quando ho visto persone rispondere a questo commento.\nfan di hololive italiani sono rarissimi da incontrare", "I really need a vtuber that can speak french...", "Altri amici italiani! :3", "@Mr. X altri fan di Hololive Italiani!!", "@maxiamy siamo più di quanti credevo! Nelle live chat e nei commenti delle hololiver giapponesi non ho mai incontrato italiani", "Mr. X esattoooo aha pensavo di essere l’unica scema e invece...!!", "@Artic Berry già è un hobby di nicchia guardare Vtuber, poi io che frequento gli stream delle hololiver con meno sub (esempio: Mel) avevo perso ogni speranza", "I love that one chat when Kiara starts speaking Italian and that guy be like \"Mademoiselle Kiara\" (which is French). 😂", "1:59:40\nSuperchat: \"I also appreciate your refined sense for yuri ships.\"\nKiara: lewd face", "The hehe was so fuckin cute", "What do you call a caretaker of chicken? Chicken Tender", "Of course man", "@Taylor =D", "@Casual Filth Im still here =)", "That was terrible. I loved it.", "I can't stop lookin at those chicken drumsticks, sooo delicious", "Un-ironically, they look tasty.", "True", "True story guys: i feel so empty these past few weeks feeling depress, one day while i was browsing the internet  i stumbled upon a shark saying A meme  and then i got too curious and found this hololive thingy it got my interest right away because ive never such thing before, ive seen all the other holo en already and i find them all unique individually but there is one girl who caught my attention and that is kiara shes the only one that made me trully happy and i find myself unconsciously smiling i mean all the other girls gave chuckles but only kiara lighten up my mood i feel so lucky about finding your channel kiara i also feel bad to other people that still doesn't know about you thank you for your existence majestic chicken KFP!KFP!KFP!❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️❤️", "this one started too early for me, archive gang", "Started at 9am for me so naturally I just stayed up to watch it. Sleep is optional, after all.", "I sneakily watched it at work. I'm a rebel.", "I've lost it even she started at 15 lol", "I agree with Kiara on how she feels about being the only 5 for gen 1 holoEN. It feels special and i want them to grow a bit before they introduce a whole new cast. I want to know more about them and have them settle in before we get a whole new wave because at that point we wont be able to watch everyone anymore", "does that intro confirm that Kiara is in fact Hololive's emergency food suply", "flashbacks to Excel Saga", "Funny how I was playing Genshin while watching this and I was at the dialogue having to pick saying Paimon was emergency food supply when reading this.", "@Yuen wait u know Geinshin has a backdoor hack right \\(OAO?\nIt becomes quite a big news in Asia, somebody's twitter&PSN  got control by that!", "@Zeta Only 1 person among the hundred thousands of players? First time I heard about that. I did hear about a kernal lvl anticheat but that's all. Luckily I don't have my Twitter bound to my Mihoyo account or if that's even possible. And I don't use the PS4 version of GI.", "Gosh, when I watched the stream, I was right on time for the gushing about Calli part.\n\n#TakaMori", "F.  I went to work when she started gushing, but I'm glad kiara is doing timestamps so I can just continue on!", "1:03:18 Kiara Thighs Part III: The Resurgence", "Chimken drums to the max", "It's nice to have streams like this, just listening to you chat about anything. Your voice is really nice to listen to.\nMy candle suggestion was something I was thinking about for everyone in holoMyth; a scented candle inspired by everyone's theme. Candles are just nice, is all, but my Mom has said 'no' to candles in the house because of the fire risk, though I'd be a lot more careful than my sister, I'd promise her that. Also, visual experiences enhanced with scents actually goes back a ways.", "shes lewding herself with those things she likes about herself", "I know chat was goin crazy 😂😂", "just here to put my super chat times and she answered! thank you so much!! I proposed the Nuzlocke idea in Superchat but Idk if anyone else said it first in the regular chat. Sorry if you did, the chat is disabled right now but I will correct if someone says so.\nNuzlocke convo - 21:24\nRead my Nuzlocke Superchat 1:53:23 ", "I hope none of them collab with the other EN vtubers tbh... luckily most are on Twitch so its no worry for now", "@DaGhost Rathir ???", "@Andrew Gomez I've no love for Ironmouse and the like... I also find their content subpar at best. Just my opinion.", "We would love to enjoy your eyes more but you close your eyes a lot. Also you didn't bring up the boing boing.\n\nedit: Maybe you can have a sign up sheet for interest of who wants to collab with you.", "🐔👄 Kisses Timestamps:\n\nNone this stream! Correct me if I'm wrong.", "Kiara's italian part translated for anyone curios from 16:45 onwards:\n\n\"Pomodoro\" = literally Tomato", "- In Italian CHIARA is a common name, Kiara is , i think, written in German, but is the same name. \nA big CIAO! From Italy! :3", "@Kirby635 We need to ask some germans if the name is written like that.\nI'm a fellow italian too, one of the few here", "Why did %50 of it look like Spanish?", "@Toaster PAMA  Because Italian, like Spanish and French, is a romance language. All romance languages derive from Latin.", "Also a lot of english speaking native people tend to confuse between this two language (SMH).\nWe share some root similarities but we are 2 different languages in way of speaking and writing\nLike japanese (and unlike english), italian words have the same pronunciation as their writing, what's you see it's what's you should read", "Kiara, the moment you went \"Wao\" on your debut stream, I knew I was inlove with you. Please keep it up. You're the best.", "The whole Thanksgiving and Phoenix lore at 1:24:36 is not even Bottom Left  anymore, she's digging her way out of the chart", "Today I woke up having to run somewhere so I missed the stream, then i saw Kiara liked my (admittedly bad) drawing of her on twitter, so I just had to come watch the archive. Our cute phoenix made my day!\nAlso looking at the closeups of her... boy I really need to redo my drawing someday, so many glaring mistakes lol.", "50:20 \"I've been to\" but it's the cutest thing your ears will ever hear.", "I love chit chat streams they’re really fun and chill. Plus, I don’t hafta fully keep my eyes on the screen, so it’s more convenient!", "Kiara is such a wild card. I think she should be in the middle of the chart", "What you mean like bottom middle?", "Well certainly I learn some lore about Kiara. That was certainly a deep conversation. Thanks for the stream....Auf wiedersehen and Danke schon.\nStill that thanksgiving part,  uuuhhhhhhhhhh...Yup,  I definitely protect her just so that mental image won't come true.", "1:23:00 - IF YOU MESS WITH THE CHICKEN, YOU WILL RECEIVE A BEATEN", "The day you stop laughing we are all doomed. Your laugh is too precious", "The things she says in Italian at 16:45\nTomato\nGood morning\nHere is your fork", "Thanks a lot for this chit-chatting livestream! It's great to hear your stories and learn more about you and the others! You are really so sweet, Colonel Kiara 店長! 🐔❤️✨", "During the course of this archive video i choke, tripped, almost dropped a dish, all at different times. I hope if i die laughing Kiara can find some way to revive me.", "19:03 Yes Yes Yes !!!!", "Kiara's streams are always so wholesome. Lovely birb.", "Enjoyed the stream! The part where you talk about your fellow EN members melted my heart with the amount of wholesomeness ", "Let's us all be nice, and cheer for her, I dont want to see her cry again", "Fuck you kid", "@Bevlin _ oi. One more misstep and ima turn ur ass to fucken fried chicken", "Streams are such a bad time for me, man I wish I could watch live more often", "Dammit I missed it. Freaking meeting", "Kiara, watching some experience minecraft for the first time has been a pleasure.", "I'm crushing on Kiara HARD.", "I missed it cuz it was so early in the morning 🥺, hope y’all had fun live tho.", "33:11 my bookmark", "I'm excited to watch your collab streams, and hopefully you'll keep up the self-dubbing for us when you do!  I'm willing to bet that will be a huge help for all us EN fans :D", "Aber du klingst so süß, wenn du Deutsch sprichst <3", "Kfp rise up!\nSad i didnt wake up in time for it but glad i can watch the archives at least.", "Her voice is sooooooooooo cute and lovely. ", "Cozy chat stream was nice, cheered me up today ", "She was destined to be a vtuber with all the adorable sounds she makes with her voice", "1:14:29 Just like you said Kiara, gaining more experience in collabing before doing some major collab stuff with Pekora is a great idea. Your Minecraft playthroughs are fun and you can think of some cool prank ideas there so you can have small collab(s) in game with her before anything bigger happens just like Pekora had some hillarious pranking with both Subaru and Shion Senpais recently. Pekora's casual unplanned pranking is great and she lets others prank her as well in return - you could do similar stuff. This way there won't be much pressure on either of you. I'd love to see you teaching her English though. You know she wants to learn from you and I believe in your ability to plan some really fun stuff around that idea.", "Thanks for bringing happiness to me", "I really love the personality of Kiara", "Kinda new to this hololive stuff since i can't understand japanese i follow the translations,but i gotta say this is  wholesome as heck,especialy kiara and gura,this is a positivity i kinda needed,so keep going with tue great work", "Looks delicious and the chicken too.", "1:41:05  BOK BOK BOK moment.", "honestly surprised KFC hasn't asked for a collab yet", "This entire stream was precious 💗💛💙", "今日も絶妙なトークで僕達をたのしませてくれてありがとうございます。キアラちゃんは英語も日本語も出きるし理解してくれるから凄い嬉しいです。後は特有の耐久とかもまってます。のどを痛めない程度に頑張って下さい。そして、マイクラもどんどん進んで楽しんで下さい。セクシーキアラちゃんもビューティフルです。", "Start Pokémon’s from your latest save for sure.-.", "Please be careful. Genshin Impact slapped your company in the face & even censored Coco's name in the chat. Maybe you should ignore the game instead of begging to play it & make people start blaming Coco & Haato for it.", "Hidden SC rick rolle at 31:15\nShe read it at 1:55:13", "1:03:40 Kiara: almost shows her boing boing\nMe: \"NO! NO! NO! NO! NO!\"", "Almost?", "1:24:44 A little bit of vore lore.", "Chitchat but there's... No... Chat? Wot? :o", "I think a Pokémon play through should start from the beginning. Pokemon games are about the journey of you and your Pokémon, after all. If you’ve already played the game it won’t take that long to get to the DLC.", "1:00:40 CUTE KIARA", "Danke schöööön~  :3", "Tamago", "She's been in Turkey, she needs to go to Peru. Both countries share a name with a bird. Is there another bird country? Angola?", "Did kiaras hats and chicken get cleaned?? They look a whole lot more crisp and clean!", "Great stream as always ", "Make more", "2:02:27\n\nI just want to clarify:", "Honestly even after I heard her response, it didn’t occur to me that the chat could have been interpreted as wanting her real name. I only saw the potential problem when I read this comment.", "Kiara says she's not a good cook and lists off like 10 dishes she can make from scratch, but the other HoloEN girls say they're good cooks and then list like nothing", "Calli and rice, cup ramelia are the two I know of.", "1:24:43 hol up", "Wholesomeness uwu", "🍗", "Hello Chicken.", "😀✋👍👍👍👍👍very beautiful THANK I LOVE YOU❤❤❤❤❤💯👈", "I eat KFC today", "I wish I could join membership but the join button isn’t appearing for me.", "For me, my credit card doesn't work...", "Welcome to the \"Vgamer311 get shot down compilation stream.\" Please enjoy the following highlights:\n1:43:52 - Refuses to use my beautiful and graciously made thumbnail.\n1:54:22 - Probably wont play my all-time favorite RPG.\n1:56:09 - Implies I should donate less.", "10/10 Vgamer311 highlights", "Lmao you and captain pepper jack are hilarious to read.", "@Aqua Freesh Its an honor to be put in the same category.", "oh cool.  i didn't notice the member badge would show on comments in the channel. neat.", "But for real though:\n\nQuestion: “How likely are you to use my thumbnail?”\nAnswer: “I saw it.”", "【google translate】\nDon't worry about turkey day.\nIt's safe until your store's Fried Phoenix is sold out.\nPlease prepare a lot.", "Thanks for the stream LA KIARA", "", "🧡💚🐔", "", "", "1:01:10 Y...yes Kiara the feathers are pretty\n1:01:35 Y..y.. Yes Kiara ;;;;;;\n1:02:35 Aaaaaa.......\n1:02:58 SPARE ME PLEASE"]