["Kiara: \"When the hell does Amelia ever sleep?\"\n\nAmelia during collab: Sleeping", "She and Calli can take turns sleeping on each others' shoulder", "Amelia: I don't like Minecraft. \nAlso Amelia: I've been playing off-stream the entire day", "Tbf we've all done that", "i get it, before i played it i didnt think to much of the game but it just gets addictive once you start doing projects, i made the school from harry potter years ago and  that project alone took my along time, not even counting all the time it took to collect the materials", "@David Melton Hogwarts", "I just hope she dosnt play it so much in a small amount of time that she end up burned of so much minecraft.", "Lets be real here, Amelia is a Gamer with a capital and hard G.\n\nEspecially because of her toxicity.", "That’s because she’s only played by herself, and I think we can all agree that playing with friends is infinitely more fun.", "@IDKmyBFFJill Dude she's a gamer with a hard r.", "I feel like Amelia's the type to play off-camera then the moment she's live, there's an entire automated nation behind her and she's like \"Yeah... So I've been busy...\"", "Ame really into minecraft now", "I quit my soul crushing job to play minecraft professionally about 10 years ago. I try to downplay my fame.", "When did she say that?", "\"I actually wanted to do more than just a field.\" - Takanashi Kiara, KFP CEO. \n\n☑️ Killed 3 Waves of Pillagers\n☑️ Killed 2 Witches", "she is a true part time warrior", "Abtimus Prime Indeed the Protector of the Hololive EN Empire 🗡🛡", "Pretty sure Enderman has a thing for Kiara. He’s been clinging to her alot lately", "Don't forget the quest for potato", "@Eh Enderman-bro even attacked Watson because she was getting too close to Kiara (is a joke)", "@Abtimus Prime And she always discredit herself, only time until she will realize and I will wait for it.", "@Eh Death seems to cling to Kiara no matter what realm she's in.", "Gura however: 3hrs = made a door.", "@Corvideus Crow Amelia: 6hrs = made a railway system", "@Abtimus Prime Minecraft really is basically an outlander coming to save innocent villagers from dangerous monsters wielding strange powers and knowledge of advanced technology.", "I'm kinda happy to see the other girls join offline to work on their little things. It's nice to know they have genuine fun with this, not just for the stream. Like I kinda didn't expect Ame to play this much offline but she seems really into it! Hic", "Ame is secretly a minecraft addict", "@Keeys remove \"minecraft\" 😏😏😏🤣🤣🤣", "Yeah kinda surprising to see Detective Amelia \"i dont really like minecraft\" Watson", "@Holo TheWise Wolf Yeah, she's a dopamine fiend for sure. Introducing her to Minecraft will either be a beautiful or a terrible thing.", "Dudeee she tidy up that long ass tunnel! That's dedication!", "Ina seems to have played offline a bit too. And of course she made the cutest little home ever, for her and her horsey.", "she stream minecraft for 5 hours... 5 HOURS", "Ame just did a 6hour Minecraft stream, she's definitely NOT addicted", "Kiara cowering from the pillagers for 5 minutes to massacring three waves of them later in the stream is the biggest character development I've seen ever oml", "Kiara for most wholesome girl. Hopefully most of what I say is not needed to be said. I am not an expert in any of those, just a fan, I can be wrong!\nIt's easy to forget there's a person behind the anime girl, so some people can be overly cruel. Do not take it to heart we all love you.\nSome other things are just that tone, jokes or sarcasm can end up not translating well into text.", "As for minecraft specific tips:\n* Water multiplies: A empty block becomes a water block if two of it's adjacent blocks are water. use this to fill the farm trenches.\n* Water moistens 4 tiles away from it, so the farm trenches could be 8 wide (dirt) and be all watered. They said 4 because water spreads to 4 tiles far.", "i hope she sees this. i get worried about her haha", "@Misah Edwards Yeah, another thing I didn't address is the whole cali being tsundere thing. It's clear that neither of them enjoy that, you can see how cali feel bad about being mean to kaira every single time, and I doubt kiara enjoys that. They should speak with management about that.", "She have phoenix heart that's for sure", "I've seen it happen to other EN girls where people are overly critical. One person said \"Hololive hates Europe because they don't use European times for their schedules. I can't believe Americans are so ignorant like this.\" They could have very easily just been like \"I've noticed that most Hololive EN members don't include European times. Could you please add them to your schedules going forward for us?\"", "@Guedez I don't know , seeing Kiara suffer is one of the most entertaining things I have seen from HoloEn.\nWhen Calli shut her up in their collab saying \"No one cares\" I laugh so fucking much that it made me come here to watch this stream to see if Kiara suffers more.\nShe just needs to roll with it and be the Aqua of the group.", "@MangaDevourer This kind of thing only works for anime where no real humans are involved. It chips you down slowly.", "She probably watching Netflix last night and didnt sleep. Like she mentioned before.", "@Necromancy For Kids They sound like entitled weenies lol. Probably just trolling or something especially with that jab. Archives exist anyways so.. And the girls need to sleep too", "@Guedez that is no excuse to act like a brat and disturb the general tone of the session.", "Well said.. it's also good to remember that breaking 300k in one month on youtube is HUUUUUUUGE", "@zero9112 Not sure what you're referring to, but I'm pretty sure she can do and act the way she wants on her stream. You/We have no say in it. You have a say in whether you like it or watch it, but that's about it.", "@Sarcasm during the Minecraft collaboration she became distant for about half an hour from the rest of the group after Mori made a teasing remark about her. She even moved her on-screen avatar away from the other girls. You are somewhat correct about her being in control of her channel. Her audience is not entitled to dictate her content , that doesn’t mean she is free from criticism. It is clear from past videos that she does not perform well under pressure, there is however no incentive for her to improve since her general fans will support her out of pity.", "I would like to caution anyone trying to help not to act on speculation. There are so many ways this could cause more harm than good. Maybe even create problems where there were none before. Instead, assume she is mature enough to seek help if she needs it, encourage everyone to stay civil and enjoy the show.", "@zero9112 Mori did the same a lot at the end due to being sleepy. Completely zoning out, avatar being \"stuck\" as if she wasn't even there. Amelia went trekking somewhere completely else for who knows how long and didn't talk much. Neither of those bothered me and Kiara being slightly embarrassed and \"hiding\" didn't bother me either, not to mention I saw it I as something that was for comedic effect as she kept dying. I didn't even notice any distance... hell, I just now went back to see that part where she moves the avatar and she moved it for about 4 minutes. Before that she talks about how you can make a cake, gets blown up by a creeper, then is a bit bummed out she had not slept in the bed, says it'd be nice if someone picked her stuff up, jokes about how it's a good thing her enderman roommate is finally gone (as she spawned far away at her house), then she moves the avatar, runs back for about 4 minutes, moves it back and immediately starts discussing how they've made progress and are at \"850\" in coordinates or whatever.", "@Sarcasm I like her but I don’t love her. To be fair, I don’t love any content creator since they are only presenting a fragment of their life. I don’t like how her fans “love” her since it feels too much like a literal idol. It feels like overusing a word that is supposed to convey a rare, strong emotion will make it less valuable.", "@zero9112 That's fair and I definitely get you on that. Fanatism and especially obsessions tend to get.. scary and irrational. :S (Like the reported irl stalking after past infoleaks)\nSame thing with hate.. strong enough emotions tend to get irrational and \"blind\" to logic, resulting in either blind hate or blind love (and like you imply; that isn't actual love.)", "We're not gonna talk about how she's holding her siblings in her hands >.>", "The strong will survive", "@Zenith survival of the fittest plus live chickens eating fried chickens are normal", "We got used to it", "For the longest time, I thought  they were lighter coloured drumsticks dipped in dark sauce, but I just realized that they are dark drumsticks wrapped in light brown paper", "4:21:25\nMama Phoenix so sweet, she watched the stream with us viewers for 4 hrs\nalso, she must have seen also our chat towards her to say hello after kiara told us about her mama might be watching", "Mama phoenix , is amazing 🔥", "wait that means she watched Kiara screaming, suffering, and just in general losing her mind for 4 hours, since Kiara said she watched the super Mario stream, lmfao", "@Owen Yin always have been , 🤣", "Kiara : \"imagine how bad i will be in horror game\"\nSuperchat : \"it's a tradition to do 3d horror game after you get 3d debut\"\nKiara : \"no, i won't do it\"", "Why does it feel like this is definitely happening in the future.", "@Vamerik Parazygone Considering how ruthless pekora is well...", "It seems we all know how the Pekora/Kiara collab will end", "@Desocupadification Its gonna end with Pekora having to do 3d horror game after losing horribly to Kiara.", "TIME STAMPS (continue below)\n\n02:06 Kicky Ricky\n03:40 shaders and PC kun", "1:35:43 L E W D\n1:38:37 BOOM RIP\n1:49:45 fence for farm, potatoes\n1:53:18 no new pc", "The timing is like 10-13 seconds off. I'll fix it later.\n\nAlso i'll add the super chat section later because i was just listening in that part", "I'm gonna comback for the time stamp again , keep it up hero", "Thanks for your hardwork man", "The Hero that everybody needed", "Time fixed and added highlights for super chat.\nThe last one was super sweet", "Have you read the LN of Spice and Wolf or did you just watched the anime/read the manga?", "Not all heroes wear elytra", "@xxDIZxx watched the anime and read 8 volumes of the novel. I already bought until 21+sequel but i'll wait the winter to continue it", "@Holo TheWise Wolf I have all of the volumes up to 21, I haven't started reading 18-21 yet since I'm waiting for volume 22 to be translated to english. What do you think of the story so far?", "@xxDIZxx well, i love it. I started watching anime and reading novels thanks to S&W\nAs a person that loved reading more \"classic\" books, i always tought of japanese novels as awful or just a bunch of fanservice. S&W changed my mind.\nI love how the characters interacts each time in a new ciry or with new characters, and Holo is pure gold", "Thanks", "助かる", "@Holo TheWise Wolf I also loved it but I think the most frustrating thing for me was how long it officially took them to get together but I get why it took so long. As for the anime I still haven't watched it but I think season 1's op song fit very much with the story.", "Anyone knows the name of the shaders she is using?", "Nvm i found it", "36:44 3:00:03\nKiara's mouse spasms on jumpscares are so hectic lol\n\nThanks for the very fun stream! Give your mom a call!", "Reminds of Luna when she gets jumpscared too lmao", "FriendSHIP ended with TakaMori, now TakaWatson is the new best ship....\n\nor not. I'm confused...", "nah, but both are cute, or Mori is her wife and Watson is good friend (that's how my mind views it)", "Why not both?", "Love triangle?", "To me Amelia is the super supportive sister of all of the girls, she always shows up for their livestreams and leaves nice comments", "EndeRia(enderman and Kiara) is best ship, fight me", "Takamori is the otp, but Watson is the harem protagonist.", "Wouldnt it be TakaSon or WatAshi?\n(The last one is too good to be true lol)", "@Koji im really worry about her tho. She is like everywhere! Did she even sleep", "lol the NTR spam when kiara said \"dont tell cali\"", "@Olgierd von Everec everyone belongs to Amelia.", "40:54 lmao the backdoor double-meaning from Ame 😂\nand Gura was like, \"my wat\" 😂😂😂", "Damn Ame’s multitasking is legit af, watching the witcher, watching Kiara’s stream and doing prep work for her stream later on", "She's doing everything except sleeping", "Andds tidying up that long ass tunnel!", "🐔👄 Kisses Timestamps:\n3:31:41\n3:55:52\n3:56:53", "Another great stream today KIKIRI-KIARA...Lots of ↗️↗️↗️↗️ Moments... Looking forward to the Collab tomorrow......", "But also lots of ↙️↙️↙️ moments.... Basically every Kiara stream then", "@TRAWESS as expected from our pheonix", "Came back for that last 2 minutes. Wholesome OVERLOADS", "3:00:01 I got jumpscared by this lol, not that scary now that I know it's coming but watching it live legit scared me for a second ahah", "Go to 0.25 speed lmaooo", "I hated endermans so much I thought I can't hate them more... until now", "Steve walks into a bar - The Barkeeper says: \"Sorry we don´t serve miners.\" /  This stream contains among other things: Amelia Watchson & a Sweet Family moment at the end", "Bu dum, psh (also <3 at the other thing)", "Can someone explain the Steve joke? I'm usually better at understanding jokes but I get this one.", "Get out of my house.", "@Alex Francia - KFP Carpet no problem Steve is as far as I know the name for the og minecraft character. Miner sounds like Minor which means in this context someone is under the age to be qualified as an legal adult and can´t be served alcohol in some countries. The joke is Steve as a MINER is told by the Barman he  can´t be served because it is illegal to give alcohol to  a MINOR.", "@Casual Filth Ah thanks for explaining. Its pretty rare to find nice people on the internet.", "@Alex Francia - KFP Carpet no problem 😁", "I love how Tenchou goes from the most seiso to the most lewd birb, then returning to be a pure flower as if nothing was said a few seconds before.\n\nAlso, Amelia's such a reliable friend! And a bit addicted, that was a total rebuilding of the subway!!", "imagine if they ever make piston-bolt transportation systems lol", "Schrödinger's Phoenix. Simultaneously both bottom left and top right at the same time.", "Just do it in Japanese if you have to. Translators will save the day and even if we dont understand, it will still be entertaining i bet. Im sure translating during the stream would be weird for the JP girls that dont really know english. Id rather you guys enjoy your collabs!", "I just wanna say thank you for the streams, especially this one. Watching you became and other members of Hololive became a new sort of coping mechanism for me to handle my depression and anxiety. Just seeing you having fun makes me smile and try my best to be more happy even though i was just crying a moment ago before the stream started.", "31:08 \"I'm not a bird brain.\"\n31:23 :", "stay healthy boys every time Kiara forgets what she is doing do a push-up", "I don’t think it’s even possible for a human to do so many push ups😂", "Sorry, I'm still recovering from alcohol poisoning.", "@I Don't Get The Joke did you take a shot everytime gura forgot what she was doing? 😆", "@umrii san HeLp", "3:00:00 That killed me XD", "Wait, why did I come here?\nWhat was I saying?\nWhere was I going?", "1:30:13 OH MY GOD WHAT A PRECIOUS THING\n1:35:48 Yabai peko\n2:44:39 Ame doing the illegal to Gura\n3:00:04 Cleaning the windows", "\"did you just watch an anime girl go to different heights just to get a potato?\" \n\nYES. AND I LOVED EVERY MINUTE OF IT.", "So about that Kiara and Amelia strip poker collab...", "Since I’m just a student, I don’t have money for the super chat. \nBut wait!!! \nI am about to graduate next year. I’ll find a good job, get a nice salary, and then I can do the アカスパ！", "So...there are people like me", "Suppachattotiemeeee", "ngl before the stream even started i love the pre stream chat everyone was awesome and nice i liked it but too bad i got really tired and got knocked out the whole stream till 2PM 😔", "Prechat gang 🔥", "@wolfz KFP Health Department Advisor  Kiara and Ina have the best chat imo", "@BottomFragger indeed , I'm gonna wait for more moment between them ✌🏻 , including mama phoenix and calli", "KFP bro’s are super wholesome we all support Kiara, and she has such a sweet personality it draws a good crowd, also ina’s streams are like pure good vibes. I’ve never been able to stay awake through a full Ina stream.", "A new day, and another day where Kiara streams in the morning to me ;-; I hate timezones. let's go the archives lol", "Archives are neat. :)", "I feel you!\nKiaras times are fine for me, but e.g. Gura is around 3am in the night. \nBut still - they all are so adorable and entertaining that VoDs are great as well!", "@Knicklichtjedi Gaming Gura, Ina and Amelia stream on good hours to me. haha Kiara too but she mostly does it early to me, while sometimes she's like 1am which is late but I'm up that hour anyway. lol", "I was waiting for her to eat the chicken the entire stream\n\n\nI want to see the rumoured cannibalism", "Day 1 of commenting on Kiara's videos to help her with the yt algorithm \nI'll be doing this every day she streams", "Too late", "I don't usually catch Kiara's streams, however this one was so wholesome in it's own way!  I need to watch more!", "Welcome to KFP", "I think “laaannguaagge Kiiiiarrraaaa” is probably one of my favorite ongoing gags", "Honestly surprised to see her being so hardworking. Mad respect kikkerikki", "1:02:29 chat: yes the moon's beautiful but can we put water in the middle pls \nlmaooooo", "Kiara doesn't make much progress, but she does create a lot of laughs so it's a pretty good trade-off.", "I mean... at least it wasn't just a door...", "Rip shark", "\"Minecraft with shaders\"\n\nSomewhere Polka shakes her potato pc in rage and sorrow", "hearing her talk about her family is wholesome af", "I honestly very much enjoy the Takamelia (Kiara & Amelia) duo very much! Was very much looking forward to the collab when I first saw it on Ame’s schedule! This stream was cozy, liked seeing Ame chat with you, and enjoyed the talks during SC & even before that. See you in the next one!", "Also some summary but not a timestamp \n\n-Pillagers attack\n-Witch attack", "Kiara: getting attacked by zombies and panicking\nAlso Kiara: \"wow look at the sun so nice\"", "\"My house is directly in between the sun and the moon!\" 1:36:35\n- \"I'm so smart! My house must be right oever there!\"\nXDXD - What a lovely bird brain. XD", "This stream was so much fun from the beginning to the end. I love you Kiara.", "Today we learned that the secret treasure of atlantis is a potato.", "47:00 omfg I misheard that as “teamwork on my throat”! Jfc!", "That's the only thing I hear now lol", "This was such a good stream, you make Minecraft fun to watch Kiara.", "Heh heh heh, Amelia went from not caring about Minecraft to playing it off stream.", "How I hope Gura manages to convince the rest to play Dead By Daylight with her. Especially Kiara :')", "@MajorLag : \"I'm at the soup store\"\n\nWhy are she using pumpkin at the soup store?!", "2:16 Stream start\n6:19 Game start\n8:39 Amelia appears\n13:02 Pillagers wave 1", "2:59:58 Enderman encounter.", "36:36 detective got revenge", "At this rate I wouldn’t be surprised after tomorrow’s stream we hit 340,000 subs", "Yo Kiara! Thanks for all the great entertainment and being so upbeat and positive! Your streams really take the edge off after a workday. Bleib großartig, Phönixmädchen :D", "Her talking about her family is so cute 🥺", "\"hololive is a very wholesome and innocent company\"\n\n\nthey had us in the first half not gonna lie", "He writes under the most wholesome stream ever", "@Hector4President i am a they", "@Goosed Moose no", "Ok, never played minecraft so I want to ask. What's with so many raids? Been watching the Minecraft streams back to back all across EN (Don't wanna miss the lore) and in all of them there's at least 1, sometimes 2 of them.\n\nIs there a reason for it or it just sorta happens?", "Jesus Christ, Amelia doesn't sleep, does she? Hahaha\nI think Endermen traumatized Kiara.", "Never forget pre-stream chat: VICKS", "2:13:10 arriving at a place she's been to 4 times already\n2:13:50 WHERE AM I WHERE AM I\nSome true bird navigational instincts right there. Love her", "Ame, the true gamer: \"ey, wtf\"", "Kiara is my bet to be the first one with an elytra, I need to see this birb fly around the server.", "I really enjoyed her stream and it was a lot of fun, let's continue to support her as she deserves ♡.", "I love how Kiara said \"Why are you guys posting A?\" and then drops another A on us! lol\nTimestamp 1 - 3:13:30\nTimestamp 2 - 3:14:10\nBonus - 3:37:55", "Hehe gotta support the TakaMori ship all the way. Unfortunately, my schedule makes it hard to catch everyone's streams. So making a big support makes is more practical for me.\nBesides, 500 is only half my monthly entertainment budget and I haven't been rolling any gacha for the past few months.", "1:47:46 i heard “wheat nazis” the first time", "i almost cried when kiara was talking about her family\nwholesome phoenix content ", "I really want to see her play jump-scare oriented horror games", "Every time Kiara swears it somehow catches me off-guard and I can't help but laugh.", "\"met many friends\" we friendzone'd again", "I'm stuck outside my house but at least I got entertainment", "Fun as always! So many hilarious out of context quotes. Always happy to be able to make it to your streams, Colonel Kiara 店長! Thank you so much! See you next livestream! Take good care, k? 🐔❤️✨", "Ironically, Gura's house is the safest of all from raids despite having any door.", "The dude that got kiara to sing happy birthday to is the most luckiest person alive\n\nBut its not like I'm jealous or anything", "Never knew that your from germany, me too", "So happy to hear that you can invite your family to visit. Glad to know my simp dollars are being well spent!", "We love you Kiara and you are an amazing and very talented person, never forget it <3", "what a whole some ending :>", "i keep falling asleep mid stream (；ω；)  i need to change my sleep schedule a bit", "This was such a nice and entertaining stream to watch. Kiara if you're reading this just wanna let you know I love you and I'm so happy you joined Hololive and also that you speak English :p", "You girls are my favorite thing on Youtube. Thank you very munch for your work. God bless you all.", "I liked the stream it was fun to watch", "Kiara should really consider making pressure plates on the inside to make doors automatically shut on the way in or out (placed like inside doormats)", "2:14 stream start\n6:18 game start", "It always puts a smile on my face watching her play", "Wholesome sister, amazing tenchou and best phoenix", "Lot's of emotions only think i can say is i hope you will see your parents <3", "Everytime someone logs into the server, something is just obviously different and it has something to do with a certain zooming detective that's definitely not addicted to the game at all", "Amelia is going to turn into the Pekora of the EN Minecraft server at this rate", "キアラちゃん声かわいい(ヽ´ω`)", "She finally installed optifine. I ducking knew it'll work. Her PC was still the same PC of hers, it's much better", "arrivederci, huh?\nThis smell... it's the smell of a JoJo-refference!", "Currently it's 4 am now and the stream started last night around 9 pm, and obviously I missed it, but meh I'll just enjoy this anyway.", "Whoa those graphics or shaders or whatever are lovely. I've alwayd wanted to see no commentary footage of that stuff without some dude going \"HEEEYYY WHAT'S UP EVERYBODY!?\" in the first split second of the video, but I'll gladly watch Kiara play Minecraft with fancy graphics. 💛 Thanks Kiara!", "2:59:49 thanks me later", "its been later, so thanks", "KIARA you are so fun and precious and always upbeat and laughing and your joy for what you do lifts us all up.  Always \"live again!\"", "I love your streams so much ❤️", "Thank you for the fantastic stream Kiara! Always feels nice when you talk about your life. Here’s too seeing your family soon ! !", "I always see you superchat 😆", "@mba-20  Yeah I’m a simp ", "so am I the only one waiting for Kiara to end this stream so that I can watch from the beginning?", "no", "my my.. I see that the world is not that small eh", "I am :0", "3:49:20 I Love You", "This is starting or ending?", "Don't mind me I'm just using this for personal use...\n3:00:04", "Mama Takanashi is so wholesome\nEdit: Bruh their entire family is wholesome tf", "VIVA LA KIARA\nVIVA LA KIARA'S MOM", "I feel like that enderman was the same one...following her all stream. The one with the grass block in its hands. It showed up at her farm, killed Amelia, appeared in the  flower forest and was originally her roommate...", "Chat is so cringe sometimes (often) lol. Its my main gripe (aside from antis) about vtubers. Chat holds on to the same joke and spams it for weeks or months.", "Thats the case no matter who is streaming, vtuber or not. Go to any decent sized twitch stream and chat is usually the same, but honestly its not as bad as Twitch", "@Israel I don’t see a difference between YouTube live chat and twitch chat except when the vtubers are being really seiso and chat behaves. I agree it’s widespread.", "Still gotta fix that chat empty box xP", "Keep up the good work! You radiant bundle of joy", "Did they remove seeds from F3? Because I recently just watched Dream's old video on finding Pewd's seed. And stating that Pewd's never F3'd on Cam so that his seed won't get leaked.", "Is it just me or does her 3D model seem more fluid when she moves??", "Kiara: \"I should never play... Um... Horror games\"", "Imagen living in a country that has no... KFC... goes to cry in the corner", "Tbh , this is a wholesome stream", "Im so jealous that streamers can write off a graphics card purchase .-. That said, definitely don't buy one until you are stable/feel like you want it for you, not for us.", "1:57:10 priorities lol", "Top right!", "37:00 Poor bird.", "Man Kiara really likes talking to herself at the end of the stream also AME is too loud", "Kiara has good taste in music.", "love that the fast food restaurant is the first that tries to fry her potato with shaders", "After watching this i really wanna see he play a horror game", "At 34:52 could it be that she found a fortress down there?", "Kiara finding the rtx 3080??? bruh you and me both hahaha", "1:20:19 \n\"a\"", "I get mouth sores too. It's part of my GERD. Don't assume what it is before asking the person.", "2:59:50 sasuga roommate-kun", "Mi parte favorita\n3:01:18", "I dont know if you will read this comment... but i just wanna say thank you for everything... for being you and for giving  joy and  happines to thousands of people", "It seems that live chat doesn't work for some of these archives, is it just me?", "it takes awhile for it to show up.", "Come back in a few minutes and it should pop up", "Yes, I just had to wait, thank you for reassuring!", "1:30:13 i didnt even see anything and she got scared", "I would never want to see Kusotori and Same-chan get in a tight situation cuz they’ll surely die HAHAHAHAH", "2:23", "Does anyone know what shader pack this is? It looks like the same one Botan uses so it's obviously well known, but I can't find anything about it anywhere.", "Sildurs vibrant shaders.", "Is Kiara sounding a bit like a mix of Korone aand Aqua towards the middle?", "Tanakashi kiara laugh sounds like.... HA↗️HA↘️HA↗️HA↘️", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "1:58:50 bookmark", "Enderman be like: \"Omae wa mou shinde iru\"", "My Mom was someone that loved getting power tools for christmas and her birthday.", "Yay Colab tomorrow! Today's stream was fun!!", "Oh okay", "I like the shader use, but why do you think none of the hololive crew ever try out different mods available? Some are pretty fun", "Man Kiara laughs like Scotty Kilmer", "That’s an obscure reference for here lmao. Can’t see Kiara revving up engines anytime soon.", "Watson is the real gamer here", "All the trouble to get a potato when she could've just pressed F3. Also Decade in superchat. Onore!", "I love how Kiara basically says we gotta keep work as work no making out and stuff, and couple days ago she was saying to Calli to eat her lmao", "I was hoping they'd call themselves the Tunnel snakes, and they'd RULE", "Get me out of this vtuber rabbit hole", "So if Kiara has survival mom and represents life then is Calli’s mom a murderer?", "Does anyone know Kiara's first language?", "The gals should play the Witcher 3, it should be a funny experience... or maybe Skyrim but with a ton of lewd mods XD.", "sugar sister lmaoo", "that opening animation...I always feel back for that one drumstick she doesn't catch.", "\"Potion Seller!  I would like you to stop throwing potions at me!\"", "I am triggered by the incomplete water placement in those farm trenches.  I am sure I am not the only one.", "3:00:01   HAHAHA", "cute lol", "does anyone know why live chats been disabled ?", "It takes youtube some time to load the chats come back a little later and it should appear", "@Pety currently the video isn't playing for me, it says an error has occured, I was just watching, but I refreshed to see if chat was enabled yet, and now its broken", "As far as what was absolutely necessary for those farms, all you need is 1 block of water to cover an entire 9x9 block area. The strips look nicer though.", "1:09:27", "Lool ich weiß das du Deutsch kannst deswegen wollte ich sagen das ich deine Streams megaa feier. Mach pls weiter so", "Full version of soran soran please.", "Oh man its done", "How is she playing while holding two chickens", "Anyone knows what are these shaders called?", "Tales of the warrior pheonix have spread to all hostiles.  They now seek to challenge her to get a free stock in KFP.", "Buy new PC TAKANASHI 😡", "Will you guys play on the main Hololive server too? Would like to see you play with the JP girls..", "They don't have access to it yet. I'm sure they will be given access soon.", "Language Kiara", "No chat? Which one of y'all clowns messed up?", "You need to wait for a while for chat to appear after a stream", "1:02:00\n1:24:59\n1:35:48", "Holo en wont be joining hololive server?", "They have their own server, but can visit the JP server for collabs and such.", "I bet her pc is cooked chicken now lol", "what shaders did she uses?", "Which shader did she use", "I'm an hour in and Kiara-senpai hasn't died yet? Now this is character development!\n\nBird facts for today:\nThere is a species living in sub-Saharan Africa called the secretary bird. Despite its pleasant name, it's a vicious raptor that swoops down on small reptiles and mammals, then stomps them to death with its talons. It stands over 1 metre tall on the ground, and its long legs allow it to walk faster than a human can run!", "Amelia X Kiara? Is this a ship to surpass TakaMori?", "No", "Wholesome Phoenix family ", "Gib mir ein hi 👋", "Wait... How does she play with two drumsticks on both her hands?", "With her feet, obviously", "@Tahanok2 hummu hummu naruhudo!", "You can probably adjust the brightness on your monitor to compensate for the shaders darkening the game. In some cases monitor reviews show their settings after calibrating for optimal colors. It will probably not be 100% accurate for your panel, but it's usually better than using the out of the box settings.", "There's a setting in the shader options to increase the brightness of the shaders itself, i have mine turned up to around 2.5 so i can see at nighttime", "Good info, hope that helps her. :)", "You really don't want to use the colour settings on the monitor to make up for the software unless you absolutely have to", "No more potalto", "1:33:30 \"Do NOT give the seed\". Gura already pretty much \"leaked\" the seed with her F3 abuse...", "I'd recommend you get the sleep mod. You'd have to mod the server but it's super easy to do, I'm sure one of you girls or someone on the management team can do it. Spigot or Bukkit or something like that. It's just a quality of life mod where you only need to have one person sleep to skip to dawn. Very useful in SMP.", "", "What shaders is she using guys?", "Sildur", "Sildurs", "@Jan Erik thanks", "@Jan Erik vibrant sildurs?", "@Cleit sildurs lite apparently", "@ZeWorld really??? hmmm thanks...", "@Cleit \"Sildur's Vibrant shaders\" she said she was using the Lite version yes", "@Jan Erik bless you, I was looking for this", "Kiara deseves more love imo", "I'm worried for her mom. Kiara had some bottom left moments in the Super Mario 64 stream lol, especially the SC taimu.", "Armpits moment is definitely nor seiso", "Kiara is there any chance you could add English captions to your JP collab streams after the fact? Or find someone who can do it for you?", "Remember Kiara you are the one that play the game not the chat, enjoy yourself rather than  fulfilling everything chat wanted (like their ocds/or being perfect)\nBut you're to kind, so you do you Kiara, just don't make it to hard on yourself.", "Kiara is just Japanese Jacksepticeye", "But she's German.", "i wish more hololive memebers used shaders for minecraft", "German's and there empires be like ....", "Am I the only one who gets passenger seat syndrome? Every so often I see her in a situation where I'm like \"this is a delicate situation! gimme the controls!\" and i can't because I'm watching a stream.", "Mori got super jealous to the point where she summoned her soldier of shadows to assassinate a British girl", "Hey Kiara, I don't know if you will read this but I have a theory on why your sub count is the lowest among all of the EN girl.\n\nYou often translate your own content, therefore, both Japanese and English viewer can understand you. This mean that there is less need for the many translation channel to translate your content. And these channel often help redirect new viewer toward the original channel. I am not saying stop translating. In fact, that is what I love most about you beside your general wholesomeness and how you take words with kindness. (also Takamori ship for life). ", "I wouldn't say its the self translations, because some channels add english subtitles to the english commentary (and I keep reading them out of habit xD)\n\nI'd say it's rather the meme or clippable moments, which is what's usually recommended on other people's feed"]