["So... Are we gonna talk about the whole Calli milk thing, or are we just gonna never bring that up ever again?", "Oh we definitely gonna bring this up", "would you mind giving the timestamp kind sir?", "@Zek 47:21 my good man", "Timestamp", "Was it 47:07", "I mean Kiara herself will mention it again", "Her bottom left level is under 9000!!!!", "Can't blame her. I want Calli's milk too tbh.", "excuse me what", "There's now a clip of it, somewhere", "What did Mario answer when the Policeman handed him something and said: \"It´s a fine.\" ?  \"No it´s a not\"", "Not gonna lie, one of the reasons I check the comments post streams are for your puns lol... Keep up the fine work eh!", "@Jkhmonkey KFP IT Hardware Department #2 Really glad to hear, thanks =)", "You're here , I expect you to be here , Cya at next comments Section", "@wolfz KFP Health Department Advisor ✌", "casual clout", "The more she says “hehe this is easy” the more she’ll regret it.\n\n\nAnd the more we’ll enjoy it 😈", "True. I played for the first time awhile ago and some levels like the secret levels broke me 😂", "\"Very delicious. Calli's milk\"\n\nRule 34 Artist: Write that down! Write that Down!!", "This stream show pro gamer kiara for the first half but then .... Mario be Mario so Rage Kiara need to come and beat it 😂.  ALSO ~ Return of Upside down Kiara and the battle with Ina.......", "Kiara's sanity level during the cage level: 80% Mario 64. Then she beat it. Mission failed boys, we'll get her next time", "Hopped on to see she was live only to find out it just finished :(", "See you in 8 hours!", "@Tomix see you there!", "PAIN , cya next stream", "hi kiara, i don't actually watch you but my friend kiko really loves you so much!!  so i want to say thank you for your bright energy and all the joy you bring them and the lovely community you have 💖💖 thank you also for reading the superchats (3:06:43) i sent on their behalf for their birthday!!! and thanks chat for sending so many bday wishes to kiko!!! you all seem so kind and sweet 💖💖", "It was a wholesome sc. Right now I'm in a dark moment and I can confirm she has helped me to keep going even if it sounds cringe.", "12:00 moment kiara was bottom left again", "You think it's frustrating for us to watch this!? Man I was actually having some big laughs at how much pain Mario can cause lmao.\n\nTruly the Dark Souls of videogames.", "I've noticed that I've been enjoying Kara's failures more than other streamers, and i think this is because it's not like she's overlooking any details when playing hard levels; she's doing what she needs to do but still fails. Makes it a lot less frustrating to watch than say, Ame's dashflower attempts in Odyssey (though I still enjoyed that bit a lot personally)", "@Intestinal Clouds I have to agree. Can't really explain what makes it entertaining for me, maybe the reactions or the sudden killer that comes out to threaten Mario's family lmao.", "@Keeys It's like rage quit. Except far more chaos.", "I love Kiara's accent so much, especially since I keep having images of Werner Herzog repeating the stuff she says, in my head", "Simp", "@Juan Lopez Simp yes, but also an individual of culture.", "There’s something strangely comforting hearing a cute girl drop f bombs", "yeah and kiara is cute irl too no joke", "I feel like chat let everyone down.\n\nWas there anyone spamming \"open the red box?\"", "yes. vehemently.", "I think the problem is that Kiara didn't get to naturally learn the mechanics on her own and took other's advice. She got too reliant on the hover because of what people told her about jumps.", "Finally someone who speaks the truth about how bad the controls are in Mario 64.", "To be fair it was a pioneer of 3D platforming. Gaming has come a long way since then so naturally it would feel outdated and weird. The Switch port made it even worse by reversing the original camera controls and not giving an option to choose the style. At least there will be a future patch to fix that even then it is strange that it took so long in the first place. Barebones compilation indeed.", "2:21:25 Imagine being her neighbor though.", "my feeling when I don't have a cute Phoenix girl as a neighbour T_T", "“Easier than 64” uh sure", "Apparently Isle Delfino doesn't believe in diplomatic immunity, or even verifying alibis or checking border patrol. Honestly, Peach would be totally within her rights to declare Delfino's actions an act of terrorism and have the Mushroom Kingdom declare war. \n\nDelfino is very lucky that Mario pities them enough to help them anyway.", "its a videogame", "Cringe ngl", "The fact that Peach has been getting kidnapped every other Tuesday for decades tells me that the Mushroom Kingdom has no soft power, so she probably couldn't do anything even if she wanted to.", "@thapoint09 \nits a video game", "Came for Sunshine, never expected to know that she drank Calli's milk 👀", "thank you for doing some north american timezone friendly streams \nyou are so cute and fun to watch", "I don't know how 0:00 AM is timezone friendly, but ok", "@Túrin Mormegil77 This stream started at 6:30 PM PT and 8:30  PM CT. So,  I'm not really sure what you're talking about.", "@extralie Where in North America?", "@extralie I'm asking where cuz if you're more to the east than NY, then you should have almost the same timezone as me", "Little does Kiara know that Super Mario Sunshine is a lot more frustrating than 64. Can't wait for her to reach Sand Bird.", "\"Someone having stomach issues\" thanks i can't unsee it now.", "Thanks for the dubbing. Amazing VA skills! Peach voice 10/10 lol", "Day 12 of commenting on kiara's vods to help her with the yt algorithm", "I really wonder if Kiara started to swear more to make Calli like her.", "47:21 💀🥛", "Your character design seems to me the most beautiful, the way you make your expressions is sweet😍💛", "1:39:19 Ina disliked this video that she got bullied by Mario in this game.\nAnyway, we enjoyed so much in the steam, Kiara. Hope you keep playing this game. Thank you!", "2:02:27 Sad/Frustrated Phoenix noises.  Also happy she noticed my comment in the livestream (I think).", "3:06:14\n\nOof, that’s why sometimes in pre-chat no one responds to me, And I didn’t know so I spent hours in pre-chat talking to myself. 💔😢", "ah damn. what can do you about it?", "Don't do that. There are rules against having private conversations in the chat. Please read the rules..", "@IDKmyBFFJill she has said several times that she doesn't mind. There's a reason why she always enables the pre-chat hours before the stream", "@Mesugaki \nWhy are you telling me this. My post has nothing to do with what she likes.", "3:02:15 has me thinking. If she can't play games like Persona 5 on stream, what games are considered appropriate for streaming? I've seen members who've played rated M titles before.", "It all has to do with permission, since Hololive is based in Japan they must abide by the copyright rules in Japan, so in order for them to play a game on stream they must first ask permission.", "P5 devs i think are specifically against streaming", "Atlas doesn't let you stream Persona 5 past a certain point(recording on the console is disabled). I think it's the first boss?", "@Mammoth Shop that hasn't been the case for years", "@Coolkid Gaming I just checked and it's still restricted, you can only stream until the game reaches the 24th of December", "@Mammoth Shop nah you can stream past it, many people do it with no issues.", "@King Mufasa While they can technically stream it, hololive has a policy where permission is required from the developers/publishers for the girls to stream games. Atlas will never give permission lol.", "@Mammoth Shop yea because atlus doesn't understand that if people stream it, especially hololive streamers, it'd get so much free advertisment and money", "@King Mufasa Yeah, but it's just a cultural difference between the West and Japan. They aren't fond of western streamers streaming their games either, but they aren't going to waste money filing international lawsuits for copyright unless they are massive like Nintendo so most western streamers can get away with streaming Japanese games without any issue. And I'm sure you've heard how crazy Nintendo is about people streaming their games and their special partnership program from a couple years ago where they were taking 40% of the revenue from Nintendo content creators. Keep in mind this program was intended to be their COMPROMISE for the outrage caused by them copyright claiming and striking pretty much every streamer and content creator that included even a small amount of game footage in their videos(thankfully they've reversed their stance in the last couple of years). In the west companies now often sponsor and pay the streamers to play through and advertise their new games, but it is still very different in Japan. It's why you see all of the vtubers playing through mostly the same games because they are the ones that they have specifically gotten permission to stream.", "When degens get too much money\nThe thumbnail:", "2:07:05 - when you’re ex wins custody of you’re dog.", "Alright now im curious how she learned japanese in the first place.", "\"Damn\" is the 1st thing I said to myself when I saw the thumbnail for this video.", "♡Don't apologize for your own efforts. I am so sorry for your efforts!♡", "I love my new mom, she's got the best thighs in town! (New KFP menu item \"Mommy's Thighs\")\n\nEdit: Comes with a complimentary glass of Calli Milk", "LMFAO do you have a timestamp on the thighs?", "40:27\nMe after being addicted to hololive", "I’m not sure who the guy at 3:21:53 is and I hope they were just trying to be informative but yikes. Thankfully Kiara didn’t say it on stream and nothing bad really came of it but lets just move on from that and hope he realizes what he did.", "I don’t even understand what it was supposed to say could you explain?", "May I ask what he said?", "@aiswallenstein24 its a racial slur for a jewish person", "@engineer gaming Negev from Girls' Frontline", "Yeah he was reaching hard with that.", "@Mega Man how is that a stretch? That's what happened. Her greeting got censored because the profanity filter picked it up as a slur.", "Trying to be informative?", "@aiswallenstein24 Kiara was confused why \"Kikkeriki!\" was censored in Among Us. The reason is that their filter doesn't detect characters before or after banned words, so the first 4-5 characters are seen as a racial slur and censored as such. If you're familiar at all with Dark Souls 2, the same thing happened where trying to make a character with Knight in the name results in K***ht because of the filter.", "I mean, you're the one lingering on it.", "I dont even know the word,  lol", "@Hollow Marthon thank you very much for the explanation!", "47:17 Calli's Milk", "Is no one going to talk about that thumbnail?", "Hey Kiara! I suggestion, cover the song \"It's not like I like you\" with Calliope!", "You really want me to watch you... you know german, you play 2/3 of my favorite nintendo games and you totally motivate me. If you ever need motivation yourself, I am very sure a lot of us will have your back so go get 'em phoenix. I will watch for now, hopefully in the future I can support you through other means", "47:43 A phoenix's cry of sorrow. XD", "Unfortunately I missed the stream, but the archive was super fun. Glad you're liking it more than 64!", "Yo can anyone link a pic of the thumbnail? it's for research purposes...", "This game is pretty interesting; I never had a GameCube before so I wondered if I was missing out on anything. You seemed like you were having more fun with this.\n\"First ever horror game\" Wait, Minecraft doesn't count?", "40:47 I hope Calli didn't hear that", "2:35:43 so did she do 3 streams a day ? Cus tommorow horror game was after 2 other streams. She's is busy!", "3:15:31 it was supposed to be 5 of them too... FeelsBadMan", "I love your  streams ! Big ups to the best chicken, Kiara <3", "Yes chicken ;)", "34:28 She lied as naturally as she breathed.", "1:07:57 \"We will not fail anymore\" famous last words.", "Sun, sea, sand and soakings with our favourite phoenix.", "I'm glad I lost conection only exactly after 2:21:29. Would be really mortified if I hadn't known if she managed the level after watching through all of it (~35 mins)", "I love Kiara's voices for the characters!", "Lmao 111 gang after live pog", "Someone enjoyed calis milk in this stream.", "\"すでに地獄の始まりを予感させる\"", "Maaaaaan you guys are sleepin' on Sunshine! Just cause guys like Peanut Butter Gamer don't like the game, doesn't mean it's bad! I - admittedly - didn't like some of the minigames, they seemed excessively hard at times, but overall it was a good game!", "What if you wanted to sleep\nBut god said:\n2:32:23", "I’m so disappointed that I missed this because I was at work. I’ll catch the next one I promise!!!", "Woah where the live chat?", "Give it an hour or two, it'll show up", "We gotta get her to do pachinko and lily pad lol. Also I can't wait to see her take on pianta and the chucksters", "Man, Tenchou never fails to make my day a good day ❤️🐔❤️", "Sadly couldn't watch the last two streams live, but well atleast some great entertainment for work right now.", "Another Amazing entertaining stream from you, Kiara. Such a lovely birb, definitely top right 😄👍", "Kiara UNRESTRAINED SUMMER FUN mode", "Kiara's inner demons return 2:07:00 2:14:00", "I had to go sleep, so missed most of it :(", "Calli's Milk?! 47:21 yes pls", "She's going to Australia!!! 1:43:23", "Congrats on the 400k subscribers! You've earned them! ^_^", "3:10からスタートです", "this stream was awesome! Good job, Ms. chicky!!", "Thanks for the stream Tenchou; I can also happily report that YT unbonked me after a day o7", "what did you do wrong 😂", "47:07 OPEN WIDE", "自分用\n3:23:45", "Too many clippable moments! Thanks for the fun stream", "The surfing was a nightmare", "Such an amazing ost", "That was great start of a new game. It was full of progress and improvements that you made despite those pain pekos along the way so uh, congrats, Kiara. Hope you get the hang of this game. Good luck on your next stream and may luck be at your side.  for the stream.", "Pain-Peko = 2:07:00", "Mario + Kiara = Comedy Gold", "Congrats on 400k Kiara!", "【日本語の方が読みやすいという人に向けて、下の方にも直訳文書いておきますね】\n※If it's easier to read Japanese than my bad English, then I wrote raw Japanese text as replies.\n\n3:22:16 I hope you to play \"the witch's House\" was released 2011. It's free horror game translated to English, Spanish, German, and so on from Japanese.", "*Note : Steam edition called \"the witch's House mv\" costs 1200JPY", "「魔女の家」は2011年に公開された日本発のフリーホラーゲームで、現在英語・ドイツ語・スペイン語など数々の原語に翻訳されている。\nホロライブメンバーでは、はあちゃま・るしあ・マリン・かなたなどがプレイしているのでおすすめできる。", "Mario Sunshine is best classic 3D Mario!", "Galaxy? :(", "♥️ Viva la Kiara ♥️", "Does anyone find annoying how youtube swap the Notification bell with the upload video option on the latest update for the phone app? ", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Ghidorah sound? 58:31", "Nostalgia 100", "2:54:24", "We are here for you Kiara pls enjoy what you want", "Apparently F.L.U.D.D. is called Dreckweg 08/17 in German. Looks like a pun but I don’t know what is it about.", "kiara deserves more love man", "Ich bin echt froh dich gefunden zu haben. Du und Gura bereitet mir in dieser schweren Zeit echt viel Freude <3", "Lit stream", "All Hail Me", "It’s October", "Nice stream 😊", "Gura eats Kiara\n\n\nRip kiara", "KFP FOREVER UNITED", "Helping with the algorithm", "Cool. I don't really know how that works, but it sounds like what your doing is good.", "@harborline765 \"It's not much but it's honest work.\"", "darn", "Yagoo is our boy", "It's winter", "Haven played it becouse i was never a big fan of mario games. Super Mario World i played as a smol child but never finished it. Then a bit of the first Mariocart and the only Mario game i completet is YoshisIsland. But this kind of games are just nothing for me.", "pog", "", "wie kann man so schlecht in mario sunhine sein ohne witz\nnoob", "es war nur ein witz haha", "Me: thumbnail\n\nFbi:🧐", "Obligatory comment", "Oh man,...Das ist eine Seite des Internets, die einfach nur gruselig ist...So viele Abos im so kurzer Zeit...riecht nach sehr einsamen Boys, die gern über anime girls phantasierten...uff", "Honest feedback concerning the frustration you kept mentioning:\n\n your lack of understanding/use of basic fundamentals of  game mechanics is frustrating. Maybe entertaining at first, but it does get old quick, and hard to me to watch.", "I mean I'm not here to watch a speedrun lol", "As you should give up on Mario 64 because it's overrated trash."]