["Kiara is basically a complete opposite of Amelia. She is literally screaming at everything and Amelia is just there saying “O wow, that’s pretty spooky” with no reaction whatsoever😂", "still fell victim to manager-san in convience store", "Despite kiaras mother being the only holo-mom to watch all her daughters streams she certainly acts the least seiso", "Not necessarily the only one...\n\nThe only one we KNOW!", "She's very lucky her mom and her \"papa\" both watch her streams", "@LF Animes Suisei's mother is a channel memeber to her daughter lol. She was watching without telling suisei until she said something that gave out she watches the members only streams.\n\nI forgot who it was but one of the girl's dad put a stream up on the livingroom tv.", "@Chuito12PR \n\nIt’s Suisei’s dad, lol!", "I for one find scared Kiara kinda adorable, she really is like a chicken, but a very cute chicken.", "Indeed", "Definitely , not chicken out 😏", "So she's like a regular chicken then", "Sie ist ein sehr süßes Hühnchen", "Must protect at all costs", "Here fellow employees, Kiara's special treat 1:50:05", "Arigathanks gozaimuch", "H o o  b o y !", "Thanks for the timestamp.", "Thanks lol", "Sasuga Horny Chicken,gochisosama", "Bottom left indeed", "BOTTOM LEFT BOTTOM LEFT BOTTOM LEFT", "THICC Chicken Tigh... i mean legs, mlem", "I mean she ain’t lying.", "", "Kiara being scared timestamps:\n\n0:00:01 - 2:40:00", "*0:00:00 - 2:40:00", "*00:00:00-2:40:04", "Good taste you have ", "Hahahahah! Well played!", "slow clap indeed you made me spill my drink laughing.  I salute you.", "thank you for your help", "I love that chat was playing a game on counting how many times she screams", "Very nice stream! You could really feel the \"character arc\" of Kiara playing through the game! \nAnd don't worry about us when it comes to screaming too loud. If someone plays a horror game, we already expect loud ear blessings!", "Broke gang commenting: \"It's not much but it's honest work.\"", "Indeed 😂", "Hi Kiara, just wanted to leave a comment based on one of the SCs today. Please don't underestimate the amount of impact you can have on your viewers. Be it a bad day at work, something shitty that happened during the day, or even the pain of losing a loved one, it makes a huge difference to have even just a short worry-free moment of fun and laughter that let's us say \"well today wasn't too bad I guess\". Just as a small campfire can provide the warmth and energy to those stranded in a winter night to survive, your streams helps give that push to get through another day. Stay bright and cheerful, and as always, thank you for your streams!", "Kiara being scared moments:\n14:43\n\n18:21", "my man, thanks", "Simping for the Reaper itself but scared of a flashing object.\nI present to you: Takanashi Kiara", "For a second i thought you kira and i was like a jojo refrencs but then i read kiara and was like ohh that makes better sense", "@Adian Lewelling lmao", "I mean would you fear the embodiment of death itself if you could constantly revive?", "@Blooper {Reloaded} But why would you fear a flashing object then if the worst case would also be death lol", "@I dont really care coz it's scary?", "Just wanna say, great job getting through a game whose genre you tend to avoid.\nYou didn't have to do it, but you did it and saw through to the end, and that's admirable.\n\nClaps for the Phoenix", "Kiara never died from old age she only died from being scared. Head canon", "\"Why would you go through the whole thing to scare yourself, that makes absolutely no sense!\" You're right! XD", "What was a burglar doing at Wayne Manor? Robin", "LOL 😂 Nice Batman realm joke", "@wolfz KFP Health Department Advisor  ;)", "the burglar was ..... doing Robin oO? My interpretation aside , nice pun once again XD", "@Jkhmonkey KFP IT Hardware Department #2 I'm still searching is this INA or other INAcent People", "1:04:12 Chat's PTSD They fly now !!!!!", "Everyone gangsta until the chessboard start floating", "I would like her to play \"The Witch's House\" or \"Doki Doki Literature Club\" Those are great games for those new in the Horror genre.", "I would love for her to play alien isolation watch her constantly ressurrect", "Bro, I would LOVE to see a full collab on Doki Doki Literature Club so that they can all voice act everyone.", "Kiara playing The Witch's House sounds amazing!! I'm sure she would like it", "Missed the live but I managed to catch up. xD\n\nThis was lovely fer Halloween. While the rain is coming. HAHHA", "I'm here for the algorithm~", "Same", "Algorithm Gang 🥚", "i just realized on Kiaras waiting screen there is one chicken-leg she misses.\nGoes directly to her mouth.\nWould be absolutely hilarious if just the bone flew out behind her", "KIKIRI-KIARA... Great stream today as always... Keep your volume up.... It will be fun...", "Its so you can show your friends right", "@Adian Lewelling if I had any sure", "@KFP Mei Mesaki well if it makes you fell any better i have like 3 frie ds good enough but they like pokeing around with me cause my ability to talk to people is really low and last time im McDonald's i broke down crying and also me talking to people is like saying i can survive in tne vacuum of space its not happening", "I skipped the gameplay after a few minutes of watching because I was too scared and then I just came back for the superchat instead. I'm so sorry, Tenchou. Seeing you scared just amplifies the horror even more for me.", "I really hope this isn’t the last we see of Kiara playing horror games. If not just because she’s cute when she’s scared then because I don’t want this to be her only experience with the genre. There’s so many better games.", "I don't care if it sounds cringe but thanks for streaming. Your energy helps me to continue in this sad world.", "That's not cringe bro", "Nothing cringe about this. Besides, there should be no reason to prevent you from saying how you truly feel; who cares if people on the internet thinks its cringe or not, it's your own feelings, not theirs.", "@Jkhmonkey KFP IT Hardware Department #2 I needed to hear that, thanks. Have a nice day.", "2 Streams in one day? THE CURSE IS BROKEN!\nfreedom at last", "2:23:44 Don't mind me...just saving this because I love how she speaks spanish~", "this was a mixture of feeling bad, laughing, but also kept me quite interested on how shes gonna reacted to scary things\n\nalso made me think what would happen if she played dark deception", "Thanks for the horror stream Kiara!  \nHowever to go from this game to a future Phasmophobia stream around the corner is pretty much like jumping from out of the frying pan into the fire when it comes to horror games.\nFor reasons it may not be an option for you, and the collab, but I recommend using the in-game voice chat over discord since the gameplay mechanics heavily revolve around voice chat in game.", "What a great stream , Kiara expression entire stream is gold .\nP/S : Now it's November 🥳🎉", "And I thought Korone was bad at dealing with scary games...", "I promised the final report would come later, so here it is. Also, shoutout to AZZAM for joining me in counting the screams until the end.\n\nKFP inventory report for this week's Kraven Manor stream:", "While I found her being scared cute, I just wanted to tell her it was okay cause you could tell it was getting scary for her.", "Her scared face is literally everything", "It's so painful to watch. I like her being happy, or if it's gonna scare her maybe play it with Ina or Gura. Watson and Cali gonna be too tough and probably not being scared at all.", "She has as much fear as the amount of times a person breathes in their lifetime", "Just doing my bit for the algorithm, nothing to see here", "Yo she did well in her first horror game. The phoenix is growing!", "Hey Kiara, regarding your relationship with Calli, if you were to leave Calli alone for a long while then Calli might realize how lonely she is without you.", "Now all she has to do is play alien isolation so we can see her resurrect everytime the alien kills her", "just supbscribed~ thanks for posting this. it was fun to watch and of a game i havent heard of. thank you again. keep up the work and the fun", "Welcome", "watching kiara get scared makes me scared, jeezus.", "1:50:27 Kiara your mom watches these videos!!! ", "1:43:04 Ah yes, the nostalgic \"I can't f*BEEP*\" Moment, thanks pewds.", "Damn that takes me back to the good old days.", "@Blooper {Reloaded} 7 years, yes", "Now THAT is nostalgia", "I was promised a scared chicken, and I was not disappointed.", "Had to miss this because of sleep, gonna watch the archive as soon as I can.", "The statue is a goddamn Weeping Angel", "Don't Blink", "I need an Kiara, Lamy, and Mio horror collab.", "2:22:00 \n2:24:30\n我的SC被唸到了!!!\nKiara我喜歡你!!", "恭喜!!!", "@Night Light 謝謝(*ﾟ▽ﾟ*)", "I can't wait for the chat to make kiara play Bioshock, that welcome to Rapture secuence is going to be fun.", "Reminds me of my first time playing an horror game. Amnesia, in my case. Everything was scary.", "Holy cow, I ain't seen this game in years. Pretty dope.", "My halloween costume will be a KFC employee", "I'm just waiting till someone from hololive plays a puppet combo game", "I now know how Golden YAGOOs are made...\nWhat an epic stream today. And congrats on beating the spooky game!", "Honestly was jumpscared more by your screams than the game ", "Alternate video title: kiara noises for 3 hours", "Helping Kiara with the algorithm", "what I love the most about this is that she's moving around the level in the same way I've seen timid chickens exploring a new pen when they've been relocated lol", "Seriously hyped for the talkshow", "2:08:41 I'm terrible when it comes to audio, but for me personaly, I think Ina and Gura has best audio quality. I've heared some static in Ame streams a bit ago, I don't know if she have changes anything recantly..", "\"what could i do what could i do what could i do what could i do\"", "Kiara talking about her upcoming talkshow at 2:28:00", "Well, we had fun, hope you did as well Tenchou o7", "o7", "God, You’re so adorable.", "Hey birb. I think you are struggling with games to play. Here are some I think you will do well with:\n\n- Bioshock Infinite (Elizabeth is love)\n- Portal 2 co-op with Cali", "Thank you for suffering through this for our entertainment Kiara - you’re a wonderful Phoenix!", "I remember Markiplier playing this a good few years back and it was hilarious.  I knew Kiara was in for a horrifically screamy time when I saw she was gonna play this XD\n\nomg I love her sudden realization of the poison gas cloud in the bottle puzzle near the end XD", "Now I want to see her play Spooky's jumpscare mansion lol", "2:05:09 So I guess they won't even be thinking of going to an onsen together..", "Kiara: I'm not a chicken! I'm a Phoenix!\n\nAlso Kiara: *literally makes chicken noises when startled and scared", "Glad I have headphones on cuz some of this sounds naughty", "2:20:34 the way she puts it...another bottom left moment", "Scared Kiara noises are so blessed", "God dammit i missed the stream😔 better luck next time i guess lmao", "Thank you for the treat~!\n\nAlso, hyped for the talk show! Wish you good luck!", "Great stream Kiara! I think it’s great that you had the courage to play a horror game. Happy Halloween!", "Hi Kiara. I'm Japanese.\nI'm still a beginner at English.\nIt was a video of Gura that I learned about Hololive EN.\nWhen collaboration I found out Kiara. I thought \"This girl is good at Japanese.\"", "My biggest honor for u that u playing a horror-game even u realy dont like this.", "ah yes our lewd phoenix  happily showing off you;re totally forgiven for my bleeding ears Kiarra", "that time when the phoenix turned into a chicken", "♥️ Viva la Kiara ♥️", "Personal Timestamps for me.\n\n2:01:56 - Judas Lore\n2:06:46 - Hydration Check", "Tikol, vanessa, gabriella, dewianti, kokoro, Tom cruise\n\n👑 = If you get this references", "Like kokoro from darling in the franxx", "I want to watch Kiara play deadspace, haha. Oh man, that would be a wild ride.", "I feel bad for u kiara it makes me cry when i see u scared i don't know why those jerks made u play this 😢😢", "I love how Kiara says that she won't get into FPS because she feels that she would be horrible and not enjoy it. That's every newcomer experience on an FPS. Take Siege for example, I don't believe anyone other than Botan can handle that game in Hololive, is a hostile game for new players lol.", "Thanks for the stream as usual. ", "9k left to 420k lads. Let's get it!", "I like when she says my name", "Kiara becoming pekora the more she laughs. Lol adorable", "👏👏👏 You made it Kiara ♥️", "Great stream Kiara! Scared chicken is best chicken 😤", "A SPECIAL TREAT 1:50:13", "I'm afraid Kiara suffers from insanity... doing the same thing over and over, expecting different results. It makes for some entertaining moments from miss Yakitori.", "Kiara why are you so scare of this ? Are you a chicken ?\n\nWelp.....", "Where can I find Amelia's run of kraven manor?", "1:44:15", "Play phasmaphobia. Don't worry even though its a horror game. You can play with a team such as with gura, ame, Ina, and calli. It would be fun for sure", "Yatta!!! Kiara clear!", "Light scares her", "Ha Ha Kiara you're such a chicken oh wait...", "EH", "Kiara should play The Joy of Creation.", "😀✋👍👍👍👍👍VER6 BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Obligatory comment", "🧡🐔🧡🐔🧡🐔🧡Happy Hallowen 🤗", "Language Kiara", "👍😊", "Your chicken heart is cute", "#JusticeForPapaHuke", "🐔", "Cute", "Candy ?", "There was no candy in this one.  Just Kiara.", "Kiara is the treat.", "I think we might have all of the candy already.", "I'll guess Kiara candy taste like chicken XD\nAlso I collect candy pieces too, we still miss 5 pieces ( maybe)", "@Blooper {Reloaded} nope, we don't.", "Bruh she said in the stream that she already gave them all...", "@Akemisan - ohhh, i get it now. Maybe she gave all the pieces she has, meaning other girls have the rest", "@hy le nhu  yep", "", "Yeah. Of course. The joke is too morbid", "that it' s no longer a joke. Sorry for causing troubles.", "I love you kiara........", "Same", "She isn't even aware of your existence. Chill", "@Noah Dalvag Says an anonymous on the internet. Bruh moment.", "@Noah Dalvag chill bro", "She might not know are names specifically but she know how many people watch her but there nothing wrong or harmful of saying you love someone", "I've never understood why girls (or phoenixes) who don't like horror games, still play horror games that clearly do not make them happy.  It really has to be due to viewer demand to see them suffer, and it is not something fans should be proud of.  I hope Kiara and the rest get to play games they enjoy more.  It could have been just as Halloween for the season if she was decorating her Animal Crossing island for Spooky theme, or doing the same in Minecraft, or something else where she could have been laughing."]