["She's like a real Sohryu Asuka Langley but much nicer. Speaks English, Japanese, and German along with red hair.", "She's perfect", "dont forget bird language", "Not gonna lie, you have a good point.", "Someone call Tiffany Grant.", "She's nothing like her", "Asuka is the tsundere without that personality she isn't asuka", "@Chase Bird as in tori lingual?", "She was supposed to go to sleep but no, she started retweeting her fanart right away lol", "Sasuga Tenchou", "At the time I post this comment, Kiara posted a tweet about 30mins ago. Sleep deprived Phoenix indeed", "@xDewritos it's almost 6:00 AM in Japan right now lol", "8:50 - \"okay, today, I might not be streaming for long...\"\n\nstream length: 4 hours", "FFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFOUR\n\nH O U R S ! ! !", "Like a certain normal student... 12 hours still short haha", "@Kokurokoki Mata are you, are you outta your mind?!", "TIME STAMPS (continue below)\n\n03:00 start feat pain\n04:03 start and sleep", "1:16:18 ghostbusters\n1:18:12 Fubuki draw Kiara\nGlass\n1:26:15 lol", "@Holo TheWise Wolf missing a 5 there in the YouTube counts. Currently says 30k rather than 350k", "@Jkhmonkey KFP IT Hardware Department #2 yeah thank you!", "1:52:30 waa\n1:53:30 planning the stream\n1:56:00 restaurant inspiration\n1:57:35 super chat", "@Holo TheWise Wolf you have too much time on your hands. But thanks", "https://youtu.be/jzuPT8Uk7aQ kiara sing uwu", "3:08:25 write something meaningful (chat goes brrrrr troll)\n3:10:44 will slap you (take the sword)\ntrolling like crazy\n3:26:00 last 15 seconds for SC (brrrr)", "@Sitting Crowd well, yeah 😂", "Thanks for your dedication", "Thank you for your hardwork", "Nice bro", "@Holo TheWise Wolf thanks", "Did Ina build the farm tower on stream? Anyone know? I'd like to watch her build it.", "@furious thumbstick yes, her second stream", "@Ivan R.A. thank you!", "@furious thumbstick from 1.11.00 she build the second floor of the automatic farm", "@Holo TheWise Wolf thank you! I started watching from the beginning and paused at 1.04 to play a lil bit ps4. Haha.", "I thought we were \"free-range\" \"no abuse\" members....", "More like \"free as long as it's in the fences range\"... Lol", "@SoulGundam, KFP Mobile Suit Yes indeed", "That's a typography error, it's actually \"Free range? No! Abuse members.\"", "The only thing I reaaaally dislike about HololiveEN is", "Even just the Minecraft stuff alone I've given up on watching it all.", "Yup...theres not enough time in the day.", "I still don't give up on watching all Minecraft streams, but got some days behind xd", "I feel this on a personal level", "same my friend, same", "Kiara falling in love with girls immediately after talking with them is so relatable it hurts \n\n\"I'm so proud of you little chicken, one day you will die!\"\nShe really is Mori Calliope's wife huh", "When my family leaves my door open every time they come into my room\n1:33:56", "Feels bad man", "I missed the stream 😭😭 I'm sorry.. I love you Kiara!!", "https://youtu.be/bw4Xck2uamU Matsuri is cutee", "@Tiny Kohai A baby laughing 😂", "As long as you're back to watch, I'm sure she'll forgive you!", "Oh bro same, my nap became a sleep", "@Jkhmonkey KFP IT Hardware Department #2  Yes!!  I promise to watch the next stream live", "@Lechonè Manowk Same huhu", "Same 😭😭😭", "@Mina B lets go watch the next stream and be sure to not miss it 😊", "Same", "Same here it's like 11 pm here on the Philippines", "same bro T_T", "@Yvan Pamintuan You're a Philippinian??", "@Sain't Migi Yes", "@Yvan Pamintuan Same 😂", "@Sain't Migi PH BROS😂", "Simp alert", "day 5 of commenting on Kiara's videos to help her with the yt algorithm", "Contribootin'", "such a dedicated fans \no7", "Help", "She's taking the chickens to Isengard!", "Fubuki what does you cat-eye see?", "Sorry for sending a red without any word besides “Meaning” I didn’t plan on sending one so soon but it was just really funny LOL. We love you Kiara and we want to support you in the ways we can. I promise this isn’t the last red from me and you’ll see me say something nice in words that I can’t express very well just yet soon. ", "https://youtu.be/bw4Xck2uamU Matsuri is cutee", "負責", "@Tiny Kohai why do people keep spreading those videos around?", "@King Mufasa They spread it around Youtube to gather hate for vtuber from normies, don't fall for it.", "@Yukihirou de Ghania Ah okay. But isn't it pretty counter productive to do that ON vtuber clips and streams? lmfao", "@King Mufasa It's to incite hate between the En fanbase and the JP fanbase, infighting between the 2 fanbase benefits the antis.", "@Yukihirou de Ghania But why would that start a fight? I love Matsuri and I also love the EN girls.", "@Arctic Fox Plenty of new people got into Vtuber since En debut, plenty of toxic one too.\nRecently, to be more precise, yesterday, they showed up in both Fubuki, Holo Japan, and Gura, Holo En, and numberfaq about how Gura is a better streamer than Fubuki since Gura got more sub in one month than Fubuki did in her three years streaming. That Holo Japan is no longer relevant since EN debut.", "@Yukihirou de Ghania Just gotta ignore the toxic people. Obviously, the older gens laid the groundwork for what hololive is now. Hololove wouldn't be what it is today without Fubuki and I think most fans know and acknowledge this. Also, people put too much stock in those sub numbers. There are way more English speaking people in the world than Japanese speaking people. The EN girls have a bigger chance of growing. It's not even fair to compare them. And honestly, I don't think the EN girls want the comparison.", "@Arctic Fox Yeah", "@Yukihirou de Ghania They probably went to the hospital after being called friends so now they are trying to make her feel down and \"be there for her afterwards\" In hopes of being more than just friends. :D", "@TheNovaGuardian EX Yup yup, she's my best friend.", "Kiara building her first \"free-range\" Hühnerfarm for KFP by imprisoning KFP members giving stray chickens a place they can call home.\nPIPIPIPI!!!", "if they want to be free, all they have to do is beat her in Mario Kart", "@Tanaka - KFP Workers Union That's... Not soo bad.", "Timestamps for the clippers:\n50:35 huke papa laughs at Kiara\n51:21 huke papa: i've defeated ender dragon\n1:03:02 62 min Ina's \"beer roots\" (beetroots) ,\"Ina were you drunk?\"", "Doing gods work ricky", "damn kawhi watches hololive EN?", "3:36:17 for slap ASMR. btw don't bully her too much.", "Them slaps  ", "Kiara: i slap u \nAlso kiara: slaps her self\nMe: am i a joke to u ", "Moment for Chat.", "@SoulGundam, KFP Mobile Suit it was ", "Kiara: everytime she meets a senpai she falls in love. \nEveryone: same", "Calli has a cave house, Gura has an underwater house. I think Kiara should make a sky house.", "What day of the week do Kiara´s chicken fear the most? Friday", "Hehehe funny", "@lissaleigh mercado =)", "Thats good. Tweet that to Ina :b", "Lets keep it 100. She could stream paint drying RTA and I'd still watch.\n\nAlso she already forgot how to play lol", "Kiara: * puts kelp in furnace *\nKelp: * cooks *\nKiara:  -- Eeew... It looks just like Haachama-senpai's cooking!", "\"I'm a warrior!\" Followed by immediate screaming and running in terror. True comedic timing in the style of a certain rabbit has been reached", "1:48:53 stroheim would be proud.", "Kiara at 11:00 - \"Maybe this will end my stream early and I can go to sleep\"\nVideo length: 4 hours", "\"NOOOOOOO, I DON\"T WANNA BE CHICKING TENNNDDIIESSS\"", "Every stream, I find something else I like about Kiara.", "Kiara is underrated\n\nchange my mind", "More like\nUltimate Gay Chicken Farm", "3:35:50 ~ We're blessed with the slaps!", "Mission success: KFP supply has been established! Can't wait for the chicken church lol", "30:15 \"I AM NOT A CHICKEN\"\n\n30:20 chicken noise", "LOL Kiara is gonna offline collab with everyone xD\n(reference to somewhere around 2:12:00)", "Amazing Nene collab! and Karaoke! Will they sing \"connect\" again?  2:10:00", "Kiara: I must not be streaming for long\n\nKiara: streamed for 4 hours", "wow, it took 4 hours 👌🏻", "I'm honestly not sure I have enough life points to watch every single 4-5 hour minecraft stream/video uploaded by these v-tubers I used to complain to my wife about Sparklez 2 hour videos lol  though I will say even if some of the extended mining, and walking, and forgetting what they are doing can get a bit tedious the overall humor outweighs it.It's nice to listen to/half watch at as I'm working or just relaxing from a work day at night, also I guess once my paid art...things...lol are calmed down all these streams give me more fuel for my future pending comic book covers I'm making for each one.", "How cute is\nThis is my number one waifu\nThe only one 💕", "The yagoo burger is made of\nBun\nLettuces\nTomato", "Kiara slapping red SC is the most I've laughed in a while lol", "my own timestamps:\n2:54:58\n3:35:16\n3:38:32", "Thanks a lot for this wonderful Minecraft livestream! It was so fun as expected. Glad to see Fubuki-san come to visit as well. The art she shared on Twitter was so adorable too. Thank you very much and keep up your wonderful work, Colonel Kiara 店長！🐔❤️✨", "Looking forward to the collab kiara :)\nMade big progress in making your free range menu.", "Lessions with Kiara: How to make a fence", "Any KFP bros got the timestamp for her eyebrows?", "kiara : i wanna make my house prettier too\n\nme : please make a BIG Burger monument as the house landmark.. at the top of ur house ❤❤❤", "We LOVE u Kiara!\n\np.s. Please take better care of yourself (SLEEP)", "8:30 ish, FBK senpai enters chat.\n42:00 huke enters chat but baby chic is born.\n50:25 huke \"super big kusa\"\n51:10 huke enderdragon", "seiso sauce always be a secret 😂😂\n\n\nseiso sauce secret: yagoos dream", "Dang I was asleep and missed it. Oh well I can still watch now", "Fun stream as always. We're on our way to KFP domination!", "27:16 How to transform a chicken to a Fénix.", "I'm glad I was just time for the stream to start. This was quite the experience.", "Catching the archive a bit laaaate, Love your streams Kiara uwu\nEDIT: \"I AM NOT A CHICKEN\" - Kiara 2020, RIP my ears 30:13", "So this is what it feels like to get your superchat read...", "today's superchat troll is the best thing ever exist in this fanbase , something meaningful indeed", "Tenchous Seiso Sauce filled streams are the perfect remedy for a turbulent college week", "Can anyone tell me what time this stream started? Like for example in the pacific north west USA? \n\nBecause i missed it and I kinda wanna know if i was asleep or not.", "Had to work, but I'm archive crawling now tenchou! Hope you had a fun time!", "HARDDDDEERRRR😍🥺😍😍🥴🥴🥴😫😫🥵🥵🥵🥵.\n\n* LOCK EYES * ", "Sleep well tenchou, not only did you hurt your hand slapping us, your throat also hurts from screaming too much, rest well and I'll catch your fire emblem stream somehow 💪💪💪", "Good luck to your next collab stream, Kiara!!! We'll be pumped haha", "Amazing stream as always!", "8:30 ish, senpai enters chat.", "アーカイブ開いたらKFCの広告で笑っちゃったｗ", "Tenchou might as well offline collab with all her senpais at this point :)", "Yes, good, I see Kiara's Gacha training is proceeding nicely.", "2:57 start", "2 hours SC reading...", "Congrats on reaching those milestones and finishing that chicken farm. Oof didn't realize the 3 deaths, thought you survived it. Thanks for the long stream, Tenchou.  ", "3:26 Sad kikiriki :'(", "Play it in the background boys she needs that watch time", "And here i thought i was the only one who fell head over heels over beautiful girls that chat with me.", "12:30 First chicken down!!", "She perfected the Pekora sleepy intro.", "Kiara is pure entertainment,  I almost feel bad not getting into her content until last. The banter she has with her community is always hilarious. And just when I think she's been pushed too far, she hits us with her Pekora laugh. The only bad news is I think I'll have to become a member soon which will bump me up to 3..", "3:07:56 don't mind me just timestamping for myself", "You have made a lot of efforts.\nI have faith in you", "2:57:06 random spot I put and i liked it", "Kiara is a very wholesome breeder ❤", "Watching Kiara play Minecraft is both entertaining and frustrating. I love her though.", "The NTR keeps getting stronger", "4 hours pog", "oof, missasin tän", "Kiara literally dies on every stream Lol", "Missed it now sad also I looked a detention of kikirikki and good ol Google said I ment peanut lol", "Bottom left gang!", "41:22 Chicken Centipede", "She forgot to close her door", "Yeap a very bright future for the chicken about 180 Celsius for 45 mins", "Kiara you are my favorite hololive EN vtuber you are so adorable and funny and I hope you never stop making content!!", "I hope she won't get any bruises from slapping herself", "I don't know about other people, but I'd have to hit myself pretty damn hard to bruise myself.", "It was great to see Kiara talk with our best friend Fubuki and then agree to a collab, that was great to catch live!", "1:48:53 kraut space magic", "2 hours to read super chat o.o", "Obligatory comment", "8:53", "Ha.... Missed it..", "Calli, Subaru, Marine, Fubuki, eventually Pekora. Kiara is a big, ongoing NTR story", "\"a\"", "Your not bottom-left kiara 😊", "Why do i have Technoblade's 1st potato farm war vibe?", "Yeah Slap us!\nstarts hurting herself cause of slapping\nPLEASE STOP SLAPPING US!", "💕🐔I LOVE UR VIDEOS 🐔💕 UR VERRY BUBBLY!!!  AND UR FUNNNNY😂😂😂💕💕💕", "tomatoes and burger are mods", "私はYoutubeを開いたところ、これを私のおすすめで見ました。「アメリカ人？」のようでした。", "It would be nice to see the chicken farm become a chicken shop", "Huke is the coolest dad", "KFP x hachaama cooking", "Free Range 😁", "Kiara needs to sleep.", "Phoenix  of dawn", "After watching speedruns so much it's so annoying to watch someone play Minecraft properly", "What would happen if I insulted Kiara...", "She would burn down everything you worked so hard to build!\n\nLike she did with Mario!", "The NTR just doesn't end.", "8:50\n19:27 25:29 27:00 40:20\n32:30", "archive gang", "キアラちゃんのしゃべり方すこなんだ", "EN勢はホロ鯖参戦してないんかな？", "Why the hell are people spamming NTR in chat thats disgusting", "Is she german?", "True fact, burgers do indeed need a tomato or they aren't good.", "ahhhhhhhhh......................i missed..........................................:'(", "Uhhh wassup", "SUPERTAKANENE", "Good", "Kiara mach bitte ein Hünerspaßbad!", "If you want burgers you need to put mods in the minecraft server Kiara.", "Oh man, the Superchat Reading segment and after that is so comfy... That's why I love you, Tenchou  ♥️🧡♥️🧡", "She is German alright , poor chickens.......", "There was like 20k people at some point watching, much more than normal. I wonder what made this happen. lol", "She did reserve the stream 27 hours beforehand so that probably let a few more people get ready for it ahead of time.", "area hostile mobs spawn is 3x3x3 block area. 3x3 wide + 3 high.so we need to make sure none of those space created by placing plenty torch.yes they can spawn inside the house if those requirements Fulfilled.\nthis is why many peoples kinda triggered seeing how stingy EN girls with torches", "E", "E", "E", "A Sports, it's in the game."]