["The 5 stages of grief \nDenial  3:29:42\nAnger 3:29:51\nBargaining: 3:31:07", "Sadly she knows how everyone felt when we found out claude was straight", "I hope this gets pinned", "I can't believe she legit went through all the stages, amazing", "@Valek Stormhowl Claude being straight when we can go Bi for El... That hit hard.", "@xaero xiii yeah however it does el a more desirable waifu bc of that", "10q 10q for timestamps", "Finding out your crush is an incompatible sexuality\nThe biggest yabai", "Natsuiro Matsuri - \"First time?\"", "Kiara hitting all the stages of grief... Sorry for your heart break! Also great stream as always :)", "https://youtu.be/Ebg1762x_Ys Mori is cute uwu", "Kiara keeps bringing up how the Fire Emblem streams aren’t performing very well, but honestly, looking at the view count for each of them, other than the third one which weirdly has a lot less views, the numbers look pretty solid to me. They seem to be within a similar range or only just a bit behind most of the other games she’s played more than once.", "When you find out your crush is straight, F for Petra and Kiara. \n\nI've never seen someone so emotionally destroyed because of Fire Emblem ever since FE Fates Conquest runs on the highest difficulty.", "50:03 Thats adorable.", "Petra: *is straight*\n\nEdelgard: You could not live with your failure. And where did that lead you? Back to me.", "Petra may be a Dorotheasexual, but Edelgard is Bylethbian", "Hi Kiara, sorry I'm not following your fire emblem stream (cuz I'm playing it too and avoiding spoiler), I'm here just to tell you that you are amazing.", "Any character with an S rank you can romance. Everyone else is a no", "Fans: Kiara is gonna be really upsets when she finds out Calli friendzoned her\n\nKiara: 50:00", "3:53:19\n\nI gently open the stream", "Kiara getting so into teatime with Petra, when you know about the aftermath... Hurts the soul :<", "If you forget the rules of Fire Emblem don't worry same as in Chess ... you're allowed to check", "3:25:53 It all started with hope and promise then came despair and sadness...\n\nWill Kiara stay the course to her current destiny? Or abandon all She fought for in this world for a chance to change the wheel of fate in another? All for the sake of love.", "Kiara: I want marry petra\nChat: But she's straight\nKiara: 😞", "After reaching the stage of acceptance they hit Kiara with this 3:41:50 P A I N", "Kiara likes Kirisame Marisa and Cirno?\n\nHow cultured can this phoenix get?", "Didn’t realize these weren’t getting a lot of views. Probably because Fire Emblem isn’t nearly as popular as other stuff like LoZ. But the important thing is that you’re having fun! The people who do watch are having fun too :)", "Tfw you're not best girl's best girl 😭", "Fashion show warning. Right now, because you have set Edelgard to wearing her school uniform in battle you can not preview her class clothes on the certification menu. You will have to undo that if you want to see her classes.", "this stream, KFPain", "3:59:43 Kiara HOWDY YEEHAW", "58:17 - 1:01:15 Maybe we need to learn this life lesson, especially during these hard times.", "You can see she's still struggling with comparing herself directly to the other 3 EN cast as well as other Hololivers, when she brings up the worry about FE streams having low viewership, and that stems with people talking about how she is the odd one out of the three, which while there may be a degree of truth to it, Kiara's ability is to enhance the other three and elevate everyone together. There's another YT channel that discussed this, but Kiara was the reason the first collab stream finally kicked off and they all started to break out of their shell a bit. And look, she's on a comparable level to Ame and Ina now too, their subs are basically all the same, Kiara has nothing to worry about!", "4:06:20 Info: Why dismount? Stairs are a reason to dismount from horses. For flyers dismounting nullifies the extra damage from archers and allows them to gain terrain bonuses.", "Remember to not overdue the jokes chat... The \"bottom left\" and \"lewd\" spam is pretty annoying. Use the opportunity to connect with Kiara instead of overusing a joke. Thanks", "1:30:40 \"I am Beedinand von Aegir.\"", "4:07:10 Tip: You can stop training Ferdinand in horses now. He's already at B rank and will gain it from battles now. You also don't need it higher than A, which is the highest requirement at level 30 classes. You don't gain any useful skills from riding itself.", "2:23:05 Info The reason Petra is so strong is because of her high speed. If +4 over opponent speed the unit gets to double attack. This is why speed has the reputation of being the most important stat in FE games. \nThis is also part of why light weight weapons like iron and swords are almost always better than heavy ones like steel and axes. Heavy lowers your speed. The lighter weapons also usually have a better hit rate. Petra fought axe users, who are slow and have a bad hit rate, while she is fast and dodges well. This was her ideal match up.", "4:42:58 epic kiara moment ❤", "I can't believe she has the least subs  from the whole group", "4:42:51 a legendary phoenix has said my name!!!", "just wanted to day i have really been wanting to seee hololive playing Fire Emblem: 3 houses.\n\n\nThanks!!!", "I'VE JUST TELEPORTED FROM THE EN LESSON.\n- Me Yesterday -", "FE might be have small viewer number because they didn't knew about the waifus and husbandos, also having low traffic chat is good to help Kiara reach certain goal.", "Recurrit feilx I know he's not sexy anime girl but he's op", "1:05:49\n\"Spoil me, don't spoiler me\" - Kiara 2020\nlol idk~\nAlso I feel you fam I restarted the whole game as male Byleth just so I could get Hilda cause best waifu~ Hopefully next game everyone can be a romance option for any gender/sex~", "Epic moment Fenix!! \n\nThanks you Kiara!!! ❤", "does Kiara already know she can hook up characters with each other?\nOne of the best parts of the game for me\n\nalso has she fallen out of love with Edelgard?", "I really hope Kiara eventually takes it to heart how many of us truly love these streams and watch them in the archives in order to not miss out on anything, whatever stats she sees during her livestream is misrepresenting her popularity... second edit: I just noticed a further 2k views have been added to this in the mere 7 hours since i originally wrote the comment, that says something.", "50:02", "Hey, both Dorothea and Edelgard are both bi", "Great stream. Sorry for the heartbreak. Youll find love eventually...\n\nThe music for the heartbreak was pretty funny though. Sory hehe.", "Pretty sure marrying sothis is difficult, you have to pick all the correct dialogue choices to raise her affinity. Fairly limited. Restarting isn’t too bad if your not too far in. Worth for Petraaa.", "I can't stop laughing lmao", "things Kiara have experienced:\n\nreply to a superchat sent by a stage 4 cancer patient (man vs society/people's view for a life nowdays')", "Algorithm-kun bless Kiara. Also, I live in the US, and I like that you stream early since I can watch you while getting ready for school and stuff!!", "I missed most of the stream but I was able to catch the end. Thank you for the stream Kiara! I will now work the cash register at KFP.", "I missed most of it, but never the superchat..", "I couldn’t watch this stream today, I was busy with work, I’m sorry chicken!", "Day 6 of commenting on Kiara's videos to help her with the yt algorithm", "34:51 a white onepiece-summerdress or a long,fluffy and tight sweater =)\nor ..what was it called? virgin-killer-sweater xD", "Thank you very much, Colonel Kiara 店長！Can always expect an emotional journey... 🐔❤️✨", "Another 5 hour vod to make my day", "Funny enough, I watched my mom play Starship Titanic as well. Classic PnC/Puzzle game.", "That's why with 3 out of 4 of my game plays I am playing with M! Byleth because I cannot marry most of my waifus 🥺", "3:05:24\nNow that's a teetee moment", "3:55:45 [insert headless chicken joke]", "50:03 is why you are here", "NOOOO I overslept and missed it", "セテスの声が出た瞬間コメ欄DIO祭りになるの草", "Back to watch the archive just like I said I would~", "For my reference 4:40:50", "I know nothing about this series but you make it interesting!", "Had to work, thanks for the vod! Sorry you couldn't get your wife of choice in this one, that sucks!", "58:35 But if you keep your grudges inside, they can nourish you forever.", "Ah yes. Just like Calli. You can't get her.", "Just wait for chapter 11...", "3:32:35 Fun fact: Hilda is also straight.", "Best grief RTA in HoloEN", "Tip: 1 goal is bad early on. It makes you lose 1/4 of your gains. (1 goal = 1x 150% gains. 2 goals = 2x 100% -> 200% gains). \n\nOnly very late game, when a character already has everything they need, does it make sense to set only 1. (Or when you messed up before and now need to rush a skill.)", "Welcome to the club, Kiara. Where nobody gets to have the girl they like. Big f.", "FE is my favorite game dont stop kiara!!", "You know Kiara, if you're gonna play Wind Waker, you should get a Wii instead of a Gamecube, it's backwards compatible and is probably a lot easier to capture the footage from. Besides, you can play the Tellius Fire Emblem games on there, and I bet you would enjoy those games!", "Kiara when Petra doesn't have the g a y: pain peko", "3:15:57 いいえ", "In regards to what happened at 50 minutes in, don't think of it as \"friendzoned.\" After all, in order to fall in love with someone, you ought to be best friends with them anyways in order to be able to stand them.", "grief RTA  lol", "50:03", "Hololive really is the light during 2020", "I like soul series a lot, but I think it's just too hard for kiara.*sad hollow noise*", "Kiara is thirsty for all the waifus.", "Who needs to marry Petra when you have FERDINAND VON AEGIR!!!", "いつか3Dでキアラが見れる日を待ってる", "I hope she chooses Edelgard", "I'm so sorry about Petra...you should definitely get her together with Dorothea at least, they totally bang.", "The Gamecube is indeed the best console, that was like a golden age for Nintendo. Wind Waker, Paper Mario, Animal Crossing, Pokemon Colosseum and Pokemon XD, Pikmin, Luigi's Mansion, the list goes on. Being a kid in GC era was the good life.", "Heads up: Have you made up your mind on what you want to do with Edelgard yet? She's balanced enough to be anything, but you have to decide early enough to train the correct skills. You won't be able to switch later on, so your time is beginning to run out. \nSo far you've mentioned Pegasus Knight. That needs Lance+Flying. You also mentioned mages having pretty dresses. That would be reason. You have only trained her in axes and authority so far. While authority is fine, axes would be a waste if you don't actually want her to end up in an axe class.", "Petra only likes Dorothea, I'm sorry for your loss w", "Kiara has Big Brain", "F for Tenchou....Petra is too dorotheasexual to care about other women", "KIARA can you give me a copy of this game? I WANTS IT. I like chess and this seems fun. GIB ME PLZ. Oh wait it nintendo. I'm playstation 3 boy.", "Being chicken is suffering", "KFPain", "who is  ready for chicken brain", "This a dumb question but does anyone know what song she was humming?", "Sorry Kiara, but Dorothea's game is mad strong.", "", "GIGGUK is the SIMP lord of our dreams!", "Possibly a spoiler below. Don't read more if you don't want to risk getting spoiled.", "Kiara I love you, imagine if she like, no? Ok", "She should really look at a list to who she can marry as female Byleth and who don't. Like wasn't it kinda obvious that you would have to pick male Byleth to romance most of the females? I was surprised there were even homosexual relationships possible when i found out.", "Kiara can't romance Claude because she chose the wrong house, and can't romance Petra because she's a girl. Truly the worst timeline.\n\nIf you do restart, choose from the start whether you want to romance Claude, Hilda, or Petra. All of them are heterosexual, including Claude for some reason. Doing a Golden Deer run lets you get all three in your house though.", "Hey, can we date?♥", "Mach mal einen ganzen Stream nur auf deutsch", "Tyroki says hi."]