["Her voice sounds SO GOOD with the upgrades.", "It really does", "yesssssss", "When did she upgrade?", "@POLMAO In the beginning she said she bought a cloud lifter for her microphone", "With these upgrades, we didn't stand a chance", "The legendary heart", "So true.", "@Warudo1 Happen to know what mic she have? It sounds so clean", "@Tony Nguyen Unfortunately i have no idea", "@Tony Nguyen Shure SM7B @3:08", "Kiara is just too pure to play impostor. She may be bottom left, but she's top right in our hearts", "Cafeteria moment.", "i like your profile picture", "Agree", "Can you explain the bottom left/top right thing to me?", "@Magitrix Alyxra it's from a chart regarding purity and intelligence of the Hololive EN members, where the top right corner is where the most pure and intelligent member is. Basically, everyone says that Kiara is the least pure and intelligent of the group LMAO", "top left*", "@Davidog ahhh, thanks lmao", "@Davidog why'd they gotta judge hololive vtubers?  They all God tier to me", "@Terence Playzz its all fun and game brother among the en members", "@Terence Playzz it's all right, Kiara's really good at both intentionally and unintentionally playing into it, and there's a bit of a \"gap\" (the contrast between her different aspects) element playing into it, too. As she told Subaru she's good at being the bullied and the bully lol (a stray joke during untitled goose game)", "I have never played an intense Among Us game in my life ever. I was jumping onto the wrong person however self restraint won me the game. Thank you for the opportunity and maybe next time, I can teach you the ways of imposter. ", "LOL Judas , Nice game and deduction by you , GG", "Apparently Judas MVP not just in Mario Kart but also in Among Us", "Truly an MVP. Both you an Egg were truly an even match. ", "Judas Always MVP, he's kinda sus tho", "Although EGG was a very good and careful imposter, but you were more careful than him. (SMORT) GG", "I might have said it once, but you're my hero o7", "JUDDDAASS", "Judas' internet OP, plz nerf", "You and Egg played a fantastic game", "GG well played Judas. You and EGG makes me stand up from my chair. It was one of the most intense game i had watched.", "I was really impressed with that round u did,very smart plays! Keep it up bro(the kiara simping and the smart plays)", "that time when you got protected by tenchou", "HOW DO YOU ALWAYS JOIN THE GAMES LMAO", "@Anonymous Duck he is speed", "Kiara kills Pain Peko in front of three witnesses on her first time as Impostor...\n\n\nSasuga Kiara... Truly pain peko...", "it's going to take atleast 3 more streams for her to get impostor again lol", "She managed to outdo Elite Miko's imposter play", "Nevermind, Miko just surpassed Kiara again by venting in front of 5 people without killing anyone", "I don't like how that Blayde guy was trying to control everything and delaying the match because he didn't wat to vote before giving his instructions.", "You'll be seeing that a lot more. He joins every stream that a hololiver is doing among with fans. He'll be back again and again.", "@Abraham he made Haachama’s stream shitty", "@Josh Riley I saw", "@Abraham lol what'd he do in Haachama's stream? He might be one of those \"redditorXdiscord mod\" types", "Damn Kiara's fanbase is actually really nice lol. Everybody followed the rules, the chat wasn't toxic, and there were no trolls", "Not what I was expecting but I’m also not surprised.", "As our employer she has our addresses, phone number and financial information. And has shown she has no problem killing us by the dozen. I ain't crossing her.", "RIP Ame chat. She literally wants to stop playing witcher 3 cause chat pissed her off so hard. She also now has mods because of backseat gaming.", "Tbh I see some people hating my man blayde when he’s just joining once every hololive among us stream and there was nothing wrong with telling kiara the general lobby settings lol", "@TheGreatEric02 I really don't understand backseat gamers. You wanna see someone play perfectly and make every move the way the game intends you to make, why not just watch one of those 10 hour walkthroughs of the said game? The reason we watch these streamers is so that we can experience the game along with them, and see how they experience the story. Their imperfections are the very reason we often enjoy watching.", "Kiara's bumpy start quickly weeded out the bad ones.\nAme's chat needs a lot of cleansing flame to ever even get into sight of the KFP.\nWell done, hatchlings. \nt. Teamate", "@ThePokemon Prince Just watch Haato’s stream and check the comments, they explain it all", "someone will definitely clip this 1:21:12 LMAO THE TIMING!!!", "\"I can't unsee what i saw\"", "Epic moment", "And the name too, peko truly bring comedic timing in the name", "The chat literally went \"somebody clip this!\"", "Literally every Among Us bad timing meme LUL", "Kiara fucking abusing her power and threatening to fire people was one of the funniest things I've seen, I'm crying", "Yep someone clipped this", "There are already with the Eric Andre intermission", "HyStab", "This was way too entertaining than I initially thought it would be. EGG MVP. Yellow Simp close second.", "EGG literally carried her", "It was an awesome play by egg. If only kiara sabotaged lights egg could’ve killed them", "Kiara: i wanna be impostor!\nImpostor Kiara: PANIK! ", "28:11 Kiara tries to type \"kikkeriki\" but is censored\nKiara... Have you been teaching us fowl language this whole time?!?! \n\n1:21:03 Kiara accidentally vents and is spotted by pain peko", "@NotBAITBUTXH Ok who cares dude", "@NotBAITBUTXH Ok just delete this it was already an open secret more than a month ago but it's not good to talk about it in Hololive", "Nice Timestamps LOL 😂", "How ironic is it that Pain Peko is Kiara's first victim", "@Some Dude don't engage, just report", "Kikke sounds like kiki.... which has a lewd meaning in filipino", "Argghhhh , the BOTS , report Time bois", "Ahhhh it's cuz it's close to a bad word for a Jewish person", "@NotAGoodUsername360 That's what I thought as well. Probably the \"kikke\" in \"kikkeriki\" flags it up.", "i remember seeing someone post that kikkieriki might be german for cock a doodle do.", "@Darkvoltinx you just made me realize, that she is kikerikiing the whole time and not everybody understands it immediately, since they are not german", "Kiara: \"He's a simp. That's why he's following me.\"\n\nAlso Kiara: \"Being locked in a room with a simp is scary...\"", "10:54 Kiara: hosted her server\nKiara Fans: \"Gotta go fast!\"\nAlso Kiara: \"You know the rules, and so do I... Say Goodbye! \"\n28:11 Kiara: tries to type \"kikkeriki\"", "Was the \"Kik\" part censored because of the apps more risque reputation?", "@WrensthavAviovus No I think it's because of a certain slur for Jewish people", "@WrensthavAviovus I would guess it's because of an antisemitic slur that sounds similar to that word.", "Ahh ok.", "1:20:33\n\nThis is the story of Egg, KFP's greatest hero.", "I was the blue crewmate and funny how i thought EGG was a crewmate. He is a really good player and this is the only game that i regretted winning😅", "@hatmo 12 Same, I was actually suspicious of Pink the whole time, so glad we didn't vote on 4 though. GG man! Mwah.", "@Judas oh hey. It was a good game and also stop giving me kisses 😅", "@Judas and here i am the pink one.. im just trying to clear the last task man :')", "@Argius FORGIVE ME T.T You were just so suspicious because your pathing was weird. I should of picked up more on the vent I saw in Medbay. I thought they were venting from medbay to electrical. I hinted that it could also be the other way around but I thought you vented into electrical, killed, and self reported. But now I know that if you see the vent animation out of vision, that means they vented out of there and not into.", "@Argius apologies pink i thought you were the imposter. Ggs", "@Judas is okay man.. red dead really make me sus lmao\ni thought you guys vote me out but skipping.. that was smart tho. gg", "but who’s egg\n\n\nthis man deserves employee of the month", "I see Amelia Watson has taught you well investigator.", "The stream went so smooth. from voice to internet to the chats.\nUsually game like this with set up like this has so much potential to go sideways, but it was well kept and entertaining through out without much hitch.  \nKudos to boss and everyone in chat.", "The employees, although fired and re-hired over and over again are doing their job well for tenchou", ">Hear Kiara say she is going to play Among Us with viewers\n>Finally buy Among Us so I can play with her\n>Spend 2 days playing game so I can know what I'm doing\n>night_before_the_stream.jpg", "Another Among Us game seems to be coming up tomorrow, good luck on getting in!", "pain peko", "I joined at about 1:41:00", "Kiara: Doesn’t move for 0.0001 nanoseconds\nEveryone: “SHE’S THE IMPOSTER! VOTE HER OUT!”", "Not even that she's streaming, but she's also pretty new to the game, and could have been checking her map or any number of things.", "I’ve used standing still as a reason before only if like they stop and then a realtor meltdown starts and then they move again", "I thought they were goofing around like \"this is the punishment for doing the task too slow.\" Cuz Green and Blue looked like experienced players and both knew that Blue was the imposter.", "Playing devil's advocate for a second here, as I think Blue's gameplay here is really interesting!\n\nIt looks like the moment you and Green are referring to is 37:26, where Kiara is moving around, stops for a bit, and starts moving again after lights go off at the beginning of the round.", "@少女時代 thanks for the write up. I enjoyed reading", "@When you're so early Thanks for reading! I also had a good time writing it", "Kiara : Do not see the stream while playing!\n\nAlso kiara : Lemme see the chat, OHHH ITS CYAN", "Chat doesn’t actually know who it is either though. She’s taking a risk by trusting their judgement.", "Kiara only survived past that round where she was caught red-handed by 5 people thanks to SIMPathy. Hummu Hummu.", "Nice", "Status Update: The trash has been taken out to the garbage alley, I repeat the trash has been taken out. \nI would like to thank all of my fellow KFP colleagues who help clean up the comment section, of course as well as other higher ups forces who might have taken care of the deeds \nI'm proud of our Tenchou, I'm proud of the KFP Army, and I'm proud of myself for being part of this absolutely amazing community ", "Good soldier follow orders", "Thank you for helping us!", "what happened while i was out, chief ?", "@T0RI 17 I was here the whole time. To sum it up some anti/bot at the end of the stream that was spamming something hateful about another hololive en member after the stream chat closed they then proceded to relentlessly spam the video comments with atleast 6 different accounts. The KFP were actively reporting those comments at the time. Eventually the video's comments were turned off and I think moderation was happening. After the comments were opened all of the spam comments were gone. There were more than 100 of these comments. The number of comments was 333 before the moderation and 205 after the moderation. Sorry if this is long.", "@Abraham I don't think those were bots. I typed in a comment on one of the spammed messages, and he responded to it.\n\nI tried to respond back, but he made it so I couldn't respond to it, like the pussy he is.", "Oh really, other streamers are getting harassed now? These guys love war", "@rahep It may be as few people as we think.\n\nEarlier, there was a bunch of spammers in the comments. You know how channels list the date they joined YouTube? Well, these spammers' channels were said to be made minutes within the time I watched them.", "@harborline765 I actually have the channel links they were made about a month or two and there is one almost a year old. They seem to just be random accounts.", "@Abraham Oh.", "@harborline765 maybe hacked accounts, or empty accounts you can buy? Those exist, afaik", "Mission Accomplished , need our janitor back as soon as possible .", "1:21:13 \nI laughed so hard at this one\nLolllllll\nI really love kiara’s laughter ", "Kiara: “everyone make sure to play fair”\nAlso Kiara: “If your job and family are important to you, you know what to do...”\n\nKiara’s playing hardball here lmao.", "43:50\nBeing called a weeb by an non weeb community (kalm)\nBeing called a weeb by a weeb community (kalm)\nBeing called a weeb by an anime girl", "People weren't accusing you for being too slow at the leaves part; the O2 popped right under you and you ran away from it, hence the suspicion.", "I got in the server and then got dropped feels bad...", "same, pain peko", "Feels bad man", "Pain - Peko , I wish you got other chance to join in the next stream", "I don’t have the game so I’ll send a big good luck to everyone who was dropped this stream. Hope you all get in next time.", "@Stumblewater 'tis free on mobile, if that helps.", "@Hraken Thx, but Ill probably just have more fun just watching. Thats good to know tho if I ever want to check it out myself.", "Those were some big brain guys in the last round. Very smart not to take a chance and vote wrong when there's 4 people left since the impostor could just kill one person to win. Egg was great, he would've won if he went up against  a lesser group.", "Since Albedo is still fired, I'm gonna need some KFP colleagues to clean up the comment section with me, scroll down and you'll see what I mean", "On it o7", "o7", "You got it o7", "I cant see any dirt anymore ", "o7 ill miss you Albedo", "What do you call a traitor among the musicians ? An Orchestraitor", "This power, it must be a Tentacultist, spreading Ina's religion.", "@NotBAITBUTXH Ok STFU", "@Shishir Raut don't engage, it's an anti trying to stir trouble, just report", "@King Mufasa Noted. Duly reported.", "@Shishir Raut the tako powers are getting stronger!!!", "Kiara was too much of a seiso idol to be an imposter\n.... until she became one. Then the Phoenix side kicked in and blood bath began.\n\nAs expected of Tenchou, swinging between Top Right and Bottom Left!", "Black: How can I see if the lights are out? (Which means his vision does not deplete when lights are out, which means he is 100% an imposter)\n\nEvery other person: Never suspects Black.", "when is this?", "I want Simp to teach me his ways.", "Wait,\n\nKiara moved, had kusozako internet...", "Day 9 of commenting on tecnhou's videos to help her with the yt algorithm", "Woah that's like 216 hours. Specifically segmented into once every 24 to create 9 separate instances. Dedication poggers.", "Nice , Keep the good works , o7", "F for everyone who can't join...Shrimp speed sure is fast btw...\n\nF counter: 3", "Thank you so much, Colonel Kiara 店長！It was really entertaining and your first Impostor kill in this stream will remain engraved in my soul as one of the most amazing things I have seen in my life. See you next livestream! 🐔❤️✨", "Why do I always see Blayde on every hololive Among us stream? Who is this guy?", "I don't know but I hope he drinks a nice bleach smoothie one day for trying to dictate to Kiara the way she should play the game", "Someone who didn't get enough attention from his parents", "He's a dude with big ego who just get called out in reddit and responded poorly because his ego matters the most. But things gets worse when other people started to defame him by using his name in other streamers and destroyed his reputation even further.", "@_BaniraAisu67 He deserved it", "School made me miss it gosh darn it", "20:15 I see Kiara not only watched \"Grease\" but also remembered the lyrics from the songs in it xD", "Hahahahahaha I was screaming \"It's a quote from Grease you idiots!!\" in my head when I saw that. I missed the show live, so I couldn't say anything. I'm just glad someone else knew it was from there. Hahahahahaha", "Respect for cyan \"EGG\" who carry hard last game for 10chou.", "I’m posting this to confirm that I hatched.\n\nEdit: confirmed.", "Nice , Congratulations for your Hatching My idol , Vgamer311 , o7", "@wolfz KFP Health Department Advisor Hm. The hatching seems finicky. I was hatched a couple hours ago but now I see an egg again. YouTube is jank as hell.", "@Vgamer311 hmm that's confusing , YouTube is Sick I think", "@wolfz KFP Health Department Advisor membership tab still shows a hatchling though, so there’s that.", "My mind was just blown watching this and realizing English is not Kiara's first language. I always thought it was and she learned the other two later. 💥💥💥", "It's pretty clear from her accent.", "@Y k Y k Not really. I have known plenty of people with heavy accents that just simply get it from family/people they know. Doesn't  change the fact English is their first language.", "My expectations for Kiara's first imposter game were somehow surpassed.", "Honestly, that's how I thought Gura's impostor game would be, immediately get caught afterwards", "1:21:04 The legendary moment.", "Oh God, disaster struck", "So many great scenes - really looking forward to the next Among Us stream.\nThis egg was on fire =)", "Be fair\nBlood soaked chicken: \"...if you value your jobs...\"", "Some short words here: \n\nALL HAIL EGG!", "THIS MAN SAID 4 COMMON TASKS LMAOO", "Arghhhh the bots are here , you know what to do KFP employees 🥚\nUPDATE : Mission Complete , o7 .", "Please Stop , Get some Help - Sincerely Wolfz , towards the spammers", "Deep fry the bots? Or should we grill them?", "@A RANDOM SKULL Both , Both are good 🔥", "@wolfz KFP Health Department Advisor Don't forget to wack the account also", "Yes boys, get those accounts deleted!", "So there're 5 Account , might be use as \"Zombie\" accounts to create Spams comments , This might happen in the future video , let's prepare 💪🏻", "Is it possible that Tenchou could simply block them, so they can't comment?", "@Syrak - KFP Wörker Drohne Mods are better than tenchou doing it herself", "Are these the C H O I N A antis?", "@Abraham I totaly agree, but does Tenchou have any?", "Aight we got the accounts name , let's report everyone", "@grace calis Honestly I wouldn't be surprised if it was them.", "@Blooper {Reloaded} Surprised they have time considering how hard they're abusing poor Miko for playing with Coco on Ark right now. >.>", "@wolfz KFP Health Department Advisor roger that", "Kiara's room is probably too buggy since they started with less than 10 people multiple times yet it always say the room is full when I join", "among us always been buggy.", "@JimRaynorRaider yeah I remember a private game with my friends where I pressed emergency meeting and got killed at the same time\nWhat happened next is that every cutscene we got jumpscared by the \"emergency meeting: and ended up waking the rest of my family because I can't contain the laughter", "I doubt the game was designed to have thousands of people attempting to join a lobby at the same time.", "1:21:12\n\nThis is certified 'Crystal Dolphin Among us meme' moment.", "Had to watch this one archived. I got weak and had to sleep. Forgive my weakness.", "20:24\nOther streamers: Gets angry at trolls; warns/kicks them out\n\nKiara: Trolls herself", "Kiara's voice is so much more crisp and clear now! Yayyyyy, we get to hear her better now :D", "Me: guys. I know bottom left is a meme but she isnt that dumb. \n\"Kiara proceed to use vent in front of someone, then when she tries to kill him for slience, get seen by three people within one minute\"\nMe: ... okay maybe she is a bit dumb and on the left but she can be pretty pure and seiso.", "I like to imagine that Kiara switches languages purely as a demonstration of her power", "Kiara I did my part and reported those accounts but you should probably straight up ban them", "Whoa, what happened?\n\n\nEdit: Just checked the rest of the comments. Thank you so much for your hard work!", "I was the bugged blue, I dont know if I should sad  or happy hahaha", "EGG will remains legend in meme later, I'm sure of it", "Our phoenix is no imposter, she's the genuine article!", "1:26:38 That \"Right guys\" killed me HAHAHA", "My reaction to seeing this was: oh among us that’s cool 😎. Wait... with viewers 😭😭😭 this is definitely going to be good.", "How is every sound out of this beautiful fire bird's mouth just an absolute ray of sunshine that the world is better for hearing?? It's fantastic", "Kiara using the Extra Crispy recipe on her sound setup I see. Sounds great Tenchou! Glad you were able to overcome some of your tech limitations :)", "Well, this is the greatest investigation of all time.", "she says boomer quote but even i remember watching Greese.she just call me a boomer?", "when kiara got impostor, the power of the apex predator surged within her, she cant contain the urge to keel\n\n... never change sweet child", "1:21:12 Pain peko died for our entertainment, perfect timing peko lol", "Ah! All these upgrades... It feels like Kiara is trying to seduce everyone. And it's working.", "Oh man, this was at 6am my time.", "thanks for the free kiss omg xD <3", "Oh man I missed another one I’m really slacking offff alarm whyyyyy  watching now!", "Honestly, this stream made me main kiara for no reason , she's super cute , keep fighting kiara , you do a good hard work here :))", "congrats on all the upgrades Kiara, stream's sounding clean <3\nalso, Grase Movie singalong night, when? =p", "Kiara: Be fair\nAlso Kiara: You know what to do...", "That stream was incredible lmao", "1:25:56 That's something an impostor would say", "That last game could have gone either way wow....", "SCREW SCHOOL IT MADE ME MISS THIS. will you be doing this again anytime soon teehee", "I understand that feel", "Check frequently her twitter for the schedule kiara did say that she would do this again", "51:24 - 52:22 Hlgh is one lucky guy", "That was a really fun stream! Thank you Kiara!", "1:21:14 wtf kill in front of them lol🤣🤣🤣\nr.i.p pain peko🥕", "I missed the stream ( ;w;)", "7:58 ‘scuse me?", "Becoming bugged just to get a Kiara kiss\nI see this as an absolute win!", "Just started watching this vid. Maybe I just never noticed before (too busy looking at her cute face), the jiggle physics are kind of slow motion.", "Egg you have earned my respect. \n\nKiara is proud of you.", "I love the stream! I think this could be good practice for when you do Among Us with other hololive members.", "Downloads Calli lewds, and kills someone right in front of a crowd..\n\nYup, definitely bottom left. :=)", "41:16 Hi Taki!", "I was finally able to watch the archive. It was enjoyable and I'm looking forward to those talk shows.", "Kiara killing him in front of everyone.I laughed it.", "?", "That was a fun stream, everyone is being chill and behaved. Keep it up everyone.", "Day 3 of suffering...I missed so many streams including this one because the electric power here is still not back....", "Ty for the stream it was great! I had heaps of fun playing! I hope everyone also had heaps of fun too :D", "20:14\nSummer Nights from movie Grease", "Egg \nKFP Employee of the Month", "Oh god she's so quick to vote lol", "32:27 ah yes a winning son reference.", "10:57 lol moments before the disaster", "hope you had a good stream couldnt tune in was busy having my first Japanese lessons ahhhhhhhh!!!", "I would have loved to join in with this but, alas, I had to go to work.", "1:21:48 Kiara bad manager confirmed", "1:01:09 sasuga kusatori. Lol\n\nwhy would green press button on reactor emergency as impostor unless he sucks badly? If there were 2, he would've gone with everyone and killed anyone to win, if there was 1, he wouldn't have pressed the button (thought the fact that he didn't go with everyone would've made him prime sus).So he should be innocent since, as he said, it was to prevent people from being killed (since button and kill cooldown is the same I believe), so either he was dumb, or he was innocent.", "The timing is too perfect 1:21:12", "i missed it cause of my eye doctor appointment  qwq", "1:21:12 we need to protect that laugh", "Somebody tell Samaritan that they’re hilarious.", "The intro reminds me of Chicken Invaders", "Damn next time I'll try to get in haha.", "The lover/best friend thing is unfair to the game.", "Pretty awesome to play with your fans. Wish I could have made the stream. New equipment sounds great!", "Kiara - I want to be top right!\nAlso Kiara - Download the Calli lewds!", "Thanks for the wonderful stream!!!", "Thanks for the fun stream Kiara, Love you.", "kiara is the only vtuber (besides pekora) that I can watch full streams of. its just the entertaining personality. For others I just watch clips", "1:23:33 Crime + The EVIL LAUGH.  Kiara oh no XDDD", "The last game made me 🤣🤣👍👍 you keep on playing Phoenix Queen", "\"2 short, 1 long, 4 commons\"? Why not 4 short, 1 long, 2 commons?", "32:27 Kiara doing gods work", "Audio quality is now 11 herbs and spices out of 10!", "I understood the boomer reference XD", "Kikeriki always lifts my spirits", "no way i missed this", "Nice pfp. I see you are a fellow man of culture, too.", "@harborline765 dw about it, i identify as a guy. thx!", "I barely missed the stream. Goddammit.", "How much would you pay to be one of the rats scurrying through Kiara's walls", "Nice grease reference kiara 😂", "Kiara is so suspicious all the time", "Yea, the SM7B is very notorious for being quiet. Good to see that you got the Cloudlifter! \nAnd yeah, if it goes into the red (clipping) when you're not even at your loudest, you should probably turn it down haha. The audio will distort otherwise.\nAlso, congrats on your new internet!", "If egg had killed green and framed pink he would have won", "She got the Ghostbusters for mice 😂", "Bottom left death at 1:08:07", "Kudos to all of the good employees who followed the rules! ", "That egg will be a proud radiant phoenix one day!", "Yooo egg is a mastermind. Carried kiara over there", "damn son that mic quality!!! ", "Highlight of stream: Tenchou apparently too Bottom Left to be impostor XD \n\nAlso: Egg absolute Chad MVP!", "2:09  kinky Ricky?", "20:18 got that reference :o", "That last round tho pfft", "How do they join so fast? Isn't there like a 10 second delay or something?", "Kick et Ricky!", "Best English in hololives:)", "Hahahahaha ghost mice. How does ones house get that infested by rodents??", "It was a fun stream.  Joiner boys be fast.", "What is the straight joke at 23:45?", "Nice Among Us stream and  EggPIC game by Egg and Kiara  in the last game .\nMOAR Egg Puns , Moar Egg Puns .", "Hope she does more games with viewers.", "Any timestamps anyone?", "😀✋👍👍👍👍👍VERY BEAUTİFUL THANK YOU❤❤❤❤❤💯👈", "Oof, I woke up an hour late on the stream. Had to rewatch the entire stream, so grats Kiara who won 2 rounds and finally become the imposter. So Kiara becoming a crewmate too many times and only became an imposter in one round, quite the top right . Thanks for the stream.", "Are microphones tasty?  Vogel-Chan? 😇", "Egg is a GENIUS, it's such a shame he couldn't clutch it in the end.", "the sad thing is that people could easly back out change name and rejoin again later. D:", "What server does she play?", "Kikkeriki the first 5 letters could be read as \"Kike\" a slur for jewish people, obviously thats not what it is but you know how chat filters be.", "Wow it's been so long I figured that word was long forgotten lul.", "Press F for our boi EGG. He carried hard for our CEO.", "Question, what's with the 8/10 and that other says that they can't get in her room? Is there a glitch or something?", "The room have Bugs , some people unable to join even the room is not full", "@wolfz KFP Health Department Advisor Oh, does that happen often? I think that only in her stream does it happen from other gameplays. I might be wrong though.", "@Blue FanofEverything it's might because of the new anti cheat system added into the game might have some bugs for now I guess.", "1:21:13", "if they don't leave? can't you just change your name?", "If only I could’ve join to you guys but I had class...", "1:18:00 I tried to kill a simp but I missed", "I probably should have let lofthouse get the last kill bc apparently he didn’t want kill kiara", "Ok I see who killing me now lol", "Kiara we will be there for your 500k celebration", "Kiara chasing white around the map was soooo funny lmao", "I forgot my steam accounts password so I couldn’t play ;-; \n\nMaybe next time.", "F. Here's hoping you've got your password next time round ", "Comment", "Kiara, you're my favorite streamer!", "Just report that dude in the comment section. You'll know who it is with the spam lol", "Done", "There's many of them! Though after bot cleaning in Coco's stream, this feels like nothing. Edit: i see 1 guy using 3 accounts. Seriously why didn't youtube had an anti spam feature built in?", "Three , I see three", "This needs to get noticed more. Dropping a like. Thank you fellow KFP staff ", "Yeah, I've been going through each account and reporting them. Thanks!!!", "So they're using old account as \"zombie\" account to create Spams comments , might happen in the future video also so be prepare", "@wolfz KFP Health Department Advisor I'm ALWAYS prepared. As long as I draw breath, those antis won't get their way.", "@harborline765 respect , o7", "1:21:05 I can already hear the crystal dolphin", "Egg is an actual master of acting", "To anyone noticing any comments/chats referring to a particular Holo EN member, pls help out by reporting the spam. All in service to the KFP Empire  ( Edit: Also, be sure to downvote those comments to oblivion. @Nursery Rhyme )", "I agree, but what we can report them for? I mean, what should I choose when I click on report? Nothing seems to fit", "@Davidog They’re clearly spamming the comments man. It’s pretty obvious what to report", "@Davidog spam obviously", "@Nursery Rhyme technically harassment too", "@Nursery Rhyme ok thank you, I was thinking of harassment", "@Davidog Yeah. I went with spam report too. Thanks for helping out. Hopefully this comment gets boosted ", "On it", "The spam comments keep coming nonstop, smh. I already reported about 15 of them.", "report the account too", "@JimmyRustler Alrighty. Noted", "We got you , we already got the accounts name , so let's also report the accounts", "Ladies and gentlemen, we got em, The bots are gone. Good work boys!", "Bots are gone for now after the comments were turned off but it's possible this might happen again in the future keep an eye out", "@Blooper {Reloaded} Noice. Thanks for the update o7 ", "@Abraham Duly noted o7 Will continue to keep an eye out for the KFP franchise ", "hype", "sad I couldn't catch this live, but excited for this VOD", "Awwww, missed her being an impostor. I may have approved at my test, but at what cost? :(", "Love you Kiara, you’re a humble and loveable girl!", "Thanks for the stream Tenchou! :D", "Please report the spam", "Thanks for commenting on this. Hopefully fellow KFP staffs would join in to help out ", "@NotYetPro Edit they use a lot of accounts there is a thread where it shows the names of the spammers", "We Got you , Kikkerikiiiiii", "Just missed it. really wanted to play", "I wish i could have played too,but i have online class all morning,anyways,i will watch it when i have time :)", "NOOOOOO!! I miss the stream because of work... again... :'(", "Wohnst du in Deutschland oder in der USA", "Ich hab gehört du sprichst deutsch UwU\nNun hab ich bock bekommen dir zu zuschauen", "Guys remember to report the bots too, not only the comments", "-Still no live chat replay in VOD? :c oh well-\n(It's been turned on since I made the comment)", "yooo kiara if u just turned it on from seeing my comment ARIGATHANKS <3 best birb tenchou", "Orange sus", "Kiara singing her opening song warms my heart", "Judas final decision to skip vote is so clutch, this feels so intense", "That was a great stream! ...is what I would like to say if i hadn't missed the stream. Watching it now...", "thanks for the game Kiara hope you have more fun with the community. Oh yeah i also enjoy that you are considerate in speaking in japanese for the JP bros. i think that is very endearing because it was hard on us to miss out on the holoJP members, so you translating for the jp bros so they can follow on what's happening is great. -TakoTaki", "sucks that i didnt get to kill you though when i was impostor that game lmfao", "I wanted to play too, but my game always made a mistake .c", "Me prende", "1:21:14\nThat was indeed pain - peko", "1:21:12\nWait, did Gura jynx you by any chance?", "1:21:04\nClippers, you know what to do", "The fact that she got away with 1:21:15 completely baffles me", "Ggs kiara it was fun to play with you. Also i thought egg was crewmate with me. He played real good", "KikeriKILLER", "Alright boys, spit it out, where's the clip of Kiara killing black in front of everyone?", "1:21:14\nPain peko", "@Math 10Q!", "I'm still searching the clip where she mentions the Marine LEWDS xd", "Blayde the Backseater", "It was a very fun stream!!!", "あなたに感謝しない人は精神薄弱、あなたを悲しませてくれる愚か者、あなたを逃がしてしまう愚か者、あなたを好きな賢い人は賢い、あなたを幸せにする人は素晴らしい、そしてあなたとあなたの人生を過ごすことができる人は幸せです。永遠に幸せ！\nPeople who do not appreciate you are mentally retarded, fools who make you sad, fools who make you slip away, smart people who like you are smart, people who make you happy are great, and those who can spend your life with you are happy. Happy forever!（∩▽∩）", "Those are some wise words.", "Don't worry, Kiara. You have already tried your best to play the last round as a imposter. This was the best round for us that your partner, Egg, was still carrying you after you've voted. It was fun and nice. Hope you will play Herny Stickman Collection in your channel, which was the same author of Among Us. Have a nice day, Kiara. Thank you!", "egg couldve framed one of them bruh", "Hey I just wanna say kiara watching ur streams make my day infinitely better", "Congratulation on breaking your Crewmate streak Tenchou", "lol are we keeping count?", "LOL", "@Abraham Not hard keeping up, if this stream was the first time she was an Imposter lol", "Aww I missed it.", "My friend forced this game upon me, and even now I don't have it installed.\nIt's fun to watch though.", "BrUh. I missed all of this. :(", "Haha Kiara stream always fun ❤❤🤣", "it takes a brave streamer to play with viewers", "Well we got 3 salty people here, report this user (YT account made several days ago):\n1) Kooki Bnd\n2) Badrawinggood Uploads\n3) ThePlayerWhoCamps Caamper!", "If there's more spammers, dont forget to report YT user(s) with additional report include the link for this stream so that YT staff can see the evidence of the spams.", "More than 3 now", "4) Cassiano Rigger\n\nsmh antis going and bothering kiara of all members is actually fucking disgusting", "@Chibs She needs mods I don't think she should do it herself.", "5) L2D skins\n6) Bick Shick\nPS : Please Edit these name to your comments to help other people to report the accounts , TQ", "every 10 minutes they change accounts. So far they have used 5 alt accounts", "Now there's six of these bastards! When will they stop!?", "why spammers starting to target kiara? they were not here last time i was watching the ocmments of kiara's stream", "@Mad Tech Probably because they find her to be an easy target due to her being the least subscribed member of Hololive EN.", "@Mad Tech  they target the entire hololive , and it's sad", "comments have been turned off", "@Abraham it's needed", "Booooo look at this nerd using mouse\nCouldn't be me", "Alright boys, we have got some bots from an anti that has way too much time on his hands, I need you guys to do your best to report them as fast as you can, because they are flooding the comments, and fast! Do it for tenchou!", "o7 ", "o7  on it!", "There's now six of these bastard bots, keep reporting boys!", "o7", "Just reported ALL the ones I could see, but I hope kiara bans them, it will resolve the problem fast", "We got you o7", "Who is tenchou?", "@Infamous Hudson Kiara", "@Infamous Hudson Tenchou is Kiara, that's her nickname because she is the manager of KFP.", "Guys, I think we did it! The bots are gone! But just in case, keep patrolling the comments for them!", "GG everyone , Nice job 👏🏻", "@Blooper {Reloaded} I've been checking all the hololive EN members Video , no spams so far", "Yes i saw someone named casino he spamming gura past identities.", "Well now i will focus on Miko stream. Her stream is like reading wikipedia in different languages. The bots is spamming nonsense, donald trump tweets and other things in many languages. Protect Coco and Miko.", "@Infamous Hudson Godspeed soldier! o7", "@wolfz KFP Health Department Advisor Good job. They are most likely targeting kiara might happen again in the future", "@Infamous Hudson It's so sad that it has come to this point. When everything  is over we can look back and see how things have changed. For now lets look to a better future.", "@Abraham we will be prepare for it 💪🏻", "Ame also is streaming today, so when that stream is over I recommend you guys also patrol those comments too just in case they try it again.", "@Blooper {Reloaded} Understood, G. I plan to watch the stream, and I will do so like a hawk.", "@Infamous Hudson The bots from miko's stream, after it ended, went to pekora's stream", "Samaritan got hunted down by Kiara.... lucky guy.", "Spammers I dont care who the anime girls are , ofcuz everyone here know there are some girls playing games behind the L2D or you just thought they are robots or something ?", "Were they spamming her other account?  I missed this live", "@The Funk It was in the comments here, they're gone now thanks to us.", "@Blooper {Reloaded} good work"]