["Kiara is truly the best. She read super chats for over 4.5 hours and made sure to get through every one of them. She was able to endure all that reading, even after so many people left. After this stream I think she should rest her voice as much as she can.", "Uncultured Weeb also Danke", "Danke schön! Agreed She is great Phoenix!", "They will forever echo in my brain. I’m ok with that.", "A legendary stream from a legendary bird", "Might have to change that name to Cultured now lol. Congrats on getting noticed!", "She really is just like her favorite senpai! Amazing!", "Since you got noticed by Miss Phoenix herself,you might wanna change your name to *Cultured Weeb", "@juldor93 way to downplay someone jesus Christ how insecure can a person like you get LMAO", "@Yousei i'm not downplaying anybody, if you felt that way it means you are the insecure one.", "@juldor93 insecure kid, stop being delusional. What would your parents think of you LMAO", "@juldor93 must be nice judging someone's effort and hard work from outside without any information huh? gain perspective and be a better human being.", "@Neko dont give him any time. His worthless parents have made him grown up to be insecure lol", "@Yousei I stated nothing but facts as a response to the ridiculous pampering and simping that's going on here. stop being such a simp.", "Nick while he does sound a bit salty he’s not completely wrong, personally I dnt have a problem with her tho she prolly worked hard to get here", "@Neko what information? maybe help me out and tell about the perspective that i need to gain??", "@Nicholas Joseph I don't have a problem with here either. It's the ridiculous simps that I have a problem with. They are just as bad as tier 3 pokimane subs I swear..", "@juldor93 autistic kid, are you still delusional? Need a hug you insecure lowlife LMAO", "@Nicholas Joseph nah the other dude is just an insecure kid lol", "@juldor93 how did you know that she worked less than those hard working office workers you talk of to get where she's at right now? sorry if im wrong but you seemed like an incel to me, or maybe you're a kid or got laid off because of covid and salty about it, if that's the case then sorry to hear that.", "@Neko dont argue with autistic insecure kids, they tend to have bad upbringings", "I made the stream this time to see Suffer Chat", "Kiara, feel free to self-translate what you're saying into whatever language you want to (even bird). Other multilingual vtubers self-translate all the time and nobody minds. Keep up the great work! 🐔❤️", "Pikamee does that all the time and no one cares, I don't get it", "I worked on a cruise liner for 6 months of my life bilingually. Self-translation helps multiple audiences follow what is happening and is useful for filling dead air or downtimes where nothing would usually be happening. You just need to avoid getting bogged down in trying to self-translate into so many languages that it slows the delivery of whatever content the audience has come to see.", "@Fábio Eira there's just a wave of new vtuber viewers coming in because of Hololive EN, that person probably just ignorant af (but still telling a streamer to change their way of streaming is really dumb), i hope they doesn't have bad intention.", "@Neko omg when that happened it was like literally instant depression. She went from being happy and thanking everyone to going silent, stuttering, and crying. My soul was dying, it gave me second hand sadness.", "@Alex Gilpin hello what about byelingual moments can you have tips?", "Fábio Eira bc Pika is translating it for EN speakers... ofc a selfish EN speaker can’t consider someone ELSE might need translation in a different stream. i’m sure multilingual streamers have the same problem with viewers who speak their native tongue. peoples minds are just too narrow", "@T-Mo Fisher yup, its to be expected from new en viewers though, just look at twitch chat, we can't have nothing nice", "@Fábio Eira You have to remember that first world westerners tend to view content that doesn't cater to them 100%, 100% of the time as a personal attack", "Isn't that kind of talk just as bad?  There's plenty of us new viewers who love the EN hololive group and want to see them succeed.", "@Fábio Eira this is a new influx of normies who probably only watched hololive jp before this. Thus they aren't accustomed to it and complain.", "It's not a problem but maybe because she is new at it she doesn't know the right things or timings to translate disrupting the flow? I haven't really felt it honestly but I'd guess that is what the reason is", "Kiara's honestly such an incredible member of HoloEN. Being trilingual is INSANELY hard and not using it to spread the infectious endless enthusiasm and positive bubbly energy of this pheonix is doing such a disservice to herself. I'm glad the JP bros can enjoy her content how we do the bilinguals of HoloJP; you can tell she's got incredible chemistry with everyone already. Looking forward to seeing great things being part of KFP.", "Yeah, and she's speaking three languages fluently, which is amazing and takes real effort.", "Yeah man, I can't believe there's people complaining about this, there's nothing wrong with trying to involve everyone.\nAlso, since when do HoloLive fans don't like japanese? Smh.", "The language is the most invaluable treasure of any civilization and cultures. I really admire and respect Kiara's ability with the languages and all efforts to connect with all the fans around the world.\n\nI wish I could speak one third of the Japanese she is able to speak. I hope I can learn a lot by listening to her talking in multiple languages, It has been a good brain exercise so far.", "I honestly really hate her, she is so self centered. She gets light criticism and begins to cry for sympathy. She annoys Pekora and constantly embarrasses the English speaking fanbase with her poor behavior. It is a shame. I hope she graduates soon.", "@Khazar Milkers Agree", "@Khazar Milkers  I honestly really like her, she is so amazing. She gets superchat and reads them all for four hours straight. She adores Pekora and the English speaking fanbase as well as JP fans love her back. It is a blessing. I hope she stays forever.", "@HappyLampJacker Agree", "@HappyLampJacker Haha well no surprise a brony would have terrible taste!", "I'm also german and english is my main secondary language. This past week Kiara's great japanese skills motivated me to taking up seriously learning the language again and so far it has been an incredibly rewarding experience and I'm eternally grateful to this eternal MVPhoenix for the inspiration!", "@Khazar Milkers Why you here then? Geez, let people enjoy the things you are too butthurt to enjoy yourself", "@Khazar Milkers Why don't you do everyone a favour, and piss off.", "@konnigratz I will once you understand how to type in English.", "Khazar Milkers she didn’t plan to get criticized during the stream, nor did she cry for attention. She was obviously stressed about it, and just wanted to make sure everyone can enjoy her content. Worried that self translating is bad for the stream, she got anxious thinking about how she could improve and started doubting her abilities because she got emotions like every other human. There is no reason to hate someone just because they have feelings.", "@DevDev Giitar19 You are too naive to notice when you are being manipulated. Perhaps in the future you shall become aware.", "Khazar Milkers i’m not naive. i just want to enjoy this new streamer. give it a rest.", "Khazar Milkers it’s just embarrassing to cry when there was over 20k people watching. it couldn’t be faked. not all women are manipulative you know.", "Khazar Milkers i don’t know much about her, and nether do you. no one does. so you stop assuming what she did was for her own good.", "@DevDev Giitar19 Yikes bro! 3 Replies, I get it you're upset.. I would be too if I was so easily manipulated. Delete those and come up with one that satisfies you and then get some sleep, your first day of middle school starts tomorrow!", "Khazar Milkers i’m done with you. just bait at this point.", "@Khazar Milkers why are you being such an asshole to her and others who love her? Get the fuck out, you dont deserve ANY of these wonderful girls. Stop being hateful to someone who is only trying her best to entertain and include everyone.", "@DevDev Giitar19 I'm pretty sure that this thing has an onlyfans account which is why it felt really salty about how successful these amazing girls were. So give it a rest my dude.", "Mart Angelo Ilagan haha yea true. I wanted to watch V tubers in peace, but seeing someone say something like that got to me. I don’t want an incident like Aloe’s to happen again.", "Khazar Milkers \nThen get off her channel, lmfao.", "Please don't feel like you have to have some kind of skill to make people want to watch you, you don't need to compare yourself to the others like that. They're them, and you're you. We watch you because you're such a warm, kind, cheerful person, it's impossible to watch your streams and be in a bad mood. You started as a Hololive stan just like the rest of us, obviously the other ENs could easily have been fans too but you wear it proudly on your sleeve and that makes you feel like one of us, like we're on the same level, along with how much you engage with the community (I love how much you reply to things on Reddit!!) and that's such a nice dynamic that we can't get with many other streamers. And on a personal note, you're so honest about your emotions, which is something I wish so hard that I was better at, and watching you do your thing makes me feel all inspired and happy, it makes me see that you can be that kind of person and still be amazing. I wish I had a friend like you. You just be you, because we already love you. KFP! KFP! KFP! KFP!", "Couldn't have said it better myself! Also, it looks you got noticed!", "@Ebi & Tako Burrito I'm happy he got noticed, that part was literally the saddest thing that has ever happened, like actually, she went from motivated to sad so fast, and the fact that she was still sad even though chat was spamming good things just because one guy wanted to say something broke my soul", "@A smoke detector I dunno I think at that point a variety of things were already getting to her, that was just the straw that broke her back. It wasn't a malicious comment either, I'm sure he meant it as an innocuous suggestion, just things piled up and yeah. I just really hope life as a Hololiver can become what she was hoping it'd be soon.", "@Hælendleof Loc, KFP Scrub it was definitely a combination of already existing stress and the fact that that comment kinda was suggesting that some people are bothered by her translations, which in her own head thinks that's the only thing special about her, I see no problem with it, I mean hololive is a mainly Japanese company after all, so is its fanbase. Idk, either way it was extremely difficult to watch, the best we could do was just send in comments.", "@A smoke detector She seems okay now at least, and superchats have chilled out a lot so hopefully we can avoid exhausting her again :p", "@Hælendleof Loc, KFP Scrub yup, shes playing mario 64 :>", "sorry I don't want to be that guy but can I get a timestamp?\nI watched her mario 3d stream and she referred to it\ndon't know what happend exactly", "@Duck just watch the stream, its obvious when it starts", "@Duck Iirc there was someone in the comments asking about it and someone gave a timestamp there, or we spent the whole stream afterwards spamming hearts in chat so you can follow the hearts backwards to where it starts", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "@TrojanPiece He didn't mean it maliciously, and he's sincerely apologised to her since which Kiara accepted. Don't think too harshly on him. He just has wrong opinions.", "@Hælendleof Loc, KFP Scrub Well yeah, giving wrong advice to her could influence her to change her ways, which is why it's completely fair for me to be this mad over a wrong opinion", "Does it even need to be explained why this girl is so lovable?", "Nope! X3", "No", "she works so hard for us she deserves so much love", "No, but explain it to me anyway", "Seriously, Kiara is great. We all often have feelings of inadequacy, but I hope we can work through them with the support of one another. The unity we had with this stream for our fave phoenix was incredible. I hope you felt the love we were trying to show you, you truly are incredible and we want to support you as long as ‘eternity’ lasts. I shed a few tears as well, haha. I Often have feelings like those as well; but I want you to know all of us love you for who you are. No need to change anything, the Kiara Fan Club has got your back, as employees, and as people you can count on for support. Seriously, we love you, and we want what’s best for you. Stay true to yourself and we will back you up! KFP is Eternal! 🧡❤️🐔", "Summary of the stream:\n\"Danke schön\"\n\nWe love you Kiara and will always support you.🎉❤️🎉❤️", "Teri teri it was either Dankeschön,Pi pi pi or Danke", "dont forget about feeling dank", "pipipi!!!!", "Danke shun", "Absolute MVP birb reads superchats for 4 hours.", "Most Valuable Phoenix indeed!", "Much love ❤", "Polka: am I joke to you ( 6h )", "Can't believe I missed this LEGENDARY STREAM", "do you know at which time she started to read superchats from this stream?", "today's lesson\n English : thanks\n German : danke\n Japanese : arigatou", "feeling dank", "Norwegian(viking): Takk", "@Playhardtolittleget Spanish: Gracias\nFrench: Merci\nKlingon: nuqneH", "Italian: Grazie", "Kiara: starts crying\n\nChat getting the hearts ready: \"So you have chosen... wholesomeness.\"", "Do you have a time stamp where she starts crying?", "@ドランク around 1:50:00", "@Owen Mathous thanks a lot!", "@ドランク No problem", "Imagine being so fucking entitled that you think you can tell a vtuber not to speak one of her multiple languages and to try and engage the JP audience in the stream.\n\nThese little shits need to shut the fuck up and I wish our little birb would stop giving them attention. Most of us wouldn't be here if it wasn't for JP hololive and translated videos thanks to our JP anikis. Show some goddamn respect.", "For those wondering the time stamp for when she starts reading the superchats of support that came in while she was crying, and start making her tear up again, it starts about the 4:02:15 point\n\nEdit: And goes on for quite a while <3", "@Grizz 100% Agree with you Man. People need to really read & understand the VTuber Chat Rules instead of ignoring them.  \nP.S. I hope this comment of yours gets more \"likes\", \"up-votes\" and/or even \"pinned\" because it's the honest truth!! Respect", "What is the timestamp for the SC that made her cry?", "@Grizz he apologized to her on twitter and was most likely not trying to be mean.", "1:48:37 We love you Kiara! \nDon't stop to doing self translate or Multi- language either Japanese or German or English. It's not wrong and WE LOVE IT SO MUCH!❤", "i like that she speaks both too..", "I don’t think that super chat was intentionally to make her upset but I can see why", "Thank you for the time stamp.  This news is getting around online, and I wanted to know what on earth happened.", "1:48:37 The Incident\n4:01:45 The SC's that came right after", "Thanks for this I had no idea this happened", "That was...admittedly a LOT less dramatic than I THOUGHT had happened (it's the internet, I expected complete and total blunt rudeness when I heard she had started crying), but it's still rather harsh to ask something like that, given that in her intro stream she said she knows other languages. It should be expected she'd speak them too.", "thanks for your service to all those who aren't able to watch the whole stream for whatever reason!", "I'm not sure if she was crying to the question or the SHEER OUTPOURING OF SUPPORT that came after it", "@universalperson she started crying because she got criticized for the one thing she perceives to be her strong suit compared to the other EN girls.\nshe continued crying because of the outpouring of love of chat.", "@Uzume OrangeHeart right?  I thought it was some crazy ridiculous insult or something too so I had to see what was going on", "Im hiding in this comment, i don't care about that guy apologizing it's no matter for me, I'll forever hate him for making her cry. You may hate me from doing this.", "@Diavolo the person apologized?", "@Flugmorph on twitter, yes.", "@Diavolo All I can say is that I'm picturing you going \"YURUSANAI\"", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "@TrojanPiece Bruh calm down it's not like he sent her a death threat", "Kiara: \"How you became so strong?\" \nMe: \"Everytime you say danke schön I do one push-up\"", "BegissoR oh god. how many push ups did you do?", "@- Kyrel - Yes.", "After that many pushups you'd probably start pushing the world down XD", "BegissoR so,how strong is your punch now? and will you repeat this everyday?", "@- Kyrel - 100 Pushups, 100 Situps, 100 Squats, and a 10 Kilometer run, every single day!", "Be careful you could become bald if you do that. 😏😂", "KN1GHT erase that,it would be 100 to the power of 10 pushups", "Have you gone bald yet?", "So I guess you have chosen to become One Punch Man.", "@AZZAM - BG, KFP Chair-Kun ONE PUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU\n3 2 1 KISS JOE", "L3WD: 2:39:25\n\nBest Moment: 2:48:00 Super Chat Explosion!", "Great to be part of that moment ❤❤", "@Byakuei Me too :D", "I was part of feeling dank great times lol", "It's spelled \"Vielen Dank\". Just a friendly advise from a pedantic German xD", "@火の月Amvs Yes, this stream is gold.", "@Claw 76 Thanks.  German sounds pretty interesting.", "@Krulty Senpai Well I'd say it's not worth the effort to learn it. If you mean how German sounds, then I can't really say anything about that. I'm a native speaker so everything sounds normal to me", "@Claw 76 I am not dedicated enough to learn it, but Hiroyuki Sawano makes some great german songs.  I enjoy listening to it.  It is also awesome to know that Kiara speaks it, here is hoping she will sing a hiroyuki sawano song in the future.", "Were the super chats delayed or did I just get scammed?😂bruh istg I got fucking scammed", "@Marthley What happened to you?", "Krulty Senpai well sometime around 1:54:00 I done a super chat but it never showed up😔YouTube needs to fix their platform", "@Marthley I am sorry to hear that.  That is my biggest fear when donating.  I hope you get a refund from Youtube.", "mhm yeah, give me that honey. lmfaooo", "1:48:37 Wait... someone is actually bothered for her self dubbing in japanese? \n.\n.\nWhenever I hear about this type of problems, I always remember that one clip I watched where coco explaining the type of streams she do... that clip is always funny to me because she basically want to say \"just search for whatever the fuck content you actually want to watch\" but she's trying so hard not be rude xD", "Selfish people who think the stream is all about what THEY want. I like it when people self dub because it includes so many viewers", "They have no place in inclusive gang", "man, Kiara is legit stunned and confused for a couple minutes. That is like an unwanted present inside a nice box.\nno respect for the specific simper, simp without attitude \"break the flow\" what flow ? does he want waterfall ?", "@Jeanne Cross its ironic because he kinda broke the flow of this stream by making her cry. He prolly feels like an ass now", "@Noire Blackheart He has already apologise to her, explaining the tone of his SPC was no to delibarate hurting her. Look", "@Regal Sanchez yea... like I said, he probably feels like an ass", "@Regal Sanchez That's just him being insensitive. I don't care if its not his intention to hurt Kiara coz it DID hurt her. Its like driving at high speed and hit someone and saying it was not his intention to hit somebody. Typical westerners, slways rude and always expect others to suit to their preference.", "@Noire Blackheart a stinky hairy ass I might add.", "@Armel Renz Lazaro   it was rude, I cried when I seen that still feel bad. Although on the other hand Ithink it was good to have that SC. He not the only person that has said stuff similar to that. This really it let her open up about it on stream so we could see that we need to give her much love she seemed to doubt herself really want the best for this chicken", "They already made up on twitter, its just a misunderstanding no need to harass the sender", "@Huez Noice no ones harassing him.", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "@Noire Blackheart almost every reply on this comment is harassing them. Or is calling somebody a prick for making somebody cry when they didn't mean to not harassment?", "I take offense to the fact that you hardly spoke any bird in this stream.  Do your best to rectify this issue in the future.", "Self-doubt is a serious killer. I'm positive that at least Mori and Amelia both have feelings of inadequacy about their Japanese skills, and maybe In'anis and Gura as well (though I'm not sure what their level of Japanese proficiency is). It's important to remember that you always have something special to offer just by being you, even if you can't see it at the moment.", "Jokes on you, I speak four languages! Jokes on me, the only language she speaks that I can understand is only English....", "If she really has doubts regarding the \"acceptable\" amount of JP translations during her streams, she should consult Haachama and Coco.\nI assume they've dealt with similar kind of feedback (e.g. some JP dude requesting Haachama or Coco to reduce the EN self translations during their JP streams)", "I mean she could do a stream completely in japanese or german and we'd still watch it 😂. The international audience isn't picky we've been watching streams in languages we don't understand ever since we've stepped into this community. As long as it's cute we'll watch it (✷‿✷)(✷‿✷)(✷‿✷)", "@kb unfortunately people are picky. There's a lot of people that hate her self-translation.", "@John Bao not a lot, but just some, lol. Most of the people who hate her self-translation are pretty much a holo-newbie or prob just a newbie in vtuber community in general", "@Fareast S. Northwest Fair, fair", "@Fareast S. Northwest yup, 99% they are new, because majority of the people who have been here in hololive for years or months doesn't have a problem with it.", "@kb It's that vocal minority that Kiara sees that gets to her. Also has a lot to do with twitch kids coming into these streams and using twitch chat behavior where it isn't supposed to be. Most of us don't mind the insta translation. It's a hell of a skill to have and it allows our JP anikis to engage with the stream and the streamer more.", "Iofi did talk about it once on twitter so I assume they all got it too.", "Pikamee got complain about that multiples time's, she refused to not self translate because she doesn't want to alienate her fanbase, which is a 50/50 split jp/overseas according to her. But also because she like to interact with everyone's", "Bruh, these new frogs and their talk about FLOW of a stream. so cringe man.  just let the streamer do their thing and if you don't like then go watch another stream with the \"flow\" that you enjoy.", "Actually in the begining HOLOLIVE ID also got criticism because they speak Indonesia less. But its about demographic, even its Hololive ID, for example like Risu, i think now her sub and fanbase more from overseas, then indonesia, then Japan. So she speak english more. Some people also ask her to do more indonesia, and i think she handle it well. Kiara maybe can consult with her. Other case is like Iofi, she also poligot who speak more on japanese.", "@Fareast S. Northwest is that an insult to me?", "@Sei Shōnagon Nah lol, just stating a fact. Obviously it wouldn't feel strange for someone who is already in the community for awhile to see vtubers do self-dubbing since it's already been done on HoloID, Niji ID, or some JP vtubers who could also speak English like Coco and Pikamee, but if you're new ofcourse it will need getting used to.", "@Fareast S. Northwest Its fine lol, I am not new . I am just really not used to it , I am usually around Coco who talks English for tid bits . So I am used to hearing one language more than the other.\n\nPikamee truly gave me a breath of fresh air in hearing both used equally.", "@Sei Shōnagon fair, mate", "This is good advice man", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "@TrojanPiece he apologized dipshit", "A few notable moments:\n2:09:16 Kiara loves Amelia\n2:20:15 \"Nothing is Free at KFP\"\n2:23:00 Onee-san Kiara goes \"Ara Ara\" in German and Japanese", "thank you for your service o7", "Now we need fanart of Amelia and Kiara the Ara Ara Onee-sans.", "3:01:45 feeling dank", "The last one is my comment at 4:00:56 asking her to say \"PEACE\" like Calli 😆 Im so glad she did it 😊", "Tbch Kiara being a polyglot was what made me love her streams most compared to the rest, i study language/linguistics so that was what sold it for me. It was cool that she made it her ‘talent’ because she seemed more evasive when her German got brought up at first, only to later make Auf Wiedersehen her signoff. The fact one superchar and apparent comments she’s found are so dismissive of a skill with language or think it’s distracting is bizarre to me when deadass it’s my favorite part.", "Well the only youtuber i knew with the same skill as her is cathy cat.", "I think my super chat got lost in the ether but that doesn't matter. She is the best to even try reading all the super chats. 4 hours and 38 mins gang. I will simp harder to get noticed by the Phoenix.\nI hope she stays authentic and not do anything just to meet expectations. We are suppose to simp for her and not the other way around. 🍗🐔🍗", "Well, it's never bad to at least give something a try that her audience requested.\nShe might enjoy it, who knows.\nEdit: I didn't know about the haters hating on her. In fact I'm surprised she has haters at all. \nWhat happened anyway? I'm not updated on what happened to her o.o", "Looks like you got noticed now haha! Congrats!", "Matthew Brieman Someone SCed that they prefer a non-JP dub stream, and it appears that there are many more comments like that. \n\nHer dubs are her strength though. Personally I think it was an awesome touch, since I am learning German and Japanese as well. It’s very useful.", "@Edward Knight I fail to see how mixing in JP dub here and there is a bad thing. Coco, and Haachama have been doing it (in reverse) for a long time. I haven't seen a JP bro complain that mixing in EN dub during a  JP stream is a bad thing. Moona, Risu and Iofi are even doing it in 3 languages (English, JP and Indonesian)", "@Matthew Brieman I was trying to find the timestamp for it but it looks like someone else already did and you already found that comment. Yeah I completely agree. I see zero problems with that. I got into hololive because of Coco and Haachama. As long as they are having fun and doing what they want to do that's all that matters. We are just here for the ride and to have fun interacting with her. She is so sweet. She took the criticism to heart and it wasn't the kind she should be listening to. It hurt a lot seeing her cry.", "@Captain Pepperjacks I fell into the Hololive hole because a Youtube-kun recommended I watch a certain white fox singing Scatman, one of my favorite songs.\nAnyway, as the old saying goes, what doesn't kill you will only make you stronger.\nI hope Kiara finds a new strength from this experience.", "@Matthew Brieman 1:48:38 context", "@Matthew Brieman please pineapple-kun can only take so much beating", "@Captain Pepperjacks Sorry I didn't mean that in a bad way. But it's just how the Internet works, you can't please everyone. So it's better she learn this hard lesson this early to make her stronger. It's good for her in the long run.", "@Matthew Brieman oh no i was referencing the song. when the fox is singing it sounds like \"Beat up a pineapple\"", "@Captain Pepperjacks lol my bad hahah", "This is what I love about this community. The fact that one rude message got completely overshadowed by hearts and support from us is really heartwarming. You can tell that Kiara appreciated each and every one of the kind Superchats. This is how this community should be, I expect nothing but this for now on. If you read this sometime in the future, Kiara then I want you to know that each and every one of your fans loves you.", "Yeah that was a little bit harsh to be honest. But I'll always support her.", "Oh, one rude message? That's... harsh. Didn't see it because it was raining down chats and sc's. She's really amazing by the way, because she's just like her favorite senpai, she really loves her fans.\n\nEDIT: I think I remember what the chat is, but I forgot when did that happened. Correct me if I'm wrong, but I think it's about her trilingual tongue. Let me know.", "@Patrick Balasan Trilingual tongue sounds kind of hot. Also would make a great band name.", "@Khaotic Twist I know. But literally saw that one message that is rude. Let's toss that aside. She loves her fans so much. She really is just like Pekora. And they actually both done the same thing, reading superchat for hours.", "It was at 1:48:37 and it hurt to see happen, I hope that she understands that most people think she should do whatever makes her happy.", "This makes me incredibly worried about Pokimane's entry into the Vtuber world. People have predicted that this may direct a large number of haters towards Hololive. Please guys, we need to protect them from the hate. Drown it out with our support, care and optimism!", "@forcexjr Don't mind her. Let her do what she wants to do. My guess is it will benefit her, if we criticize about it. To think that she did that just for the trend or maybe it lowers her viewer count, and we did what shouldn't be done, it will benefit her, if you think about it. That will damage the fanbase of vtubers in general, making everyone here, including the innocent ones, looking toxic in their eyes. Look what happened in the last few days, some of the fanbase criticize or \"whiteknighting\" about her decision, and they see us as toxic fanbases. That's what I observed. Just let her be, that's it. What's more concerning is those that really damage the reputation of the vtubers, like that one video that is against them, most especially the HoloEN, because they made a worldwide sensation, drawing forth new viewers overseas, and eventually, new fans.", "@Patrick Balasan it's a guy complaining about an issue she has pretty much already adressed during the past few streams. The dude felt pretty bad after he said that.", "Bruh, these new frogs and their talk about FLOW of a stream. so cringe man.  just let the streamer do their thing and if you don't like then go watch another stream with the \"flow\" that you enjoy.", "@Pan Cakes Like yeah. A fricking live stream doesn't have a \"flow\" because everything can happen, it's not a video essay for god sake.", "It wasn't even a rude comment. It was constructive criticism that unfortunately hit a landmine. The guy even apologized. If that's your definition of rude then you really should go out more often since you'll be surprised on what being rude really is.", "@Angelo Puey y Garcia yeah bro i agree, this people is just extra sensitive. Even Kiara already said that she does not think it's a bad comment just that she was emotional at the moment, you guys need to tone down the white knighting.", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "It wasn't really a rude post, it was just a bit harsh and too pointed, somewhat disrupting the wholesome vibe.\n\nI do hate to see poor Kiara get upset, but it can be chalked up to her being very sensitive. For that reason, I don't feel the need to put full blame on anyone in particular. I do hate it when a community tries to silence certain people when they aren't being particularly offensive, though at the same time it's a good idea to be thoughtful in how you phrase something like criticism in order to minimize harsh reactions and backlash.", "Props to the 7k viewers who stayed until the end, (especially if it was really late)", "It was 2:30 am when she ended and I still want to get up in 3 hours to see Mori's stream. Life is pain.", "I had a feeling this would take awhile, but it was great the whole time", "huh,I’m in Asia and it took from 11AM to 3:45PM.\ncongratulations to the ones who stayed past midnight", "@- Kyrel - Yeah, it's almost 4am here heh, worth every second tho", "That 7k people is really love kiara till end, it's KFC anyway", "7k gang! Glad we stuck it out", "Glad to be a part of the 7k! Proud of u bois 🧡", "faux I would’ve done that too,earlier I barely got sleep because Calli streamed at midnight and Gura had one early in the morning. worth it", "NO SLEEP GANG AAOOOH", "Thank", "Kiara > Sleep", "Sleep is for the weak", "Sakata Gintoki true,but we would die quickly though. so better sleep every 2 days,then watch the Goddess again", "IDK what the hell happened but apparently there was some incident regarding an SC a little while after I left? I dont excatly know the details or what but please know that most of us dont mind you self dubbing nor does it \"disrupt the flow\" of your streams.\n\nIll say it without hesitation, out of all the HoloEN, you are my favorite. Your upbeat personality, your singing and most especially, your taste in gaming (im a big fan of RPG games despite CSGO being my all time fave).", "four hours lets GO thats the kind of time im talking about", "Don’t listen to the haters we all love you so much 🧡🧡🧡🧡🧡🧡🧡🧡🧡 you’re amazing!!!!!!", "Did somebody say something?", "What? What happened", "what haters?", "yukee nakamura As far as I’m aware somebody was being rude to her pretty much criticizing the fact that she self dubs (pretty much her interacting with the Japanese viewers in the chat) and she got really upset and started crying it was just a sad situation(somebody could probably give a better explanation and as far as I’m aware she’s just been receiving a lot of hate)", "yukee nakamura 1:48:37 is what happened", "Holden Makok 1:48:37 is what happened", "Fábio Eira 1:48:37 is what happened", "@yukee nakamura I think people mean this 1:48:37, her like and dislike ratio seems perfectly positive however, I guess she shouldn't mind it that much.\nPikamee is another vtuber that self translates all the time and no one has a problem with it. It's freaking wholesome, I don't see any problem with it. I get what the person means by \"it ruins the flow\" but if she has japanese fans and I'm sure that she does, why not include everyone? It's like I said, wholesome.", "@Doverz I wouldn't go so far as to say he was a hater, just that he was clearly new to the Hololive world. Lets not crucify him (even if he made our phoenix cry with a somewhat insensitive superchat) but instead hope he learns the error of his ways by getting drawn further into the hololive hole. Its hard to hold these sorts of opinions when you watch Korone or Fubuki or Miko or Coco speaking English.", "Twitching Bouse Yea it’s just also in general I’ve seen negative things about her on Twitter and other places so I nots just that but yea I’m not saying crucify the guy I just want to spread love and positivity because that’s what everybody deserves right now especially our Phoenix", "Thanks for addressing this and providing timestamp. I missed this part and she mentioned it in her latest stream. It's kinda hard to watch. Yeah, they're not so much hating on her as they are being selfish and ignorant. I can't fathom criticizing someone who is multilingual trying to entertain thousands of people from several different countries on nearly a daily basis. It hurts that she thinks so little of herself and felt the need to defend herself from such a dumb comment.", "Nivek yea hate is strongish word on my part but I have genuinely seen some actual hate thrown her way too which again is awful", "@Doverz yeah, u can't please everyone after all. There will always be a rock somewhere. I just hope that the chicken can get up and run again! \nAnd she really had the Japanese skill. It will be great weapon later when collab with pekora. (she can decieve her with english hehe)", "@Doverz That guy has already been doxed and his life is ruined. JP and EN bros united to get him kicked out of school and his mom fired from her job. It was great to see! 👍", "scooby yubi doo lmao please tell me your joking?", "@Doverz I'm joking but that's also how the internet goes nowadays lol", "So does Ina get hate for self translation? I don't get why people hate on Kiara when other Vtubers do it. Also don't get it as she is positive energy, fun and heartwarming, it honestly makes no sense that she gets some hate for literally doing nothing wrong and actively doing right.", "@Kc Link WHAT THE FUCK DID YOU JUST SAY ABOUT INA???", "4:34:05 The legendary superchat", "There is something wrong. I can only see 2 hours in the pre-recorded livestream", "I for one am all for the self dubbing even though my Japanese is still beginner level, it really helps    to hear something followed by a translation. And I'm sure the jp bros appreciate it way more than I do.", "Yea the JP viewers deserve it tbh it’s kinda like us English viewers when we watch JP Hololive", "Yeah it’s really bizarre that some people legitimately think she should just stop self dubbing? Like dudes, she was hired under a Japanese company who has a large Japanese audience who also watches her. It’s literally her job to translate and bring entertainment to them too lol", "Eternal Memeage Well because some people think it’s their stream and she has to cater to whatever they want which is disrespectful as hell", "Umm,I guess my energy has drained out from watching this legend of a four hour stream. I can’t really get a highlights out period,it’s 4 hours long I mean,I got drained by compiling a 2 hour stream. So i’ll give stamps for the loading screen.\n\n1:18 Kiara hops into stream realizing her mic was not working properly", "Wait... My dad likes kiara?", "3:24:10 for 99 Luftballons", "4:24:32 for myself\nI love you Kiaraちゃん.Don't care about what hater says. Just do the thing you think it's right.\nMulti-language is your advantage. And you can be a bridge to connect HoloEN and HoloJP. It's a \nunique place that no one can replace you.", "Damn, that one SC that made her cry. He definitely didn't do it with bad intentions, but it definitely hit Kiara more than expected. Don't feel down Kiara! Think about it positively, you will probably be the only Hololive English member that will be able to have collabs with Hololive JP at 100% communication. Once you girls are allowed to collab with other Hololive members, you will show your true skills! You will be the collab queen of Hololive! Can't wait for a chaotic English-Japanese stream with Coco. It's going to be hilarious!", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "@TrojanPiece He did apologize, and he received a lot of hate from the fans in fact i think he was kinda harrassed on twitter because of the Superchat. Kiara apologized about that, shows how wholeseome the Bird is.", "good on chat to cheer on kiara when she was feeling down.", "missed the stream, why was she feeling down? i thought superchat debut went well?", "@Yves Briones One of the comments question about her self translation. saying it ruined the mood, this really hit kiara very hard but chat came to the rescue!!!", "@Udoneater that's kind of a garbage take. don't most people love when hololive jp speak eng?\n\nsuper proud of chat though! as expected of kfp employees and stockholders!", "This stream was a rollercoaster of emotions I'm so glad I was there until the end.  Danke schön Kiara keep doing what you do.", "God she is the most wholesome phoenix I've ever met!", "Agreed", "How many have you met", "@Jay Spradley 1 but that doesn't change the fact that she's the best.", "@Buff Bouncer Yagoo True", "Kiara: enables superchat\nSan Andreas meme: \"Allow us to introduce ourselves.\"", "Please never stop speaking japanese/german/english in the way that you are doing right now.\nIts so amazing and wholesome, and i'm pretty sure everyone here like in that way.\nYou're an amazing bird, please never forget that. You not only put a smile in the face of the people, also motivate the people, and that's something to feel good about 🐔❤", "one of the 7k who stayed and i’d do it again in a heartbeat", "Kiara, as a fan I say this from the heart.\nPlease get some water, seriously. Your throat has got to be DEAD after reading through all of that. Drink some water, get some rest, and revive stronger the next morning.", "Pretty sure she already use one or more revive today 😅", "何を言いたいなら、キアラちゃんの動力が誰よりも負けない。いつも元気で配信してくれてありがとうございます！これからも頑張って下さい、応援するからな！", "Feeling Dank", "Dank Chicken", "Danke", "I'm a japanese not to be good at english.\nHer compassionate streaming is big helping for me to study another language and to understand foreign brother feeling through \"Otaku\" culture.\nThank you kiara, I support you.", "I love this Phoenix, I love her a lot. I will be with her in the bads an the goods and I will always support her.\n\nThank you, Takanashi Kiara, thank you for everything.", "Wholesome SC reading starts at 4:01:40", "Rewatch gang wya !?\n\nKinda late but seeing all these positive msgs in the comments, I thought I’d contribute. It’s always gonna be difficult to be in a position or mindset where u can completely ignore criticism and not try to conform to what your audience wants. That’s just simply the hardships of an entertainer. However, I do wish that u, without disregarding those criticism entirely (considering ", "Ayyy", "That's hardcore", "Her neighbors probably know fluent German by now", "they’re probably fluent in Dankeschön and Auf Weidersehen", "She can speak deutsch?", "Danish Wistara ja", "Pipipi", "@Edward Knight time stamp please, she's going to have a blast talking to Airani", "@Danish Wistara at the begining was a german part", "@KFP Eggu san time stamp?", "@Danish Wistara 12:00", "@Danish Wistara 43:40", "@Danish Wistara She said in her debut that German is her native language", "@Big Boy wait, she's from a german speaking country, what a twist", "@Danish Wistara not from German actually, but from Austria", "Austria, you can even hear her accent which is clearly Austrian", "@goose chaser I have never seen or heard an Austrian before in my entire life, except Hitler, and I don't even know if he's German or Austrian", "@Danish Wistara you clearly heard an austrian, he's called arnold Schwarzenegger", "Did she really?", "Polka superchat livestream flashback\nimagine Kiara didn't turn off her SC button", "Its gonna be forever. Cos most of ppl here already had incomes.", "it's ~10pm on american timezone. audience is people with income", "For people that don't know what the comments talk about  1:48:41\nFor Kiara. First of all you have more talents than just speaking Japanese. Your singing voice is ridiculously good and you are very vibrant and joyful, give a bit of time for your stream to develop before you criticize your self :) Also, i think most people don't mind that you translate for the JP in the chat. I was thinking of how fun Haachama's and Coco's streams were when they are translating. I am sure more people appreciate it and the people that said that probably meant it as a suggestion than an annoyance.", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "Kiara, you are an amazing person who deserves all of the love that everyone has been giving you. You are an extremely kind, caring, and loving person who tries her best to include other people. You have an amazing singing voice. You are very fun, funny, and energetic. You have very unique ideas. You have nearly impossible endurance! And yes, you speak both Japanese and English perfectly, while neither is your native language. I tried to learn German once, and I wasn't smart enough to get past the first two weeks of lessons. You have gotten so far because of your own talents, and I know you will achieve even more.  You are definitely not a one-trick bird, even if your dark feelings tell you that. YOU ARE AN INSPIRING PERSON. Please remember this always.", "To Donovan I, can you teach me your power?", "Don't forget Cat Daddy", "日本人からすればその場で日本語訳してくれるのが凄いありがたくて助かる！", "i have zero issue with how she handles her streams, and i speak the same 3 languages myself actually.  there is another vtuber i wont mention name ofc but she speaks half in japanese and half in english and does a really good job at keeping both languages engaged without dubbing every sentence.  i feel her experience would be of help possibly if worlds align and they collab one day.   eitherway, great job kiara, i enjoy the streams", "I said this once before in Aki and Mio’s situation but my only gripe with holo live and companies that are like it, is that it’s really easy for talent to compare each other’s weaknesses, things there good at, and ability to get more subs/views/likes. It can be good in some aspects because it can spawn motivation but it really has a lot of emotional and stressful issues that can really drain these great people. There’s a lot she’s good at and I really admire that she’s fluent in multiple languages, Because it takes a lot of determination to do that. Not to mention she is very funny, great at singing and cute to match that. She’s going to do great. But I hope she doesn’t put herself down to much. I hope she puts her mental and physical health first!", "Don't forget Kiara, \"Netflix & Chill\" has a different meaning in some countrys then it has in Japan and Germany ;)", "it has a diffrent meaning in germany?", "@GALM1Cipher in Germany and Japan it means to relax at home (or a friends place) and watch some Netflix. So nothing lewd :) as it would be used in e.g. the U.S.", "Kiara deserves the world and then some. I cried when she said her face was in pain because she wanted to give everyone a cheery Danke Schön. If you read this Kiara, ty for everything and the kfp army will get you to 200k and beyond.", "I stayed the whole stream and I've got to say. It's quality content. Keep up the good work!", "You did it! 👏 Over 4 hours! Stayed until the end, but it was fun to stay with you in the ups and downs! Hope you rest well! See you later! \nEdit: 4:30:50 (marking 1st personal SC ever)", "Nice", "1:48:37 ..........👉OBJECTION!", "Seriously what a wanker. If its only a comment, Kiara can at least ignore it, but to send a SC? Talk about lacking EQ. \n\nIts so heartwarming to see the community shower her with so love and support.", "yup", "I can't understand complaining about self dubbing when most hololive streams I can't understand a single word of", "Also imagine spending money so you can hurt someone's feelings, the fuck?", "gentlemen, it’s time for the hunt.", "@uskan yeah, is nice, she is connecting both sides, japannese and english", "@uskan Literally what I was thinking when I heard it live.", "What a douchebag eop really, but fortunately everyone were here to cheer Kiara, I don't understand the complaining", "Some of you people are making the incident out to be like he made some extremely rude and toxic message berating her or something, and it turns out to be nothing of the sort.  Dude literally gave some mild constructive criticism.", "@Danial Lapidus telling someone that their specialty “ruins” the flow is nowhere near “constructive”, you need a reality check. Literally dozens of English words and phrases he could use and he goes for that?", "@Danial Lapidus That's not constructive, that's actually destructive criticism. And Kiara almost fell for it.", "@Danial Lapidus The intentions might not were to harm, I agree that self-dubbing makes the flow of the show a lot slower specially if you understanding only one of the languages, but! I think the author of that SC and all other people with similar opinion lacks the understanding and appreciation to all the effort Kiara puts into connecting with both Japanese, German and English speaking viewers. She could just talk in English, which she speaks very well, but that would be a waste of her multilingual skills, which I find very rare and admire a lot.", "@Danial Lapidus I agree, I thought it was a super rude comment or something when I read about it on reddit", "Wholesome bird 🐔❤️", "HololiveEN learning what it means to be bullied with money", "I thought I recorded when she said my name correctly, but it turns out I was wrong. So I'm... rewatching this archive...\n\nAlso, I love you Kiara, your personality is so warm and kind!", "I'm trying to go to sleep after watching this for 4.5 hrs and all I can hear is \"dank chicken\" in the darkness ♥️", "Who would have imagined that the SC stream would be the most epic!!!\nThere was everything starting quietly, going through different topics and conversations, through laughter and tears and enduring until the end after 4 and a half hours.\nCongratulations Kiara remember you are more talented than you think and if you do what you enjoy we will enjoy it 💙🐔", "Also 1:48:37 that scene was heartbreaking, some people may think it was just a comment from a person, but the reason is in what kiara says in 1:52:08 she mentions that her only strong point is that she can speak Japanese and translate it, imagine thinking that you are only good at one thing and then someone tell you to stop doing it, it was painful to hear that because you realize that kiara does not know how talented she is, she not only speaks 3 languages, she also has a cheerful and energetic personality that lifts your spirits and that's so but so important, she is creative , she is funny, she sings well, and many more things, that unfortunately she has not realized, I hope that with the help of us she can realize that it is more talented than she thinks, and not underestimate herself", "Kiara truly chad, we need to protect her", "Only You i thought her mic got better...actually now cali had some weird noises when she spoke with her mic when i listened with headphones last stream...but well it will all be sorted out at some point! everything is still new for them", "@Abtimus Prime But i still hear some strange noises in kiara too, like reduced noises or i don't know\nYes i hope they can get better in future", "well as far as i know she got the mic from cali lol...it is supposed to be high standard but that also means a lot of settings and tuning you can do and that itself can be troublesome...sometimes simpler is better at the start ...let‘s just wait and hear ^^", "honestly the muddy mic is part of her charm!!", "I’m trying to learn Japanese for the past couple of months and honestly you’re helping..\nMany streamers speak in two languages and it’s fun to involve other peeps too so it means a lot when u do that.\nAlso dedicating  4 hours just to say thank u to everyone says a lot about you.. <3\nYou’re such a nice and caring person and i hope u know that we will forever support and stay by u", "1:48:37 - Please, don't hate the guy. He actually didn't say anything that bad. I don't agree with him but he only stated his opinion.", "Yeah I don't get why everyone's calling him a hater when It obviously wasn't a hate comment", "Yeah, from everything I read before I saw his comment it sounded like he was a total asshat, murderer and baby eater. Now I've actually seen his comment and it was a totally tame question without any hate in it. Way to blow something out of proportion.", "@Dominik Imagine doing something you're good at and someone tells you to stop because you RUINED it for 'em.", "@Dominik and that keeps on for days.", "I'm glad we could cheer you up at the end, I really hope you never lose confidence I'm yourself, you're a really amazing person, and we all support you with all our hearts", "Kiara, being fluent in 3 languages is amazing, you can communicate with a lot of people because of it. And if you'd like, didn't you say that you're good enough to be able to teach the others Japanese if they needed help? Do it! I'm sure a lot of us would love to learn with them as well. It can be a nice collab stream.", "Can someone clip the part where she says Bubble Bass's line?", "I little bit late, but just now I got to catch this legendary stream. About that one message, I'd just like to say that for each person that even thinks that self-dub may be a problem, YOU ARE helping at least tenfold that number of people busting their asses trying to learn Japanese. So THANKS TO YOU Kiara you inspiring majestic phoenix-bird!", "Hey Kiara, I'm sure you'll eventually figure out how to balance your wish to keep everyone informed during your streams without sacrificing the pace. You have something to show everyone and the fact that you're standing alongside the other 4 girls is proof of that. ", "Danke Schoen for the wonderful streams Kiara! You are such bundle of energy and happiness that I can't help but feel the same!", "I was going to leave the stream around the 2nd hour, because I had classes tomorrow, but when Kiara started crying I knew that I need to be there for HER! Keep Up with the great work Kiara! LOVE from Perú or how we say: \"!Sigue con el buen trabajo!\" ♥️🐔", "Thank you for the stream Kiara and I honestly like how you speak in different languages during your streams. Change because you want to not when  others tell you. Fans should love and support you on whatever you decide so continue doing what your doing because we love it. I think it's cool how you translate everything you say it helps me and the others learn different languages", "Please don't stop translating for the japanese bros. I think it's amazing that you're working hard to make content that all of us can understand and I am sure the vast majority of your viewers agrees. Stay strong and keep up the good work!", "Well that was the longest,\"dankest\" stream of all streams I have ever watched of hololive.\nIt was 4 hrs. Gads, hope Kiara gets some rest. She deserves it and really should earn 200K.\nAhhhhhhhh. Kikkeriki,danke shoun , auf wiedersehen...whatever.", "Please, please, please don't tone down the Japanese. It's great how inclusive you are trying to be by speaking English AND Japanese. Keep doing your best, Kiara!  <3", "you actually went for almost 5 hours you absolute madbird,  \"feeling dank\" for the hard work", "Caught up to 4 hours + incredible Kiara read them all. Get some rest so that we get some Best Bird Content  and laugh all together. Bis zum nächstenmal.", "I was here. I'm seriously considering adjusting my sleep schedule in order to catch Holo-live streams.", "Honestly Kiara your streams make me feel an insane amount of happiness that I haven't felt in a while. You are insanely hardworking and I hope you always will have a good day 🙏", "Kiara really radiates positive energy, let's all keep simping to this wholesome Birb/Phoenix! We love you Kiara!", "You're one of the most entertaining people I've seen on here. You deserve all that kindness and love. Keep doing you, and have fun with what you do.", "The fact she's liking comments just adds to her wholesomeness and commitment to the KFC. Bless her.", "I guess I can kinda see why some wouldn't like the live translations, but I always thought it's really sweet of you to do it. Those like me, who had to wait for the translated clips to see what their favourite JP vtuber was talking about, know the pain.\nYour Japanese fans are very lucky that you not only can, but also want to include them in your streams. I hope you will find your sweet spot and make lots of people (and yourself) happy!", "I can't believe she actually did 4 hours\nThe dedication of this girl is amazing!", "Man, I got so sad when she said her only strength was being multilingual, like, she's so fun to watch and upbeat and I loved the karaoke stream, loved her singing and her choice in music. I don't generally love more current pop but the older stuff is so much fun so the songs she sang were great, I've already listened to the whole stream a couple times while working. It was very wholesome, though, that everyone in chat were spamming to cheer her up, and really funny that although they wanted to make her feel better the newer scs were just giving her more work. ", "Honestly watching Kiara's first streams I felt like she was most geared to be the \"leader\" of the generation, her natural charisma and willingness to put herself out first is astounding. Her language skills are just part of that strength and she can very easily be the bridge between EN and JP that will form the core of the interaction of those communities going forward. On the off chance you're reading this, speak all the languages you want girl; you didn't get almost 200k followers because you were doing something wrong. It's all uphill from here.", "Kiara, your self dubbing is one of my favorite parts of your streams\n\nIts so wholesome and sweet and I love how you want to bridge the gap between your fanbases\nYoure so genuine and warm and I appreciate you immensely, youre my favorite of the holoen girls and I love watching your streams", "Im sad i miss kiara's streams, she's so wonderful, kiara dont worry about self translating i think its brilliant that you're translating for your Japanese audience don't listen to the haters.\nKeep being incredible.", "On the self-dubbing issue, and as someone who knows very little Japanese, I'm of the opinion that the self-dubbing helps to include everyone, English AND Japanese. It may slightly disrupt the flow of the stream, but it's a small price to pay to make sure everyone can understand. You do you!", "Don't take people being jerks to heart, you're my favorite holoEN member! Can't wait til memberships are available, I'll be there day 1!", "5:12 \"This will be a long stream, I guess\"\n\nPhoenix can see the future....!!", "Kiara is so wholesome 🧡🧡🧡\nDanke Schoen for the stream! PiPiPii!!\n\nTURN THE SCs BACK ONNNN", "Kiara like I said on my superchat, you're a fantastic person in every sense possible. And today you showed that even more. I love you and your work. <3", "Legendary stream! Don't worry about what the haters say, we absolutely love you for who you are!", "wait? haters? what for?", "@Abtimus Prime Someone said some negative things about her translating what she was saying to Japanese.", "@Abtimus Prime She read a super chat that said \"Why are you self dubbing yourself, It kinda ruins the flow.\" And it hit her really hard cause there apparently already was comments about it. And tbh idk why people are complaining about the self dub I think it's such a positive thing to break through language barriers so she can communicate with more fans overseas and it's not like it is a negative thing either, its only a positive.", "@Snowy The translating is such a good thing, bringing the community together. Sucks that some people view it negatively.", "Her being able to translate so effectively throughout her streams is one of her many redeeming qualities.  She really is incredible!", "Excuse me, but... Do you have a timestamp? 👉👈", "Haters? We don't do that here.", "@•ᴍɪᴋɪᴏ• thanks!!!♡", "Kiara with superchats: Thanks every single KFP for 4 hours\nAmelia with superchats: SIKE", "Kiara! Don't worry about your timeslot not being perfect for USA viewership, continue on with schedule that works with your timezone. You still cover European and Japanese time zones pretty well, and if you stick with it for a month it will be just perfect for when you finally get to collab with your senpais! Which I am very exited for, since your communication skills are amazing and you got that quick wit to perfectly tease anyone! Let's go KFP!", "Just barely missed it but hope I can make it in time for Mario 64！！　LOVE from TEXAS Kiara  you are the BEST!!", "Thank you for the Stream!!\nI only wanted to say that your live translations are really Helpfull for someone like me who is learning Japanese, I hope you don't quit doing it, you are great.", "4hrs and a half reading SCs.... ~♥~\n\nDanke Schon", "Kiara you are too awesome for sitting here for 4 hours and reading off all of our SuperChats!! Phoenix MVP right right here. Some would stop, but you kept going ti'll there were basically none left. We truly do love you very much Kiara! and you are honestly best girl out of this new cast. Your personality shines through so brightly and your pure energy makes me wanna get fired up! Your the perfect cure for this quarantine sadness, stay shining Kiara!", "I was really sad to see you being down like that! \n\nHere you go, a hug through time and space!", "キアラちゃん！I just want to say you’re awesome and you absolutely deserve everything. You’re such a treat to watch and I love the energy that you bring in your streams. It’s been a rough year for me personally but watching your videos put a lot of smile on my face. Keep on being awesome. ありがとう！", "I can't believe she did a 4hours video thanking SCs, bless this girl", "Bruh, I cried", "Kiara's so warmful. I wish nothing pressure to her. 😭", "Also a big \"DANKE\" to the 7k bros that stayed for the whole 4hours...\n(Sadly I have to log off after an hour because I needed to drive a family member to the hospital)... So I was shocked to see this just uploaded when I got back... 4hours... Omg.", "Agreed, but there is beauty in a smaller community aswell. But in the end i just hope that Kiara's dreams come true and that she ends up being happy. Im glad that people such as yourself and so many others are supporting her and encouraging her. I am so glad to be the part of this community!", "SUPA CHAT READING RTA!", "Your streams are always so bright and welcoming and i always feel loved when I come to watch. If you are ever feeling down again, I hope you will remember today and remember just how much we all love you. You are as bright as the sun and your warmth gives us all energy.", "You probably won't see this, and that's fine.. but I personally love that you dub yourself, I think its so nice of you to be inclusive to the entire audience. The other thing, you're just starting out streaming, you still need to feel out how you want to do the stream. Karaoke nights, just playing some fun indie games, maybe even like a language lesson would be interesting. Don't let anything get to you, you are a hololive vtuber! That's huge, and just enjoy the stream, and do you bb bird!", "She's so fun to watch, she has such a great personality and Its gonna be such a fun journey for everyone involved. Thanks Kiara we cant wait to spend hours and hours of our future watching our birb have fun.", "My first super chat goes to Kiara. I like and loved your voice when you sing hope you sing Shin Takarajima in your next karaoke stream. \nWe loved you and will continue to support you.", "Kiara, you're my current favorite holo EN right now.\n\nto be fair, your first (debut) stream having too much japanese. i feel like i'm watching hololive JP at that one.\nbut everything after that is fine. i'd prefer if you do 50%/50% self-live-translated (Pikamee is the best example) so i can also learn some japanese at the same time and i'm fine with it (don't know about other people though, but just let you know i'm sure there will be some audience gladly take that).", "Kiara! I don't know if you'll ever see this, but we all love you and appreciate all the hard work we know you have put in! You are amazing at 3 languages! There are people in this world who aren't even good at 1! And you have such energy and dedication! \n\nYou don't have to take suggestions from a random person on the internet, but I'd love to see you teach Japanese on stream! Maybe even HoloEN members and help them practice their Japanese! Or teach English to the Japanese HoloLive streamers (when you are allowed to collab with them). You are the bridge that connects two worlds!!!", "Viele Liebe Kiara, For being so strong thanking everyone super chat from last stream and this one as well, for being so positive, for being so wholesome, for being... You.\nYou're the süßes phoniex that ever exist and I'm sorry that the only thing that I can say is nothing more than...", "3:01:50 when you spend too much on dank cushions, you start feelin' dank.", "The fact that she read through every single one of them shows that she really appreciates them all. This video is very heartwarming and Kiara deserves all the love and support she's getting.", "Hey! Thanks for being here Kiara, you're literally a sunshine to all of us. I can't help but feel upbeat about my day every time I watch one of your streams. Your streams are special. Your bubbliness, mannerisms, attitude, voice, and mood. Everything. It doesn't matter whether it's a 12 hour long superchat reading stream or something else entirely. I'll watch all of it as long as you're in it. The mood you bring to us is too infectious lol, and seeing you happy makes me more happy and energetic than usual. You're like a drug,  loljk. I'm HYPEDDDDDDDDDDD for the things you'll bring us in the future! Lastly....", "Kiara is currently my favorite member of Hololive-EN - she has such a friendly and bright energy that it makes everyone around her more comfortable, as we saw when she hosted the collab yesterday. In her streams too I feel like she makes the viewers feel at ease and cared for. ", "3:01:45 for feeling dank", "Everyone has their own talent you don't need to compare yourself with the rest of the members! You are amazing for who you are and you have your own talents too! Be a little more proud of yourself cause you are doig an excelent job! \n\n(My eng is not perfect sry)", "2:48:55 “Can someone confirm that you cannot donate anymore?”\n\nMe: Gladly", "legends said that if you comment early, kiara herself will heart your comment", "This is truly what you can call a perfect stream. Taking your time to say thx to everyone even when it costs so much time shows what a nice and also real person you are. I´m seeing forward to all the upcoming streams of you and for me you are my favourite Vtuber, because you always bring me (and i bet lot of others, too) such a nice and enjoyable time and atmosphere with you. So, from the bottom of my heart, Arigato, thank you, and \"Dankeschön\" ^^", "I wanna watch live streams so her, even if there are no Japanese translation.\nRegardless of the outcome, I'm KFC, probably they too.", "I love this beautifully spirited Phoenix and I'll keep loving her for who she is, not what she does", "You're so funny and energetic. Your voice is so beautiful and when you speak Japanese is even more beautiful, don't mention the German. <3 <3 <3", "Kiara is an amazing phoenix and we love her!!! Its incredible that you can be proficient in 3 different languages and is really wholesome you want to include everyone as part of your crew. I love german so i enjoy when you speak it too.\n\nAnd pls don't think that language is your only strength. I really enjoy all the passion you put in your streamings, they are the perfect shot of energy to start a new day. And to be a jack of all trades is rly a strenght not a weakness. You could sing, play some games or just talk and with everything we'll vibe in the chat with you!!! ", "when I saw that Dank Shion comment I couldnt unhear it anymore XD", "Kiara, don't feel like you have to have something different over the other girls in terms of a specific talent. I feel like your personality by itself is the best part about you, and that's what makes us appreciate you more!!!", "This ^", "Those dang Ninjas cutting onions. I'm not crying I swear, I just got some wholesomeness stuck in my eyes I swear!", "Kiara is truly something special.  Despite currently having less subs than the rest of her fellow EN members, she still continues to amaze me with her persistence, her hard work, and of course, her infectiously sweet personality.  She endured 4 1/2 hours straight of reading through every superchat donation, even while people told her that it would be okay to finish reading in a future stream.  That’s just truly a testament to how much effort she puts in, and how much she cares for her supporters.", "Hi Kiara, I'm learning Japanese and also love hearing other languages. I'm sure you could teach us some German too. Please keep speaking other languages whenever you like! I enjoy it.", "The sheer amount of dedication she has is incredible, she better get some rest after a long stream!", "I want to thank you for making me and thousands of people smile whenever they visit your channel.\nKiara you are the best .❤️🐔🧡", "You are so very well loved, Kiara! We really do enjoy you just being you, so keep it up!", "I remember being here for an hour yesterday because I had to go and when I came back after 3 hours she was still streaming! I’m glad she tried her best at giving the dankeschöns to everyone, I’ve never met someone so dedicated at something!", "I've comment this before on your debut video I love your self JP dub its help me a lot in understand the words.\nI want to let you know there's people who still love the way you are so please be yourself. \nWe'll support you STAY STRONG! 🐔❤️", "Thats a long time of reading appreciate the hard work ❤ definitely one of the best bird-chicken\nThank you for the stream\nOtsukaresamadeshita", "I couldn't be here for the stream but i'll be sure to watch every minutes of it to honor you dedication ! Congratulation Kiara, you truly are a beautiful phoenix.", "I think it's great that you self dub and cater to our japanese bros! Please please just do what you want because we all will watch you regardless. We've all pressed the subscribe button because of your amazing personality. Keep fighting on phoenix CEO o7", "Keep going Kiara! You have so much to offer, beyond your language skills, and we're all eager to keep seeing it. Your dedication to your viewers is unmatched, and you bring the best out of your fellow EN members every time you're with them. Keep soaring 草鳥\n\nAnd don't you dare stop speaking Japanese in stream!", "I love that you try to include all of the fans with Japanese and English don’t ever change.", "I only had 5 hours of sleep for you. Vielen dank für dich, denn du bist in meinem leben, keep streaming the way you are we love you either way don't let the anti's get to you because there's more of us who love your content. Wir lieben dich.", "How can people even hate this Energetic/ Positive/ Lovely Bird/ person?!! \nI really don’t get it. 💔", "I love it when you speak Japanese! I've been studying Japanese for over ten years, but with COVID, I haven't had as many people to talk to face-to-face, so hearing you flawlessly switch between English and Japanese has helped me shake off some of the rust. Thank you for all your hard work and genuine good cheer. Your voice and positivity are so beautiful. Also, thank you for being the brightest phoenix in the universe. キッケリキー！(And NOT Kicky Ricky!!!)", "YOOOO DONOVAN IS MY HOMIEEE HOLY SH****", "Really, thank you so very much, Colonel Kiara! I know you're the last majestic Phoenix in this world based on your lore but you are also such a sweet and unique mythical entity! Please get some well deserved rest! You'll need it when we barrage you with more Super Chats again. Also, please go and answer the calls of nature. Urinary stasis predisposess to urinary tract infection. Bless you, Colonel Kiara! See you next time! 🙏❤️✨", "I just have to say, i haven't had enough time to watch all of Hololive EN yet... but you seem to lift me up somehow, and give me hope & strength & optimism. It's just... a natural reaction to seeing & hearing you! So yeah! Keep doing what you're doing... you are amazing :)", "Someone know at which time she started reading superchats from this stream?", "3:21:50 Don't mind me I'm just bookmarking this for reasons.\n\nSeriously, though, congrats for actually getting through all the SuperChats! I probably would've toughed it out if Callie didn't have a 7AM stream I wanted to catch, and I still felt bad for tapping out. Mad respect for going through all that, hope you rested well after that!", "Thank you for your dedication, Kiara. Wish I could have stayed up to hear you read every ones names but I had to rest sadly.  You are so amazing and wonderful for doing what you do and we all love you for who you are, never forget that.\n\nThank you very much,  ありがとうございました,  \n vielen Dank", "Now that I think about it, I can't wait to hear her sing Los! Los! Los! XD", "Nobody:", "Its unbelievable she was able to go through ALL the donations even after getting so many haha, I loved this stream so much and I'm happy how much joy she's getting from this huge new journey!", "Although I speak Spanish, I understand English very well, so seeing the live shows of the hololive girls are fun but this is the first live that broke my heart when I saw Kiara cry, cheer up, girl-phoenix I can only tell you to be yourself do not limit yourself that seeing them doing what they like most in live shows is very fun, greetings", "Aways keep some bottles of water at your side, you'll need it.\n\nP.S.: You're already conquer us, don't let any criticize bring you down, you doing your best and deserve the best, and if it hit you by any way take these words and meditate about him, sometimes we don't have the right response to critics, there's no need to be sad or ashamed of your work.", "Kiara's linguistic ability is very important skill for hololive. I want you to connect hololiveEN with JP. There are many opportunities for you to success.", "4:08 Don't threaten me with a good time.", "Keep speaking japanese in stream!! ❤️ We english speakers may not understand you completely but atleast the Japanese fans can have the same fun with us! Don't mind the small brains that tries to destroy personality.", "I was here for the end of this stream but I went back and watched the whole thing. I just wanted to leave you a comment and tell you that I have really enjoyed your streams, especially when you self dub what you're saying. I think it's awesome to want to include as many people as possible and you should keep doing it if it's what you want to do. I went and watched your karaoke stream after this and I enjoyed it so much, you're an amazing singer. I guess I just want to say you should do you, because so many people enjoy it already. <3", "I had to go to sleep after the first two hours of the stream, but I have to say that I'm glad you were my first ever superchat. You put in the time and work to be a great idol Vtuber! I hope you know that a lot of people and I will make sure to support you in your dreams!", "4:00:56 that's my comment!! Thank you for saying PEACE like Calli! That was so cute and I love it when you said it was embarrassing XD", "rockin' 4 hours stream whew mustve been tough after the stream", "Kiara, you are such a sweetheart, thank you very much for the content, you truly brighten up my day.", "\"I love Emilia\", Kiara is now best girl and a girl of culture.", "Yo Kiara. Hard swerve those feelings of inadequacy cause youre anything but. I was never rlly into Hololive until I gave EN a try and came across you. You've got so much going for you but one of the things that makes you rlly special is that you have this incredibly infectious energy.  You can literally twiddle your thumbs and ramble on about hoopla and ppl will still wanna tune in. Not saying the others are using their talents as a crutch, but aint nobody else in the group has what you have and it's just a rare trait to have in general. Idk who it is behind the vtuber model but I was thinking about all the other voice actors that must have competed against you for the job ;bringing their artistic and musical ability to the audition only to be beaten by sheer bubbly charisma alone. That's POWERFUL. Talent is learnable, charisma is often innate. That said, you're also incredibly talented in your own right. Keep that chin up sis! You're deserving of all the success coming to you and then some :)", "You're doing perfectly, dear Phoenix.  Your stream is one of the few I can't usually watch, but I watch it post-fact every time!", "I love our clumsy bird! Her giggle when ( 58:07 ) she ate the bread is so heart warming! ♥", "I love watching you because of the self dubbing, keep on doing what makes u feel strong!", "I love your streams, and I hope you get to grow a lot more and become more popular.\nDanke schön for all of the happiness you have given all of us♥️♥️♥️", "I think it shows how lovely you are that you spent over 4 hours reading superchats, thanks for the effort Kiara! Your stream is really entertaining!", "I can’t wait to see you soar to incredible heights, I know you will. We all have self doubts and that just makes us human, keep being yourself as that’s what makes you beautifully you. Gonna keep watching your great streams and I look forward to more of your self dubbing as it helps me learn Japanese in a way 🧡", "I knew the thank you stream would be the longest haha she's such a trooper!", "Please feel free to be your self Kiara, I really love your Japanese accent and voice, please don't stop speaking it. I will try to be a better fan and keep up with your streams, love from Saudi Arabia :D", "Thanks for this long stream Kiara! <3 :chicken_dank:\nDont worry about those kind of comments, you being able to speak a lot of language is huge pro chicken move, you can connect both side of your fanbase; japanase speakers&english speaker (also german),so dont worry, many of us apreciate you doing it.", "For some reason\nI could see Kiara as Subaru's stand\n\nNow imagine a small duck with a gigantic Phoenix", "I admire her dedication. Thank you, Kiara, for all that you do.", "please dont give up on speaking japanese throughout your streams, or any language for that matter, its an amazing talent for someone learning languages like me, you are uniting people from all over the world, plus we wouldn't be here if us watchers weren't weebs in some way or form. :) I love you kiara.", "I also want to be able to speak English‼️ Today, English only‼️ Thank you Kiara 🙏", "I sadly missed the stream due to work and I am currently watching the archive. I just wanna say Thank you for everything, you blew all my expectations and I hope you never change. So much positive energy, goofyness and dedication towards your new challenges just leaves me speechless. We all love you, our favourite phoenix❤️", "kikkerikiiiiii!!! I know this is late but as someone from Japan, I'm so glad you can break that language barrier..! Please don't burn yourself out you flaming Phoenix!", "imo, as someone learning Japanese, your speaking Japanese helps a lot with listening practice.\n\nIf JP bros didn’t mind the JP Hololive girls speaking English for their overseas fans, then it shouldn’t be a problem when the situation is reversed.", "Kiara, run your streams the way you want, you and the other girls motivated me to actually start learning Japanese.  I am currently only able to read hiragana and only know what a few of them mean but, I feel it really helps when you self dub so I can kind of understand how a sentence is supposed to flow and be constructed.  Much love from Minnesota❤️❤️❤️❤️", "We love you so much, Kiara! Please keep doing things the way you want to and just have fun, don't worry about the haters.", "When you see your own superchat insert leonardo dicaprio meme", "As someone who is trying to learn Japanese the auto translations helps me a lot! And it gives me more motivation to learn the language. Thank you so much I love your streams", "Kiara is like Coco, she's building a huuuuuuuuuuuuuge bridge between the japanese fan and the english ones, keep up the great work tenchou !", "But Coco barely speaks English. Pikamee is the true bridge in my opinion.\n\nCoco just gives the memes", "@Sei Shōnagon nah coco did a lot of english stream, and colabs revolving around english games with other members, she's the reason hololive opened hololive EN, and pikamee isnt part of hololive to begin with.", "@Ras Veles Pikamee isn't Hololive I am aware, but I am more abreast with her than Coco.\n\nCoco is just....there for more", "I'd like to call the official first meeting of the Kiara protection squad", "regarding the emotional part, Aki Rosenthal said it best. id highly recommend watching the clip", "Wait no I really enjoy the multilingual part of the stream!! Please do not listen to whoever sent that super-chat because I as well as many others love when you speak Japanese!", "Man I wish my work schedule wasnt so messed up, I always miss the live streams... 😔", "If you love JRPG's, please check the Kiseki series. It can be story-heavy but it is hype af during climaxes.\n\nHope to see more of our beloved Chic- Divine Phoenix!", "24:00 i hope this dosent take to long \nFrance voice: 4,5 h later", "Her voice charges me with positivity. She is such a sweetheart. WE MUST PROTECT KIARA!", "I think speaking Japanese from time to time is a wonderful idea and you shouldn't pay too much attention to the very small minority that gets bothered by it, it makes it so that more people can understand, watch and enjoy the stream and I think that's beautiful!!\n\nAlso don't think you need some kind of special talent to stand out or for us to enjoy your content, all of us here love you and your personality and that is absolutely all that matters, you're not inferior to the others because they have different tallents, your shining personality is enough for us to love what you do!!", "You're my oshimen out of the EN group. Keep up the good work!", "Now that's dedication. Thanks for being there for us, ya beautiful bird.", "24:06 WELL XD", "2:02:48 I think the were referring to games that have dialogs in Japanese and text in English, so there's usually some things lost in translations, it'll surely be entertaining, anyways keep it going Kiara ♥️🐔 you are great! And please don't listen to nonsensical whines, we love your Japanese~", "1:23:05\n\nPutting this here for myself. Pineapple pizza gang.", "Keep speaking Japanese. I honestly like when you do both. It's very nice.", "Also I want her to speak 3 languages on her streams I don’t get confused and I think it’s cute", "Kiara, keep doing what you're doing! You're doing amazing work and I will continue support you however I can!", "1:48:34 - this comment here, officer.\n(\"the\" superchat...)", "I'm sure the person who sent that superchat didn't mean any harm but, personally, I absolutely love that Kiara speaks both English and Japanese.\nI read a lot of people saying that it helps them a lot to practice their Japanese and understand it better. Not only I don't think it hurts the pacing at all, but it's sweet that she tries to include both English and Japanese audience and make everyone feel welcome!", "This stream was the most intense roller coaster, I love you birb queen", "don't mind me just gonna watch 4hr and 30 since I missed it :P", "26:44 @DSPStanky Simp spotted", "Please don't say ever again that speaking japanese is your only strenght. Look at the duration of the stream and the time you took to interact with us. You have a lot of patience and endurance and we love your positivity.", "Thanks For those four freaking hours of chat reading. It was fun. \nThank you Kiara for the wonderful entertaining you give us.\nYou are definitely my Favorite Vtuber. ♡♡", "Does anyone know if she said what her favorite tales of game is? Loved the stream she is super wholesome :)", "I'm actually starting to pick up japanese from your stream please don't stop and keep doing what you want", "Your streams are always entrained me and translating yourself so the Japanese bros can understand whats going on is really awesome and wholesome so.....please don't stop being yourself just do whatever makes you happy and we will always support you we love you Kiara", "I love you so much, Kiara! All I can hear now is danke schön and feeling dank!", "I love this bird, please I love that she self dub THAT'S AWESOME", "Just want to say that your streams are always a highlight of my day and I appreciate what you're doing tremendously.", "we love you kiara you are amazing! You dont need to tone anything down speak english, speak japanese, speak bird, we all love you in all languages! We're all gonna support you so please dont let anyhting get you down youre doing great!", "Kiara you're doing great! Dont let those kind of comments get to you. It's good that youre inclusive of everyone. Love your happy energy!", "From the few, random times I tuned in (especially more towards the end of the 4 hours), I saw that she was STILL pushing through with good energy and reading names. That is amazing.\n\nThank you Kiara and also for having a wonderful heart!! Rest well and let’s make even more memories in the streams to come!!", "It was a very intense roller coaster, someone commented in a SC that she self dubbed in both languages too much and she got quite upset becuase that's kind of one of her main talents and things she wants to do and she was trying to say how if people didnt like it she would cut back. But everyone in chat and with SC sent her lots of support and love and cheered her up- then she realised, the superchats wouldn't stop! Eventually she turned them off defeated by KFP employee love. But there was lots of funny moments, she answered questions and was generally lovely. I wish I had video editing power to make a fan highlight video more people need to see birb", "Yeah I heard!! Thanks for the context!\nI'm really glad you all were there for her :')", "We love you Kiara!\n\nKikkeriki!", "3:55:53 NSFW art policy 👀", "Kiara you're amazing 4hours of reading superchat! We love you and your content!❤️❤️", "And she said thought nobody would view her whole thank you stream on back log", "Iofi has the exact same problem back when she was just started too, you probably could ask her on how to deal with that kind of comment, Kiara. \n.\nEither way, keep doing the kind of stream that you wanted, people come here to enjoy you being you, we will always support you.", "I couldn’t catch the stream live 4am gang but I’m glad you and all the holoEN girls got monetisation, you all deserve it so much!", "KEEP YOUR HEAD UP SOLDIER!!! Seriously, you're doing amazing!! Ignore those who are insensitive and  rude !!!", "That constructive criticism really did got to her. Man I hope she continues to stay wholesome and lovable.", "I hope she keeps this positive energy", "@Toilet Paper Same", "@Ryan Gosling VIRUS ye", "@Toilet Paper 👍👍", "This is a simp log don’t mind me. 3:30:06", "knowing any language is an avantage and you work hard to learn those languages so you need to proud of it (even bird) so cheer up and be proud of it", "I'm looking forward to the live stream in Japanese!\nBut don't overdo it", "A bit late, but I finally had time to watch the archive. And to be honest I think that you underestimate yourself to much, we're just starting to know you but you're a lot more than just somebody who can speak good Japanese, you have a really entertaining  and charming personality. So please stop comparing with others, you already had all what is needed to be successful, so just push forward. ", "Thank you for speaking Japanese, please be a bridge between Hololive EN and JP, don't be afraid of criticism and keep doing what you think, I'm Japanese and I use DeepL", "You're amazing! To think that you're reading all of the superchats for four hours, I gotta say you're really just like your favorite senpai. You love your fans so much, just like her. Congrats, Kiara! You deserve all the love you get.", "I really wish I could watch your streams live, but I wish you the best Kiara and to reach your dream of opening up your phoenix burger :P", "I love that you self dub it helps me with my Japanese I thinks awesome that you want to include everyone in your stream I think you should continue❤️❤️❤️❤️", "Thank you, Arigato, Danke Sćhon, Pi Pi Pi to Kiara and all of you guys. I’m so proud of this community. ❤️", "The legend of Donovan, who was able to SC despite it being disabled 4:34:07 😂", "Kiara, I hope you remember your Senpai's advice and take it to heart. https://youtu.be/MZQBn89HmwY?t=701 . She rose to the top and is adored by many by following her own advice despite anxieties and problems. Your mix of languages is your strength and it's great for people like me who are learning JP - it needs some work/balance but don't let others force you to be like they want. As a viewer all I want is you to be yourself, so take things slow and focus on developing your strengths, confidence and finding your own pace - and stop comparing yourself to others. I genuinely think you'll succed Kiara if you follow her advice.", "Yagoo bless your kind soul 🙏 i stayed up to watch the entire stream you are great", "we need time stamp >.< \notsukare our precious chikin. now jus chill and refresh your mind", "I wasn't able to watch this stream on time because of the timing (I generally can catch Kiara streams so far but obviously it won't be every time, such is time), so thank everyone for the timestamps.\nI'm just gonna add my 3.5 cents/points here, maybe Kiara'll manage to read it and get something out of it.", "3:55:45 I love emilia", "I think almost five hours of just reading patiently the never ending superchats is pretty impressive", "Oh man there are 4 hours of supacha. I missed the whole thing and I heard Kiara said 30 something big smoke orders. I would like to hear one if anyone has timestamp I would appreciate it!\n\nI found the 4th one at 43:20", "Hey Kiara, thank you so much for the birthday wishes! I appreciate it! :')  Please keep the self-dubbing. Your Japanese is great and I love it, dein Deutsch natürlich auch. Ich freue mich auf mehr Videos von dir. Weiterhin viel Erfolg! ❤️", "わんっ！(来ました)", "Me being a trilingual person myself, I always felt inadequate and uncomfortable speaking other languages infront of people that don't speak those languages. You gave me the courage to be more comfortable being myself. \nPlease keep doing what you're doing kiara and don't let others dismay your unique voice and style of streaming because it's the reason why I'm here.", "2:48:30 welcome to the end of superchats and beginning of sufferchat reading", "Kiara do your best. Much love from the Philippines. We love how hardworking you are.", "Wow! It took Kiara-chan 4 hours and half! She's so hard working and earnest!", "4 to 5 hours must be tried Kiara-san. We really enjoyed your stream! Please continued to be the rising energetic bird we love 🎊🎊🎊", "4:32:36, bless this man with his last supacha.", "Just learned of \"that\" superchat. I have to admit, if I had to criticize one thing in your debut stream, it would have been that. It's not that people don't like Japanese (we're practically all here because of that), but for anyone not fluent in both languages, it was a bit bothersome. But from what I've seen thereafter, there was nothing to complain about. In the end you have tons of people supporting you and that means you're doing something right. It's impossible to make everyone happy. ", "Never change. Always be you. ❤", "her japanese is her strength, wait till she collaborates with like Marine or Pekora, then her content is gonna be gold.  Love you Kiara, stay strong.", "Thank you Kiara, you are perfect the way you are.", "This stream provide the best example of (in my opinion) some of Kiara’s best traits-her earnestness and wholesomeness . Thank you, Kiara. The stream was a blast, and you deserve every compliments in the comment sections (and also a good long rest lol). :3", "4,5 stunden kiara?! Du bist eine Legende ich hoffe deine stimme ist in Ordnung <3", "My favorite Vtuber from HoloEN. Feel free to self dub it I think it's a great idea !", "Thanks for the stream keep up the good work your my best streamer I haven't missed your streams", "Thank you for your hard work!!\nI decided to support Kiara and want to join her membership soon. She is true idol", "Rip I had to sleep cuz I have school the next day and nurses this stream, but keep doing what you want! The translations are great and I love how much effort you give to your streams. Being trilingual is amazing and you should show it off as much as you want. Can't wait to see more, though I probably can't be in the livestreams but in the VODs.", "You're doing amazing our favorite Phoenix keep up the good work and thanks for always keeping us entertained!!! Lovely Stream! ♥️", "Kiara, please go enjoy that häagan dazs ice cream and rest up. Thanks for the stream and know that you have a lot of people who appreciates what you do, me included. Just be yourself, tenshi tori <3", "well, they say \"words have power\"... aaaaaaaand following this logic, yours are strong in three different languages, so just keep being ... you", "Honestly hope she continues self-dubbing, trying to learn Japanese by watching Kiara's stream LOL 🐔❤️", "She does continue doing it through the rest of the stream, so I wouldn't worry about that.", "I think we should give the 7000k people that stayed till the end an honorable name.", "Self dubbing is okay please don't feel bad about talking in all the wonderful languages you know. Be proud of yourself and your talent for languages Kiara. I'm sure everyone here will support you to their heart's content. Please don't tune it down!!", "i need a compilation of her kikirikis", "I love all the girls from hololive because they are themself. And I love the way you are so please don't feel bad you are a warm bird. Men I am bad at saying that kind of stuff there is much more but I can't express it in words sorry. Bleib wie du bist und ich bin mir sicher das du noch deine Flügel ausbreiten wirst.", "The way you can make the most of your knowledge of japanese is to collaborate with hololiveJP, Pekora, Subaru, or the previous generation wold be the best options if you ask", "2:28:57 LOL That Big Smoke's order", "Your amazing Kiara 🐔❤", "I watched and enjoyed the stream, especially the PIPIPI ♥️.", "Ei kiara dont beat yourselg about small stuff like those. We love all of you equally there in hololive EN because of the way you girls are. You entertain and make our days lighter with your streams. Never think you are less than the other girls cos if you cry the whole community weeps...Much love❤(friedchickenforlyfe)", "Man that dude must feel awful", "Kiara you do you... you can't please everyone, but as you saw,  there are WAY more people that love and support whatever you wanna do you including me.\nJust keep moving forward you adorable chicken... I mean Phoenix! Much love from México", "I don't know if it means too much, but I just want to see Kiara be happy with herself. You've done so much since joining and I think everyone loves and appreciates that effort, but in the end the one who needs to recognize that effort is yourself.\nI look forward to all the streams comming up, Kiara!", "I coudnt watch the stream cause it was so late for me, but im definetly going to watch it now! i came as fast as i could when i read on reddit that you were sad about some superchat saying he doesnt want you to translate... youre the best kiara! i know you feel like you dont have as much talent as the others or you have to prove yourself more, but youre my favourite holoEN BY FAR. and im pretty sure that many people think the same. Youre just great, its incredible and im already addicted to your streams. Translake and do whathever you want and be yourself as youre been doing, because your real self is so goddam wholesome and great.", "She's so cute 😩❤️", "Heartwarming 🥺", "Tu es magnifique, merci pour tous tes efforts je t’adore ! <3 <3 <3", "2:24:54 I'd be surprised if something can annoy subaru, she talked about this in one of her stream and felt bad because she accidentally ignored Kiara's dms lol", "I love you Kiara!! keep doing your best!", "42:44 leaving this here for reasons :3", "1:50:00 Calli, get in here and comfort your wife!", "Danke schön Kiara <3", "I couldn’t watch the stream because youtube’s asian servers were acting up 😞 \nANYWAYS I LOVE YOU AND I WILL SAVE ENOUGH MONEY FOR SUPERCHAT ONE DAY ❤️", "I seem to have upset Kiara a little with my kicky ricky SC. I'll tone it down. I didn't realize she didn't like it until this stream, and by then it was too late. I always thought of it as a Kiara meme!", "In regards to \"the only thing I'm good at\"...\nThree languages! That's super cool, and frankly I kinda envy you for it cause it's a really hard thing to pull off! Please don't think that you are not good or anything, okay? I know this comment probably also doesn't mean much at all, but I just needed to get it out there! So, all I wanna add is... How do they say...? Ganbatte!", "You don't need special talents to be entertaining. If you have an enjoyable personality, people will gravitate towards you.\n\nYou have 200k subscribers in one week. That is not easy to do. It is not an accident. You are loved.", "Notice Meeeeee ❤️", "Cheers to the start of the kfp empire!  Don't ever let anyone get on your way. Do what you want to do Because that's what we love about you.", "Oh my god, Kiara is just so wholesome and her crying broke my heart. I’m glad everyone in the chat was showing so much love and support for her because she deserves them all.", "Don’t mind me just wanna timestamp this 3:38:08", "Kiara makes me want to hug a chicken,🐓 while also making me want to eat one at the same time.🍗", "You're a good birb. Thank you.", "omg 4 hours...? You legendary phoenix you", "4:13:09 don't mind me, this is just for personal use", "All i remember is feeling dank", "Being skilled in multiple languages is your strength!  Use It to your liking! Don't compromise!  I'll be cheering for ya ^_^", "Darn I missed your steam, But I think I would've dropped half way though, FOUR hours of reading super chat. You really are dedicated. Good job and get some rest!", "Hi Kiara! I really like your streams not only because I'm able to learn a bit of Japanese (and German!) but also because you are always very energetic and happy and always make me smile. Keep doing our best, I will keep supporting you.", "12 hour SC endurance stream, yeah..? :D\nLove you Kiara-chan..!", "Hey Kiara, hope that you are taking care of yourself. I'm sure it's been just a mountain of stress for you - both the positive and the negative take up the same amount of nervous energy reserves. Make sure you're getting the sleep you need, eating on time even when you're busy, and getting time with friends and family who you can be relaxed around.", "If asacoco morning program was still around this would definitely make that news about how chat tortures a pheonix in hordes of superchat lol", "4:02:08 that small i love you tho ;;_;;", "And remember guys it's kikkeriki not kicky ricky.\n\nRicky did nothing wrong", "nOOOOOO I personally love you speak Japanese German and English at the same time!!! That means how talented you are!!", "Bestest Phoenix. Don't ever let other people stop you from being the unique and wonderful individual that you are. Spread your wings and fly, and we'll be behind you every step (flap?) of the way.\n\nFrom, a fellow birb. 💜", "Well the dud for THAT SC already apologized and said IT came out wrong and he didn't want to make her cry. That's good and yeah! Trilingual Kiara is already amazing. You're known for your amazing trilingual streams and your kusotori memes. Keep including more people cuz that's what you really want and thus keep improving yourself and the streams! KIARAちゃんファイト！！", "Kikkeriki!!!\nwelcome to Kiara Super Chat Guide\n* kalm *\nStep 1 : Turn off Super Chat", "Kiara you have so much more than just your awesome ability to self dub. You have really great chemistry with the other members and are really fun to watch. I hope that comment didn't discourage you from doing what you want, because you're really great! I hope you keep being you! <3", "Ngl, i really like the self dub, mainly cause im learning japanese and i enjoy trying to get what she says while knowing what she translated.", "She is a Phoenix of focus, commitment and sheer fudging will", "Holy heck, the bird is a longmen. Awesome.", "Self dub all you want. I wish I was as talented.", "Danke Schön Kiara, absolute fun listening to your stream session and absolute trooper doing this for 4.5hrs. Just do your thing, ignore the haters as long as your fans are here supporting you, subscriber count/concurrent viewers watching wouldn't matter. \n\nCan't wait for your mario 64 stream later!", "4.5 hour Superchat reading stream\n\nKiara you crazy bastard that deserves respect", "I'm feeling dank\nThank you dank chicken", "Kiara pls DON'T stop self-translating, I bet JP bros love it as much as I did when japanese hololive members spoke english, also some people like me want to learn japanese and maybe we can learn by watching you.\nCheer up!!!", "Can't wait she meet pekora~ got be lot of fun~", "I'd say it's best not to rush this collab or possible friendship. As much as I want to see it too, we as viewers should not interfere in these matters or force it. Kiara needs a lot of experience and find her own pace, confidence and strenghts. When she does that she will be ready to be a true colleague or maybe a friend of Pekora, not just a fangirl kouchai. I want to see such a development and happy collab days in the future.", "This comment is just for me.\n\n4:22:03", "I fell asleep part way through with it playing in the background but I can't believe you actually apparently read them all Kiara. That's some dedication to your fans miss. You deserve all the love and support you receive. Have a great day if you read this 🔥🐔❤️", "Keep self dubbing include everyone speak bird to we need more bird people to join too", "Speak whatever language you want Kiara, we're here cus we love you the way you are. Self dubbing is good way to learn another language too for me. Thank you, we will always support you ❤️❤️❤️", "I only have experience in watching 4 hours with league players feeling toxic about their games and their life... How can anyone dislike her? I myself cant last reading aloud within 30 minutes... that's pure appreciation onbher part for the superchats sent on her way. I regret not meeting her earlier. Just got into hololive a few days ago and happy enough to enter this rabbit hole.", "congrats on the super chats you totally deserve it because you're the best phoenix", "...I am in awe.\n\nGet some rest. Please. For us. You have plenty of money!", "A proud Phoenix indeed  👏", "Dankeschön Kiara.\nGanbatte and keep believing in the hearts of the people that believe in you!", "I stand by my statement that you're ALL best girl! Not a single one of you is better than the other. Youre all amazing in your own adorable quirky ways. And yes some may be similar but, still youre all unique. Don't ever change birb, we love you irregardless!", "Kiara ur such an sweetheart we love you🥺", "I'll have two number 9s, a number 9 large, a number 6 with extra dip, a number 7, two number 45s, one with cheese, and a large soda", "Vielen dank for streaming!", "you're kind and honest, please don't ever change kiara ;-)", "For me, who is not good at English, translating into Japanese is very helpful.\nBut don't forget. Even if you don't speak Japanese at times, the Japanese are your fans.", "You want to watch our fav birb slowly go insane saying dankeschön to SCs for 4 hours? be our guest,we already did it. it was insanity", "I just want to support her as much as my broke ass can", "Kiara Fried Phoenix? So is she a cannibal?", "Kiara, in terms of strengths, you're probably one of the kindest people I've ever seen", "anyone got the time stamp on that subaru topic? i had to leave in the middle of it and came back to more \"Danke schon\" lmao  D:", "Challenge: take a drink for every time Kiara says \"danke schön.\"", "you have a death wish huh?", "Ameer II no not that kind of drink. What are you, crazy!?!?!?", "I bet kiara can do a Harley Quinn impersonation. Anyways, do what you love and don't let anyone put you down. Much love.", "Lmao that guy who sent the superchat at 1:48:37 must feel so bad now", "Danke schön! <3", "We love you Kiara !! ❤️🧡❤️🧡❤️", "I really like Kiara's self dubbing. In some ways, it helps people who wants to learn Japanese. It definitely motivates me to learn. Thank you Kiara!.", "Dankeschön!! ❤️🐔❤️", "I could only listen to the beginning since I was driving home from work but I'm glad I was able to watch everything through to the end. It was a wild and very long ride but it was all worth it. We love you Kiara! Get plenty of rest, I'll catch your next stream even if it means sleeping only 2 hours again!", "Kiara, your energy is something you're good at too, not only japanese XD\ni really like it when you're trying to light up the mood, i can really feel your energy XD", "2:23:37 for Ara Ara~❤️", "So I saw there was an instance when someone had an issue with her self translating. Sure maybe it does disturb the flow, but the stream isn’t just for that small group of people it’s for everyone so if she includes them by translating herself I think it’s a great thing. It’s why I watch Pikamee and Kiara, they create a warm atmosphere and are very inclusive with what they’re saying. It’s nice and it’s fun, so don’t be discouraged just because of a few people.", "You will be the bridge between hololive jp, hololive id, and hololive en. Keep doing what you're doing, Kiara. 🐔👊", "IDK if you'll see this, but I love that you self-dub. Anyone who has tried to learn other languages or is bilingual knows that hearing someone translate, especially when they are clearly fluent, is extremely helpful. you've been motivating me to perhaps really double down and learn Japanese. Also, just as I appreciate when Japanese Hololive members talk in english, I'm sure there are JP bros ecstatic that you translate. of course, biggest thing is that since you do so many streams, you should do whatever feels most comfortable to you!", "danke schon great stream\n2:09:00", "2:41:22 \nI was trying to make a minecraft reference as a creeper but she didn't get it cause she haven't played minecraft before and don't know what creepers are. Oh well ¯\\_(ツ)_/¯", "感動, I am touched, kiara", "You're so lovely Kiara", "So I still don't get it, are hololive EN talents Japanese natives that know how to speak english, or native English speakers that speak japanese?", "Did someone ever explain Big Smoke's order to her or is she still in the dark?", "What is her timezone and the rest of the holomyth", "Verdammt klasse, Kiara. Du bist echt die Beste!", "キアラさんがとても好きです。すごい苦手な英語も好きになれそうです。ほんとに大好き！！！", "We love our bird friend❤🐔", "I found the meme in reddit, she turned SC off ? lolol.", "starts from 2:48:30", "You are so amazing 💕💕💕💕", "2:39:27\n\nHoney", "♥WE♥\n♥LOVE♥\n♥KIARA♥", "I will dream about the word Dankeschön tonight", "Don't stop translating Kiara. F them haters your great = )", "I honestly love Kiara's self dubbing. Her energy and her desire to connect with all her fans, EN and JP is amazing to me. I'm honestly just thankful that Hololive has put together a group of streamers that I can enjoy live without learning another language. I noticed Kiara stopped self-dubbing and I honestly got a little worried that people had said something because it was something I really enjoyed. I hope Kiara doesn't switch to language exclusive streams but even if she does I'll still watch and donate because I think what she's trying to do is amazing and the fact that she's trilingual is what helps set her apart from the rest of Hololive EN for me.", "3:20 I was debating whether I should tease her and write kicky ricky or if I should be supportive and write kikkeriki. There were a lot of kicky ricky's so I decided to balance it out with a kikkeriki. And literally like 5 seconds after I sent it she says she loves everyone who wrote it correctly. SCORE!", "Kiara epic endurance stream befitting the phoenix that she is. Her heart was in full show throughout. Stayed awake as long as I could with her, because she keeps me smiling. I hope she realized how much being multilingual and wanting to incorporate as large a community as possible is part of who she is and why her fans love her.", "It was a bit of a short stream but I still liked it. - 3-", "57:23 mogu mogu ASMR", "あなたの得意なこと誇りに思っていいと私は思います。", "YOU ARE THE BEST BIRB!!!!", "We love you Kiara!!!", "There’s no need to compare yourself to others.\nWe enjoy your content because of you! You have a lovely personality that’s brimming with positivity that I appreciate very much.\n\nYou’re really funny and it’s almost impossible to watch your streams without a smile on my face.", "who said it i just wanna talk i swear", "You are the MVP for reading superchats for 4 hours. We all know that you're dedicated and you're very talented and that's why we support you. I have suffered from insecurity and anxiety for a long time and I thought that I had no talents or skills so when you said that speaking japanese was the only thing you were good at I felt that. I understand where you're coming from but you can't listen to that voice that tells you that. We all love you and enjoy your content, that's why we are here. And you should love yourself too because you are valuable, loved, and very talented. <3", "Keep being you, you trilingual fire bird you.", "4 hour MVP", "Please remember that we shouldn't change for the benefit of others, but only for betterment of ourselves. Keep being you. \n\nI know from experience how easy it is to lose yourself if you listen to your own doubts, but please remember that you earned your place and now do something millions would love to do. Those millions can't though, because they are not you. You are special. Keep growing, learning and pushing forwards, but don't change for anyone!", "初めてのスパチャ読みお疲れ様～、喉の調子は大丈夫かな？　読んでくれてありがとう！！", "calli shall slay the fools who made this birb cry. no one makes birb cry >:(", "So does Donovan get an award or something now?", "quuckly create a laugh that suits her best!", "Dank Cushion girl is best girl.", "Congrats for 200k subscriber soldier", "Can anyone count how many danke shöns she said? Im gonna TRY to do 1 pushup for every danke shön", "Can anyone count how many danke shöns she said? Im gonna TRY to do 1 pushup for every danke shön", "Top 5 words that are stuck in youre head", "Imposter syndrome hits alot of people in our times. I'll cut to the chase.. You made it by your own skill. You have so much talent..trilingual+ , etc. You can read the room and make people genki af. This is all you.\nWill you derp? Yes. Does it matter? Learn if possible and move on . \nYou made it. You deserve it.", "I think I should say this right now I unsubscribed to many a Streamers for yours right now you're the core of hololiveEn. You have been Fitting in a lot talent, also please keep keep the Japanese shelf dub I mean I watch Pikamee streams ( maybe you could collab with her) because she does that. \nRemember if the numbers are low it means your fan base is strong and pure in heart.", "You speak english but you laugh in japanese.", "2:23:27 LMAO", "Much love, I loved it", "i know you want to adhere to all your fans but keep in mind that being true to yourself is what will make the most of us happy. i hope you never feel discouraged, because you will always have fans who have you as their favorite and pour their heart into supporting you!", "ほんと乙キアラちゃん！", "Such a hard worker and kind girl.", "I was there for the entire stream 6:01", "As a bilingual myself YOU'RE THE BEST HOLO EN VTUBER FOR ME. Your self dubbing helps me how to be a translator myself by taking notes how you translate your words. Keep it up and don't stop.", "You shouldn't stop your self dubbing, it's nice to hear your Japanese and how well you can do, and all your streams are very different for that reason :) just think if all the Japanese hololive girls who speak English for us westerners! It's always nice and welcoming I imagine ^_^", "It is adorable that she thought people were only going to donate on the first stream and not EVERY STREAM AFTERWARDS", "キアラちゃんの話していることを僕は完全に理解することは出来ないけど思いは伝わるよ\n頑張って", "Among the HololiveEn group, Kiara is absolutely the most likely to succeed as an idol. Raking in those numbers at so late is impressive, I’m really glad I tuned into the stream.", "Kiara got a Phoenix Down", "I couldn't believe someone sc that smh.... i knew exactly what was gunna happen when she was reading it. Chat went crazy trying to cheer her up. WHO BULLYING THE CUTE BIRB? WE GUNNA THROW HIM OUT", "Sorry I kinda miss it halfway through, can you give rough estimate when it is?", "@Kevin Kuhon like 1:48:40", "I have an idea of where it came from, but man that SC was in poor taste honestly. Just wished she wasn't being driven to the corner like that.", "@CupOfWhiskey thanks", "Ich würde es lieben ein Stream von dir auf Deutsch zu schauen?", "MONETIZEDDDD", "3:55:53 NANI", "She's so kind ❤🧡❤", "Как она не тронулась умом после 4 с половиной часов чтения?", "I didn’t go to bed until 3 and it was COMPLETELEY worth it", "そのうち取り柄とか考えずに\nキアラさんの人柄に魅了される人が増えてくるよ\n人事を尽くして天命を待つ\nできることを続けていけば時間が解決してくれることもある", "<3", "Danke schön 🎈❤️🎈❤️🎈❤️🎈❤️🎈❤️", ":C", "Dank Shoe!", "If you don't think you have any special skills, make your special skill LEARNING.\nNot only is watching someone learn new things great content, but it would also be a great excuse to spend time with friends in HololiveEN.\nIf you have friends teach you things, it only gives you more things in common... and if you run out of things to learn from other Hololive members, there are lots of small independent Vtubers who would surely be happy to teach you things in exchange for the exposure a collab would provide. Everyone wins.", "I''LL BUY 99 AIRBALOONS FOR PHOENIX", "24:00 oof", "I can’t believe I missed this stream I am sorry my queen I was not there to protect you this shall never happen again so long as I live or I will retire from being your knight you will never cry again so long as I live and to anyone that thinks I’m making cute chicken girl cry you will be dealt with swiftly I am a proud simp of this chicken and shall always be all hail chicken may she prosper forever more", "Kiara watching your streams gave me diabetes", "A lot of Filipino wanna donate so bad but they are so broke. HAHAHAHAAHAHAHA", "Just wanted to add to the support all the others have given here.  You just do you.  All of the Hololive EN girls have brought some inspiration in some form or other.  Your multilingual streams have inspired me to continue studying Japanese so I can reach the degree of fluency that you have.  I'm looking forward to seeing what else you bring to the Hololive community!", "I don't know why self dubbing is such an issue for that guy(it's probably fun to have that guy at parties ) just like Kiara said she just wants to involve the JP bros also\nNever change your streaming style Kiara we love you ♥️♥️♥️", "Well tbh this is a time for her to grow, one day she will be better and even the self dub wont ruin the flow we see many times with multilingual vtubers that they found the flow in later streams and it was her debut so she must be very nervous but she is doing very fine now", "応援してんで！", "Kiara, I don't speak a single word of Japanese... and I for one greatly admire and appreciate that you self-dub so that as many people as possible can enjoy your content. You keep being you. ❤️🐔", "愛してるぞ", "切り抜きから来ました。日本語が得意でバイリンガル配信ができるあなたを好きなリスナーもたくさんいます。抑えるんじゃなくて逆にその長所を更に生かせる配信を考えていきましょう。面白い日本語のネット用語を紹介する配信とか、日本語の授業の配信とか、先輩たちの切り抜きを通訳するとかはいかがでしょう。他にもいくらでも方法はあるはずです。自分の長所をもっと信じて", "Kiara, please don't let the loud minority of people who only want you to speak EN bother you too much.\nIt's a great strength that you speak 3 languages so well, and I think the JP bros enjoy you a lot more for it! (Me as a German, too of course. Having a vtuber speak my mother tongue is a dream come true). \nYou're really amazing, and a source of positive vibes for me and many others. We'll keep on supporting and simping you! ", "My japanese is not that good, but I like the live translations, because I'm trying to learn the language and it helps a bit with associating words. For someone who is almost fluent, it would be even more useful. I understand that it's hard to find the right balance. I think you should just get a feel for it. Don't worry about it too much, and it doesn't have to be the same for every video. What's most important is that you are having fun. That makes it more fun to watch.", "oof tried to stay awake but I had to sleep, sorry Kiara you are stronker than I. (:edit: Also I doubt Kiara is going to read this, but if you do, please continue your self dubbing, that is part of you, and as you say it shows your strengths). Much love, I'll SC on the next stream. (another edit: Please do 99 LuftBalloons  in your next Karaoke stream)", "Dont worry about changing languages ,talking EN,JP,GERM,BIRD,PIPIPI or any other language we will still love you,is was great stream(watching the VOD) and will be waiting for the next one. AND BE YOURSELF DONT WORRY.\nPS : Pls pay your workers =)\nPS2 : Pls send me a fried chiken nugget and a soda =)", "Kiara best chicken lov u ❤💛", "Dont feel like you have to limit your talent, be proud of it.  Being multilingual is a sophisticated talent, which means it takes time for people to get the taste of it, just like the way one learns to drink fine wine vs chugging beers.", "4:24:13", "I have nothing but respect for you for reading through each and every one of those SCs without taking a break, even when we said it was okay to pick it up next time. We truly don't deserve someone as amazing and dedicated as you! Please continue to be yourself and the idol YOU want to be, and we will support you all the way! As someone who has tackled learning three different languages thus far in his life (Native English, took 4 years of Spanish in High School, and recently have taken up to a year of Japanese), you putting your multilingual talent to work really impresses and inspires me to keep trying harder with my own language skills! Please keep using your talent to bind us, your humble KFP investors and future employees, together so that we can open restaurants all over the world! :)", "I'm just gonna leave this comment here, just some honest thoughts.\n|\n|\n|", "Maybe not something I can request, but I hope one day you and Subaru-chan become best friends. Beyond the whole birds of a feather thing, you both have an overflowing love for overseas fans and try your best to transmit your feelings to them. I feel like you two could relate about a lot!", "7K GANG", "We love kiara and nothing going to able to change that", "😎✋👍👍👍👍👍very beautiful I LOVE YOU❤❤❤❤❤💯👈", "I hope she gets over her insecurity before it holds her back.", "Those 4 and a half hours were a roller-coaster and I was glad to be a part of it from start to finish. There was a lot of German, there were tears, there were laughs but most importantly, there was love. I should've been sleeping but showering our dear birdo with support and hearts seemed way more important to me. I want Kiara and all of Hololive EN to know that even though there isn't a lot we can do, you can bet your * that we will shower you with support and encouragement in chat until you stop crying or cry in happiness -sincerely a sleep deprived KFC, Teamate, Deadbeat, Chumbud and Tentacult", "Kiara really is great. Going for over 4 and a half hours just to make sure she got everyone's names and taking everyone on a roller coaster of emotions all the while. I know zero Japanese, but I love the self dubbing for the sole reason that it allows the Japanese fans to get involved with us english ones, similar to how some of the other Holo members try their best to speak english, whether it's great or not, just to make sure that they know that even if most of us cannot understand them, they still appreciate our support. ", "Legendary", "1:48:38", "I love you", "we love you kiara!", "excuse me pls translate birb", "1:48:37", "Kiara u r a cool gal 😎🤙🏿", "Kiara i don't know if you are going to read this but i want you to know that we all love you here. I think the fact that you are so fluent in three languages is amazing. Oh i mean four sorry. Forgot the Bird language. You're such a good person and i am sure people will see that soon. Seeing you get sad really broke my heart and i do wish you the best.cause you deserve everything. Please keep up the good work and we will be with you no matter what! We love you Kiara!", "I just got up to the part where people were complaining about you translating for JP.  You can't please everyone so just do what makes you happy and if you want to translate for them, go for it.", "Speaking japanese is something she is good and she is proud of it, why people would get upset at her speaking it?", "boing boing", "Do what you like to do our fastfood queen, don't worry about the antis the PPS (Phoenix Protection Squad) is always here to support you in any way possible. Just be yourself and be the Phoenix you want to be😊♥️", "信じられん、何考えてスパチャ送ってんの\n自分の満足感じゃなくて、ライバーの意思を尊重しろよ\n\n悪気がなかったら、なんでも送っていいのか？", "Dan Cushion", "Don’t feel bad for translating yourself. It’s 100% totally fine with us you doing it. We too want to become one with the Japanese audience. Go ahead and translate for them to understand. Also you do have talent. You bring out the fun when you are with others and make the atmosphere friendly and relaxing. That helps them get comfortable to be themselves and make it for for the rest of us. Keep doing what you doing, and remember “ NEVER GIVE UP”", "Kiara, please don't think language study is the only unique and worthwhile thing you bring to HololiveEN.", "Kiara, please don't let the negative comments get you down. The fact that you speak in both Japanese and English really show how kind-hearted and inclusive you are, and it is just one of the reason your fans love you. You should speak as much Japanese in your streams as you want!", "Kiara herself might not be able to read this but as someone who struggled learning English as my 2nd language, her self-translation is helpful for people who want to learn Japanese, English or even German!", "It doesn't matter if you don't think you are the best at something. For me you are my favorite of the new EN members since I love your singing, attitude, voice, and it's fun to watch you try to play games hehe. Keep up the good work!", "God damn it. Kiara's debut was the only one that I wasn't sure I liked, but damn if 1:48:37 doesn't hit close to home. I'm basically the same, everyone around me is good at so many things and the only thing I know i'm half-decent at is english, as my second language. And this kind of stuff hits waaaaay close to home.", "I have to say that your the skills you bring to the group are not what people consider hard skills but soft skills.\nAn uplifting personality, an amazing ability tomake things fun, a dedication and wholesomeness that moves people\nYour language skills are not the only things you are good at.", "Honestly, if you want to give constructive criticism, don't use the SuperChat for that.\nWait until the archive is up to comment about it, just like you would do with a non live stream video.\nOr just post a thread in the subreddit. Kiara and the other HoloEN girls are either mods or lurk there.", "Do foreign holo funs think about this linguistic discrimination problem ?\nI would appreciate it if you could write about it easily.", "Only antis or jealous people will care about it. It exists everywhere I think. I know 4 languages and I face this same kind of problem.", "@WA二千 Thank you for answering.\nI believe you keep liking holo.", "Danke schon", "Calli & Ina = Talent\nKiara = Funny\nGura = Cute\nAmelia = Drugs", "That's kinda accurate", "私は韓国人だけど英語わかんなくて日本語しかわからないから日本語で話してくれるの助かる。キアラちゃん大好き！これからも元気に配信してほしい！応援してるよ！", "Kiara! Kesshite akirameruna! Gambare!", "ホロENは超人揃いだと思うけど、キアラみたいな人がムードメーカーやまとめ役を務めるのも大切だと思うよ。\n日本語だって、見せ方次第できっと武器になると思う。\nホロJPとコラボしてくれる時を楽しみにしてます。", "I do not know if you can see this butI feel that your streams are really great. Especially when you self dub because everytime you speak japanese I feel like I am watching anime at the same time of being able to understand it in english. For me, full english stream is kind awkward to hear because I was used to listening to japanese dub while reading english subtitles. So having you dubbing in japanese and english is  super great. I hope those harsh comments will not bother you. You are great. We watch your stream because it is you who streams it. God bless and stay strong Kiara, you are great and special. ^-^", "P.S. Not only you are entertained but you will also learn practical language skills in her streams! <3 <3 <3", "we luv u Kiara", "Kiara please don't compare yourself to others.  Most of us fans love all 5 you.  I'm sure there's some that love you the most even.  Also don't listen to those negative comments.  I know it can be hard but do your best.", "【和訳動画を見ました】\nみんな英語を聞くために動画を見ているわけではなくて、キアラちゃん自身を見に来ていると思う。それは、英語を話す人も、日本人も同じでしょう。\nそして、僕たちが見ているキアラちゃんは英語も日本語も上手でそれが魅力なわけだから、それを存分に動画の中で発揮するのは間違っていないし、むしろ良い事だと思う。", "どんな言葉使っててもいいんやでファンならそれを許容してくれるさ", "I love all Hololive gals but Kiara is officially best girl", "KIARA, Dont think ur lacking... UR OUR FAVORITE CHICKEN...  THATS ALL  WE NEED TO LOVE YOU", "i meat phoenix", "meant", "I really don’t understand why some people said Kiara should not speak Japanese. Speaking Japanese is one of the Strengths of Kiara so if you don’t want to listen Japanese, just get out and   shut up. \nI will support Kiara, please don’t give up!", "I'm Japanese.\nあえて日本語でコメントします。\n私は英語が下手です。hololive EN の配信は頑張って聞き取りをしていますが\n殆どのアーカイブは自動翻訳を頼りに見ることになります。", "Could we get fried Phoenix next time? Shhhhh...!!!! Maybe Kiara won't read this give your suggestions fast!", "Kiara, don't doubt yourself, No one can be the best in the world, not even your fellow members can be the best at what they do. There will always be someone better than them and those who are better than them probably lacks something else. Each person is unique and that's the beauty of our existence.", "英語で文章を書くことがまだ出来ないので日本語ですみません。\n\n私は英語が勉強不足でキアラちゃんが言っている全てを理解することはまだ出来ないけど、キアラちゃんの配信が面白くてとっても元気が出るので、いつも観てます。", "You just can't satisfy everyone, i lover her self-dubbed, and i believe many do.", "I personally want her to keep speaking jp for the jp bros cause as someone who only speaks en, kr, and fr I understand what its like to be watching the jp girls and like WUHHHHHHT THE FUCK why is everyone spamming the kusa", "Isn't the entire point of knowing multiple languages to use them ? \n\nSome people get very envious...", "why self dubbing is such a problem ? i don't get it. is it because she's in holoEN ?", "Apparently from what I’ve seen from a few fans it apparently “messes with the flow” of the stream even though it’s literally apart of their job to entertain the Japanese portion of the fanbase and I’m sure they definitely don’t mind having things being translated for them. It’s just a bizarre complaint", "@Eternal Memeage i know like, isn't it a good thing that both EN and JP community can enjoy kiara's stream at the same time.", "You're not gonna be successful because of gimmicks. You're gonna be successful because of your personality. If there is something you like to do, just do it and share it with us; just like you'd share your hobby with a friend.", "What kind of a prick unable of empathy can someone be to not think that before posting a SC like that? How would they feel if someone told the same thing to the other hololive members doing their hardest to actively communicate with the overseas viewers everyday?? The stupidity is appalling.", "Oi Spicy Chicken! Don't listen to those people who don't like what you are doing. Just keep doing whatever you are doing that makes you happy. Your viewers will be happy also when you are happy what you are doing. Don't listen to that random person who does not like your self-dubbing.  Being you makes you a different person and that is a good thing. Keep being strong spicy chicken.", "I don't watch holololive EN streams anymore, And you guys don't come to watch the Japanese members' streams. I don't want to see your racist comments.", "Kiara, since im not this good in english let me say it in german: Lass dich bitte niemals von Leuten wie diesen einem im Stream verunsichern oder gar zum weinen bringen, denn egal was diese einzelne Leute sagen, so hast du immer noch uns, deine Community, die hinter dir stehen. Und ich persönlich finde es schön, wenn du auch auf japanisch zurück antwortest, weil du versuchst jeden zufrieden zu stellen, was eine verdammt schöne und vor allem starke Eigenschaft ist, was auch der Grund ist, wieso ich so gerne deine Streams schaue. Du bist ein herzensguter Mensch und musst dir von eben gesagten Leuten so etwas nicht gefallen lassen. Denn wir, der KiaraFanClub werden hinter dir stehen und dich unterstützen, weil du uns allen ein Lächeln aufs Gesicht zauberst ^^ I hope it was ok to write all of this in german because the english version would have cost much time i think, because I don´t know all the words :<", "Kiara, dont let individual bad opinions get you down. You know what your own goals and objectives are for what you want to do. If you want to consider other peoples opinions on something, I'd go to your peers and seniors first. As they will be of far more value to you than randoms on the internet that obviously cant consider the perspective of yourself and a Japanese speaking fanbase, who you obviously are keeping in mind too. You cant make everyone happy on the internet, so do what feels right to you.  Even if dozens of dumb people are whinging about something, that's still a statistically insignificant portion of your live chat, let alone people who enjoy watching the stream after it happened, though its understandably hard to just ignore that kind of thing. Keep up the great work.", "IM LATE IM SORRY YOU PROBABLY WONT SEE THIS BUT PLEASE DONT LET COMMENTS LIKE THAT ONE GET TO YOU, DO WHATEVER YOU WANT AND SPEAK WHATEVER LANGUAGE YOU WANT YOURE AMAZING AND WE ALL HAVE YOUR BACK!!!", "NOOO I JUST WATCHED MORE KIARA SPEAKING JAPANESE ISNT YOUR ONLY STRENGTH PLEASE YOU ARE SO TALENTED. YOU HAVE THE ABILITY TO MAKE SO MANY PEOPLE LAUGH AND SMILE, DO NOT LET PEOPLE CHANGE YOU AND YOUR CONTENT, YOU ARE AN AMAZING SINGER, STREAMER, ENTERTAINER, RESTAURANT OWNER AND PHOENIX CHICKEN❤️WE LOVE YOUUUU YAAAYY", "Ich denke du bist erstaunlich, du sprichst so viele Sprachen und du bist sehr mutig, weil du es der Welt zeigst, das ist etwas, was nur mutige Menschen tun können, du hast einen neuen mexikanischen Fan.", "Remember, there are far, far more of us that like you than people trying to bring you down.  Keep being you, there is no need to change when you're a good person.", "🐔🐔🐔🐔🐔🐔🐔🐔", "Kiara certainly put her heart into her channel and while she is certainly not doing bad, it is kind of disheartening she is the least popular of her generation with subs and SC.  I am kind of puzzled of why that is.  I do think Kiara could improve by learning from the other girls with better titles, and maybe making separate song videos of her existing  or possibly new content. 4+ hrs to read all SC is a lot of dedication.", "Okay, to those who sent that SC telling Kiara to do less self-translation: That was rude and very uncalled for, not to mention you killed the mood and made her feel depressed. Hope you enjoy your nightmares after this and pray to God that we're not coming for you.\n\nTo Kiara, whatever you do please continue doing it. We stand with you, come hell or high water.", "これは日本の視聴者だから思うことかもしれないが、すべての人を納得させることはできないから、自分の長所を短所と受け取る人よりもすごいと受け入れる人のほうが圧倒的に多いだろう。そちらの方を優先する方が彼女にとってもすごく容易な道のはず。それでもそんな人たちも含めて融和を唱えるなら、それは彼女にとってはいばらの道だろうなぁ...どちらが正解というものでもないから、彼女の心が壊れない選択をすることを切に願います。", "by trying to appeal to everyone you have less subs. just know that", "Ich kann deinen Wunsch, ein herausstechendes Talent zu haben verstehen, und auch, dass du dich mit anderen vergleichst. Also wenn du selbst übersetzen willst, bleibt das selbstverständlich dir überlassen. Allerdings stelle ich mir es auf Dauer für dich eher hinderlich vor, weil du dich dadurch in die Sackgasse, alles übersetzen zu müssen manövrieren könntest. Wenn dir dass aber Spaß macht, und es funktioniert, warum nicht.", "Honestly, Kiara's reaction is understandable, but the fans' was kinda unwarranted. The guy had honest criticism. And the fans branded him as a public enemy. I think he worded it as nicely as possible. But the fans act as if he just called her the worst insult imaginable. Look, my heart broke when she started to cry, but I don't blame that guy.", "It was a mix of that SC's bluntness and her own thoughts. Don't blame that guy too, could've worded it more nicely though.", "@Ryan Gosling VIRUS I tried to think of other ways to word it. And I can't really think of any nicer way to say that he finds her constant self dubbing annoying.", "To who ever wrote that  sc message to Kiara about stop JP Translating and just keep it EN only. \n1. Your Comment is \"Toxic\" to this Community and should be labeled as \"Harassment\" & \"Gate Keeping\" Please Stop before you start a \"Flame War\" and Anger Kiara and her devoted fanbase\n2. Your Opinion honestly doesn't matter here because it's ultimately up to Kiara to decide on how she wants to do and present her stream to the audience ", "Can I add my two cents, I have been a hololive fan for a year and a half. However, his request wasn't a bad one I myself have that complaint . It's not gatekeeping, but it ruins the flow in a way. Like I don't think their flows in streams but it felt forced.\n\nBefore you say \"Coco speaks English even though she is a Japanese Vtuber.\" She does indeed but sparingly, Pikamee is a perfect counterclaim to my arguement. Because in my opinion, she can translate without being so forcefully.", "Don't take the hateful comments seriously Kiara. Because the amount of those that hate you pales in comparison to the number of smiles you bring to those who love you. I'm pretty sure that I'm not the only one who enjoys your multilingual streams. Talking in multiple languages is an amazing talent because your reach isn't limited to those who know English exclusively. So Kick them Rickys goodbye and I hope you'll always have a nice day! 🐔🐔🐔"]