["Gatekeeper best waifu. He's always cheerful, always happy to see you, and wants to brighten your day with good news.", "And they said I was being silly when I said she'd probably see the spoiler discussions.\n\nSpoilers are the worst.", "Especially for such a plot-heavy and twisty game, people need to learn to just keep things to themselves.", "People say \"there's no wrong route\" but the route that I finished the game with was an immensely baffling disappointment. The fact that you can even get it I find personally insulting. I'm not a fan of spoilers, but if it meant I didn't have to waste 50 hours in a great on a story that was incomplete, I would take being 'spoiled' hands down. Wanting to know how to get a good (or even \"ideal\") ending in a game is an incredibly shallow price to pay for a player's investment as long as the gameplay is still solid and you still don't know any major story beats or the context they come from.", "Zeemod155 which route are you talking about? CF? I know that that route is the shortest and least developed, but an “immensely baffling disappointment” is a HUGE overstatement.", "Zeemod155 The thing about Three Houses is that if you want the full story, you need to beat all the routes. Piecing it together is the fun part.", "@Vgamer311 Having CF as your first route would leave an intensely sour taste in your mouth. It's meant to be like a secret route..\n\nBut its also like.. Just bad. Like really really bad. I put the game down for like 6 months after beating CF beefore doing the next route cause of the sour taste that route left in my mouth. It's such a massive downgrade in quality compared to the rest of the entire game.", "@Zangelin I mean, it was my second route and my reaction was pretty much “eh, that was a bit short, but oh well.” I get that it’s personal preference and I do admit it’s the “worst” route but I just don’t get the intense hatred it gets.", "What did she get spoiled about?", "@Nando People kept eluding to what certain characters were going to do later in the story, not sure if she saw anything in great detail, but it was enough to get the general idea of how things might go.", "Don't remember the timestamp. But I loved the part where Kiara calls out chat for not chatting and falling asleep Lmao\n\nEdit: 2:15:00", "Caught me, but in my defense it was a 3AM stream.", "2:15:00", "-_- It was nice falling asleep too tho", "3am for me hard to stay up", "@mapucheHD thank you 👌", "I legit had the stream opened but I fell asleep after 10 minutes cause it was 3 am.", "@EpicBlackflame07 no problem dude", "I'm joining this club of had the stream opened but fell asleep :(", "I was there. It was mostly story dialogue + more than half of chat was past midnight. I commented that chat was reading the dialogue but that was half of it.", "1:33:18... POV: It's your birthday \n3:02:19... Kiara coming out of the closet, no one is surprised..", "Mei Mesaki Her singing voice is so sweet. Such a songbird.", "Even singing happy birthday her voice is so sweet its giving me diabetes", "24:40 Tip Give everybody a battalion as soon as possible. Not only will it make them stronger, it will also train their authority during battles. Later there will be some very strong battalions that need high authority to use.", "\"I want to recruit and marry Lysithea.\" As Fem Byleth. So.... who wants to tell her?", "Only if you want to tell her that most of the characters are straight.", "@Tyler Baldonade TBOT6 She’s got tons of Lesbian options, she’ll be alright.", "I really love Kiara's enthusiasm when she games! Great stream as always!\n\nAlso, for my fellow FE fans, you gotta admit that green unit pog moment at 2:28:00 is pretty rad.", "I'm a green unit", "22:09 sounds like Kiara is singing and blasting Caramelldansen...", "Looks like 2007/2008 is back", "56:00\nAs a fire emblem fan, you learn to save every possible time just for good measure... that’s just one of the perks :/", "I will not tolerate this Bernie disrespect, she’s one of the only girls you HAVEN’T offered to marry. Bernie is best girl and I will DIE on this hill.", "She seems to be treating her as the cute little sister. Which, gotta say, is the vibe I'm getting as someone who hasn't played the game.", "GriffinPilgrim Bernie does have more of a “must protecc” vibe than Edelgard’s “step on me, queen”  vibe but that doesn’t disqualify someone from being best girl. Bernie is best girl not in our pants, but in our hearts.", "@Vgamer311 Perhaps so but one doesn't usually want to marry those with such a vibe...well, in some games maybe...", "GriffinPilgrim also, I won’t spoil anything but as I learned more about her and heard her backstory that endeared me even more as time went on. Plus her interactions with the other characters are at times so cute it makes you want to die.", "\"We've got a stop to all of the millionayuhz and billionayuhz from controlling our kingdom.\"", "Kiara's playing 3H???? Insta sub! It's a wrap!", "I missed the stream NOOO I’ll get right to the video Tenchou!", "Isn't that a mood", "Are u a member of like every hololive EN member? I saw u in inas karaoke livestream lol", "The Church of Seiros may pray,\nBut I think we can all agree the real waifus were the girls we met along the way.", "\"Take That\"- Phoenix\nnow we just need her to say \"Objection\"", "Write...", "don't forget about \"Hold it\"", "1:31:00 \"What's this translation mistake!\"\n\nMy understanding is that the Japanese version actually means that the Professor visits some students \"at night\" in their rooms and it's some sort of Japanese trope with varying meaning and severity. (Femleth/Edel visits are gold for the fanart.)", "Let's use buffs so this combat doesn't dragon", "IMPORTANT ADVICE for Kiara", "50:41 Ow.", "Dorime 🙏", "Kiara's streams can one-shot anyone's depression! ❤️", "22:23 That is really good pronunciation", "Thanks for the stream Kiara! Don't worry, even I was slightly spoiled and still ADORED this game, your experience won't be harmed by what you've heard so far. Looking forward to the next one!", "Yes I had some spoilers without context  but still big love.", "1:29:41 let me tell you a good German word~", "Whether you can or cannot recruit Hilda depends on what you decide to do in the story and involves spoilers.", "2:42:50 Slithering boy? Now that's a very ironic thing to call Hubert.", "Love Fire Emblem streams. It has been a very hard year and they make me smile.", "I couldn't help laughing when I saw Caspar at level 1. Sasuga phoenix, treating Caspar like half the FE community.\n\nOh also: sometimes it's good enough to not attack. If one of your characters can only take one hit, you can leave them in range of being attacked. When enemies attack, your character always attacks in return if not killed in the first hit. On your next turn, you could finish them off if their HP is low enough, then heal your characters if they took damage. Also, someone tell Kiara that Petra needs lance and/or axe skill if she wants to use her flying skill.", "2:02:43 Kiara's beautiful voice. (cruel angel's thesis)", "I'm really glad she's playing this but I can't watch it because I still need to play it lol.  I think it's cool you took this on though Kiara, haven't seen any other hololivers playing this.", "I actually wanna continue my own black eagles run now after watching this.", "Missed the stream cuz its 3 am for me ;;; but I'm glad Fire Emblem's back! Your first stream was what actually introduced me to hololive", "1:30:35 for a  moment", "Loved the live stream I hope you have a wonderful day.", "Finally have time to watch this, just in time for the stream tonight~", "Her voice is super pretty", "I'm not familiar with FE, so thank you for the stream.  Good way for me to learn!", "Hello! Helpful tips paragraph:\n- Don't forget you can undo to the start of each battle and can go backward forever basically. But only have 3 charges of that ability (for now).\n- The lesson you learned last time was to be timid with your casters (smart) but now you're a little bit too timid (they can overwhelm small amounts of enemies so they can be aggressive when accompanied by other units). ", "FINALLY I CATCH UP! Good streaming an--- THE NEXT IS 5 HOURS?!\n\nI WILL CATCH UP EVERYTHING", "missed the last hour due to needing sleep, time to fix that", "I wish I'd had a phoenix as one of my teachers...though she'd probably seduce all my female classmates...", "i fell asleep mid stream sorry ｡ﾟ(ﾟ´ω`ﾟ)ﾟ｡", "Thanks a lot for yet another wonderful stream. It's always fun to get your unfiltered opinions and responses to the game. Enjoy your meal, Colonel Kiara! See you next livestream! 🐔❤️✨", "Ferdinand big brain wanting career changing into the same thing, love it.", "So frustrating that my alarm didn't go off and I missed this stream.  Watching the archive now, but it's still frustrating.", "danke schön!", "2:05:30 Well, you can recruit Hilda in blue lions. In this route if you can or not depends on your decisions. However I suspect the decisions you will make will put you on the can't recruit path. Better to focus on others. At least for now.", "We missed you so much <3", "I never thought I'd see a Phoenix play three houses :)", "Thanks for letting people enjoy rpgs through your streams.", "2:58:10 Well, technically you're not quite on the wrong route for anything YET.", "I'm holding off of watching since I want to play FEH myself one day, but I watched a clip of Kiara singing Caramelldansen. All I've come to say is, goddamn I'm jealous I wasn't in chat for that.", "Being a pst, i missed it", "Couldn't make it bc I Kiara streamed at 3:00 am for me, time to watch the archived stream !", "1:54:36 iI understand, for example if you live in mexico, you wouldnt like to go putside -.-", "I love that Kiara and Sylvain are just the biggest bros in the monastery", "Man what's with youtube! disconnecting.", "Who came here after this 22:10 YouTube recommendation", "I'm curious which route will kiara choose, tbh I'm not very fond of either of them so I idc as long I see her playing them X)", "our girl almost hit 300k boy", "1:41:44 Have a carrot peko", "Speaking of Visual Novels, Kiara should play steins;Gate with Huke papa", "It was... Too late for me ;n; but Fire Emblem is the reason I got to find Kiara and to the end I'll keep with her in this journey! ...Even if it's just on the archives...! ;w;", "22:08 UMA", "I hope she plays more", "Great video as always", "♥️ Viva la Kiara ♥️", "😎✋👍👍👍👍👍VERY BEAUTİFUL THANK I LOVE YOU❤❤❤❤❤💯👈", "What game is that called?", "Fire Emblem Three Houses", "Best Girl. No Competition.", "VERY HORNY CHICKEN", "e g g", "1:35:30 There's your reason why steel is bad, btw. That steel lance is probably what got Ferdinand von Aegir killed. Steel weapons are heavy, which means they reduce speed more. With too low speed people get double attacked, which is what happened to Ferdinand when that mage killed him.", "she can do Sothis or Rhea as long as she doesnt do Crimson Flower.. which she shouldn't..  It's not a good route for your first playthrough\n\n(Also its terrible)", "I just hope this run doesnt end with a no cutscene, 5 chapter genocide that was designed as a secret just because some dudes like to spoil.", "Wanna be Japanese v tuber", "I do too bro", "Not dissing Kiara shes the reason Im here. But watching Fire Emblem makes me physically angry. Why did I waste money on this game?", "Why does it make you angry? It’s a great game", "@Silverwind X I would call it great if it were 10$ on the eshop from an indie studio.", "I have been playing Jrpgs before you were in diapers probably. nothing insults me like spending full price on an unfinished game. hate to be so hard but that money could have went to more productive things.", "William Melchor how is it an unfinished game? Also way to assume my age bro, calm yourself and check yourself. The only route that was maybe kind of unfinished was perhaps the crimson flower route, what with TWSITD not being taken care of (if you don’t know what that acronym is, then you probably haven’t even really played the game). The whole point is to choose a side and then once you’re done, you explore the other sides, putting the pieces together as you find the lore from each route. If you can’t understand that, then frankly, you don’t deserve to play such games, or be in this community. And according to sales and reviews, you’re in the minority.", "I dont know how you kids thrive in this day and age. everything is so expensive and the new content is so stale and unfinished. I have to go live in the last decade just to stay sane. sales dont indicate quality, thats why cult classics exist,", "@William Melchor unfinished game? It has more content than most 60$ games and gameplay for like 400 hours, what on earth are you talking about?\n\nAlso whats with the \"You kids these days\". Fire Emblem if anything is quite old school. What on earth are you on about?  The game is absolutely amazing.. Also its not a jrpg.. Its a SRPG.", "I will pay 60$ to watch Sakurai puff a bowl out of Toshiyuki Kusakihara's asshole but as for Fire Emblem I will never play or praise a game in the series again.", "@William Melchor sounds like you’re bias against FE, 3house isn’t even bad, it honestly deserved that slot in smash too", "@William Melchor ok boomer"]